{"title":"Unstacking CSS Stacking Contexts","link":"https://smashingmagazine.com/2026/01/unstacking-css-stacking-contexts/","date":1769508000000,"content":"<p>Have you ever set <code>z-index: 99999</code> on an element in your CSS, and it doesn’t come out on top of other elements? A value that large should easily place that element visually on top of anything else, assuming all the different elements are set at either a lower value or not set at all.</p>\n<p>A webpage is usually represented in a two-dimensional space; however, by applying specific CSS properties, an imaginary z-axis plane is introduced to convey depth. This plane is perpendicular to the screen, and from it, the user perceives the order of elements, one on top of the other. The idea behind the imaginary z-axis, the user’s perception of stacked elements, is that the CSS properties that create it combine to form what we call a <strong>stacking context</strong>.</p>\n<p>We’re going to talk about how elements are “stacked” on a webpage, what controls the stacking order, and practical approaches to “unstack” elements when needed.</p>\nAbout Stacking Contexts\n<p>Imagine your webpage as a desk. As you add HTML elements, you’re laying pieces of paper, one after the other, on the desk. The last piece of paper placed is equivalent to the most recently added HTML element, and it sits on top of all the other papers placed before it. This is the normal document flow, even for nested elements. The desk itself represents the root stacking context, formed by the <code>&lt;html&gt;</code> element, which contains all other folders.</p>\n<p>Now, specific CSS properties come into play.</p>\n<p>Properties like <code>position</code> (with <code>z-index</code>), <code>opacity</code>, <code>transform</code>, and <code>contain</code>) act like a folder. This folder takes an element and all of its children, extracts them from the main stack, and groups them into a separate sub-stack, creating what we call a <strong>stacking context</strong>. For positioned elements, this happens when we declare a <code>z-index</code> value other than <code>auto</code>. For properties like <code>opacity</code>, <code>transform</code>, and <code>filter</code>, the stacking context is created automatically when specific values are applied.</p>\n<p><img src=\"https://files.smashing.media/articles/unstacking-css-stacking-contexts/1-stacking-context-order.png\" /></p>\n<blockquote>Try to understand this: Once a piece of paper (i.e., a child element) is inside a folder (i.e., the parent’s stacking context), it can never exit that folder or be placed between papers in a different folder. Its <code>z-index</code> is now only relevant inside its own folder.</blockquote>\n\n<p>In the illustration below, Paper B is now within the stacking context of Folder B, and can only be ordered with other papers in the folder.</p>\n<p><img src=\"https://files.smashing.media/articles/unstacking-css-stacking-contexts/2-stacking-contexts.png\" /></p>\n<p>Imagine, if you will, that you have two folders on your desk:</p>\n<pre><code>&lt;div class=\"folder-a\"&gt;Folder A&lt;/div&gt;\n&lt;div class=\"folder-b\"&gt;Folder B&lt;/div&gt;\n</code></pre>\n\n<pre><code>.folder-a { z-index: 1; }\n.folder-b { z-index: 2; }\n</code></pre>\n\n<p>Let’s update the markup a bit. Inside Folder A is a special page, <code>z-index: 9999</code>. Inside Folder B is a plain page, <code>z-index: 5</code>.</p>\n<pre><code>&lt;div class=\"folder-a\"&gt;\n   &lt;div class=\"special-page\"&gt;Special Page&lt;/div&gt;\n&lt;/div&gt;\n\n&lt;div class=\"folder-b\"&gt;\n  &lt;div class=\"plain-page\"&gt;Plain Page&lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n\n<pre><code>.special-page { z-index: 9999; }\n.plain-page { z-index: 5; }\n</code></pre>\n\n<p>Which page is on top?</p>\n<p>It’s the <code>.plain-page</code> in Folder B. The browser ignores the child papers and stacks the two folders first. It sees Folder B (<code>z-index: 2</code>) and places it on top of Folder A (<code>z-index: 1</code>) because we know that two is greater than one. Meanwhile, the <code>.special-page</code> set to <code>z-index: 9999</code> page is at the bottom of the stack even though its <code>z-index</code> is set to the highest possible value.</p>\n<p>Stacking contexts can also be nested (folders inside folders), creating a “family tree.” The same principle applies: a child can never escape its parents’ folder.</p>\n<p>Now that you get how stacking contexts behave like folders that group and reorder layers, it’s worth asking: why do certain properties — like <code>transform</code> and <code>opacity</code> — create new stacking contexts?</p>\n<p>Here’s the thing: these properties don’t create stacking contexts because of how they look; they do it because of how the browser works under the hood. When you apply <code>transform</code>, <code>opacity</code>, <code>filter</code>, or <code>perspective</code>, you’re telling the browser, <em>“Hey, this element might move, rotate, or fade, so be ready!”</em></p>\n<p><img src=\"https://files.smashing.media/articles/unstacking-css-stacking-contexts/3-diagram-stacking-context.png\" /></p>\n<p>When you use these properties, the browser creates a new stacking context to manage rendering more efficiently. This allows the browser to handle animations, transforms, and visual effects independently, reducing the need to recalculate how these elements interact with the rest of the page. Think of it as the browser saying, <em>“I’ll handle this folder separately so I don’t have to reshuffle the entire desk every time something inside it changes.”</em></p>\n<p>But there’s a side effect. Once the browser lifts an element into its own layer, it must “flatten” everything within it, creating a new stacking context. It’s like taking a folder off the desk to handle it separately; everything inside that folder gets grouped, and the browser now treats it as a single unit when deciding what sits on top of what.</p>\n<p>So even though the <code>transform</code> and <code>opacity</code> properties might not appear to affect the way that elements stack visually, they do, and it’s for performance optimisation. Several other CSS properties can also create stacking contexts for similar reasons. <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_positioned_layout/Stacking_context#features_creating_stacking_contexts\">MDN provides a complete list</a> if you want to dig deeper. There are quite a few, which only illustrates how easy it is to inadvertently create a stacking context without knowing it.</p>\nThe “Unstacking” Problem\n<p>Stacking issues can arise for many reasons, but some are more common than others. Modal components are a classic pattern because they require toggling the component to “open” on a top layer above all other elements, then removing it from the top layer when it is “closed.”</p>\n<p>I’m pretty confident that all of us have run into a situation where we open a modal and, for whatever reason, it doesn’t appear. It’s not that it didn’t open properly, but that it is out of view in a lower layer of the stacking context.</p>\n<p>This leaves you to wonder “how come?” since you set:</p>\n<div>\n<pre><code>.overlay {\n  position: fixed; /* creates the stacking context */\n  z-index: 1; /* puts the element on a layer above everything else */\n  inset: 0; \n  width: 100%; \n  height: 100vh; \n  overflow: hidden;\n  background-color: #00000080;\n}\n</code></pre>\n</div>\n\n<p>This looks correct, but if the parent element containing the modal trigger is a child element within another parent element that’s also set to <code>z-index: 1</code>, that technically places the modal in a sublayer obscured by the main folder. Let’s look at that specific scenario and a couple of other common stacking-context pitfalls. I think you’ll see not only how easy it is to inadvertently create stacking contexts, but also how to mismanage them. Also, how you return to a managed state depends on the situation.</p>\n<h3>Scenario 1: The Trapped Modal</h3>\n<p><img src=\"https://files.smashing.media/articles/unstacking-css-stacking-contexts/4-microsoft-edge-stacking-context.png\" /></p>\n<p>You can immediately see your modal trapped in a low-level layer and identify the parent.</p>\n<h4>Browser Extensions</h4>\n<p>Smart developers have built extensions to help. Tools like this <a href=\"https://chrome.google.com/webstore/detail/z-context/jigamimbjojkdgnlldajknogfgncplbhhttps://chrome.google.com/webstore/detail/z-context/jigamimbjojkdgnlldajknogfgncplbh\">“CSS Stacking Context Inspector” Chrome extension</a> add an extra <code>z-index</code> tab to your DevTools to show you information about elements that create a stacking context.</p>\n<p><img src=\"https://files.smashing.media/articles/unstacking-css-stacking-contexts/5-browser-extensions.png\" /></p>\n<h4>IDE Extensions</h4>\n<p>You can even spot issues during development with an extension <a href=\"https://marketplace.visualstudio.com/items?itemName=mikerheault.vscode-better-css-stacking-contexts\">like this one for VS Code</a>, which highlights potential stacking context issues directly in your editor.</p>\n<p><img src=\"https://files.smashing.media/articles/unstacking-css-stacking-contexts/6-ide-extensions.png\" /></p>\nUnstacking And Regaining Control\n<p>After we’ve identified the root cause, the next step is to deal with it. There are several approaches you can take to tackle this problem, and I’ll list them in order. You can choose anyone at any level, though; no one can complain or obstruct another.</p>\n<h3>Change The HTML Structure</h3>\n<p>This is considered the optimal fix. For you to run into a stacking context issue, you must have placed some elements in funny positions within your HTML. Restructuring the page will help you reshape the DOM and eliminate the stacking context problem. Find the problematic element and remove it from the trapping element in the HTML markup. For instance, we can solve the first scenario, “The Trapped Modal,” by moving the <code>.modal-container</code> out of the header and placing it in the <code>&lt;body&gt;</code> element by itself.</p>\n<div>\n<pre><code>&lt;header class=\"header\"&gt;\n  &lt;h2&gt;Header&lt;/h2&gt;\n  &lt;button id=\"open-modal\"&gt;Open Modal&lt;/button&gt;\n  &lt;!-- Former position --&gt;\n&lt;/header&gt;\n&lt;main class=\"content\"&gt;\n  &lt;h1&gt;Main Content&lt;/h1&gt;\n  &lt;p&gt;This content has a z-index of 2 and will still not cover the modal.&lt;/p&gt;\n&lt;/main&gt;\n\n&lt;!-- New position  --&gt;\n&lt;div id=\"modal-container\" class=\"modal-container\"&gt;\n  &lt;div class=\"modal-overlay\"&gt;&lt;/div&gt;\n  &lt;div class=\"modal-content\"&gt;\n    &lt;h3&gt;Modal Title&lt;/h3&gt;\n    &lt;p&gt;Now, I'm not behind anything. I've gotten a better position as a result of DOM restructuring.&lt;/p&gt;\n    &lt;button id=\"close-modal\"&gt;Close&lt;/button&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n</div> \n\n<p>When you click the “Open Modal” button, the modal is positioned in front of everything else as it’s supposed to be.</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/azZVVNP\">Scenario 1: The Trapped Modal (Solution) [forked]</a> by <a href=\"https://codepen.io/drprime01\">Shoyombo Gabriel Ayomide</a>.</p>\n<h3>Adjust The Parent Stacking Context In CSS</h3>\n<p>What if the element is one you can’t move without breaking the layout? It’s better to address the issue: <strong>the parent establishes the context.</strong> Find the CSS property (or properties) responsible for triggering the context and remove it. If it has a purpose and cannot be removed, give the parent a higher <code>z-index</code> value than its sibling elements to lift the entire container. With a higher <code>z-index</code> value, the parent container moves to the top, and its children appear closer to the user.</p>\n<p>Based on what we learned in “<a href=\"/scl/fi/ue0rufxffviprc9858j25/Debugging-CSS-Stacking-Contexts.paper?rlkey=ezbdaiq6mojvb7xzezxlds29b&amp;dl=0#:uid=376729122027939635792428&amp;h2=Problem-2:-The-Submerged-Dropd\">The Submerged Dropdown</a>” scenario, we can’t move the dropdown out of the navbar; it wouldn’t make sense. However, we can increase the <code>z-index</code> value of the <code>.navbar</code> container to be greater than the <code>.content</code> element’s <code>z-index</code> value.</p>\n<pre><code>.navbar {\n  background: #333;\n  /* z-index: 1; */\n  z-index: 3;\n  position: relative;\n}\n</code></pre>\n\n<p>With this change, the <code>.dropdown-menu</code> now appears in front of the content without any issue.</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/YPWEEWz\">Scenario 2: The Submerged Dropdown (Solution) [forked]</a> by <a href=\"https://codepen.io/drprime01\">Shoyombo Gabriel Ayomide</a>.</p>\n<h3>Try Portals, If Using A Framework</h3>\n<p>In frameworks like <a href=\"https://react.dev/reference/react-dom/createPortal\">React</a> or <a href=\"https://www.digitalocean.com/community/tutorials/vuejs-portal-vue\">Vue</a>, a Portal is a feature that lets you render a component outside its normal parent hierarchy in the DOM. Portals are like a teleportation device for your components. They let you render a component’s HTML anywhere in the document (typically right into <code>document.body</code>) while keeping it logically connected to its original parent for props, state, and events. This is perfect for escaping stacking context traps since the rendered output literally appears outside the problematic parent container.</p>\n<pre><code>ReactDOM.createPortal(\n  &lt;ToolTip /&gt;,\n  document.body\n);\n</code></pre>\n\n<p>This ensures your dropdown content isn’t hidden behind its parent, even if the parent has <code>overflow: hidden</code> or a lower <code>z-index</code>.</p>\n<p>In the “The Clipped Tooltip” scenario we looked at earlier, I used a Portal to rescue the tooltip from the <code>overflow: hidden</code> clip by placing it in the document body and positioning it above the trigger within the container.</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/myEqqEe\">Scenario 3: The Clipped Tooltip (Solution) [forked]</a> by <a href=\"https://codepen.io/drprime01\">Shoyombo Gabriel Ayomide</a>.</p>\nIntroducing Stacking Context Without Side Effects\n<p>All the approaches explained in the previous section are aimed at “unstacking” elements from problematic stacking contexts, but there are some situations where you’ll actually need or want to create a stacking context.</p>\n<p>Creating a new stacking context is easy, but all approaches come with a side effect. That is, except for using <a href=\"https://css-tricks.com/almanac/properties/i/isolation/\"><code>isolation: isolate</code></a>. When applied to an element, the stacking context of that element’s children is determined relative to each child and within that context, rather than being influenced by elements outside of it. A classic example is assigning that element a negative value, such as <code>z-index: -1</code>.</p>\n<p>Imagine you have a <code>.card</code> component. You want to add a decorative shape that sits behind the <code>.card</code>’s text, but on top of the card’s background. Without a stacking context on the card, <code>z-index: -1</code> sends the shape to the bottom of the root stacking context (the whole page). This makes it disappear behind the <code>.card</code>’s white background:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/QwEOOEM\">Negative z-index (problem) [forked]</a> by <a href=\"https://codepen.io/drprime01\">Shoyombo Gabriel Ayomide</a>.</p>\n<p>To solve this, we declare <code>isolation: isolate</code> on the parent <code>.card</code>:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/MYeOOeG\">Negative z-index (solution) [forked]</a> by <a href=\"https://codepen.io/drprime01\">Shoyombo Gabriel Ayomide</a>.</p>\n<p>Now, the <code>.card</code> element itself becomes a stacking context. When its child element — the decorative shape created on the <code>:before</code> pseudo-element — has <code>z-index: -1</code>, it goes to the very bottom of the parent’s stacking context. It sits perfectly behind the text and on top of the card’s background, as intended.</p>\nConclusion\n<p>Remember: the next time your <code>z-index</code> seems out of control, it’s a trapped stacking context.</p>\n<h3>References</h3>\n<ul>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_positioned_layout/Stacking_context\">Stacking context</a> (MDN)</li>\n<li><a href=\"https://web.dev/learn/css/z-index\">Z-index and stacking contexts</a> (web.dev)</li>\n<li>“<a href=\"https://www.freecodecamp.org/news/the-css-isolation-property/\">How to Create a New Stacking Context with the Isolation Property in CSS</a>”, Natalie Pina</li>\n<li>“<a href=\"https://www.joshwcomeau.com/css/stacking-contexts/\">What The Heck, z-index??</a>”, Josh Comeau</li>\n</ul>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/02/css-z-index-large-projects/\">Managing CSS Z-Index In Large Projects</a>”, Steven Frieson</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2024/09/sticky-headers-full-height-elements-tricky-combination/\">Sticky Headers And Full-Height Elements: A Tricky Combination</a>”, Philip Braunen</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2019/04/z-index-component-based-web-application/\">Managing Z-Index In A Component-Based Web Application</a>”, Pavel Pomerantsev</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2009/09/the-z-index-css-property-a-comprehensive-look/\">The Z-Index CSS Property: A Comprehensive Look</a>”, Louis Lazaris</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"002e377181eb996a007471f6b71aa18d8539289ea038aceb30bf152a9e466d9c","category":"Tech"}