{"title":"From Pro Peloton to the Moots Family: My Journey on and  Off the Bike","link":"https://moots.com/blogs/news/from-pro-peloton-to-the-moots-family-my-journey-on-and-off-the-bike","date":1736835654000,"content":"\n      <figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Outlook-hf0fnepk-768x1024.jpg?v=1762207775\" alt=\"\" /></figure>\n<p>Hi, Moots family! I'm Lauren Hall, a former professional cyclist, lifelong athlete, and proud Moots ambassador. As someone who's spent years chasing finish lines and now thrives on exploring new roads and trails, I couldn't be more excited to share my story with you.</p>\n<p><strong>A Little About Me</strong></p>\n<p>Growing up in Vicksburg, Mississippi, I was an all-around athlete, playing soccer, basketball, tennis, and running track. My passion for competition earned me a full scholarship to play soccer at Mississippi State University, where I graduated in 2001. After college, I explored different paths, from culinary school to managing child nutrition programs, before discovering cycling at 28 – a little late by traditional standards but just in time to find my true calling. Cycling became my world, and soon, I found myself racing professionally for eight years. During that time, I raced for teams like Optum, United Healthcare, and Team Twenty16, competed in four World Championships, and proudly represented the U.S. National Team in Europe for three seasons. One of my career highlights? Winning a spring classic, Gent-Wevelgem, in 2014- a victory that still feels surreal.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/c6df14a6-8d12-43f0-a442-3ba040a31c83.jpg?v=1762207761\" alt=\"\" /></figure>\n<p><strong>Why Moots?</strong></p>\n<p>After retiring from the professional peloton, I sought a bike that would reconnect me with the pure joy of riding, my forever bike. Moots bikes have always been synonymous with craftsmanship, performance, timeless design, and the titanium frame needed with my current travel – all points that resonate deeply with me. When Moots provided me with a Vamoots RCS, equipped with Shimano Dura-Ace, HED Vanquish 45 Pro wheels, and aluminum bars (my choice), it reignited my love for exploring roads less traveled. That bike wasn't just a tool; it became an extension of my passion for riding. I've embraced a new cycling medium with a new Moots Routt RSL gravel bike decked out with SRAM Force, HED wheels, WTB 44 tires, and ENVE bars. Gravel riding has been an exciting way to explore new places and create fresh adventures. It's taken me off the beaten path, offering a sense of freedom and discovery that feels different from my road racing days. From quiet backroads to rugged trails, this bike has opened up endless opportunities for adventure and exploration.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/image_cf4e5974-29e2-4053-bf60-3490e0331901.jpg?v=1762207766\" alt=\"\" /></figure>\n<p><strong>What's Next?</strong></p>\n<p>Through this blog series, I'll share stories from my days in the pro peloton, my transition to life off the bike, and how Moots inspires my adventures today. Beyond the bike, I work for the USA Cycling Foundation, where I have the privilege of contributing to the mission of supporting athletes and the sport. This role allows me to be part of some incredible experiences, from attending the men's and women's Tour de France trips to cheering on our U.S. athletes at Road World Championships, Olympics and events across the U.S. Additionally, I've taken on a commentating role for marquee events like the Life Time Grand Prix series (see the YouTube series), SBT GRVL, and more. It's a dynamic and exciting way to stay connected to the sport and community that have shaped my life. -Lauren</p>\n<p><em>Join us monthly as Lauren details her transition from the pro peloton to her now impactful roll in the gravel community. </em></p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"042cc8c399b641078e29e8566d3609f105d655e4fcc31ee18fd6b942e7cf0756","category":"Cycling"}