{"title":"AI Bubble 2025","link":"https://markpeak.net/ai-bubble-2025/","date":1763890561000,"content":"<p>โลก AI เข้าสู่ภาวะฟองสบู่จริงไหม?</p>\n<p>น่าจะเป็นคำถามที่มีคนถามผมเยอะมากในรอบ 1-2 สัปดาห์ที่ผ่านมา หลังจากไปนั่งฟัง อ่าน คิด มาสักพักหนึ่ง คิดว่าน่าเขียนถึงเรื่องนี้ไว้สักหน่อย</p>\n<p>ถ้าให้ตอบแบบฟันธงก็คือ ไม่รู้เหมือนกันครับ ถ้ารู้ก็คงรวยไปนานแล้วล่ะ 555</p>\n<p>แต่ถ้าให้ลองตีกรอบ (framing) คำถามให้แคบลง ผมว่าเราสามารถแยกย่อยคำถามออกได้ 3 ข้อหลักๆ คือ</p>\n<ol>\n<li>ความต้องการพลังประมวลผล AI มีเยอะจริงหรือไม่</li>\n<li>รายได้จาก AI คุ้มค่าลงทุน infra หรือไม่</li>\n<li>ถ้าฟองสบู่แตกจริงๆ มันจะไปแตกที่ตรงไหน</li>\n</ol>\n<h1>ความต้องการพลังประมวลผล AI มีเยอะจริงหรือไม่</h1>\n<p>คำตอบของคำถามนี้คงต้องไปดูจากฝั่ง supply คือผู้ผลิตชิป ว่าความต้องการมันมีจริงรึเปล่า</p>\n<p>ผมฟัง Jensen Huang ไปขึ้น <a href=\"https://www.youtube.com/watch?v=0zXSrsKlm5A\">เวทีรวมมหาเทพ AI ของ Financial Times</a> (จะเขียนถึงเรื่องนี้อีกที) เขาเปรียบเทียบว่าในยุค dotcom bubble นั้นมีการลงทุนในสายไฟเบอร์ออปติกส์ (ในฐานะ “โครงสร้างพื้นฐานของอินเทอร์เน็ต”) กันอย่างบ้าคลั่ง แต่สายไฟเบอร์จำนวนมากกลับไม่ถูกใช้งานจริง (dark fiber) ซึ่งเป็นอาการของฟองสบู่ ในขณะที่ยุคนี้ มี GPU เท่าไรก็ไม่พอ ผลิตมาได้กี่ตัวก็ถูกใช้งานจนหมด</p>\n<p>อีกประเด็นที่ Jensen พูดไว้น่าสนใจคือ ในโลกซอฟต์แวร์ยุคก่อนหน้านี้ เราเอาพลังประมวลผลมาคอมไพล์ซอร์สโค้ดมาเป็นไบนารีซอฟต์แวร์ก่อน แล้วแจกจ่ายไบนารีไปรันบนเครื่องอื่นๆ ในภายหลัง การคอมไพล์ (ที่ใช้พลังประมวลผลเยอะๆ) ทำครั้งแรกครั้งเดียว หลังจากนั้นเราใช้พลังซีพียูไม่เยอะเท่าครั้งแรก แต่ในยุค AI มันต้องประมวลผลใหม่ทุกครั้ง เพราะต้องการคำตอบที่เป็น context-aware ขึ้นกับบริบทด้วย ไม่สามารถเตรียมคำตอบไว้ล่วงหน้าได้มากนัก จึงเป็นเหตุผลว่าทำไมโลกยุค AI ถึงต้องการพลังประมวลผลสูงมาก</p>\n<p>ฟัง Jensen พูดแล้วก็เข้าที แต่ก็อย่าลืมว่าแกมี conflict of interest เป็นคนขาย GPU ยังไงก็ต้องบอกว่าไม่ใช่ฟองสบู่อยู่แล้ว ลองหาความเห็นอื่นมาเทียบดู และ<a href=\"https://www.cnbc.com/2025/11/21/google-must-double-ai-serving-capacity-every-6-months-to-meet-demand.html\">เพิ่งมีเอกสารหลุดของกูเกิล</a> (แปลว่าไม่ได้ตั้งใจออกมาพูดเอาหล่อเอาเท่ เป็นข้อมูลจริง) มาเทียบ</p>\n<p>เอกสารนี้เป็นของ Amin Vahdat หัวหน้าฝ่าย AI infrastructure ของกูเกิล พูดในที่ประชุมพนักงานภายในบริษัท โดยเขาบอกสั้นๆ แต่ตรงประเด็นว่า “Now we must double every 6 months…. the next 1000x in 4-5 years.” อ่านแล้วน่าจะเข้าใจตรงกันทุกคน</p>\n<p>Vahdat บอกว่าการแข่งเรื่อง infra เป็นสิ่งสำคัญที่สุด (the most critical) ในโลก AI ตอนนี้ และเป็นสิ่งที่แพงที่สุดด้วย ในขณะที่ Sundar Pichai ก็ตอบคำถามพนักงานว่า เราจะพยายามรักษาการลงทุนให้พอดีๆ คือไม่ overinvest และไม่ underinvest เพราะความเสี่ยงของการลงทุนน้อยไปแล้วโดนคู่แข่งแซงหน้า มันสูงมาก</p>\n<p>คำตอบจากทั้ง NVIDIA และกูเกิลน่าจะไปในทางเดียวกันว่า demand เป็นของจริง และ supply มีไม่พอ ถ้ายังอยากอยู่ในการแข่งขันต่อไปก็ไม่มีทางเลือกอื่น นอกจากลงทุนเพิ่ม</p>\n<h1>รายได้จาก AI คุ้มค่าลงทุน infra หรือไม่</h1>\n<p>คำถามถัดมาคือ ลงทุนค่า infra ราคาแพงมหาศาล แล้วบริษัทต่างๆ สามารถสร้างรายได้กลับมาได้จริงหรือไม่ คุ้มค่าแค่ไหน</p>\n<p>อันนี้คงต้องแยกเป็นรายบริษัทไป บุคคลหัวแถวอย่าง Jensen ยกตัวอย่างของ Cursor บริษัทเจ้าของระบบ AI เขียนโค้ดชื่อดัง ว่าทำกำไรได้ดีมาก (very profitable) แต่ผมคิดว่ากรณีของ Cursor ที่อยู่ในตลาดเฉพาะทาง แล้วเป็นผู้นำในตลาดนี้ด้วย การทำกำไรได้เยอะ ไม่น่าจะเป็นตัวแทนของภาพรวมอุตสาหกรรมได้ดีนัก</p>\n<p>บริษัทที่ทุกคนจับตาคงหนีไม่พ้น OpenAI (และ Anthropic ในระดับรองลงมา) ว่าคนใช้งานมหาศาลจริงๆ แล้วคนจ่ายเงินเยอะจริงไหม?</p>\n<p>ตัวเลขล่าสุดที่ OpenAI เปิดเผยช่วงต้นเดือน พ.ย. 2025 คือมีผู้ใช้งาน 800 ล้านคนต่อสัปดาห์ และมีลูกค้าธุรกิจจำนวนกว่า 1 ล้านราย ในแง่การเติบโตคงไม่มีใครสงสัย แต่รายได้มันโตตามในสัดส่วนที่ทันกันหรือไม่</p>\n<p>เนื่องจาก OpenAI ยังไม่เข้าตลาดหลักทรัพย์ ข้อมูลการเงินจึงไม่เปิดเผยมากนัก ตัวเลขล่าสุดที่หาได้มาจาก <a href=\"https://x.com/sama/status/1986514377470845007?s=46\">ปากของ Sam Altman</a> เมื่อวันที่ 7 พ.ย. ว่าปี 2025 น่าจะมีรายได้ 20,000 ล้านดอลลาร์ ซึ่งเยอะกว่าที่ประเมินกันไว้ก่อนหน้านี้</p>\n<p>เราไม่มีข้อมูลอยู่ดีว่า รายได้เยอะจริงแล้วขาดทุนเท่าไร แต่ก่อนหน้านี้มีการคาดกันว่าตัวเลขรายได้กับการขาดทุนของ OpenAI อยู่ในระดับพอๆ กัน (แปลว่าต้นทุนเป็น 2 เท่าของรายได้) และผมคิดว่าอัตราขาดทุนน่าจะเพิ่มขึ้นกว่าเดิมอีก ไม่มีลดลง</p>\n<p>พี่ Sam ของเราให้ตัวเลขเองว่า “ประกาศลงทุน” ไปแล้ว 1.4 ล้านล้านดอลลาร์ในอีก 8 ปีข้างหน้า ซึ่งเขาพูดชัดเจนว่าต้องสร้างรายได้ให้เติบโตอีกมากๆ เพื่อเอามาใช้ลงทุนตรงนี้</p>\n<p>บริษัทสุดฮ็อตอย่าง OpenAI ไม่มีปัญหาเรื่องกระแสเงินสดในระยะสั้น อยากได้เงินเท่าไรมีแต่นักลงทุนยักษ์ใหญ่มาต่อคิวกันหัวกระไดไม่แห้ง แต่ผมคิดว่าในระยะยาวแล้ว สถานการณ์ของ OpenAI เริ่มไม่ค่อยดีนักด้วย 2 เหตุผลคือ</p>\n<ol>\n<li>ทรัพยากรประมวลผล (GPU) มีจำกัด และ OpenAI ไม่ได้เป็นเจ้าของเองเลย (ก่อนหน้านี้เช่าไมโครซอฟท์) จึงเป็นเหตุว่าทำไมช่วงหลังเราถึงเห็น OpenAI ประกาศทำดีลมากมายเรื่อง GPU และศูนย์ข้อมูล เพื่อการันตีว่าจะเข้าถึงพลังประมวลผลเหล่านี้ในอนาคตได้ ซึ่งแต่ละดีลมันก็พิสดารพันลึกมากๆ คงไม่ลงรายละเอียดในที่นี้ แต่มันสะท้อนว่าสภาพการบีบคั้นจริงๆ</li>\n<li>รายได้ “น่าจะ” ลดลงเพราะการแข่งขันรุนแรง ถ้า OpenAI เป็นเจ้าตลาดแบบนำห่าง ทุกคนต้องยอมจ่ายเงินใช้งาน ChatGPT มันก็น่าจะพอไปได้ แต่สถานการณ์ในปี 2025 กูเกิลมาแรงเหลือเกิน ยิ่งรอบล่าสุด Gemini 3 เอาชนะ GPT-5 ได้เด็ดขาด เราก็แทบไม่มีเหตุผลที่จะต้องจ่ายเงินให้ OpenAI กันอีก ซึ่งคนรอบตัวที่ผมรู้จักจำนวนมากก็ทยอยเลิกจ่ายเงินให้ OpenAI เปลี่ยนมาจ่ายให้ Gemini แทนกันเยอะแล้ว (ตลาดที่ผู้ชนะกินรวบนี่มันน่ากลัวจริงๆ)</li>\n</ol>\n<p>เมื่อเร็วๆ นี้เพิ่งมี <a href=\"https://seekingalpha.com/news/4524966-openais-sam-altman-mulls-temporary-economic-headwinds-from-googles-ai-progress\">บันทึกหลุดของพี่ Sam เขียนถึงพนักงาน</a> ยอมรับว่า Gemini 3 ทำออกมาได้ดี และการแข่งขันกับกูเกิลจะสร้าง “ลมต้าน” เรื่องรายได้ (economic headwind) กับ OpenAI เป็นการชั่วคราว</p>\n<p><a href=\"https://www.businessinsider.com/at-an-ai-conference-attendees-were-asked-which-startup-they-would-short-2025-11\">อีกข่าวที่เกี่ยวข้องกัน</a>คือในงานสัมมนา Cerebral Valley AI Conference เมื่อเร็วๆ นี้ มีการตั้งคำถามผู้เข้าร่วมงานประมาณ 300 คนว่า ถ้าต้องช็อตหุ้น AI สักตัวจะเลือกบริษัทไหน คำตอบที่นำมาอันดับหนึ่งคือ Perplexity บริษัท AI ที่เรียกตีนที่สุดในยุคนี้ (อันนี้ไม่น่าแปลกใจ) แต่อันดับสองคือ OpenAI ซึ่งก็น่าตกใจไม่น้อย แต่น่าจะสะท้อนมุมมองของคนในวงการได้เป็นอย่างดี</p>\n<h1>ถ้าฟองสบู่แตกจริงๆ มันจะไปแตกที่ตรงไหน</h1>\n<p>Demis Hassabis แห่ง DeepMind ไปออกรายการพ็อดแคสต์ไม่กี่วันก่อน เขาบอกว่า “some parts of the AI industry are probably in a bubble.” โดยหมายถึงเงินของนักลงทุนเทไปลงในบริษัท AI ที่ยังไม่มีรายได้เข้ามาจริง</p>\n<p>พี่ Sam เองก็เคยให้สัมภาษณ์ไว้ว่า นักลงทุนตื่นเต้นเกินไป (overexcited) และนักลงทุนบางคนน่าจะสูญเงินมหาศาล</p>\n<p>เมื่อเร็วๆ นี้ <a href=\"https://www.bbc.com/news/articles/cwy7vrd8k4eo\">Sundar Pichai ซีอีโอกูเกิลไปออกรายการ BBC</a> แล้วโดนถามเรื่องนี้ เขายอมรับว่า มีบางส่วนที่ผิดปกติ (there was some irrationality) ในกระแส AI บูมช่วงนี้ และออกตัวว่าไม่มีบริษัทไหนที่จะทนทานต่อฟองสบู่แตก ซึ่งรวมถึงเราเองด้วย (I think no company is going to be immune, including us)</p>\n<p>ผมคิดว่ามุมมองของผู้นำในโลก AI น่าจะตรงกันว่าฟองสบู่นั้นมีอยู่จริง คำถามคือมันจะไปแตกที่ตรงไหน</p>\n<p>Pichai คนดีคนเดิม ไปตอบคำถามพนักงานในบริษัท แล้วพูดอีกแบบว่า เราอยู่ในตำแหน่งที่ทนทานความผิดพลาดได้ดีกว่าคู่แข่ง (We are better positioned to withstand, you know, misses, than other companies)</p>\n<p><a href=\"https://markpeak.net/google-io-2025/\">ผมเคยเขียนถึง</a>ไปหลายครั้งว่า จุดแข็งสำคัญของกูเกิลมี 2 อย่างคือ</p>\n<ol>\n<li>พิมพ์เงินเองได้ (literally) จากธุรกิจโฆษณาเดิม ในขณะที่ OpenAI ยังต้องหาเงินจากการระดมทุน</li>\n<li><a href=\"https://markpeak.net/three-pillars-of-large-ai/\">มีทุกอย่างครบอยู่คนเดียว</a> ตั้งแต่ออกแบบชิปเอง มีศูนย์ข้อมูลเอง มีโมเดลเอง มีแอพพลิเคชันของตัวเอง ไม่ต้องพึ่งพาจมูกคนอื่นหายใจ</li>\n</ol>\n<p>ถ้าเปรียบเทียบเป็นสงครามโลก กูเกิลคงเป็นสหรัฐอเมริกา ชาติใหญ่มหาอำนาจ มีทรัพยากรมหาศาล แค่ตอนแรกขยับตัวช้าหน่อย กว่าจะตื่นลุกขึ้นมาทำอะไร ส่วน OpenAI คงเป็นเหมือนญี่ปุ่นหรือเยอรมนี ที่เป็นชาติเล็กกว่า ทรัพยากรน้อยกว่า แต่ห้าวเป้ง จู่โจมรวดเร็วปานสายฟ้าแลบ (Blitzkrieg) แต่พอต้องทำสงครามระยะยาว เป็นสงครามทรัพยากรว่าใครหมดก่อนแพ้ (attrition warfare) ก็เสียเปรียบก่อนจะพ่ายแพ้ไป</p>\n<p>กลับมาตอบคำถามแรกสุดว่า ฟองสบู่ AI มีจริงไหม? จริงครับ</p>\n<p>แล้วมันจะแตกที่ตรงไหน? ไม่ทราบครับ</p>\n<p>ทราบแต่ว่าถ้าฟองสบู่ AI แตก มันจะมีบริษัทที่แข็งแกร่งมากๆ ที่บาดเจ็บเล็กน้อย แล้วไปต่อได้แบบยิ่งใหญ่กว่าเดิม เพราะคู่แข่งหายไปเยอะแล้วนั่นเอง</p>\n<p><strong>หมายเหตุ:</strong></p>\n<p>จริงๆ ยังมีอีกปัจจัยที่ผมคิดว่ามีผลช่วย “ชะลอ” ฟองสบู่ AI ลงไปได้บ้างนิดหน่อยคือ on-device AI หรือการประมวลผลในเครื่องของเราเอง แทนการไปประมวลผลบนคลาวด์ ซึ่งมันจะช่วยลด demand การประมวลผลบนคลาวด์ลงมาได้บ้าง (สำหรับงานที่ไม่ซับซ้อนมาก) แต่คิดว่าไม่ได้มีผลถึงขนาดเปลี่ยนแปลงภาพรวมตลาดได้อยู่ดี</p>The post <a href=\"https://markpeak.net/ai-bubble-2025/\">AI Bubble 2025</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"074224b585d4ad3dcdacb5cbf91799e0747e45edb5395c72a76f73ecaaf03e9a","category":"Thai"}