{"title":"How StrongDM's AI team build serious software without even looking at the code","link":"https://simonwillison.net/2026/Feb/7/software-factory/#atom-entries","date":1770478848000,"content":"<p>Last week <a href=\"https://simonwillison.net/2026/Jan/28/the-five-levels/\">I hinted at</a> a demo I had seen from a team implementing what Dan Shapiro called <a href=\"https://www.danshapiro.com/blog/2026/01/the-five-levels-from-spicy-autocomplete-to-the-software-factory/\">the Dark Factory</a> level of AI adoption, where no human even looks at the code the coding agents are producing. That team was part of StrongDM, and they've just shared the first public description of how they are working in <a href=\"https://factory.strongdm.ai\">Software Factories and the Agentic Moment</a>:</p>\r\n<blockquote>\r\n<p>We built a <strong>Software Factory</strong>: non-interactive development where specs + scenarios drive agents that write code, run harnesses, and converge without human review. [...]</p>\r\n<p>In kōan or mantra form:</p>\r\n<ul>\r\n<li>Why am I doing this? (implied: the model should be doing this instead)</li>\r\n</ul>\r\n<p>In rule form:</p>\r\n<ul>\r\n<li>Code <strong>must not be</strong> written by humans</li>\r\n<li>Code <strong>must not be</strong> reviewed by humans</li>\r\n</ul>\r\n<p>Finally, in practical form:</p>\r\n<ul>\r\n<li>If you haven't spent at least <strong>$1,000 on tokens today</strong> per human engineer, your software factory has room for improvement</li>\r\n</ul>\r\n</blockquote>\r\n<p>I think the most interesting of these, without a doubt, is \"Code <strong>must not be</strong> reviewed by humans\". How could that <em>possibly</em> be a sensible strategy when we all know how prone LLMs are to making <a href=\"https://simonwillison.net/2025/Mar/2/kellan-elliott-mccrea/\">inhuman mistakes</a>?</p>\r\n<p>I've seen many developers recently acknowledge the <a href=\"https://simonwillison.net/2026/Jan/4/inflection/\">November 2025 inflection point</a>, where Claude Opus 4.5 and GPT 5.2 appeared to turn the corner on how reliably a coding agent could follow instructions and take on complex coding tasks. StrongDM's AI team was founded in July 2025 based on an earlier inflection point relating to Claude Sonnet 3.5:</p>\r\n<blockquote>\r\n<p>The catalyst was a transition observed in late 2024: with the second revision of Claude 3.5 (October 2024), long-horizon agentic coding workflows began to compound correctness rather than error.</p>\r\n<p>By December of 2024, the model's long-horizon coding performance was unmistakable via Cursor's <a href=\"https://forum.cursor.com/t/yolo-mode-is-amazing/36262\">YOLO mode</a>.</p>\r\n</blockquote>\r\n<p>Their new team started with the rule \"no hand-coded software\" - radical for July 2025, but something I'm seeing significant numbers of experienced developers start to adopt as of January 2026.</p>\r\n<p>They quickly ran into the obvious problem: if you're not writing anything by hand, how do you ensure that the code actually works? Having the agents write tests only helps if they don't cheat and <code>assert true</code>.</p>\r\n<p>This feels like the most consequential question in software development right now: how can you <a href=\"https://simonwillison.net/2025/Dec/18/code-proven-to-work/\">prove that software you are producing works</a> if both the implementation and the tests are being written for you by coding agents?</p>\r\n<p>StrongDM's answer was inspired by <a href=\"https://en.wikipedia.org/wiki/Scenario_testing\">Scenario testing</a> (Cem Kaner, 2003). As StrongDM describe it:</p>\r\n<blockquote>\r\n<p>We repurposed the word <strong>scenario</strong> to represent an end-to-end \"user story\", often stored outside the codebase (similar to a \"holdout\" set in model training), which could be intuitively understood and flexibly validated by an LLM.</p>\r\n<p>Because much of the software we grow itself has an agentic component, we transitioned from boolean definitions of success (\"the test suite is green\") to a probabilistic and empirical one. We use the term <strong>satisfaction</strong> to quantify this validation: of all the observed trajectories through all the scenarios, what fraction of them likely satisfy the user?</p>\r\n</blockquote>\r\n<p>That idea of treating scenarios as holdout sets - used to evaluate the software but not stored where the coding agents can see them - is <em>fascinating</em>. It imitates aggressive testing by an external QA team - an expensive but highly effective way of ensuring quality in traditional software.</p>\r\n<p>Which leads us to StrongDM's concept of a <strong>Digital Twin Universe</strong> - the part of the demo I saw that made the strongest impression on me.</p>\r\n<p>The software they were building helped manage user permissions across a suite of connected services. This in itself was notable - security software is the last thing you would expect to be built using unreviewed LLM code!</p>\r\n<blockquote>\r\n<p>[The Digital Twin Universe is] behavioral clones of the third-party services our software depends on. We built twins of Okta, Jira, Slack, Google Docs, Google Drive, and Google Sheets, replicating their APIs, edge cases, and observable behaviors.</p>\r\n<p>With the DTU, we can validate at volumes and rates far exceeding production limits. We can test failure modes that would be dangerous or impossible against live services. We can run thousands of scenarios per hour without hitting rate limits, triggering abuse detection, or accumulating API costs.</p>\r\n</blockquote>\r\n<p>How do you clone the important parts of Okta, Jira, Slack and more? With coding agents!</p>\r\n<p>As I understood it the trick was effectively to dump the full public API documentation of one of those services into their agent harness and have it build an imitation of that API, as a self-contained Go binary. They could then have it build a simplified UI over the top to help complete the simulation.</p>\r\n\r\n<p><strong>Update</strong>: DTU creator Jay Taylor posted some extra context about this <a href=\"https://news.ycombinator.com/item?id=46924426#46931812\">on Hacker News</a> sharing a key prompting strategy:</p>\r\n<blockquote>\r\n<p>I did have an initial key insight which led to a repeatable strategy to ensure a high level of fidelity between DTU vs. the official canonical SaaS services:</p>\r\n<p><code>Use the top popular publicly available reference SDK client libraries as compatibility targets, with the goal always being 100% compatibility.</code></p>\r\n</blockquote>\r\n\r\n<p>With their own, independent clones of those services - free from rate-limits or usage quotas - their army of simulated testers could go <em>wild</em>. Their scenario tests became scripts for agents to constantly execute against the new systems as they were being built.</p>\r\n<p>This screenshot of their Slack twin also helps illustrate how the testing process works, showing a stream of simulated Okta users who are about to need access to different simulated systems.</p>\r\n<p><img src=\"https://static.simonwillison.net/static/2026/strong-dm-slack.jpg\" alt=\"Screenshot of a Slack-like interface titled &quot;DTU Slack&quot; showing a thread view (Thread — C4B9FBB97) with &quot;Focus first&quot; and &quot;Leave&quot; buttons. The left sidebar lists channels including # org-general (182), # general (0) (shared×2), # it-support (0), # channel-0002 (0) (shared×2), # channel-0003 (0) through # channel-0020 (0), # org-finance (1), and a DMs section with a &quot;Start&quot; button. A &quot;Create&quot; button appears at the top of the sidebar. The main thread shows approximately 9 automated introduction messages from users with Okta IDs (e.g. @okta-u-423438-00001, @okta-u-423438-00002, etc.), all timestamped 2025-11-12Z between 18:50:31 and 18:51:51. Each message follows the format &quot;Hi team! I'm [Name], joining as Employee in general. Key skills: [fictional skill phrases]. Excited to contribute!&quot; All users have red/orange &quot;O&quot; avatar icons.\" /></p>\r\n<p>This ability to quickly spin up a useful clone of a subset of Slack helps demonstrate how disruptive this new generation of coding agent tools can be:</p>\r\n<blockquote>\r\n<p>Creating a high fidelity clone of a significant SaaS application was always possible, but never economically feasible. Generations of engineers may have <em>wanted</em> a full in-memory replica of their CRM to test against, but self-censored the proposal to build it.</p>\r\n</blockquote>\r\n<p>The <a href=\"https://factory.strongdm.ai/techniques\">techniques page</a> is worth a look too. In addition to the Digital Twin Universe they introduce terms like <strong><a href=\"https://factory.strongdm.ai/techniques/gene-transfusion\">Gene Transfusion</a></strong> for having agents extract patterns from existing systems and reuse them elsewhere, <strong><a href=\"https://factory.strongdm.ai/techniques/semport\">Semports</a></strong> for directly porting code from one language to another and <strong><a href=\"https://factory.strongdm.ai/techniques/pyramid-summaries\">Pyramid Summaries</a></strong> for providing multiple levels of summary such that an agent can enumerate the short ones quickly and zoom in on more detailed information as it is needed.</p>\r\n<p>StrongDM AI also released some software - in an appropriately unconventional manner.</p>\r\n<p><a href=\"https://github.com/strongdm/attractor\">github.com/strongdm/attractor</a> is <strong>Attractor</strong>, the non-interactive coding agent at the heart of their software factory. Except the repo itself contains no code at all - just three markdown files describing the spec for the software in meticulous detail, and a note in the README that you should feed those specs into your coding agent of choice!</p>\r\n<p><a href=\"https://github.com/strongdm/cxdb\">github.com/strongdm/cxdb</a> is a more traditional release, with 16,000 lines of Rust, 9,500 of Go and 6,700 of TypeScript. This is their \"AI Context Store\" - a system for storing conversation histories and tool outputs in an immutable DAG.</p>\r\n<p>It's similar to my LLM tool's <a href=\"https://llm.datasette.io/en/stable/logging.html#sql-schema\">SQLite logging mechanism</a> but a whole lot more sophisticated. I may have to gene transfuse some ideas out of this one!</p>\r\n<h4>A glimpse of the future?</h4>\r\n<p>I visited the StrongDM AI team back in October as part of a small group of invited guests.</p>\r\n<p>The three person team of Justin McCarthy, Jay Taylor and Navan Chauhan had formed just three months earlier, and they already had working demos of their coding agent harness, their Digital Twin Universe clones of half a dozen services and a swarm of simulated test agents running through scenarios. And this was prior to the Opus 4.5/GPT 5.2 releases that made agentic coding significantly more reliable a month after those demos.</p>\r\n<p>It felt like a glimpse of one potential future of software development, where software engineers move from building the code to building and then semi-monitoring the systems that build the code. The Dark Factory.</p>\r\n\r\n<h4>Wait, $1,000/day per engineer?</h4>\r\n<p>I glossed over this detail in my first published version of this post, but it deserves some serious attention.</p>\r\n<p>If these patterns really do add $20,000/month per engineer to your budget they're far less interesting to me. At that point this becomes more of a business model exercise: can you create a profitable enough line of products that you can afford the enormous overhead of developing software in this way?</p>\r\n<p>Building sustainable software businesses also looks very different when any competitor can potentially clone your newest features with a few hours of coding agent work.</p>\r\n<p>I hope these patterns can be put into play with a much lower spend. I've personally found the $200/month Claude Max plan gives me plenty of space to experiment with different agent patterns, but I'm also not running a swarm of QA testers 24/7!</p>\r\n<p>I think there's a lot to learn from StrongDM even for teams and individuals who aren't going to burn thousands of dollars on token costs. I'm particularly invested in the question of what it takes to have agents prove that their code works without needing to review every line of code they produce.</p><p><em>You are only seeing the long-form articles from my blog. Subscribe to <a href=\"https://simonwillison.net/atom/everything/\">/atom/everything/</a> to get all of my posts, or take a look at my <a href=\"https://simonwillison.net/about/#subscribe\">other subscription options</a>.</em></p>","author":"Simon Willison","siteTitle":"Simon Willison’s Weblog","siteHash":"1b599216bd27a00f15d67a3ed9719c64148630c70244b6dd8e743f17cb45527e","entryHash":"07fa4eac14722130e5f494648c1549af160ec848c2ee0d1270d7599f36fa78d9","category":"Tech"}