{"title":"Apple’s budget MacBook coming soon: What to expect","link":"https://www.macworld.com/article/2854313/a18-pro-macbook-design-processor-specs-release-rumors.html","date":1771519430000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s MacBook lineup could be in for a major shakeup. The company is reportedly planning on releasing a new, low-cost laptop that can compete with Chromebooks and Windows laptops in the budget market. Such a laptop could bring the Mac to a whole new class of users.</p>\n\n\n\n<p>The new MacBook may feature an aluminum design in playful colors, an A19 Pro chip, Ultra Retina XDR OLED display, fewer ports, and Apple’s C2 modem. </p>\n\n\n\n<p>This new, low-cost MacBook could be a very popular one, which means you’ll want to keep track of its developments. Well, look no further. This article will keep track of the rumors and reports of this upcoming product, as well as offer our perspective on the device, so keep an eye on this page for the latest.</p>\n\n\n\n<div>\n<div><div></div><div>\n<h2>New A19 MacBook: Release date</h2>\n\n\n\n<ul>\n<li>March 4, 2026 – possible </li>\n</ul>\n\n\n\n<p>Apple is scheduled to host three “Apple Special Experiences” on March 4 in the U.S., U.K., and China. These sessions, which are expected to offer media hands-on time with new products, could provide the ideal setting for the budget MacBook’s debut.</p>\n\n\n\n<p>Apple’s low-cost MacBook has been rumored for some time, with Apple leaker Jon Prosser describing a new <a href=\"https://www.macworld.com/article/676885/first-look-at-colourful-macbook-air.html\">colorful MacBook Air</a> back in May 2021, that never materialised, but over the past year rumors have remerged suggesting that Apple does have something different coming. </p>\n\n\n\n<p>In June 2025, credible analyst Ming-Chi Kuo, <a href=\"https://x.com/mingchikuo/status/1939558393875943719\">indicated (in Chinese)</a> that Apple would start production of the new <a href=\"https://www.macworld.com/article/2832014/apple-may-launch-a-low-cost-macbook-powered-by-an-iphone-chip-later-this-year.html\">low-cost MacBook</a> at the end of the fourth quarter of 2025 or in the early stage of the first quarter of 2026. It’s worth emphasising that those dates refer to the manufacturing process rather than the announcement or shipping timeframe. If production began in October 2025 then it’s plausible that the budget MacBook will arrive in early 2026, potentially unveiled at a <a href=\"https://www.macworld.com/article/1484151/apple-spring-event-date-time-how-to-watch-rumors.html\">spring event</a>, or in the run up to Apple’s March 4 ‘Experience’. </p>\n\n\n\n<p>In November, 2025, Bloomberg’s Mark Gurman <a href=\"https://www.bloomberg.com/news/articles/2025-11-04/apple-readies-a-low-cost-laptop-to-rival-chromebooks-and-windows-pcs\">reported</a> that Apple is planning to release a “low-cost laptop to rival Chromebooks and Windows PCs” in the first half of 2026. He said it was currently in testing at Apple and “in early production with overseas suppliers.”</p>\n\n\n\n<p>On February 8, 2026, Gurman reported that the low-cost MacBook will be available “in the first half of the year.” He did not offer any specifics. And then, on February 15, he wrote that Apple’s long-rumored low-cost MacBook is <a href=\"https://www.macworld.com/article/3061517/low-cost-macbook-in-fun-colors-leads-flurry-of-upcoming-mac-releases.html\">expected to arrive</a> “as early as March,” with a design that defies its price tag.  </p>\n\n\n\n<figure><div>\n\n</div></figure>\n</div></div>\n<div>\n\t\t\t\t\t</div>\n\n\n<div><div></div><div>\n<h2>What will the new MacBook be called? </h2>\n\n\n\n<ul>\n<li>MacBook (probably)</li>\n</ul>\n\n\n\n<p>No reports have been made about the official name of the laptop, but you can assume it won’t be part of the MacBook Air line. It’s being referred to as the A18 or A19 Pro MacBook, based on the chip it could have. Apple could simply call it “MacBook,” reviving the name of the <a href=\"https://www.macworld.com/article/232994/the-12-inch-macbook-is-dead-and-it-will-be-missed.html\">discontinued 12-inch MacBook</a> that was targeted at a similar market.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2025/09/macbook2017_16_thumb.jpg?quality=50&amp;strip=all\" alt=\"Old MacBook from 2017\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption>Apple last updated the MacBook in 2017.</figcaption></figure><p>Foundry</p></div>\n</div></div>\n<div>\n\t\t\t\t\t</div>\n\n\n<div><div></div><div>\n<h2>New A19 MacBook: Design</h2>\n\n\n\n<ul>\n<li>Playful colors</li>\n\n\n\n<li>Aluminum chassis (not plastic) </li>\n</ul>\n\n\n\n<p>According to Mark Gurman (in February 2026), Apple’s low-cost MacBook will have a <a href=\"https://www.macworld.com/article/3061517/low-cost-macbook-in-fun-colors-leads-flurry-of-upcoming-mac-releases.html\">design that defies its price tag</a>. </p>\n\n\n\n<p>Apple’s goal with this laptop is to make it affordable compared to the MacBook Air and MacBook Pro, and one way to cut costs is to make a plastic case instead of an aluminum one. However, since Apple is working to make its products <a href=\"https://www.macworld.com/article/674645/all-apple-products-will-be-carbon-neutral-by-2030.html\">carbon-neutral</a>, it’s doubtful that it would use plastic, preferring to use aluminum or some other recyclable or carbon-free material. Therefore, it is no surprise that the new MacBook, according to Gurman, will have an aluminum chassis. </p>\n\n\n\n<p>There will be a new manufacturing process “designed to be both faster and more cost-effective than the one used with Apple’s current laptops,” according to Gurman. </p>\n\n\n\n<p>Along with the aluminum shell, Gurman reports that the new MacBook will be available in “playful colors.”</p>\n\n\n\n<p>The following colours are indicated: yellow, light green, blue, silver, dark gray, and pink. Which, in the case of yellow, green and blue, does seem to match the logo Apple designed for the invites to the special events on March 4. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/02/apple-event-logo-march-2026.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple special experience logo march 4 2026\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t</figure><p>Apple</p></div>\n\n\n\n<p>Back in June 2023 analyst Ming-Chi Kuo suggested the following colors: silver, blue, pink, and yellow. </p>\n\n\n\n<h2>A19 Pro MacBook: Display</h2>\n\n\n\n<ul>\n<li>12.9-inch display – rumored</li>\n</ul>\n\n\n\n<p>Apple currently uses a Liquid Retina (LED-backlit display with IPS technology) display in the MacBook Air, an upgrade over the original Retina displays Apple last used with the <a href=\"https://www.macworld.com/article/791082/13-inch-macbook-pro-m2-review.html\">13-inch MacBook Pro in 2022</a>. It’s possible Apple could revert to a Retina display with squared-off corners for the A19 Pro MacBook, though it’s more likely that Apple shaves cost by using a smaller display.</p>\n\n\n\n<p>On August 11, DigiTimes <a href=\"https://www.digitimes.com/news/a20250811PD214/apple-low-cost-macbook-notebook-market.html\">reported</a> that the laptop will have a 12.9-inch display, slightly smaller than the 13-inch MacBook Air.</p>\n</div></div>\n<div>\n\t\t\t\t\t</div>\n\n\n<div><div></div><div>\n<h2>New A19 MacBook: Processor</h2>\n\n\n\n<ul>\n<li>iPhone chip: A19 Pro or A18 Pro – expected</li>\n</ul>\n\n\n\n<p>Another way to meet the pricing goals for this new MacBook is to use a chip that isn’t as robust as the chips used in the MacBook Air and MacBook Pro. When Kuo first discussed the budget MacBook in his June 2025 <a href=\"https://www.macworld.com/article/2832014/apple-may-launch-a-low-cost-macbook-powered-by-an-iphone-chip-later-this-year.html\">report</a>, he stated that Apple will use an A18 Pro, the same chip that was in the <a href=\"https://www.macworld.com/article/2469098/iphone-16-pro-and-iphone-16-pro-max-review.html\">iPhone 16 Pro</a>. Now that the A19 arrived with the iPhone 17 this is probably the more likely chip. Read more about what the iPhone 17 can tell us about the MacBook that could use the same chip in: <a href=\"https://www.macworld.com/article/2908245/apples-rumored-cheap-macbook-could-be-hiding-in-plain-sight.html\">Is Apple’s rumored cheap MacBook hiding in plain sight? </a></p>\n\n\n\n<p>The A-series chips are used in iPhones, while M-series chips are in Macs. Both chip families are based on the same general architecture, but the M chips generally offer more processing power.</p>\n\n\n\n<p>An A19 Pro (and A18 Pro) can technically do everything an M-series chip can, but it will be slower. When comparing Geekbench 6 benchmarks, the A18 Pro offered single-core performance that’s on par with the M3. However, because the A18 Pro has only 6 CPU cores, its multi-core performance is slightly behind the M1, which has 8 CPU cores. If Apple keeps everything the same, an A18 Pro MacBook will perform like an <a href=\"https://www.macworld.com/article/234819/macbook-air-m1-review-an-absolutely-stunning-debut-for-apple-silicon-in-a-mac.html\">M1 MacBook Air</a>, which, for a lot of people, has more than enough processing power. Should Apple use an A19 Pro we can expect something even better. </p>\n\n\n\n<p>It will draw comparison with the iPad models that are powered by Mac chips, though. </p>\n\n\n\n<p>MacRumors <a href=\"https://www.macrumors.com/2025/12/16/apple-developing-imac-with-m5-max/\">reported</a>, in December 2025, that references to an A18 Pro MacBook appeared in a set of leaked Apple files.</p>\n\n\n\n<h2>New A19 MacBook: Connectivity</h2>\n\n\n\n<p>Apple is using its own wireless networking chip, the N1 in the <a href=\"https://www.macworld.com/article/2393967/iphone-17-release-date-specs-features-rumors.html\">iPhone 17</a>, bringing Bluetooth 6, Wi-Fi 7, and Thread. It’s likely the same chips will make their way into the A19 Pro MacBook. </p>\n\n\n\n<p>There’s also a chance this new Mac will have cellular connectivity using Apple’s C1, C1X or yet to launch C2 modem. The C2 is likely to support mmWave. </p>\n\n\n\n<p>Aside from this, it’s rumored that the budget MacBook will have fewer USB ports than the MacBook Air (which has two USB-C and a magsafe charging port). This low-cost MacBook may not support Thunderbolt. </p>\n</div></div>\n<div>\n\t\t\t\t\t</div>\n\n\n<div><div></div><div>\n<h2>New A19 MacBook: Camera</h2>\n\n\n\n<ul>\n<li>No camera?</li>\n</ul>\n\n\n\n<p>It’s also possible that Apple opts not to include a built-in camera. Over the past several years, Apple has promoted the Mac’s Continuity Camera feature that lets you use an<a href=\"https://www.macworld.com/article/817000/how-to-continuity-camera-iphone-webcam-for-your-mac.html\"> iPhone as a Mac webcam</a>, as well as the upcoming <a href=\"https://www.macworld.com/article/2780261/macos-16s-new-magnifier-app-uses-an-iphone-to-see-far-away-objects-up-close.html\">macOS Tahoe Magnifier</a> app. Apple could promote this as a webcam solution. This would be a drastic change, since it’s been a long time since Apple shipped a laptop without a camera, but it could be a possibility in order to meet the company’s price goal.</p>\n</div></div>\n<div>\n\t\t\t\t\t</div></div>\n\n\n\n<h2>New A19 MacBook: Performance</h2>\n\n\n\n<div><div>\t\t\n\t\t<div></div>\n\t\t\n\t\t\t\n\n\n<p><sup>Results are expressed as Geekbench scores. Higher scores/longer bars are faster.</sup></p>\n</div></div>\n\n\n\n<p>We don’t yet have the benchmarks for the A19 Pro, but the A18 Pro has 8GB of RAM, which Apple has said is the bare <a href=\"https://www.macworld.com/article/2365423/apple-intelligence-cpu-memory-neural-engine-private-cloud-compute.html\">minimum required</a> to run <a href=\"https://www.macworld.com/article/2362804/apple-intelligence-faq-features-release-date-hardware-support.html\">Apple Intelligence</a> features. So, this new laptop will have at least 8GB of RAM and possibly 16GB, like the other MacBook models. Since the iPhone doesn’t offer RAM upgrades, we don’t know what Apple could charge for extra memory.</p>\n\n\n\n<p>As for graphics performance, the A18 Pro has a 6-core GPU, and its Metal score in Geekbench 6’s Compute benchmark is similar to that of the M1 found in the MacBook Air. It’s not a cutting-edge performer, but it’ll handle everyday tasks without any issues. Since Apple’s other MacBooks all start at 256GB of storage, it’s nearly certain this model will come with 256GB of storage as well. </p>\n\n\n\n<h2>New A19 MacBook: Price</h2>\n\n\n\n<p>The cheapest laptop Apple sells is the $999 MacBook Air. However, <a href=\"https://goto.walmart.com/c/321564/565706/9383?veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https://www.walmart.com/ip/Apple-MacBook-Air-13-3-inch-Laptop-Space-Gray-M1-Chip-Built-for-Apple-Intelligence-8GB-RAM-256GB-storage/609040889&amp;subid1=rss\">Walmart still sells the M1 MacBook Air with a 256GB SSD</a> for $649 and as low as $599. The A19 Pro MacBook has been thought of as a replacement for this Walmart model, though it’s hard to believe it would be that cheap. A price that falls between $729 and $849 seems like it would fit into the MacBook lineup.</p>\n\n\n\n<p>There are claims that the low-cost MacBook could start at $599, which could allow Apple to compete with Chromebooks and Windows laptops. </p>\n\n\n\n<p>Gurman reports that the new laptop will cost “well under $1,000.”</p>\n\n\n\n<p>Our estimation would be around the middle of those two figures, around $749. </p>\n\n\n\n<figure><div>\n<blockquote> <section> <a target=\"_blank\" href=\"https://www.tiktok.com/@macworld.com?refer=embed\">@macworld.com</a> <p>A cheap MacBook…or something else. A rumor says that Apple is going to release a cheap laptop, but what if it’s actually the long-rumored iPad/Mac hybrid we’ve heard about? From the latest episode of the Macworld Podacst. <a target=\"_blank\" href=\"https://www.tiktok.com/tag/macbook?refer=embed\">#macbook</a> <a target=\"_blank\" href=\"https://www.tiktok.com/tag/mac?refer=embed\">#mac</a> <a target=\"_blank\" href=\"https://www.tiktok.com/tag/apple?refer=embed\">#apple</a></p> <a target=\"_blank\" href=\"https://www.tiktok.com/music/original-sound-Macworld-7522265050019597086?refer=embed\">♬ original sound – Macworld – Macworld</a> </section> </blockquote> \n</div></figure>\n\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"08b7ed74be6c284c0360a5a52b875ff983561baf411e1ddd3861518776a25ead","category":"Apple"}