{"title":"More MacOS 26.3 Finder Column View Silliness","link":"https://lapcatsoftware.com/articles/2026/2/4.html","date":1770916411000,"content":"\n<p>Jeff Johnson:</p>\n\n<blockquote>\n  <p>In today’s macOS 26.3 update, Apple implemented a “fix” for an\nissue I blogged about a month ago, <a href=\"https://lapcatsoftware.com/articles/2026/1/4.html\">macOS Tahoe broke Finder\ncolumns view</a>. (At the behest of John Gruber and the <a href=\"https://support.apple.com/guide/applestyleguide/c-apsgb744e4a3/1.0/web/1.0#apdef2437a79d084\">Apple\nStyle Guide</a>, I’m now using the term “column view” rather\nthan “columns view.”) Specifically, the issue was with the system\nsetting to always show scroll bars. [...]</p>\n\n<p>Without the path bar, the columns are now taller, but the vertical\nscrollers remain the same height as before, leaving vertical gaps,\na ridiculous amount of space between the bottom of the scrollers\nand the bottom of the columns, looking silly and amateurish.</p>\n\n<p>Did nobody inside Apple test this configuration either? Or do they\nsimply not care?</p>\n</blockquote>\n\n<p>In one sense, this whole issue with column view in the Finder with scroll bars set to always show is a little thing. It was downright broken in earlier versions of MacOS 26 — you literally could not resize the columns. So now it’s not broken. But as Johnson says, it looks silly and amateurish.</p>\n\n<p>This is the sort of detail that Apple used to strive to get pixel-perfect, all the time, for all settings. “<em>Whatever, good enough</em>” instead of “<em><a href=\"https://www.folklore.org/How_to_Hire_Insanely_Great_Employees.html\">insanely great</a></em>”.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/12/more-macos-263-finder-column-view-silliness\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0962cca2c4aa1c3e6092938c1bba2995d6f75c1f6d2698d219f1ab35ecd53f5d","category":"Tech"}