{"title":"Surround sound","link":"https://blog.whs.in.th/node/3710","date":1720958318000,"content":"<p>ช่วงต้นปีซื้อจอใหม่ แล้วจอเก่าไม่รู้จะเอาไว้ไหนเลยเอาไว้ในห้องนอน แล้วช่วงนั้นเพิ่งเริ่ม sub Netflix 4k พอดี ซึ่ง Chromecast ตัวเก่าเหมือนมันไม่ค่อยชัด น่าจะ 720p ก็เลยซื้อ Chromecast with Google TV มาใส่แทน ทีนี้ตัวเก่าไม่รู้เอาไว้ไหนก็เลยเอาไปเสียบกับจอในห้องนอน กลายเป็นว่าได้ set ดูหนังเฉยเลย เหลือแต่ลำโพง ก็ไปขุดหาลำโพงมาตัวนึง ซึ่งมันก็พอใช้ได้ แต่มันมีปัญหา ground loop ถ้าจ่ายไฟให้มันกับ Chromecast ด้วย USB Power Supply เดียวกัน</p>\n<p>พอรำคาญมากเข้า ก็เลยซื้อ Soundbar มา แต่ปรากฏว่าได้ปวดหัวกับเสียงอีกเยอะเลย</p>\n<h2>Audio codec</h2>\n<p>ไฟล์เสียงมีหลาย format ตัวที่ทุกคนน่าจะคุ้นเคยก็คือ MP3 ซึ่งก็เป็นมาตรฐานเก่าที่สิทธิบัตรหมดอายุแล้ว และปัจจุบันก็ไม่มีบริการใหญ่ที่ไหนใช้งานเป็นหลักแล้ว แต่คิดว่าเนื่องจากเดี๋ยวนี้ใครๆ ก็ใช้สตรีมมิ่งเลยทำให้เราไม่ค่อยเห็นไฟล์เสียงกันโดยตรงแล้ว</p>\n<p>ฟอร์แมตเสียงตัวแรกที่จะพูดถึงก็คือ AC3 หรือชื่อการค้ามันคือ Dolby Digital ซึ่งรองรับเสียงถึง 5.1 channels จริงๆ ก็เป็นมาตรฐานที่เก่าแล้ว แต่เท่าที่ทดสอบมาเหมือน YouTube ยังมีไฟล์ AC3 อยู่ถ้ากดเปิดเสียง 5.1 (ในคอม YouTube มีแต่เสียง stereo ต้องใช้ในแอพ YouTube เท่านั้น)</p>\n<p>หลังจาก AC3 แล้ว Dolby ก็ขยับมาเป็นรุ่นถัดมาคือ Dolby Digital Plus (DD+) หรือ Enhance AC3 (E-AC-3) ซึ่งมันอาจจะมีแชนแนล AC3 เดิมสำหรับ backwards compatibility และแชนแนลเพิ่มเติมสูงสุด 15.1 channels บวกกับ metadata ใดๆ</p>\n<p>และแบบสุดท้ายของฝั่ง Dolby คือ Dolby TrueHD ซึ่งก็จะคล้ายๆ กับ Dolby Digital Plus แต่ว่าจะเป็นเสียง Lossless</p>\n<p>Dolby ยังมี AC4 อีกด้วยซึ่งยังไม่เป็นที่นิยมในขณะนี้</p>\n<p>อีกฝั่งหนึ่งคู่แข่งของ Dolby คือ DTS ซึ่งรู้สึกว่าใน content เก่าๆ จะเป็นที่นิยม แต่ในปัจจุบันหาได้น้อยลง ก็มีเทคโนโลยีแข่งกันเช่นกันคือ DTS ที่ใช้แทน AC3, DTS-HD ใช้แทน E-AC3 และ DTS-HD Master Audio (DTS-HD MA) ใช้แทน Dolby TrueHD ที่เป็น Lossless</p>\n<h2>Channels</h2>\n<p>แล้วอะไรคือ channels? Channels ก็คือลำโพง 1 ตัวซึ่งในการจัดวางลำโพงจะมีกำหนดตำแหน่งและชื่อไว้</p>\n<ul>\n<li>1 channel เรียก mono</li>\n<li>2 channels เรียก stereo คือ มีลำโพงด้านซ้าย ขวา</li>\n<li>5 channels มีลำโพง ซ้าย กลาง ขวา ข้างซ้าย ข้างขวา</li>\n<li>7 channels ซึ่งจะเพิ่มลำโพง หลังซ้าย หลังขวา มาอีกสองตัว</li>\n<li>ปัจจุบันมี 9 channels ซึ่งจะเพิ่มลำโพงซ้าย-ขวา มาอีกชุดหนึ่งที่ทำมุมเฉียงกับผู้ฟัง</li>\n</ul>\n<p>สำหรับส่วน .1 เช่น 7.1 channels คือเพิ่มลำโพง subwoofer หรือเสียงทุ้ม ซึ่งไม่นับเป็น channel หลักเพราะว่าตัวฟอร์ตแมตและตัวลำโพงเองจะเน้นเสียงทุ้ม ไม่สามารถถ่ายทอดเสียงได้ทุกแบบ</p>\n<h2>Object Based Surround</h2>\n<p>ในอดีตเวลาชมภาพยนตร์ที่เป็นเสียงรอบทิศทางนั้นทางผู้สร้างก็จะกำหนดว่าเสียงจะต้องออกลำโพงตัวใด ซึ่งหากผู้ฟังติดตั้งลำโพงไม่ครบก็จะต้องมีกระบวนการ downmix ไม่อย่างนั้นเสียงก็จะไม่ออก เช่นถ้าชมภาพยนตร์ที่ใช้เสียงระบบ 5.1 แต่มีลำโพงแค่ 2.0 อาจจะทำให้เสียงพูดที่ออกช่องเสียงกลางไม่ออก จำเป็นจะต้องตั้งค่าระบบให้มีการ downmix เท่ากับลำโพงที่มีอยู่</p>\n<p>ปัญหาก็คือช่องเสียงจึงมีจำกัด เช่น ติดตั้งช่องเสียง 9 channels แต่ไม่มีภาพยนตร์ที่ทำ 9 channels ก็ไม่มีเสียงออก ในปัจจุบันภาพยนตร์บางเรื่องจะมีการใช้ระบบ Dolby Atmos ซึ่งก็คือ Dolby Digital Plus หรือ Dolby TrueHD ที่แยกช่องเสียงของแต่ละเสียงไว้ แล้วมีข้อมูลกำกับว่าเสียงนี้มาจากพิกัดใด เครื่องเล่นที่รองรับ Dolby Atmos ก็สามารถนำตำแหน่งไปคำนวณต่อได้ว่าเสียงที่มาจากพิกัดนี้ควรจะเล่นที่ลำโพงตัวใดบ้าง เรียกว่า Object Based Surround Sound คือแทนที่จะกำหนดเสียงใส่ลำโพงมาตั้งแต่ต้นแล้วรวบเสียงไว้เลย ก็เปลี่ยนเป็นแยกเสียงแต่ละเสียงออกจากกันแล้วไปรวบใส่ลำโพงหน้างานที่จะมีข้อมูลลำโพงที่ถูกต้องที่สุด</p>\n<p>หนึ่งในนวัตกรรมที่ Atmos เพิ่มเข้ามาคือการกำหนดความสูงของเสียง (height channel) ซึ่งทำให้สามารถติดลำโพงบนเพดานเพิ่มขึ้นไปอีก เช่น 9.1.2 คือมีลำโพงบนพื้น 9 ตัว subwoofer 1 ตัว และลำโพงบนเพดานอีก 2 ตัว ซึ่งใน soundbar บางรุ่นก็จะใช้วิธียิงเสียงจากด้านบน soundbar ขึ้นไปสะท้อนเพดานลงมาแทนการติดตั้งลำโพงจริงเพื่อความสะดวก</p>\n<p>ระบบนี้นอกจากไว้ชมภาพยนตร์แล้วก็ใช้กับเกมได้เช่นเดียวกัน เนื่องจากเสียงในเกมก็มีพิกัด 3D อยู่แล้ว แต่อาจจะต้องเป็นเกมที่ออกแบบมารองรับ Object based โดยตรง เพราะหลายๆ เกมยังมีการแต่งเสียงภายในอยู่ทำให้เสียงจากเกมออกมาเป็นแบบ 7.1 channels</p>\n<h2>HDMI &amp; Dolby</h2>\n<p>ปัญหาที่เจอตอน setup เสียงก็คือพวกเครื่องเล่นต่างๆ ออกแบบมาให้ช่วยเรามากที่สุดให้มีเสียงออก ซึ่งก็ไม่ได้การันตีว่าเสียงที่ออกนั้นคือคุณภาพสูงสุดตามต้นฉบับแล้ว เวลาแก้ปัญหาจึงต้องดูเป็นเปลาะๆ ดังนี้</p>\n<ul>\n<li>Content: ในแอพ Netflix จะมีการแสดงเสียงไว้ โดยถ้าไม่ขึ้นสัญลักษณ์คือเสียง Stereo, สัญลักษณ์ 5.1 หรือ 7.1 ถ้ารองรับ Dolby Digital และโลโก้ Dolby Atmos หากรองรับ (ขึ้นอยู่กับหนังที่ดูด้วย)\n<ul>\n<li>Netflix มีหนังสั้นทดสอบชื่อ <a href=\"https://www.netflix.com/title/80141336\">Meridian</a> ที่รองรับ 4K HDR และเสียง Dolby Atmos</li>\n<li>แน่นอนว่าเสียง lossless แบบ Dolby TrueHD ไม่มีใน Netflix ต้องซื้อ Blu-ray มาเล่นเท่านั้น</li>\n</ul>\n</li>\n<li>Chromecast: ใน Chromecast with Google TV จะมีตัวเลือกเสียงรอบทิศทางใน Settings สามารถเช็คได้ว่าระบบเสียงเรารองรับรูปแบบไหนบ้าง และกดบังคับให้เสียงออกเป็นรูปแบบที่ต้องการได้ (แต่ถ้าระบบที่เหลือไม่รองรับจะไม่มีเสียงออกลำโพง) อีกจุดหนึ่งที่เช็คได้คือ</li>\n<li>TV: เนื่องจากเสียบ Chromecast เข้า TV ดังนั้นทีวีต้องรองรับการถอดรหัส Dolby Digital Plus ด้วย เท่าที่หาข้อมูลทีวีไม่จำเป็นต้องรองรับ Dolby Atmos โดยตรงเพราะ Atmos เป็นเพียงข้อมูลเสริมใน DD+ และช่องเสียบเสียงต้องมีข้อความ eARC (ARC เฉยๆ รองรับสูงสุดที่ Dolby Digital)\n<ul>\n<li>ไม่สามารถใช้ S/PDIF (Coxial หรือ Optical/TOSLINK) ส่งสัญญาณ Dolby Digital Plus ได้เนื่องจากความเร็วไม่พอ</li>\n</ul>\n</li>\n<li>สาย HDMI: เท่าที่หาข้อมูลมา สาย HDMI ที่ใช้ต้องเป็นมาตรฐาน HDMI 2.1 หรือรองรับ HDMI with Ethernet จึงจะใช้ eARC ได้ (สายเป็นดิจิทัลไม่ต้องซื้อแบบหุ้มทองก็ได้)</li>\n<li>Soundbar: Soundbar ที่ใช้ต้องรองรับการถอดรหัส Dolby Atmos</li>\n</ul>\n<p>หากไม่รองรับ วิธีแก้ไขคือซื้อกล่องแยกเสียง HDMI ออกมา ซึ่งเท่าที่หาดูในไทยยังไม่มีขายแบบสมบูรณ์ที่สุดซึ่งจะต้องรองรับดังนี้</p>\n<ul>\n<li>HDMI eARC: สามารถส่งเสียงไปยัง soundbar ด้วย eARC ได้</li>\n<li>HDMI CEC: สามารถกดรีโมททีวีเพื่อเพิ่มลดเสียง soundbar ได้</li>\n<li>HDCP 2.2: การเข้ารหัสข้อมูลเพื่อป้องกันการละเมิดลิขสิทธิ์ (เท่าที่ทราบ กล่องแยกสัญญาณบางตัวไม่ได้เขียนว่ารองรับ HDCP โดยตรงแล้วแอบถอดรหัสข้อมูลให้เลย ทำให้สามารถใช้กับจอภาพอะไรก็ได้)</li>\n<li>รองรับสัญญาณภาพ 8K</li>\n</ul>\n<p>เท่าที่เห็นมีขายในไทยตอนนี้น่าจะใช้งานได้ถึง 4K และไม่รองรับ HDMI CEC แต่ก็สามารถสั่งแบบที่รองรับทุกอย่างจาก Aliexpress มาได้</p>\n<h2>Headphone</h2>\n<p>การเล่นเสียงรอบทิศทางยังมีอีกรูปแบบหนึ่งคือใช้หูฟังเล่น เนื่องจากมนุษย์มีรูหู 2 ข้าง ดังนั้นก็อาจจะไม่จำเป็นที่จะต้องมีลำโพงหลายตัวก็ทำเสียงรอบทิศทางได้</p>\n<h3>Binaural audio</h3>\n<p>วิธีแรกที่ใช้ทำเสียงรอบทิศทางก็คือการบันทึกเสียงแบบ Binaural โดยปั้นหุ่นที่จำลองลักษณะหูมนุษย์ไว้ แล้วติดตั้งไมโครโฟนไว้ที่ภายในหูทั้งสองข้าง วิธีนี้ทำให้บันทึกเสียงแค่ stereo ก็รู้สึกเหมือนอยู่ในสถานที่จริง</p>\n<div></div>\n<p>เท่าที่ทราบเกมที่ใช้เทคนิคนี้ก็มี Corpse Party และ SOMA</p>\n<h3>Head-Related Transfer Function</h3>\n<p>ที่ Binaural audio เวิร์คก็เพราะว่าในการเดินทางของเสียงผ่านวัสดุต่างๆ รวมถึงใบหูและรูหู ก็ทำให้เสียงมีลักษณะแตกต่างไป และเวลาที่ใช้ในการเดินทางระหว่างหูซ้ายกับขวาจากต้นเสียงที่แตกต่างกันก็ทำให้เรารับรู้ทิศทางของเสียงด้วย ดังนั้นถ้าหากเราสามารถจำลองทั้งหมดนี้ในซอฟต์แวร์ได้เราก็ไม่จำเป็นต้องใช้ไมโครโฟนสองตัว</p>\n<p>วิธีนี้ยังมีข้อดีอีกด้วยคือตำแหน่งของผู้ฟังก็สามารถปรับเปลี่ยนได้ตามต้องการ ซึ่งทำให้เกมสมจริงมากขึ้นโดยเฉพาะเกมมุมมองบุคคลที่หนึ่ง ปัจจุบันหลายๆ เกมก็รองรับระบบเสียงรอบทิศทางภายในตัวแล้ว เช่น Overwatch, Counter-Strike 2 หรือเราสามารถ mod บางเกมได้เองโดยใช้ <a href=\"https://www.pcgamingwiki.com/wiki/Glossary:Surround_sound#OpenAL\">OpenAL Soft</a> ในเกมที่ใช้ OpenAL อยู่แล้ว</p>\n<p>ใน Windows 10 เป็นต้นไปตัว OS ก็จะรองรับ Virtual surround คือตัว OS ทำเสมือนว่ารองรับเสียง 7.1 แล้ววิ่งผ่านโปรแกรมที่แปลงเสียง 7.1 ให้เป็นเสียง 2.0 ซึ่งเนื่องจากเป็น API ที่ไม่เปิดเผย ปัจจุบันเลยมีตัวเลือกให้แค่สามโปรแกรมคือ Windows Sonic ซึ่งฟรีและไม่ค่อยดี, Dolby Atmos for Headphones และ DTS Headphone:X ซึ่งต้องซื้อเพิ่ม ผมคิดว่าใช้ Dolby Atmos for Headphone มาก็คุ้มค่าและทำให้หลายๆ เกมที่รองรับ 7.1 เสียงสมจริงมากขึ้น แต่เกมที่ผมเล่นมักจะไม่รองรับเพราะส่วนมากไม่ใช่มุมมองบุคคลที่หนึ่ง หรืออีกทางเลือกหนึ่งคือใช้โปรแกรม HeSuVi ซึ่งเราจะต้องจำลองลำโพง 7.1 ขึ้นมาเองเพื่อป้อนเสียงเข้าไป แล้ว HeSuVi ค่อยแปลงเสียง 7.1 คืนออกลำโพงจริง ค่อนข้างลำบากในการตั้งค่าแต่ก็ใช้งานได้ฟรี และอาจจะดีกว่า Dolby Atmos for Headphone ด้วย (ยกเว้นในเนื้อหาที่รองรับ object-based surround แท้)</p>\n<p>ในส่วนของบนมือถือตอนนี้ก็มีนวัตกรรมที่ใช้หูฟังไร้สายที่มี accelerometer เพื่อบอกตำแหน่งของหูฟัง ร่วมกับ Dolby Atmos เพื่อทำให้เสมือนเรานั่งอยู่ในสถานที่จริง หมุนหัวแล้วเสียงย้ายที่ตาม แต่ต้องใช้อุปกรณ์ที่รองรับซึ่งค่อนข้างจำกัด เช่น iPhone คู่กับหูฟัง AirPod และแอพที่รองรับ Spatial audio</p>","author":"whs","siteTitle":"Quietly Verbose","siteHash":"5f972a6fe70a917eb1b1aa165b3cb2be8a9465af33ab38bf05f34c55c0e40587","entryHash":"09df99cb68e43442e016f6d27012e4e41cabfcf82904609e798d1107a4616adf","category":"Thai"}