{"title":"★ Apple Releases iOS 26 Adoption Rates, and They’re Pretty Much in Line With the Last Few Years","link":"https://daringfireball.net/2026/02/apple_releases_ios_26_adoption_rates","date":1771354195000,"content":"\n<p><a href=\"https://daringfireball.net/linked/2026/02/17/how-to-force-restart-an-iphone\">Speaking of</a> iOS 26, here’s <a href=\"https://www.macrumors.com/2026/02/13/apple-shares-ios-26-adoption-stats/\">Joe Rossignol reporting for MacRumors</a>:</p>\n\n<blockquote>\n  <p>Apple has shared updated <a href=\"https://developer.apple.com/support/app-store/\">iOS 26 and iPadOS 26 adoption\nfigures</a>, revealing how many iPhones and iPads are running\nthose software versions. These adoption numbers are based on\niPhones and iPads that transacted on the App Store on February 12,\n2026, according to Apple. The statistics are as follows:</p>\n\n<ul>\n<li>74% of all iPhones introduced in the last four years are running\niOS 26.</li>\n<li>66% of all iPhones are running iOS 26.</li>\n<li>66% of all iPads introduced in the last four years are running\niPadOS 26.</li>\n<li>57% of all iPads are running iPadOS 26.</li>\n</ul>\n\n<p>Here is how that compares to the <a href=\"https://www.macrumors.com/2025/01/24/ios-18-adoption-rate/\">iOS 18 adoption figures</a> that\nApple shared based on iPhones and iPads that transacted on the App\nStore on January 21, 2025:</p>\n\n<ul>\n<li>76% of all iPhones introduced in the last four years were\nrunning iOS 18.</li>\n<li>68% of all iPhones were running iOS 18.</li>\n<li>63% of all iPads introduced in the last four years were running\niPadOS 18.</li>\n<li>53% of all iPads were running iPadOS 18.</li>\n</ul>\n</blockquote>\n\n<p>Via the Internet Archive (<a href=\"https://archive.org/donate\">seriously</a>, what would we do without them?), <a href=\"https://web.archive.org/web/20240206013405/https://developer.apple.com/support/app-store/\">here are the numbers Apple released for iOS 17 two years ago</a>, with data collected on 4 February 2024:<sup><a href=\"#fn1-2026-02-17\">1</a></sup></p>\n\n<ul>\n<li>76% of all iPhones introduced in the last four years were\nrunning iOS 17.</li>\n<li>66% of all iPhones were running iOS 17.</li>\n<li>61% of all iPads introduced in the last four years were running\niPadOS 17.</li>\n<li>53% of all iPads were running iPadOS 17.</li>\n</ul>\n\n<p>These are the numbers I was waiting for <a href=\"https://daringfireball.net/linked/2026/01/29/apples-own-ios-adoption-numbers\">when I followed up three weeks ago</a> about the silly stories, <a href=\"https://daringfireball.net/2026/01/ios_26_adoption_rate_is_not_bizarrely_low\">based on obviously bogus data from StatCounter</a>, that iOS 26’s adoption rate was absurdly low. <a href=\"https://daringfireball.net/2026/01/ios_26_adoption_rate_is_not_bizarrely_low\">I wrote then</a>:</p>\n\n<blockquote>\n  <p>What’s going on, quite obviously, is that Apple itself is\nslow-rolling the automatic updates to iOS 26. For years now\nApple has steered users, via default suggestions during device\nsetup, to adopt settings to allow OS updates to happen\nautomatically, including updates to major new versions. Apple\ntends not to push these automatic updates to major new versions\nof iOS until two months after the .0 release in September. This\nyear that second wave was delayed by about two weeks, and\nthere’s now a third wave starting midway through January. It’s a\ndifferent pattern from previous years — but it’s a pattern\nApple controls. A large majority of users of all Apple devices\nget major OS updates when, and only when, their devices\nautomatically update. Apple has been slower to push those\nupdates to iOS 26 than they have been for previous iOS updates\nin recent years. With good reason! iOS 26 is a more significant — and buggier — update than iOS 18 and 17 were.</p>\n</blockquote>\n\n<p>At least according to Apple’s own numbers from the App Store, iOS 26 adoption is pretty much exactly in line with the rates for iOS 18 and 17. There’s no conclusion that should be drawn from this about the general opinion of the Liquid Glass UI design or iOS 26 overall. People may love it, hate it, be ambivalent about it, or not even notice — but most of them let their iPhones (and iPads) update via automatic upgrades pushed by Apple. Their opinions about iOS 26 form <em>after</em> they install it.</p>\n\n<div>\n<hr />\n<ol>\n<li>\n<p>Looking at these last three years, the only real trend has nothing to do with the iPhone. It’s that the adoption rate for iPads — in both categories, recent models and all models — is trending upward. <a href=\"#fnr1-2026-02-17\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"0c128d17a41a50d8f77a28dcbebf18a9d4ae248e375be89fd8d5fe25218e2210","category":"Tech"}