{"title":"Simon Mottram: why Manchester to London is the hardest but the most meaningful ride you can do","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/simon-mottram-ambitious-about-autism-manchester-to-london","date":1769785085000,"content":"\n      <p><em>This article was produced in collaboration with <a href=\"https://ambitious220.ambitiousaboutautism.org.uk/\" target=\"_blank\">Ambitious about Autism Manchester to London 2026</a></em></p>\n<p><span>Some challenges last for a single day. Others last a lifetime. The Ambitious about Autism Manchester to London ride brings the two together. On paper, it's brutally simple: 350 kilometres, 220 miles, ridden in a single day from the centre of Manchester to London. In real life, it’s much more profound: this is a unique test of physical and mental endurance, resilience and shared purpose, undertaken in support of autistic young people and their families who face challenges not just on one day, but every day for the rest of their lives.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54609505062_fc8d558994_b.jpg?v=1769513975\" alt=\"Simon Mottram\" /></div>\n<p><span>Rapha founder Simon Mottram has a deep personal connection with the Manchester to London ride. He </span><span>conceived the ride in 2014 with the goal of raising money for <a href=\"https://www.ambitiousaboutautism.org.uk/\" target=\"_blank\">Ambitious about Autism</a>, a charity he knows intimately. His son, Oscar, has profound autism and has been helped by the charity’s specialist education and support services for over 20 years. </span><span>“I wanted to raise money for them,” he says. “Cycling is a great vehicle for that and it’s something I’m involved in, so I thought, could I use my contacts to set up something, with the help of Rapha?”</span></p>\n<p><span>From the beginning, he knew the ride had to be hard. “We wanted to make it very challenging, nothing like having autistic spectrum disorder – we’re not trying to replicate that – but it couldn’t just be a simple ride to the coast or something where we just ride around the park. It had to give us an element of challenge so that it would just give us a glimpse of what it’s like to be autistic or to have a autistic family member and how you cope with life. The challenges in your way.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54610591693_5b5a03c898_b.jpg?v=1769514022\" alt=\"Manchester to London start\" /></div>\n<p><span>Since that first edition, when around 100 riders took part, it has gathered huge momentum. Former professionals, including Bradley Wiggins, have ridden, and it’s now one of the best known and respected charity cycling events in the UK. </span><span>Mottram himself has ridden every year except one (due to a bad back, he explains ruefully). “This year – June 28th, 2026 – will be the 11th time I’ve ridden it and we’ve raised £3.5 million for Ambitious so far.”</span></p>\n<p><span>Although on the surface it's might seem all about endurance and determination, Mottram says it’s a beautiful ride: “Probably the most rewarding ride you can do in that we’re all there riding for the same cause, but for people who haven’t ridden in the middle of England, you’ll be surprised at how beautiful it is”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54609505462_703f1d9d93_b.jpg?v=1769514055\" alt=\"Manchester to London going over the Pennines\" /></div>\n<p><span>Groups of around 15, starting together based on their estimated average speeds, leave Manchester at about 5am, arriving at the foot of the Pennines at dawn and, says Mottram, “It’s just spectacular. You go along the tops and see the mist in the valleys, the sun rising… It’s some of the best riding in the world.” </span><span>From there, the route threads south through the heart of England – Derbyshire, Leicestershire, Northamptonshire, Bedfordshire – before London finally starts to feel within reach. </span><span>Speed, Mottram stresses, is irrelevant: “The fast people do it in 12 hours, I do it in 15 hours, some people do it in 20 or 21 hours – it doesn’t matter because it’s about finishing it.”</span></p>\n<p><span>Exactly how tough does it get, when many riders have gone further than they’ve ever gone on a bike, yet there might still be 100 kilometres to go? </span><span>“It’s such a long time, the battle is mental as much as physical. Your body can always do another 30% when your brain tells you to stop. So it’s a psychological battle.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54609505777_b22aa5a338_b.jpg?v=1769514106\" alt=\"\" /></span></p>\n<p><span>Even for someone who has ridden it 10 times, the doubts begin to creep in every time. </span><span>“There’s a section for me, always the same road, about 150 kilometres to go,\" says Mottram. \"I always have a few wobbles, I always get cramp, I know it’s going to come and then I get through it and carry on.”</span></p>\n<p><span>This is where the ride’s communality becomes so important. </span><span>“Everyone has to ask hard questions of themselves at some point and that’s why riding in a group is so good, because you can cajole and support each other and it makes it much more bearable.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54610686875_c30663cdb2_b.jpg?v=1769515958\" alt=\"Manchester to London rider pushing friend\" /></div>\n<p><span>Additionally, riding for a cause, he says, fundamentally changes it. </span><span>“It does make a huge difference… It’s very different when you get to 200 miles and you’re just riding for ‘fun’ and you could turn round at any point.” Here, turning back is not an option. “Every rider is asked to raise £1,000. You’re doing amazing work for something that’s so important.”</span></p>\n<p><span>There’s an additional and more present incentive to keep going, too: “Something like 15% of the riders are on the autistic spectrum so not everyone there is neurotypical… You’re not going to stop if you’re riding alongside one of the cohort that you’re raising money for.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54610379131_c8af239b53_b.jpg?v=1769514199\" alt=\"\" /></span></p>\n<p><span>For 2026, the event is introducing a new cumulative relay format designed to widen participation: the Snowball Team. “The team will have one rider who starts in Manchester and does the whole thing. And at each feed stop one of their team members joins them so by the finish all five are riding together. It opens it up to good riders who just can’t train enough or can’t quite stomach 220 miles – and this makes it more accessible to them.”</span></p>\n<p><span>Mottram jokes: “There’s normally one nutter who wants to do the whole thing… so if you’ve found your nutter in your company or club, all you need is four more for the Snowball Team and it makes for a very special atmosphere when you’re doing it together.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54610580634_0f8d7a58f2_b.jpg?v=1769514232\" alt=\"Manchester to London Veloforte bars\" /></div>\n<p><span>What sets Manchester-London apart, he explains, is the atmosphere: “Instead of at the Etape du Tour, where you’re fighting French riders for the last segment of orange at every feed stop, you’re cheered into a village hall by volunteers waving banners and shouting, filling your bottles for you, this amazing spread of food, there’s a mechanic to sort out your bike, St John’s Ambulance in case you’ve got any issues… you just get buoyed up by the whole experience because it’s run by the charity for the charity and almost everybody involved has a connection with autism. Lots of us are touched by it – most of us know somebody. So there’s a shared feeling and excitement. You get even more people cheering you through the gates of the Rapha HQ when you finish. People say ‘oh that was so hard’ when they finish and then the very next day they’re saying ‘sign me up for next year’.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54610592818_c6923bc822_b.jpg?v=1769514268\" alt=\"Manchester to London the finish at Rapha HQ\" /></div>\n<p><span>And finally, how easy is it to raise £1,000? </span><span>“There are some tried-and-tested very good ways to get funds, lots of tactics, lots of techniques. We’ve got some incredible fundraisers who have done the ride several times and can give lots of advice. It can be difficult, but you have to be creative and persistent. Some people do cake sales or bike washes or offer mechanic services to their mates. You can raise it if you start early enough. Many people have their employers match their contributions. One of our biggest fundraisers does it by building a big list of all their friends, not asking them for any money until the day before and then starts to hit them with live reports – 'I’m travelling to Manchester, I’m really nervous, can I do this, oh my God here I am at the first climb…' and that’s a brilliant way to get people to put their hands in their pockets. Last year we raised £385,000 with 200 riders. And we run it on a very low cost base so almost all the money goes directly to Ambitious About Autism.”</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/54610592283_c0b3ce0c8f_b.jpg?v=1769514302\" alt=\"Manchester to London sock and tattoo\" /></div>\n<p><span>He concludes: “If you push yourself enough and train enough there’s no reason why you can’t do this. For me this is as far as I can do in a day… and I suspect this will go for even the strongest people too. I can guarantee it’s going to be the best ride of your year. It’s special.”</span></p>\n<p>Manchester to London is open to all riders willing to train, commit and take on an extraordinary challenge that goes well beyond the bike. <span>Standard entry is £140,</span><br /><span>including a bespoke </span><a href=\"https://www.rapha.cc/gb/en\" target=\"_blank\">Rapha</a> jersey and four feed stations on route<span>. </span>With on-bike nutrition from <a href=\"https://veloforte.com/\" target=\"_blank\">Veloforte</a>, a registration pasta party the night before the ride, support in the lead-up including team calls, training rides and information evenings, it's a day designed to get you to the finish – and to raise vital funds for Ambitious about Autism.</p>\n<p><span>To be on the start line in Manchester on June 28, 2026, sign up via <a href=\"https://ambitious220.ambitiousaboutautism.org.uk/home\" target=\"_blank\">Ambitious About Autism’s website </a>– places are expected to sell out quickly, so secure your place today.</span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0fa4d252451aa7544f2f905075687ed62e8739d09b81d640a35d96442736415f","category":"Cycling"}