{"title":"Dear Dakanda","link":"https://iannnnn.com/2025/3377","date":1749116919000,"content":"<p>แน่นอนว่าระเบิดเละเทะ กับเอ็มวีล่าสุดของบอยป๊อด ที่ดักแก่และเค้นน้ำตาชาวเจนวายทั้งประเทศอย่างอลังการ เลยขอก๊อปปี้มาจาก<a href=\"https://x.com/iannnnn/status/1930475311235510631?t=Z9TPt4eLo_hAjQv8YUkArQ&amp;s=19\" target=\"_blank\">ทวิตเตอร์</a> จะได้ไม่หาย</p>\n\n\n\n<p>///</p>\n\n\n\n<p>นี่ฟังสลับกับเพลงเลย เพลงแรกที่ปล่อยออกมาในอัลบั้ม ก็เลยรู้สึกว่ามันมีความคาบเกี่ยวกันพอประมาณ คือมีสองคนที่เคยดีๆ ต่อกันแหละ แล้วก็จากกัน เวลาผ่านไปนานก็มีความรู้สึกคิดถึงกัน …แต่ไม่ใช่เรื่องเดียวกัน<br /><br />เสียงของพี่ป๊อดในเพลงเลย มันเหมือนเรื่องเล่าของคนเหี้ย – อาจจะไม่ถึงกับเหี้ยหรอก แต่มึงไปทำอะไรเขาไว้แน่ๆ ก่อนจะแยกจากกัน แล้วจนบัดนี้ไม่ได้เจอกันนาน มึงก็ยังไม่รู้เลยว่าทำอะไรลงไป<br /><br />ในขณะที่ I’m ok // not ok นี่มันมินิมัลกว่านั้นมาก ถึงจะตัดเรื่องไข่ย้อยและดากานดาออกไป (ลบยากแหละเพราะภาพนี้มันจะประทับไปพร้อมกับเพลงไปตลอดกาลแล้ว) แต่เนื้อเพลงที่พูดออกมาแค่นิดหน่อย เหมือนเริ่มทักทาย แต่ก็รู้เลยว่าแต่ละคนมันผ่านอะไรที่หวานขมมาเยอะขนาดไหนในช่วงที่ไม่ได้เจอกัน</p>\n\n\n\n<p>///</p>\n\n\n\n<p>อีกมุมหนึ่ง เอ็มวีไม่ได้แค่เล่าเรื่องของพระนางในตำนานคู่นี้แต่เพียงสองคนเท่านั้น<br /><br />คนที่คิดถึงกันอย่างจับใจ ไม่ได้มีแค่สองคนนั้น แต่เราด้วย คุณด้วย (ถ้าคุณเกิดทัน) กับเพื่อนสนิท และประสบการณ์ส่วนตัวที่แต่ละคนได้เจอมา<br /><br />คนที่ต่างเติบโตแยกย้ายไปมีชีวิตของตัวเอง ผ่านช่วงเวลาที่ดีและร้ายในวงโคจรของดวงดาวแตกต่างกันไป แต่ในลิ้นชักความทรงจำก็ยังมีก้อนอุ่นๆ ที่เก็บไว้อย่างลึกที่สุดอยู่ คิดถึงบ้างในบางที แต่ชีวิตก็ต้องไปต่อ<br /><br />จนได้ลืมตามาเห็นฟินาเล่ระดับนี้ปรากฏต่อหน้า ไม่ใช่แค่ดากานดาหรือไข่ย้อย มันคือเรากับเอ็มวีเพลงนี้ที่บรรจงปรุงมาระเบิดต่อมน้ำตาด้วย วินาทีนั้น ไอ้ที่ต่างปกปิดกับมานานขนาดไหนก็ตาม ก็ระเบิดพรั่งพรูเอ่อล้นออกมา แบบไม่ต้องห่วงฟอร์มกันอีกแล้ว<br /><br />ดูไปหกรอบ พยายามฟังเพลงก็ยังโดนรัศมีของเพื่อนสนิทกลบ (เรียกว่าดีหรือไม่ดีวะเนี่ย ดีละกัน 555) จนย้ายมาใส่หูฟังใน สปตฟ ที่เขาทำเวอร์ชันแยกเสียงไว้ <br /><br />เรียกว่าสมมง เจอกันในคอนสิ้นเดือนนะ<br /><br />ท่อนที่บิวกิ้นอยากจะถามอะไรออกไปเยอะๆ ระดับที่ละล่ำละลัก // แต่ก็ไม่ถาม<br />ในขณะที่เสียงของป๊อดก็อยากเล่าอะไรให้ฟังเต็มไปหมด // แต่สุดท้ายก็ต้องกลั้นไว้เพราะไม่อยากให้อุตส่าห์ได้เจอกัน เธอฟังแล้วไม่สบายใจ<br /><br />จบท่อนที่ระเบิดออกมาแล้วก็ทิ้งช่วงเปียโนยาวๆ จนเฟดจบเพลงลงไป ไอ้เหี้ย แค่เพลงนะ ไม่ต้องมีเอ็มวี เท่านี้ก็ระเบิดแล้ว<br /><br />พี่บอยบอกว่ากำลังจะมีเอ็มวีเวอร์ชันสอง คิดว่าคราวนี้คงมีนักร้องปรากฏตัวในนั้นด้วย และหาคนทำซับจีนอยู่</p>\n\n\n\n<p><a href=\"https://youtu.be/AXA8jTk1tFc?si=foq5BSOIkwWEmREm\" target=\"_blank\">i’m ok // not ok</a></p>\n\n\n\n<p>// edit  : โพสต์ของคุณปอย พอร์ตเทรต สรุปทุกอย่างอย่างละเอียด ดีจัด <a href=\"https://www.facebook.com/share/p/16aVgrGAEc/\" target=\"_blank\">โพสต์นี้</a></p>\n\n\n\n<p></p>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"0fe0c7fbd8ca53b53bce795f27f7772cbaead7bfbb090899630ee5f37d0b6cea","category":"Thai"}