{"title":"A guide on how to beat Tadej Pogačar","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-guide-on-how-to-beat-tadej-pogacar","date":1770811166000,"content":"\n      <p><em>This article was first published in Rouleur <a href=\"https://www.rouleur.cc/products/issue-140-copy\" target=\"_blank\">Issue 141.</a></em><em> It was written by Andy McGrath, author of <a href=\"https://www.bloomsbury.com/uk/tadej-pogacar-9781399426541/\" target=\"_blank\">Tadej Pogačar: Unstoppable</a></em></p>\n<p>Trying to beat Tadej Pogačar might seem as futile and fanciful to most WorldTour riders as King Canute ordering the tide to recede. Here is a force of nature almost as powerful and predictable as the waves, a supreme talent who seems to be getting better, attacking earlier and winning by bigger margins with every passing season. Time-trials, Monuments, Grand Tours, mountain stages, even the odd bunch sprint – “Pogi” is not picky, he wins them all.</p>\n<p>However, Pogačar himself said in 2025 that he is at his peak. He will not be pro cycling’s unstoppable force forever and has shown a few chinks in his armour over the years. Is everyone else really racing for second place for much longer?</p>\n<p>Here is a light-hearted look at how to topple pro cycling’s Goliath with insight from members of the WorldTour peloton, exploring past lessons, looking at the present and peering speculatively into the future.</p>\n<h4>Pre-empt him</h4>\n<p>Going up the road and staying ahead of Pogačar’s inevitable crushing attack is easy in theory, very hard in practice. We’ve seen it at a couple of editions of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\" target=\"_blank\">Tour of Flanders</a>.</p>\n<p>Take the 2023 race: Mads Pedersen got away as part of a dangerous ten-man move with 100km to go and was the last man standing, but Pogačar blew past him on the last ascent of the Kwaremont like a bullet train roaring by a commuter on a station platform. He has the power and lactate threshold to keep throwing 600-watt bombs on the bergs.</p>\n<p>The front foot-first approach of Mathieu van der Poel and Pogačar has changed the racing dynamic of modern Monuments. “They want to create as much fatigue as possible to play into their hands. They’re freaks, their engines are bigger than most,” 2025 Australian road race champion Luke Durbridge says of the duo.</p>\n<p>“Pogačar gets his team, which are world-class riders, to start ripping with 90km to go. They’re out of the bike race [afterwards], but that’s part of their strategy … It means you’re not dealing with a 60-man peloton, you’re only dealing with a 20-man peloton – that means less risk of crashing on the run-ins [to climbs].”</p>\n<p>The dubious honour of being one of Pogačar’s many jettisoned victims is not lost on Durbridge. The veteran pro can tell his kids that he was there for spectacular feats. “I mean, not for long, but I was there,” he says, laughing. “I think we’re really lucky: it doesn’t always come hand-in-hand that you have a true champion cyclist and he’s also a good guy.”</p>\n<h4>SEND HIM OFF COURSE</h4>\n<p>We saw what happened in the 2025 <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\" target=\"_blank\">Paris-Roubaix</a>: the debutant did not realise the route turned right, braked too late and had a small crash in a ditch.</p>\n<p>‘Wacky Races’ cartoon style, a domestique in the day’s breakaway could stand by a route sign, flick it the wrong way as he passes, then correct it in time for the rest of the bunch.</p>\n<h4>RELY ON A TIME-TRIAL OFF DAY</h4>\n<p>Even though his lowest time-trial result in 2025 was fourth place, Pogačar is not impervious to a so-so performance against the clock by his Stelvio-high standards. At the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/criterium-du-dauphine-all-you-need-to-know\" target=\"_blank\">Critérium du Dauphiné</a> in June 2025, he lost 48 seconds to winner Evenepoel and 20 to Vingegaard over 17.4km – a source of frustration, albeit no obstacle to eventual overall victory.</p>\n<p>At the World Championships in Rwanda, he suffered the ignominy of being caught for two minutes by an effervescent Evenepoel – although it speaks of the Slovenian’s class that fourth place, a couple of seconds off the podium, can be considered a bad day at the office.</p>\n<p>So, go on Christian Prudhomme, listen to the devil on your shoulder telling you to put a couple of 60km flattish time-trials into the 2027 <a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a> route. Advantage Remco, in that case, and possibly a couple of minutes to make up for Pogačar.</p>\n<h4>HOPE TO CAPITALISE ON MISFORTUNE</h4>\n<p>Pogačar is not afraid to take risks in pursuit of glory. Take the 2025 <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\" target=\"_blank\">Strade Bianche</a>, where he crashed at 50km/h into a bramble bush. (The location has already been labelled “Pogačar corner” on Google Maps.) What could have been a season-ending injury simply made his eventual victory even more epic, crossing the line cut and bleeding. While no person would wish ill luck on Pogačar, he is not impervious to sustaining an injury which shortens his season.</p>\n<p>As it stands, Pogačar has not had a career-affecting crash on the scale of rivals Jonas Vingegaard, Remco Evenepoel and Egan Bernal. Breaking wrist bones at the 2023 <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\" target=\"_blank\">Liège-Bastogne-Liège</a> has been his biggest setback.</p>\n<h4>EXPLOIT ACCUMULATED FATIGUE</h4>\n<p>Year in, year out, Pogačar finishes first from February to October, from the UAE Tour to races as diverse as the Tour of Flanders, the Tour de France and Il Lombardia. He is the best and most complete rider who also keeps going the longest, like a Lamborghini with 150,000 miles on the clock. Sooner or later, his punishing schedule will probably catch up with him.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_17.png?v=1770653296\" alt=\"\" /></p>\n<p>We saw that at the 2025 <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\" target=\"_blank\">Amstel Gold Race</a>: who would have bet on Pogačar cracking during what appeared to be a routine solo attack, made 40km from the finish? Caught by two rivals, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mattias-skjelmose?tag=member\" target=\"_blank\">Mattias Skjelmose</a> pipped him in the sprint.</p>\n<p>That may well not have happened if Pogačar had not raced Paris-Roubaix the weekend before, calling it one of the “roughest, toughest races” he had ever done.</p>\n<h4>JOIN A BREAKAWAY OF GC NO-HOPERS</h4>\n<p>In some regards, it is a fool’s errand trying to go toe-to-toe against Pogačar for the GC in any Grand Tour. Nobody has beaten him in a stage race since the 2023 Tour de France.</p>\n<p>No, far better to lose 25 minutes before the mountains and have the freedom of France to get into the escapes. This is the most reliable way to win a difficult stage where Pogačar is content to be watchful. Just ask Simon Yates and Thymen Arensman.</p>\n<p>Of course, you still need to be the strongest from a large escape group and pick an opportune afternoon. “I was going for stages and trying to get in the break every day,” Oscar Onley told me of his debut Tour de France in 2024. “UAE had such a strong team there they could just ride it down.</p>\n<p>“It didn’t really matter who was in the break. There were some days I was looking around at Grand Tour winners and podium finishers and we were getting ridden down by two or three guys – then obviously Pogačar goes and finishes it.”</p>\n<h4>BE A BUNCH SPRINTER</h4>\n<p>Flat stages and their frenetic finishes belong to the likes of Jasper Philipsen, Jonathan Milan and Tim Merlier. Pogačar does not need to try to beat them and take risks.</p>\n<p>He is no slouch though, outsprinting Wout van Aert to win the 2022 GP Montréal and taking victory in a 23 man bunch kick at the 2024 Volta a Catalunya.</p>\n<p>“He’s not too bad,” his friend and former team-mate Matteo Trentin (Tudor Pro Cycling) told me for <em>Unstoppable</em>, my biography of Pogačar. “For sure he’s not a sprinter; that’s the only thing I can beat him in. Even there, it’s not like he wants to sit in and he’s going to lose the race because we finish in a sprint. This is the kind of champion mentality [he has]: you don’t want to have any weak point.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_20.png?v=1770654681\" alt=\"\" /></p>\n<h4>CONVERT HIS LOVE FOR CYCLING INTO ENNUI</h4>\n<p>Turning a gruelling sport of self-sacrifice sunny side up keeps the champ going through all the demands, on and off the bike. As long as he can take coffee breaks with friends and have fun with team-mates, it’s all gravy.</p>\n<p>“That’s what I really admire him for,” says Mikkel Honoré (EF Education-EasyPost). “Because when you win so much, it’s all so easy to get a good contract, you’re all sorted.” Easy to take his foot off the gas too, in other words. “He loves cycling and that’s what makes him so good, he loves to race. You can be as talented as you want but you need to have the passion.”</p>\n<p>We saw a glimpse of the sport’s talisman ready for it all to be over during the 2025 Tour de France’s final throes. Weeks later, he said he was “counting down the days” to retirement. It was an insight into the strain of striving to be the best.</p>\n<p>If his drive or passion is eroded, Pogačar might lose his edge or call it quits. Rivals could play a long mind game, chucking in a comment in the bunch of “not another four-hour race in the rain”, or complaints about how bad the local coffee is.</p>\n<h4>HAVE THE WINNING HAND IN THE MSR POKER MATCH</h4>\n<p>Pogačar does not win every race. Case in point: <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2024-everything-you-need-to-know\" target=\"_blank\">Milan-Sanremo</a>. Five finishes, five near misses, with his most recent results 4th, 3rd and 3rd.</p>\n<p>“Milan-Sanremo is in my opinion the hardest Monument to win,” Mikkel Honoré says. “You have to be strong, very good and have your day, but you have to play your cards right. That’s also why someone like Tadej hasn’t won yet.”</p>\n<p>Puncheurs, grand tour riders and sprinters come to this party. The final coastal hills are tough, but not long, steep or numerous enough to allow him to definitively shed his company. “It’s a really hard race for me to make the difference. The laws of physics are at play here and you cannot do magic,” Pogačar said after the 2025 race.</p>\n<p>However, his Cipressa surge almost came off in 2025 and will likely be repeated. Only Mathieu van der Poel stopped his conjuring trick. On that note…</p>\n<h4>BE VAN DER POEL OR VINGEGAARD</h4>\n<p>A few mere mortals have regularly gotten the better of Pogačar in the biggest races. Think of the 2022 and 2023 Tours de France, or the 2022 Tour of Flanders and 2025 Paris-Roubaix.</p>\n<p>These are rare examples of His Pogness being beaten fair and square. Some fans might be tired of Pogačar’s dominance, but think just how crashingly dull it would be without Vingegaard and Van der Poel introducing jeopardy and genuine rivalry in past seasons, raising one another’s levels in the process.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_18.png?v=1770653348\" alt=\"\" /></p>\n<h4>DIVIDE HIS TEAM AND CONQUER</h4>\n<p>Jumbo-Visma did just that in the 2022 Tour, softening up Pogačar before the Col du Granon finale. They used their whole squad to isolate Pogačar, with Vingegaard and Roglič giving him 1-2 accelerations on the Galibier to soften him up. It was arguably the most electrifying, enterprising day of racing we’ve seen this century. It took all the Dutch squad’s ingenuity, boldness and strength-in-depth, as well as capitalising on Pogačar’s minor shortcomings at altitude and heat, weaknesses which seem to have been rectified. Principal rivals Visma-Lease a Bike or Red Bull will need to use all their resources and brainpower again to outthink Pogačar and his squad.</p>\n<p>Undoubtedly, UAE are stronger in 2026 than they were then. They have João Almeida, Yates and Wellens in the engine room and, most intriguingly of all, Isaac del Toro.</p>\n<p>The Giro d’Italia runner-up broke through last season with 18 wins, the third most in the WorldTour – you can guess who had the most – and threw his sombrero into the ring as a contender.</p>\n<p>He and Pogačar could be a fearsome two-headed beast in 2026 if they combine smartly, but having two of the strongest riders is also a potential recipe for internecine trouble. Six years younger than “Pogi”, the 21-year-old will likely not be happy with feasting predominantly on a diet of non-WorldTour race wins again this season.</p>\n<p>Like Pogačar himself, he wants to win the sport’s best races and test himself against the best. Both are contracted to the team until 2029, at least. Sooner or later, their similar attributes and goals – Grand Tours and Monuments – will clash. It is a predictable quandary, which will require smart management from UAE Team Emirates-XRG if they want to keep two otherworldly talents content. After all, look at what happened with Juan Ayuso, a similarly-gifted youngster who jumped ship to Lidl-Trek.</p>\n<p>For now, it seems to work just fine as the Slovenian sorcerer and his Mexican apprentice, who helped him to win Il Lombardia this year.</p>\n<p>“Just be chill and push, suffer. It’s chill with him, it’s easy,” Del Toro told me when asked what he has learned from Pogačar. “If you do your job, he’s super nice and you realise he races like everyone else.”</p>\n<h4>BE HIS TEAM-MATE</h4>\n<p>If you can’t beat Pogačar, join him. Adam Yates and Tim Wellens have enjoyed some of the best results of their careers in recent seasons since signing for UAE Team Emirates-XRG. Having Pogačar in the lead group as a teammate or foil has worked out for Marc Hirschi at the 2023 Coppa Sabatini and Brandon McNulty at the GP de Montréal last September.</p>\n<p>The catch? As the American did, you’ve essentially got to keep up and be the second-strongest rider in the race to subsequently benefit from His Poginess’s munificence and horsepower.</p>\n<h4>BE HIS TEAM-MATE #2: BEAT HIM AT ROCK, PAPER, SCISSORS</h4>\n<p>Seriously: Rafał Majka and Pogačar did this after breaking away together in a 2022 Tour of Slovenia stage. Paper beats rock, so the Pole got the stage win. The video of this inventive way of deciding glory went viral online too.</p>\n<h4>USE VOODOO</h4>\n<p>If all of the above fails, the mysterious magical tradition is a last resort. There is nothing in the UCI rules against it, after all. Pogačar grimacing at the foot of Alpe d’Huez with a sudden stitch in his side? Maybe it’s that little rainbow jersey voodoo doll stashed in a rival’s team car with a pin in it.</p>\n<p>Undetectable, if ethically frowned upon.</p>\n<p><em>Images: Getty</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"0ffe42aad6ab71d0a2da4b6f676cf7f72155dfcc769af01523e417835145a082","category":"Cycling"}