{"title":"How To Leverage Component Variants In Penpot","link":"https://smashingmagazine.com/2025/11/how-leverage-component-variants-penpot/","date":1762250400000,"content":"<p>This article is a sponsored by <a href=\"https://penpot.app?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=Variants\">Penpot</a></p>\n<p>Since Brad Frost popularized the use of design systems in digital design <a href=\"https://bradfrost.com/blog/post/atomic-web-design/\">way back in 2013</a>, they’ve become an invaluable resource for organizations — and even individuals — that want to craft reusable design patterns that look and feel consistent.</p>\n<p>But Brad didn’t just popularize design systems; he also gave us a <strong>framework</strong> for structuring them, and while we don’t have to follow that framework exactly (most people adapt it to their needs), a particularly important part of most design systems is the <strong>variants</strong>, which are <em>variations</em> of components. Component variants allow for the design of components that are the same as other components, but different, so that they’re understood by users immediately, yet provide clarity for a unique context.</p>\n<p>This makes component variants just as important as the components themselves. They ensure that we aren’t creating too many components that have to be individually managed, even if they’re only mildly different from other components, and since component variants are grouped together, they also ensure organization and visual consistency.</p>\n<p>And now we can use them in <a href=\"https://penpot.app?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=Variants\">Penpot</a>, the web-based, open-source design tool where design is expressed as code. In this article, you’ll learn about variants, their place in <a href=\"https://penpot.app/design/design-systems?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=Variants\">design systems</a>, and how to use them effectively in Penpot.</p>\nStep 1: Get Your Design Tokens In Order\n<p>For the most part, what separates one variant from another is the <a href=\"https://penpot.app/collaboration/design-tokens?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=DesignTokens\">design tokens</a> that it uses. But what is a design token exactly?</p>\n<p>Imagine a brand color, let’s say a color value equal to <code>hsl(270 100 42)</code> in CSS. We save it as a “design token” called <code>color.brand.default</code> so that we can reuse it more easily without having to remember the more cumbersome <code>hsl(270 100 42)</code>.</p>\n<p>From there, we might also create a second design token called <code>background.button.primary.default</code> and set it to <code>color.brand.default</code>, thereby making them equal to the same color, but with different names to establish semantic separation between the two. This referencing the value of one token from another token is often called an “alias”.</p>\n<p>This setup gives us the flexibility to change the value of the color document-wide, change the color used in the component (maybe by switching to a different token alias), or create a variant of the component that uses a different color. Ultimately, the goal is to be able to make changes in many places at once rather than one-by-one, mostly by editing the design token values rather than the design itself, at specific scopes rather than limiting ourselves to all-or-nothing changes. This also enables us to scale our design system without constraints.</p>\n<p>With that in mind, here’s a rough idea of just a few color-related design tokens for a primary button with hover and disabled states:</p>\n<table>\n    <thead>\n        <tr>\n            <th>Token name</th>\n            <th>Token value</th>\n        </tr>\n    </thead>\n    <tbody>\n        <tr>\n            <td><code>color.brand.default</code></td>\n            <td><code>hsl(270 100 42)</code></td>\n        </tr>\n        <tr>\n            <td><code>color.brand.lighter</code></td>\n            <td><code>hsl(270 100 52)</code></td>\n        </tr>\n        <tr>\n            <td><code>color.brand.lightest</code></td>\n            <td><code>hsl(270 100 95)</code></td>\n        </tr>\n    <tr>\n            <td><code>color.brand.muted</code></td>\n            <td><code>hsl(270 5 50)</code></td>\n        </tr>\n    <tr>\n            <td><code>background.button.primary.default</code></td>\n            <td><code>{color.brand.default}</code></td>\n        </tr>\n    <tr>\n            <td><code>background.button.primary.hover</code></td>\n            <td><code>{color.brand.lighter}</code></td>\n        </tr>\n    <tr>\n            <td><code>background.button.primary.disabled</code></td>\n            <td><code>{color.brand.muted}</code></td>\n        </tr>\n    <tr>\n            <td><code>text.button.primary.default</code></td>\n            <td><code>{color.brand.lightest}</code></td>\n        </tr>\n    <tr>\n            <td><code>text.button.primary.hover</code></td>\n            <td><code>{color.brand.lightest}</code></td>\n        </tr>\n     <tr>\n            <td><code>text.button.primary.disabled</code></td>\n            <td><code>{color.brand.lightest}</code></td>\n        </tr>\n    </tbody>\n</table>\n\n<p>To create a color token in Penpot, switch to the “Tokens” tab in the left panel, click on the plus (<code>+</code>) icon next to “Color”, then specify the name, value, and optional description.</p>\n<p>For example:</p>\n<ul>\n<li><strong>Name</strong>: <code>color.brand.default</code>,</li>\n<li><strong>Value</strong>: <code>hsl(270 100 42)</code> (there’s a color picker if you need it).</li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/1-color-token-penpot.png\" /></p>\n<p>It’s pretty much the same process for other types of design tokens.</p>\n<p>Don’t worry, I’m not going to walk you through every design token, but I will show you how to create a design token <em>alias</em>. Simply repeat the steps above, but for the value, notice how I’ve just referenced another color token (make sure to include the curly braces):</p>\n<ul>\n<li><strong>Name</strong>: <code>background.button.primary.default</code>,</li>\n<li><strong>Value</strong>: <code>{color.brand.default}</code></li>\n</ul>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/2-design-token-alias-penpot.png\" /></p>\n<p>Now, if the value of the color changes, so will the background of the buttons. But also, if we want to decouple the color from the buttons, all we need to do is reference a different color token or value. Mikołaj Dobrucki goes into a lot more detail in another <a href=\"https://www.smashingmagazine.com/2025/05/integrating-design-code-native-design-tokens-penpot/\">Smashing article</a>, but it’s worth noting here that Penpot design tokens are platform-agnostic. They follow the standardized <a href=\"https://www.w3.org/community/design-tokens/\">W3C DTCG format</a>, which means that they’re compatible with other tools and easily export to all platforms, including web, iOS, and Android.</p>\n<p>In the next couple of steps, we’ll create a button component and its variants while plugging different design tokens into different variants. You’ll see why doing this is so useful and how using design tokens in variants benefits design systems overall.</p>\nStep 2: Create The Component\n<p>You’ll need to create what’s called a “main” component, which is the one that you’ll update as needed going forward. Other components — the ones that you’ll actually insert into your designs — will be copies (or “instances”) of the main component, which is sort of the point, right? Update once, and the changes reflect everywhere.</p>\n<p>Here’s one I made earlier, minus the colors:</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/3-main-component-penpot.png\" /></p>\n<p>To apply a design token, make sure that you’re on the “Tokens” tab and have the relevant layer selected, then select the design token that you want to apply to it:</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/4-design-token-penpot.png\" /></p>\n<p>It doesn’t matter which variant you create first, but you’ll probably want to go with the default one as a starting point, as I’ve done. Either way, to turn this button into a main component, select the button object via the canvas (or “Layers” tab), right-click on it, then choose the “Create component” option from the context menu (or just press Ctrl / ⌘ + K after selecting it).</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/5-create-component-penpot.png\" /></p>\n<p>Remember to name the component as well. You can do that by double-clicking on the name (also via the canvas or “Layers” tab).</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/6-renaming-component-penpot.png\" /></p>\nStep 3: Create The Component Variants\n<p>To create a variant, select the main component and either hit the Ctrl / ⌘ + K keyboard shortcut, or click on the icon that reveals the “Create variant” tooltip (located in the “Design” tab in the right panel).</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/7-creating-component-variant-penpot.png\" /></p>\n<p>Next, while the variant is still selected, make the necessary design changes via the “Design” tab. Or, if you want to swap design tokens out for other design tokens, you can do that in the same way that you applied them to begin with, via the “Tokens” tab. Rinse and repeat until you have all of your variants on the canvas designed:</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/8-styling-component-variants-penpot.png\" /></p>\n<p>After that, as you might’ve guessed, you’ll want to name your variants. But avoid doing this via the “Layers” panel. Instead, select a variant and replace “Property 1” with a label that describes the differentiating property of each variant. Since my button variants in this example represent different states of the same button, I’ve named this “State”. This applies to all of the variants, so you only need to do this once.</p>\n<p>Next to the property name, you’ll see “Value 1” or something similar. Edit that for each variant, for example, the name of the state. In my case, I’ve named them “Default”, “Hover”, and “Disabled”.</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/9-naming-component-variant-properties-penpot.png\" /></p>\n<p>And yes, you can add more properties to a component. To do this, click on the nearby plus (<code>+</code>) icon. I’ll talk more about component variants at scale in a minute, though.</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/10-managing-component-variant-properties-penpot.png\" /></p>\n<p>To see the component in action, switch to the “Assets” tab (located in the left panel) and drag the component onto the canvas to initialize one instance of it. Again, remember to choose the correct property value from the “Design” tab:</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/11-using-component-variants-penpot.png\" /></p>\n<p>If you already have a <a href=\"https://penpot.app/blog/penpot-for-design-systems-101/?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=DesignTokens\">Penpot design system</a>, combining multiple components into one component with variants is not only easy and error-proof, but you might be good to go already if you’re using a robust property naming system that uses forward slashes (<code>/</code>). Penpot has put together <a href=\"https://community.penpot.app/t/how-to-prepare-your-files-for-the-upcoming-variants-release/9804?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=DesignTokens\">a very straightforward guide</a>, but the diagram below sums it up pretty well:</p>\n<p><img src=\"https://files.smashing.media/articles/how-leverage-component-variants-penpot/12-diagram-sorting.png\" /></p>\nHow Component Variants Work At Scale\n<p>Design tokens, components, and component variants — the triple-threat of design systems — work together, not just to create powerful yet flexible design systems, but sustainable design systems that scale. This is easier to accomplish when thinking ahead, starting with design tokens that separate the “what” from the “what for” using token aliases, despite how verbose that might seem at first.</p>\n<p>For example, I used <code>color.brand.lightest</code> for the text color of every variant, but instead of plugging that color token in directly, I created aliases such as <code>text.button.primary.default</code>. This means that I can change the text color of any variant later without having to dive into the actual variant on the canvas, or force a change to <code>color.brand.lightest</code> that might impact a bunch of other components.</p>\n<p>Because remember, while the component and its variants give us reusability of the button, <strong>the color tokens give us reusability of the colors</strong>, which might be used in dozens, if not hundreds, of other components. A design system is like a living, breathing ecosystem, where some parts of it are connected, some parts of it aren’t connected, and some parts of it are or aren’t connected but might have to be later, and we need to be ready for that.</p>\n<p>The good news is that Penpot makes all of this pretty easy to manage as long as you do a little planning beforehand.</p>\n<p>Consider the following:</p>\n<ul>\n<li>The design tokens that you’ll reuse (e.g., colors, font sizes, and so on),</li>\n<li>Where design token aliases will be reused (e.g., buttons, headings, and so on),</li>\n<li>Organizing the design tokens into <a href=\"https://help.penpot.app/user-guide/design-tokens/?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=Variants#design-tokens-sets\">sets</a>,</li>\n<li>Organizing the sets into <a href=\"https://help.penpot.app/user-guide/design-tokens/?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=Variants#design-tokens-themes\">themes</a>,</li>\n<li>Organizing the themes into <a href=\"https://help.penpot.app/user-guide/design-tokens/?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=Variants#design-tokens-themes-group\">groups</a>,</li>\n<li>The different components that you’ll need, and</li>\n<li>The different variants and variant properties that you’ll need for each component.</li>\n</ul>\n<p>Even the buttons that I designed here today can be scaled far beyond what I’ve already mocked up. Think of all the possible variants that might come up, such as a secondary button color, a tertiary color, a confirmation color, a warning color, a cancelled color, different colors for light and dark mode, not to mention more properties for more states, such as active and focus states. What if we want a whole matrix of variants, like where buttons in a disabled state can be hovered and where all buttons can be focused upon? Or where some buttons have icons instead of text labels, or both?</p>\n<p>Designs can get very complicated, but once you’ve organized them into design tokens, components, and component variants in Penpot, they’ll actually feel quite simple, especially once you’re able to see them on the canvas, and even more so once you’ve made a significant change in just a few seconds without breaking anything.</p>\nConclusion\n<p>This is how we make component variants work at scale. We get the benefits of <strong>reusability</strong> while keeping the <strong>flexibility</strong> to fork any aspect of our design system, big or small, without breaking out of it. And design tools like Penpot make it possible to not only establish a design system, but also express its design tokens and styles as code.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"122690f43d5a1ac3b02a7c3bbc98c4003ea2b118ba6d235e072b4de321d3508c","category":"Tech"}