{"title":"An Attempt of the Sawatch Circle","link":"https://moots.com/blogs/news/an-attempt-of-the-sawatch-circle","date":1731555224000,"content":"\n      <h2><em>The slightest inspiration is all that is needed when there are people who are hungry for an adventure.</em></h2>\n<figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2024/11/Sawatch-Circle-13.jpg\" /></figure>\n<p>Deep winter, near Christmas time, I can remember working on my creative presentation that I intended to give to my wife (Gen) as an idea for a trip that I wanted us to tackle the following summer. Reflecting, a few things come to mind now: 1. I should have given her some maps with the intended route highlighted stuffed into a handlebar bag rather than trying to put together a collage tied to a story…no wonder it led to a lot of explaining while trying to hype up an unknown adventure. 2. It also sets the tone of what gets us excited. A little vague (I had a vision and I was trying to correlate it through a beginner-level Canva experiment), super optimistic on the scale (seemed like we had plenty of time to prepare), and although not too far from home almost all of it was completely unknown.</p>\n<p>This all started a few years back, I recall reading an article on theradavist.com that was titled Circumnavigation of the Sawatch Range by Hailey Moore. I do not know what it was about this particular adventure but I remember thinking “One day we are going to do this!”</p>\n<p>The route felt relatable as it started and ended in Leadville and we know that area well. We have ridden on all sides of the Sawatch range and just love that part of Colorado. We have many stories of camping adventures down there, epic bike rides, and some of our favorite places to grab a bite are scattered through the small towns in the region. It seemed so relatable that</p>\n<p>I got too comfortable with the planning and prep, or better yet the lack of either planning or preparing.</p>\n<p>We originally planned to head out on this trip at the end of July, but as that timeframe came close, there was no way we were going to be able to swing this trip and enjoy it. Lo and behold the next window for us was the start of September. So the first full week of September, Labor Day week, right after a week of big work meetings that followed after the week of the MADE handbuilt show, which came the week after SBT GRVL week in Steamboat…yea Labor Day week seems like the perfect time for this!</p>\n<p>So one thing I did not mention about why we did not go in July is that my bike was still a carcass from last year's White Rim trip and Gen’s bike was only an idea at that point. My go-to choice for these style rides is a bike that is affectionately known as the Rumbler. Unfortunately, the Rumbler had has a fork that needs more attention than a retriever with a frisbee, as well as it has been the victim of some parts pilfering for other bikes…guilty as charged! Gen was considering riding her old mountain bike but was concerned about the gearing being too low along with being able to carry enough water on the bike and not on her back. This left a question mark of what to do while rolling through August and the events.</p>\n<p>Fortunately, the plan easily fell together! We were already planning to showcase a Routt ESC at MADE that was complimented by some of our great friends'/partners' in sort of the bikepacking extension of our gravel lineup. As we got closer to MADE, this looked like it was going to be my best shot of the ideal bike for this mission. For Gen, I had a vision of taking an older Routt YBB frame that was used during the concept phase of the gravel YBB design and turning it into a mini Rumbler. It was ever so slightly large, but I thought I could pull some parts together and get it dialed in for the adventure. Truth be told, the day before we intended to depart I pulled the selection of parts together and assembled Gen’s bike, fitted racks, and gathered the bags and gear. All came together with enough time to head for a late afternoon shake-out ride. With no backup plan in mind, I was fortunate that everything, for the most part, was spot on and seemed as keen as we were to take on the next few days of adventure.</p>\n<h2>Day 1: Leadville to Buena Vista - We’re doing it</h2>\n<p>A few things needed to take place before we departed from Steamboat to kick off the ride in Leadville on Sunday. For starters, we needed to watch the penultimate stage of the Vuelta, at the time it was worth prioritizing. Next, we had to pack more gear than we took the evening before on the shakeout ride. More food, more clothing, more spares, another bag, etc. Who cares, mine as well just take it! One thing that I wanted to pick up on the way down to Leadville was a new water filter or in this case a water purifier. That took a little detour over to REI as I knew they would have stock and likely a few other things we would purchase like camp food and the twice forgotten maps that I did not give at Christmas only to be purchased early in the year and ultimately forgotten again and left at home on the desk!</p>\n<p>After departing our brief shopping experience Gen’s thoughtfulness was on point when she wisely ordered two sandwiches from Cheba Hut so we could eat before arriving in Leadville so we could easily hit the road with food in our stomachs. Pretty easy start to the ride, basically parked the car, loaded the bags, packed all the gear, and were ready to set off.</p>\n<p>It was a casual 2 pm roll out, with the two amigos loaded up ready to ride to Salida that afternoon. After twenty minutes of circling Leadville before finding our way to the mineral belt trailway through town, it then became apparent that we were likely going to be pushing it to make dinner in Salida that night.</p>\n<p>After leaving the path and joining the short road bit to head west out of town, Gen got a quick surprise from her bike, extreme shimmy in the front end. Remember the extra gear we loaded after the shake-out ride, yea it was all towards the rear of the bike meaning it changed the balance and how she had to position herself on the bike. We stopped and adjusted, did not completely fix it but improved the balance and continued. One thing to note, I pulled out my camera for the first photo of the trip and was immediately shocked at what I could see through the viewfinder. I dropped my camera the week before and looking through the viewfinder something was completely wrong. I could not see anything clearly and could not focus on a subject in any way. The first thing I thought was I was not carrying this camera, two lenses, batteries, etc. for the next five days, then I quickly realized the diopter had been cranked to one extreme when packing the bags on the bike and completely taking the viewfinder out of focus. Five miles in and we were both ready for a beer!</p>\n<p>Out of Leadville the main route to Buena Vista and Salida is down Rt. 24, our path was not that. We started off on a section of the Leadville 100 course called Pipeline. It consisted of a steady grade on a zero car traffic gravel/two track road. All was good, we were finding our rhythm and both agreed Salida was out of the picture for the evening. We hit the one singletrack Leadville 100 section and made our way over to a subdivision that overlooks Twin Lakes. I’d say this may have been one of the steepest climbs of the entire ride to get up into the subdivision to gain a viewpoint over the lake. It was worth it, but still not forgotten. From there we started to follow the Colorado Trail around Twin Lakes only to bounce for a moment to avoid some wilderness and carry on down gravel roads until reconnecting back onto the CT. Where we rejoined the CT was just north of Clear Creek, I love this section. Even though you are high in elevation you are tucked nicely into the aspens with great singletrack that climbs up and over a ridge before dropping down into the remarkable Clear Creek valley.</p>\n<p>We had now gotten a taste of what we were in for and could not have been happier. All of the worries and what-ifs were behind us at this point and we were doing it. I wanted to take Gen down to Clear Creek and show her where I filled up years ago on the Colorado Trail and the stunning beauty of that creek and valley. What made it even more special was before we got down to the creek there was a big boulder with a dozen donuts and two twelve packs of cream soda with a note that read “for through hikers and bikers” Gen’s first experience of a trail fairy.</p>\n<p>After pulling away fully topped off with water, a donut, and cream soda we headed south on a familiar detour towards the Arkansas River. This unique little dirt road that follows along the river takes the path of the historic Midland Railroad. That means a mellow grade and rock tunnels that we can only imagine someone had a good time making in the late 1800’s.</p>\n<p>As we rolled into Buena Vista it was perfect timing to grab an evening bite to eat. We stopped in at the Olive Food Truck, a nice little Mediterranean spot run by some good dudes. Last day of the season that they were open and we nailed it! Got the last watermelon salad, some killer falafel, and a nice spread of pita and spicy hummus. While waiting for the food I popped into the liquor store and picked up four single beers. I thought one each for dinner and another when we got to camp as a celebration that we did it, we got through the first day.</p>\n<p>We wrapped up our meal and cruised down to the park to fill our bottles at the fountain and set off into the darkness. As we left BV to the east we immediately crossed over the Arkansas River and got straight onto singletrack. The Midland Trails are a great network of trails right out of town. The trails consist of techy, granite, janky fun…at least on a mountain bike. On loaded drop bar bikes in the dark it is not as thrilling! With that said, we had such a good day that we agreed to find a camp spot and call it for the night. 5 hours of riding, 52 miles, and 3,000 feet climbing. The numbers do not do it justice, but that will become a theme over the next couple days.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-12.jpg?v=1762210233\" alt=\"\" /></figure>\n<h2>Day 2: Buena Vista to Marshall Pass -The reality of the adventure sets in</h2>\n<p>We set off at 9am with intentions of making it to Salida for a late breakfast/early lunch, boy were we wrong! Slow going through the midland trails singletrack on loaded bikes, but super fun. As we left the singletrack behind we popped across 285 on the eastside of BV we were elated with the gravel road that was taking us south towards Aspen Ridge. Climbing up behind Nathrop and Salida was amazing. Really cool Aspen groves with the big peaks of the collegiate range in the background to the west. The section affectionately known as Aspen Ridge was a special highlight. Nice rocky two track that had a steady grade, thick groves of aspen trees that were just starting to break into yellow colors, and silence. There was a distinct opening towards the top were the picturesque setting of Mt. Shavano and Mt. Antero just glimmered. We left the beauty behind and continued to go down with plenty of uphill reminders throughout the descent to remind us we were in the mountains. We tee’d into 175 and dropped down into the familiar roads just outside of Salida that we usually ride up to get to the north backbone and cottonwood trails.</p>\n<p>It is safe to say we missed the late breakfast! It was definitely looking like an afternoon lunch at this point. Fortunately it was Labor Day and it was hard to tell if it was noon or 3pm. There was a spot that we knew we wanted to go to, Sweeties. It is a sandwich and sweets shop right downtown. As we patiently waited through the line (maybe five minutes) we got to the counter and ordered three sandwiches (they had at least seven veggie options), a fudge brownie, a rosemary lemon bar thing, two bags of chips, a soda, a San Pellegrino, and a beer. The lady pleasantly looked back at us, still with our helmets on, and responded “will that be all?” I stepped back to look at the menu one more time thinking we missed something, and Gen was wise enough to answer, “yes.” As we waited for our sandwiches to be complete I popped around the corner to buy a new sleeping pad, unfortunately the one I packed held air about as long as I could hold my breath. So of course I bought an airless Thermarest. Without thinking the next issue through too much, where to put it, I strapped that big foam brick onto the only place we had space for it, the back of Gen’s bike.</p>\n<p>We went over to the park, sat in the shade on the cool grass, met two South African bikepackers who were on the Tour Divide route, and devoured our sandwiches and watched the people enjoying their Labor Day. We were lucky to pull ourselves together and leave that park with full stomachs, but we had riding to do and we knew we wanted to get up higher for the night.</p>\n<p>As we pushed out of town on the bike path towards Poncha Springs, we had to unfortunately ride by very enticing outdoor beer garden at Elevation Brewery. As we navigate our way to Poncha Pass we soon realized this next climb was going to be on the road, with holiday traffic, hot and windy. It was definitely not a highlight of the trip riding up that road in the afternoon, but it was worth the debt paid to get to the dirt of Marshall pass. Marshall pass was one of my highlights of the trip. Little to no traffic, epic views, plenty of changes of directions, and a pleasant grade for the loaded bikes. We climbed and climbed and made it three miles from the summit before finding a sweet spot for the night. It looked like someone once had a small shelter or cabin there decades ago with foraged timbers still remaining in a slightly stacked grid and a few pieces of tin scattered about. Who knows it could’ve been a livestock hold where sheep were stored, but hey we were dreaming.</p>\n<p>We scaled up on the rocks around the camp and chowed down on the last bits of the Sweeties items we still had remaining. Today was a good day 7 hours of riding, 60 miles, 6,500 feet of climbing.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-11.jpg?v=1762210233\" alt=\"\" /></figure>\n<h2>Day 3: Marshall Pass to Taylor Park - Oh, so good</h2>\n<p>As we woke up, we had our routine at this point. I would get started on preparing breakfast and getting the bikes squared away and Gen would pull down the tent and pack up the sleeping gear. We were operating like a well oiled machine and rolled out of camp that morning by 9. It was a fairly easy push to the top of Marshall Pass. It was cold, but for some reason my left palm was extremely cold. I pulled my hand off my bar and held it out in front of me, all normal. When I went to put my hand back on the bar I saw what was going on, there was no bar tap right behind my left shifter, what the hell was going on? I press my face down near the bars and it looked like a little varmint went to town on the tape through the night, maybe it was the sandwich juices, who knows. The little bastard also chewed through a shirt I had draped on the bike and a base layer. Not a big deal, but there was not a surplus of clothing on this trip, every piece was crucial. Onward to the summit!</p>\n<p>We were greeted by some MTB’ers getting dropped off by their shuttle driver at the top, wished them well, they did the same, and we set off in two opposite directions both literally and figuratively. We got a summit photo and then plummeted down the other side for what seemed to be more than an hour of solid descending. It just did not end. Left, left again, right, big sweeping bend with a view down the valley, past a hunting camp, along a river, over a few water bars, just on and on.</p>\n<p>After the endless plummet we ended up pulling into Sargents at the Tomichi trading post. It was a small gas station in a town/neighborhood that had a small restaurant, bar, general store, probably fishing bait, showers, and t-shirts. It worked out that we were able to squeeze in some eggs from the attached cookhouse before they flipped over to the lunch menu, what a treat. Before we left we bought some more snacks, everything from nut mixes to tropical gummy bears. Our next destination was the +/- Ranch. I saw signs coming into Sargents, “+/- Ranch Est. 1899.” I thought it was the plus minus ranch, but come to find out it is the infamously haunted cross bar ranch. However it is referred to, it has the windiest creek I have ever seen and the boys were getting after it cutting and baling hay. It took our minds off what our day ahead was going to be.</p>\n<p>Next stop, Black Sage Pass. Black Sage Pass was a steady grind to the top with an inconspicuous summit. Over the top we dropped down into a large Valley near the likely unknown Waunita Hot Springs. Before getting to the hot springs we turned and headed north towards Waunita pass.</p>\n<p>Waunita Pass was a little more steady than the prior pass and we scooted up to the summit in an hour flat. Aside from the open range livestock we only saw one side by side and they were out here enjoying the surroundings as much as we were. From the summit it got a little more rocky on the northside as we dropped down towards Pitkin. Right before we made it to town it started to rain, the first bit of moisture we had seen on the trip.</p>\n<p>Here is the thing, when it rains in the high mountains of Colorado it goes from a beautiful late summer temp to a forty temperature swing in a matter of minutes. The squall was nothing major but enough for us to pull into an awning covered store and swap into our rain jackets and give it a minute to pass. The irony was we were preparing to get ready to turn into popsicles while the other six people there were getting ice cream. We plotted along over to the general store at the other end of town, refueled and decided that it was 3pm and the weather looked better towards the biggest climb of the day, Cumberland pass…onward and upward.</p>\n<p>Another highlight of the route was Cumberland Pass, not much traffic, amazing views, and a memorable achievement. Gen was pushing the pace on this one, she was feeling good and it showed. I had a hard time keeping her close and it was one of those mountain ascent where you could tell where you were going to crest. If I recall I smashed some of the tropical gummy bears and reeled her back in! The reality is she likely sat up and took some photos and saw I was now close and eased up. All that matters is we shared the sites and stories for the last couple of miles. We got to the summit, took in the 360 views and the expanse around us. There was a guy on a moto who pulled up to the summit a few minutes after us, he was from Mt Rainier, WA. It was good tossing stories back and forth for a few minutes and it truly brought it all together of how fortunate we are to be out and about in beautiful Colorado. As reality quickly came back to us it was chillier over 12,000 feet so we moved on and headed down into Tin Cup.</p>\n<p>This side of the pass was tougher and chunkier, likely from more side by side traffic, but at that time of day the sun was making it all look perfect so it was nice to slow down a bit and take it in. A couple of endless road pictures later and we pushed on past Tin Cup and then Taylor Reservoir where we found a spot to camp near Pie Plant Creek. We had a nice space with water not too far away and enough flat surface to set the tent up in a level position. We cooked two meals tonight, this was a big epic day 8 hours, 80 miles, and 6,700 feet of climbing.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-15.jpg?v=1762210234\" alt=\"\" /></figure>\n<h2>Day 4: Taylor Park to Brush Creek - How quickly the wheels can fall off</h2>\n<p>Last night was by far the coldest night of the trip. Frost and ice on everything in the morning. I looked later at what the temps were at Taylor Reservoir that morning, 24 degrees! We had a decent amount of gear, but this pushed us past the limit.</p>\n<p>As we wrapped up camp, in a very swift manner, we rolled right onto the sandy dirt road of Taylor Creek and quickly realized it was going to be slow. Fortunately it was short lived and we were lucky to have no cars pass us nor dust us. Once we turned off we found a spot to filter water for the day. While I was getting the liquid gold, Gen was making friends with the swallows of the area who were very obsessed with her hair! Somehow she makes friends easily, even if she does not want to. In this case, it was more entertainment for everyone watching these little birds determine whether or not this was new nest material or a bad idea. At this point we were easily entertained.</p>\n<p>After the latest episode of Backcountry Entertainment ended we headed up to Star pass which we knocked out with ease and were heading towards Spring Creek road. In June we got a chance to ride Spring Creek road when we were in Crested Butte for a mountain bike trip so there was an immediate familiarity. As we were enjoying the morning and talking about how low the water level was in Spring Creek compared to June, little did we know the momentum of our journey was getting ready to shift. As we proceeded down Spring Creek road we optimistically rode past a “bridge out” sign. I thought “this will be fine,” we’ll get our feet wet and trudge through the creek. We got down to where the bridge was out and boy was it out! There were two big excavators, skid steers, scrapped concrete and rebar everywhere, a crew of who knows how many hard hatted people and a gap across the creek the size of a small canyon. Rightfully so the crew would not even let us get close enough to scope out the possibilities so we had to turn back and head back up. This was a sixteen mile descent that we just did off of Star Pass, there had to be another option.</p>\n<p>We made it back up the road 4 miles to Deadman’s Gulch trail and from vague memory Deadman’s links over to Cement Creek, this should be a good detour option surely. One important detail, I have never ridden the connector from the Spring Creek side over to Deadman’s. This connector was a slight up that is mainly moto trafficked, just a complete boulder scree field. We could barely ride 100 meters at a time, tough going and no fun on a loaded bike. It only got better, we got to the end of the connector and without thinking I went left assuming it was Deadman’s as that is the only way I thought I had ever ridden it. After 30-40 minutes up this rough/shelfie jenky moto trail I finally look at the map and we are on Rosebud not Deadman’s….ugh, back down.</p>\n<p>Scoot over to Deadman’s proper and immediately it becomes more rideable. We quickly run into the split from Reno/flag/bear loop and now this looks familiar. We start up Deadman’s, it’s cruisy, then got steeper, then the weather gets worse, then steeper, and worse weather. Not having a good time. We both got to the top regrouped and prepared for the descent. For those who know what deadman’s is like, you know how fun it would be on a drop bar loaded touring bike. For those that don’t know, it’s a moto downhill only trail, think huge trough ruts, ledge root droppy bits, and plenty of just aim and hope maneuvers. On a 140mm full sus bike it’s not that bad, the dirt was really good, and you have room to work with. On a 70lb loaded (mine) and 50 lb loaded (Gen’s) in wet slippery conditions, it’s slow going. We got through it in a humorous way and got out to cement creek road and headed to CB south for some lunch and to talk about the rest of the day's plans.</p>\n<p>In my mind all the chaos was behind us. Weather was looking really good into the night and we had two amazing sandwiches with fries and onion rings coming our way. Plus I got a mint chip Oreo ice cream sandwich, yea you cannot make these things up. Things were looking up. What I didn’t realize is that the long day we had yesterday and the unpredictability of the day up to this point had drained my partner. I thought she went back inside to use the bathroom, but realized she was in there talking to the cook of the general store about our plans and the road ahead. Let’s put it this way, he did not fill her with confidence that we would be able to make it up Pearl pass before it got dark. Powered by the local insight we had a little debrief and decided it’s 3:30, let’s ride into Crested Butte, get a coffee and a few other supplies, kill a little time and then head out to Brush Creek and camp for the night, we’ll hit Pearl Pass in the morning.</p>\n<p>We made the right call. As we headed North towards Crested Butte the head wind going into town killed us! You forget how much drag panniers have in the wind until you're stuck on an open road with nowhere to hide. This took more time and energy than expected but we got into town and the weather was amazing. We got some drinks and snacks, enjoyed the warmth and moved along to find camp.</p>\n<p>We made it out to the tent city campground on Brush Creek, just at the foot of Pearl pass. Pulled right in and got a good spot, set up with other mountain bikers scattered all around us. Gen quickly made friends and managed to score a beer to go with our dinner. We still are not sure why we did not grab a can of wine or something when we were in town, but it all worked out. I scampered the hillside down to the creek for a quick cold plunge, came back up and cooked our meals, enjoyed the beer, and got to bed early. Nearly 6 hours, 52 miles, and 4,000 feet of climbing, this was a tough one.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-14.jpg?v=1762210233\" alt=\"\" /></figure>\n<h2>Day 5: Brush Creek to Leadville - The truth of why women live longer than men</h2>\n<p>It rained through the night, almost seemed like fireworks as the lightning was non stop lighting up the nylon of our tent. Gen got up at one point and stepped out and said “you gotta see this.” The storm was sitting up high and lighting up the valley below.</p>\n<p>We woke up to some broken clouds in the sky, everything was wet but no worries. The bigger issue than some wet gear was Gen did not sleep well, or maybe not at all. The miles, being at altitude five straight days/nights, and scale of this journey caught up to us real quick. We ate a nice Ranchero scramble for breakfast and started the morning in pants and long sleeves, that should’ve been the sign. As we started off the ride we immediately had to fjord a knee deep creek. Wet feet are my favorite. As I filtered water and Gen went up the trail around the bend for a nature break. She came back and said she was pulling the plug. “What do you mean?” I said. She talked it through in a truly reasonable manner and I did my best to convince her otherwise but ultimately we were standing at the bottom of a three hour climb-hike a bike with saturated clothes, in pants and long sleeves with an ominous sky overhead. I was bummed to say the least. I knew we could make it, I knew the weather would get better, we just needed an hour to let it happen. We pushed on for a bit but in the end we turned back and headed into CB.</p>\n<p>It all caught up to us and we were fatigued. We briefly discussed our journey coming to an unexpected end and logistically how we wrap it up. Our difficulty was our car was in Leadville and it was not going to be easy to make it back there with two people and two loaded bikes. This is where I set out to prove why women live longer than men. My short sighted plan was that I would ride an “easier” route back to Leadville and get the car and come back and pick her up. So without much thought we did probably the only thing that both of us did not want to do, split up, but we agreed it would be best to try both options. It was early in the day I felt ok and felt I could knock this out. So she agreed to hang tight and recharge in town while I set out to save the day.</p>\n<p>Gen thought it through more and was able to make a few different acquaintances in town and negotiate a ride over to Leadville. Somehow she met a few different Moots owners as well as a guy at the visitor center who had a friend that may be able to give her a lift. She called the so called friend's wife and talked to her, Jim the said driver was out golfing but would eventually call her back and said he could make it happen. Jim drove up from Gunnison in his mint Volvo XC90 and plopped Gen’s messy rig into the back of the car and off they went. Easy peasy.</p>\n<p>Immediately I set off up to Mt Crested Butte on thought I would power through the mountain passes and this would still wrap up nicely. As I got through the small town of Gothic on route to Schoefield pass I realized that I was only swimming towards the deep end. I knew the ride up to Schofield Pass would be a grind but I have done it before to the 401 trail so it felt somewhat familiar. I had heard the backside of the pass was rough, but holy shit! Come to find out the Jeep scene of the world refers to this as the most dangerous Jeep road in the US, I could see why. Bombing down the chunk to the Crystal Mill was just insane, I cannot believe people seek out this road (if you can call it that) to drive up or down. I saw a Jeep coming up, not sure if he made it (New York plates and a frantic wife outside the car not spotting, but yelling at him), then a half a mile later I saw an FJ cruiser that was abandoned on the hill side edge only mere pebbles away from rolling down into the ravine, no owners to be seen. It was legit, there were definitely sections I could not ride through and just had to hoof it. By the time I got to the Crystal Mill my hands were so gripped I needed a break. I rested my bike near a fence and dug through my bar bag for a snack…Oh what do we have here, the Snickers that Gen picked up yesterday at the general store, definitely eating that!</p>\n<p>I chatted with a few moto folks that had pulled into the Crystal Mill and then went to set off, or at least I thought. Flat tire! Rear sidewall slice. It may have happened on day one as I had been adding air throughout the trip, but now it was bad and I had to try and plug it. Two plugs in and some rapid pumping got me going. I pumped up two more times in the next six miles before the town of Marble. I added another plug and aimed at Redstone. I think I made it to Redstone without pumping but it definitely needed some love at that point. I went into the general store and got some fluids, a nice fat freshly baked chocolate chip cookie which was borderline cooked through but was amazing. Forgot to look for anything to put on my stripped clean squeaky chain, oh well. I headed across the street to the park and laid the tire on its side so the tear was at the bottom hoping sealant would fill in and save the day, then pumped up and took off. I almost made it the seventeen miles to Carbondale, but had to pull up short and pump up. Then I almost made it to the Rio Grande bike path and had to pump up. At the first picnic table on the Rio Grande bike path I decided to stop and turn it into my work bench!</p>\n<p>Ok so this was going to be a process, bags off, rack off, rack mount axle off, wheel out, tire off, sealant everywhere, plugs out of the sidewall, the convenient cloth towel out of my spares bottle to wipe the wheel then wipe the tire clean, boot the tire, valve stem out, find where my tube is, tube in, pump up, try and seat the bead, give up on seating the bead, wheel back in, axle in, rack on, bags on, and fortunately no extra ikea bolts! Clean up and start riding. Nice hop in the tire for ten minutes or so until the bead finally seated. Found a friendly watering station, washed my hands and headed to Basalt for some pizza.</p>\n<p>Two slices of average but smoking hot pizza and some 7/11 nutrition while sitting on the bridge over the Frying Pan River thinking about how do I pull myself out of this suicide mission. I got it, chain lube! Three convenience stores later looked for something to put on my chain and nothing that will work. “I’ll just deal with it, I’m not buying an $8 bottle of WD to carry to Leadville.”</p>\n<p>It is now 7pm as I am leaving Basalt heading to Leadville. For the record, I can now say this section ahead is a day ride in itself on an unloaded bike. When we split up, I kept all the gear and I had everything I needed to camp for the night but wanted to push on. I made it three minutes out of Basalt up Frying Pan road and pulled over. I have to have something to put on this chain. I went through my little bag of toiletries and found a tin of dermatone sunscreen that had been cooking in my bag all day…this will do. I smeared a nice petroleum layer of sunblock on and thought let’s see how this does. Push off, still squeaky, but within minutes it was silent and smooth. SIlca better not take my secret! For reference I did bring a bottle of lube on the trip but due to all of the water crossings we had done throughout I burned through the small bottle quicker than expected.</p>\n<p>Ok, here is where it goes off axis. It is 7pm and Frying Pan road is a 32 mile paved climb. Then after the pavement it turns to 14 miles (I did not know this part at the time) more of a dirt climb to Hagerman Pass. Overall we had been averaging around 10 mph throughout the trip. I thought if I got to the dirt in three hours (10pm) I would be in good shape. We have ridden the paved bit a few times and it is not intimidating, it’s a nice steady grade with a few bumps.</p>\n<p>I motored on into dusk and then hit the Ruedi Reservoir incline and it went dark. Lights on, push on. Got to a high point behind the reservoir and stopped for a banana and some honey roasted pistachios (7/11 nutrition). Dropped down towards Deerhamer campground, freezing at this point and knowing now what three hours of climbing was going to be like that I thought was acceptable earlier. Keep pushing on, got some late night cheers from some porch monkeys up in the cabin community of Thomasville, and yell out to them “Going to Leadville.” I could not hear what they said back, but I am now sure it was something along the lines of “the hell you are.” I watch the mile markers slowly tick over. When you are starting the climb, any climb for that matter, and you see mile marker 1, 2, 3 you think “yes I’m making progress” but when you are on a big climb and see mile marker 21 or 27 they are more torture than an indication of progress. At that point you relate to how long it actually has been and you still are going up. After three hours and ten minutes I got to the dirt road transition and stopped. I swapped from shorts to pants, put a jacket on, ate some gummy bears and some gummy candies I picked up in Redstone. I ate nearly a whole pack of these strange gummy candies in one handful and I look at the pack and see they are cherry flavored but they are in the shape of stars. This does not make any sense. I pull one of the remaining candies out of the bag and hold it up in front of my bike light mounted on the fork leg and look at it, look at the packet again (a dodgy cherry cartoon on the front and some BS slogan, and a branding that I have never heard of nor seems reputable). Noooo these are not edibles are they? I just ate the entire packet but three in one go. It’s pitch black I’m trying to find my headlamp now so I can read the ingredients and all the small print, meanwhile I just throw the one I had in my hand in my mouth because what difference is it going to make. Read the ingredients about seventeen times, although there were more things that I could not tell you what they were or what they do, there was nothing stating cannabinoids on that packet. PHEW! Just some hippy homemade gummy treats that I picked up from a lady in Redstone who made a banging partially baked cookie that likely was going to give me salmonella.</p>\n<p>I am freezing cold up here and have almost put everything I have on at this point, meanwhile my adrenaline is still coming down off of the thought that I was going to be doped up and flying high over this next section. There is a quintessential brown forest service sign with three mile marker notations on it. I go over and look at the sign that says something or something meadows 4 miles, Hells Gate 7 miles, and Hagerman Pass…I cannot see what it says there is a tree branch in the way, reposition the branch with another stick…what 14 miles! It’s 10:20pm if I can do 7mph I’ll get to the top at 12:30am, I gotta go!</p>\n<p>Just like Frying Pan Road the dirt is a steady grade, but it has the added pleasure of washboard and a soft sticky surface. The first four miles went by no problem. The next four were not too bad. Hey I’m going to do it, let me stop and switch out my light, eat a king size payday, and look at the stars. Thinking to myself, I don’t mind riding at night, and don’t mind the darkness. There is something calming about it, it’s so quiet and still, your focus is razor sharp, and there are not any intimidating vantage points in sight.</p>\n<p>I get up through Hells Gate, the surface starts to get a little chunkier but not bad. I pass mile marker 10 (yes the dirt section had mile markers and then reset back to zero) and then the road splits. The road continues straight and forks left. By preference of grade and surface I wanted to continue on what looked like the better way, but the sign said to some lake in that direction and to Hagerman Pass and Leadville, go left. Instant hike-a-bike! Just chunk, like massive boulders embed into the earth and steep. Four miles to go and 1600 feet, this is going to suck. Ride a little, get bumped off, walk a little, trip over rocks. 2.5 miles to go, full on death march at its finest. Last .6 miles I rode to the summit with rolling clouds spilling over the top and insomnia setting in. I reached the summit at 1:17am. What a night.</p>\n<p>But wait, that's not the end, the friendly computer device now tells me climb number 14 of 18 completed. What, there are four more climbs? I am over 12,000 feet and Leadville is just over 10,000 feet, how are there four more climbs? With no one to complain to, I bundled up, ate a random gel out of my snack bag(yes I am that tired that a gel seemed like the best idea) and plummet down the boulder field. Down and down until the road starts to get better and better, then towards the lights of town, then pavement, then up. Four little climbs to get into Leadville. Casually pull in at 2:45am where I am greeted by Gen who I only had heard from about ten minutes earlier. See, as I bounced in and out of reception all afternoon evening, none of her messages came through yet. In my delirious state as I am coming into Leadville I am still thinking Gen is back in Crested Butte. Low and behold she was not only resourceful enough to get back to Leadville, but also to score a sweet little tiny house for the night right near our car. To top it off, she also grabbed some beers and a fat bagel sandwich from Butte Bagels in Crested Butte for me. 13.5 hours, 139 miles, and 11,000 feet of climbing that was technically across two days.</p>\n<p>Within minutes of quick banter back and forth of putting our two stories together, the sandwich followed by a beer, that was it. Our trip was over. Day two and three were both her favorite as well as mine with some of the highlights being Aspen Ridge and Cumberland Pass. Believe it or not there are probably many more details to talk about, but onto the bikes.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-10.jpg?v=1762210233\" alt=\"\" /></figure>\n<h2>Nate’s Bike, Gear, and Setup</h2>\n<p>The foundation of the bike is a medium Routt ESC built with a MRP Baxter 60mm travel fork. The wheels were a prototype bikepacking rim from Weareone composites laced to King boost mountain hubs, and were wrapped with WTB NineLine 29x2.25 tires. The groupset consisted of SRAM Force levers and brake calipers and they were paired to SRAM X01 Eagle crank (38T), cassette (10/52), and rear derailleur. The cockpit started with a King headset, Moots Ti stem (70x0), and Redshift gravel handlebars (44cm). Moots Ti post topped with a Moots/WTB ti railed Silverado saddle.</p>\n<p>The gear was mainly hung across two racks, an Old Man Mountain Divide rack on the rear and Elkhorn rack on the front. Two Old Man Mountain panniers were run on the sides of the rear rack with a Juniper rack on the top. Meanwhile two 5l Tailfin panniers did the work upfront, with a Porcelain Rocket Nigel handlebar bag on the front with room to strap the Big Agnes Tigerwall two person tent on top of the rack.</p>\n<p>The general breakdown of gear consisted of two Big Agnes sleeping bags, two sleeping pads, a small pillow, a bag liner (Gen is usually colder at night), puffy jacket, and rain gear in e rear pannier. The other rear pannier would usually be full of food, broken down for morning and night at camp as well as the snacks throughout the day, camera gear (Fujifilm X-T2 with two lenses). The Juniper top bag had toiletries, first aid, batteries, MSR windburner stove and fuel, emergency blanket, multi tool, plug kit, pump, and random small items.</p>\n<p>The front panniers house clothes, started off with tops on one side and bottoms on the other. Then moved to clean and dirty clothes, ultimately to finish with a hodgepodge of dirty clothes with no said organization. On the outside of the one pannier up front I strapped the Garyl water purifier for quick access when we would see a stream and want to take a break. I could pull it off, filter some water and strap in back on quickly. In the handlebar bag I had lights, snacks, trash, wallet, quick access stuff.</p>\n<p>The one piece I like to take on these bigger rides is the</p>\n<p>toolbox</p>\n<p>water bottle spare zone. It is a simple hack of the larger cylindrical part of two water bottles, one stretched open a bit and the other with a little hole poked in the bottom, then pressed together to create a more or less watertight tool/storage container. I strap it as low as possible and only open it up when I really need something. In this case I had two tubes rolled up tight in there, zip ties, tire boot kit, wipeall, derailleur hangers, spare pieces of chain, brake pads, and an assortment of different bolts.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-17.jpg?v=1762210233\" alt=\"\" /></figure>\n<h2>Gen’s Bike, Gear, and Setup</h2>\n<p>The Bruiser is more or less a 54cm Routt YBB. It started off a little different as it was one of the concept frames for bringing the YBB over to the gravel part of Moots lineup. The YBB unit has a slightly different makeup as far as outside aesthetics go, but the internals were part of the evolution to what is now found in each Routt YBB. For reference the YBB in the gravel bikes is different than those of the mountain bikes. The unit consists of a two stage shorter travel platform than the MTB’s. The two stage compression unit is designed to reduce pedal bob and has a beginning of stroke elastomer compression and then mid to end of stroke compression from a coil spring. The opposite cycle takes place on rebound.</p>\n<p>Onto the bike, this was pulled together with a lot of different era’s of parts so it is a harmonious mashup through the selection. The fork is the older version of Fox’s gravel suspension fork, tied to a Paul Boxcar stem (70x15), with Spank vibracore gravel bars (44). The groupset is for the most part a GRX 810 1x11 kit with a 40T in the front and 11/42T in the rear. The one exception is post mount caliper instead of flat mount as this frame and fork were built around that standard at that period. Mavic Crossmax carbon wheels with Schwalbe Thunder Burt tires kept the bike moving along.</p>\n<p>Gen ran a Tailfin Aeropack on the rear with a 10l pannier on each side. The frame bag is a size medium from Outer Shell, and the handlebar bag that was used was a Swift Industries Catalyst pack. We both ran two bottles in the front triangle as our only water storage with the backup to carry another 24oz in the Grayl container if needed.</p>\n<p>The gear was broken down on the Brusier with clothes spread across the two rear panniers, she used stuff sacks to keep the items broken down for type and cleanliness. The aeropack housed rain gear, puffy jacket, layers for on the bikes during the day, toiletries, electronics &amp; battery items, off bike shoes, and ultimately the Thermarest strapped on top! The frame bag had the gear needed throughout the day, snacks, phone, maps, tire plug, trash, sunscreen, chapstick, and surely more. The Catalyst pack on the front did eventually absorb some of the aeropack gear to balance the load a bit more, so the rain gear moved up front, along with some other layers for the day, sodas, sandwiches, snickers, etc. (all of the good stuff) lived in this bag and was rationed accordingly.</p>\n<p>We definitely shared the gear as best as we could across the two bikes and we started off feeling like we had too much, but ultimately used nearly every piece of clothing we brought. The temperature was in the 20’s some mornings and then the high got up to 80 one of the days. We had high alpine rain, multiple water crossings, hike a bike sections, so having enough depth in gear was crucial.</p>\n<p>Looking back we would have changed only a few things. First would’ve been to take one double sleeping pad and skip the sliding around in the tent and having to purchase the foam pad along the way. Next, we probably would not have carried as much breakfast and dinner food and been more strategic about picking up a meal here or there. We ate everything in the end, but we also passed on getting pizza or breakfast sandwiches as well. On the ESC a heavier casing tire or liner, at least in the rear, would have likely helped with the weight of the loaded bike, but all in all the setup felt very solid weighted down. Gen would’ve like to get down to one pair of shoes, so instead of having her stiffer Shimano MTB shoes and pair of off bike hiking shoes, compromise the bike shoes and get a hybrid hiking/biking shoe. Small problem, but we took different approaches here and there were spots where is made a difference.</p>\n<p>We’re planning the next journey, hope to share more stories soon.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Sawatch-Circle-18.jpg?v=1762210233\" alt=\"\" /></figure>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"142cd7147addc690e1010834949153925d8edae784c286ddbe9ccd4f3614a5a7","category":"Cycling"}