{"title":"'The more you sleep, the better you perform' - Lael Wilcox and the secrets to ultra cycling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-more-you-sleep-the-better-you-perform-lael-wilcox-and-the-secrets-to-ultra-cycling","date":1770726119000,"content":"\n      <p><em>This article was first published in Rouleur <a href=\"https://www.rouleur.cc/products/issue-140-copy\" target=\"_blank\">Issue 141</a></em></p>\n<h4>What was your biggest takeaway from your world record ride?</h4>\n<p>Riding around the world was like a party – everyone was so excited to be there with me even for just ten miles. I always feel like cycling is such a niche side project, so when people would come riding with me and then they’d meet all the other locals and start making friends with one another, that was so cool. It’s not about who’s the best or who’s the fastest, but about enjoying being on the bike together. I saw that we’re all in this sport because we love it, and that we’re so passionate about it.</p>\n<h4>Which countries surprised you?</h4>\n<p>Most people came out to see me in the Balkans. In Slovenia especially, there were tons of cyclists, but that’s because they have champion racers. As far as beauty is concerned, I’m drawn to the mountains, and riding in Kyrgyzstan was amazing. New Zealand was also new to me and I loved it there, too.</p>\n<h4>What will be your route for your world record attempt in 2026?</h4>\n<p>I will start in Chicago, and cross America to Halifax, Canada. From there I’m thinking of taking a flight to Porto, and riding to Istanbul. I can’t ride through Russia, so I’m looking at the possibility of flying from Turkey to western Kazakhstan, and then riding through there, a tiny section of China, and then Mongolia. From Beijing or somewhere else around there – depending on budget, as I’d like to ride more in Asia – I’ll fly to Perth, and ride across Australia and New Zealand. I’ll then come back up to Alaska where I’m from and ride south to Chicago to get to the 18,000 mile point.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_31_1024x1024.png?v=1770726021\" alt=\"\" /></div>\n<h4>How will you approach this ride differently from your last trip around the globe?</h4>\n<p>When I established the women’s record, it was kind of thrown together. I asked lots of friends for little pieces of route, I tried to include mountain passes, I wanted to go through all the cities, and make it a fun, global tour. This next one is about efficiency: I have to take time off the route. There’ll be less sightseeing and meeting people, and it’s more about really trying to reel in this athletic achievement. Last time my route involved 640,000ft (195,000m) of climbing. This time I’ll have a flatter route and a stripped-down bike, and my average speed should be higher.</p>\n<h4>Have you spoken with Mark Beaumont?</h4>\n<p>I’ve only ever met Mark virtually during a pandemic Zoom challenge. I just started reading his book which I’m enjoying and I’ll watch his documentary. It’s cool because it’s good to hear his story, but I feel like I’m not quite as military as he is.</p>\n\n<h4>How will you be supported?</h4>\n<p>My wife, Rue Kaladyte, will be there to document the trip, and I’ll have an RV for somewhere to sleep, with someone providing me food, and a mechanic. There’ll be a core group of four people, and then depending on the continent a couple of local drivers. It won’t be a huge group because I guess I’m not that needy – my background is self-supported and I like to stay self-sufficient. The key is about where I can cut time and not stop for food, water and to find a place to sleep.</p>\n<h4>What’s the key to good fuelling?</h4>\n<p>I eat everything – you just try to eat as much as you can. Last time I had real breakfasts and dinners, so I ended up eating lots of rice, pasta, and drinking lots of Coca-Cola. I mostly prefer savoury food, but then people came out and gave me sweets and baked goods.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_32_1024x1024.png?v=1770726050\" alt=\"\" /></div>\n<h4>How much do you aim to sleep each day?</h4>\n<p>Last time I broke it down into 12 hours on the bike, and 12 hours off the bike, sleeping for seven. This time the balance will be 16 hours on the bike and eight hours for everything else, and I’d like at least six hours sleep, pushing to seven if I can. I’ve been ultra racing for ten years and what I’ve found is that the more you sleep, the better you perform. If you get a full sleep then your body has the ability to recover.</p>\n<h4>How do you keep focused mentally?</h4>\n<p>I was doing a podcast and somebody said to me, ‘You better download a load of podcasts because you’re going to be really bored’. I said: ‘How can I be bored? I’m riding through the world, I’m seeing, experiencing and feeling everything’. I can just let my mind go free. I’m never worried about getting bored because it’s what I really love to do.</p>\n<h4>Do you always need a project?</h4>\n<p>Not really, but I’m a person who goes through the seasons. In the winter I’m tired – I go into hibernation. But then the spring comes, the days get longer, and then all of a sudden my energy comes back. So I’ve learned to focus on the summers, and not to keep rolling into the winter because I need that recovery time, especially mentally.</p>\n<h4>If you could only ride one bike, what would it be?</h4>\n<p>I’ve spent most time on a Specialized Epic hardtail with droppers [drop bars] – that’s my classic bike that I’ve ridden the Tour Divide and other races on. But lately I’ve been mostly riding a Specialized Tarmac and I love it. I come from a gravel/ultra background, so road riding feels like a breeze – it’s simple and light because there’s no gear attached like there is on a big bikepacking trip. It feels like the bike is floating.</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"152cba1b30d7f6af87e6a5574663adacc68eaf056cd6b45936b92f21a00f50b2","category":"Cycling"}