{"title":"Vault certificates and secrets inventory reporting: Improve visibility and audit readiness","link":"https://www.hashicorp.com/blog/vault-certificates-secrets-inventory-reporting-visibility-audit-readiness","date":1771002000000,"content":"<p>HashiCorp Vault users need to have continuous answers to questions like:</p>\n\n<ul>\n<li>What secrets and certificates do we have?</li>\n<li>What do we know about them?</li>\n<li>Do any of them require action?</li>\n</ul>\n\n<p>Typically this is done by collecting and analyzing logs, or additional visibility tools in <a href=\"https://www.hashicorp.com/en/products/vault?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_vault-secrets-inventory-blog_PRODUCTPAGE&amp;utm_content=intro-blog-cta&amp;utm_offer=product_page\">HCP Vault Dedicated</a>. Now, HCP Vault users have access to additional visibility and reporting capabilities with <strong><em><a href=\"https://developer.hashicorp.com/hcp/docs/vault/reporting/certificates-inventory-reporting\">certificates</a> and <a href=\"https://developer.hashicorp.com/hcp/docs/vault/reporting/secrets-inventory-reporting\">secrets</a> inventory reporting,</em></strong> a new feature set now available in beta.</p>\n\n<p>These new dashboards visualize access patterns, secret usage, and policy adherence for improved compliance and reporting. Learn more about these features in this post.</p>\n\n<h2>The reporting gap in secrets and certificate management</h2>\n\n<p>Teams need to understand what secrets and certificates exist, where they’re used, who owns them, and whether they comply with policy. When that information is spread across fragmented silos, risk assessment becomes impossible and audits turn into a scramble.</p>\n\n<p>Teams can spend weeks, or months, tracking down certificate details across multiple systems and manually reconciling inconsistent records. In many cases, they end up building custom integrations or stitching together multiple tools just to assemble the evidence auditors need, pulling time and budget away from higher-value security and platform work.</p>\n\n<p>This pressure is especially high in regulated industries such as <a href=\"https://www.hashicorp.com/en/blog/building-resilient-infrastructure-in-regulated-environments-7-lessons-from-ig-group\">finance</a>, <a href=\"https://www.youtube.com/watch?v=voLS6Tz8Pl0\">insurance</a>, and <a href=\"https://www.hashicorp.com/en/resources/automating-fedramp-security-compliance-with-terraform\">government</a>. Regulatory frameworks increasingly require organizations to show demonstrable control over sensitive credentials and the systems that rely on them. Without reliable reporting, proving that control becomes a recurring fire drill.</p>\n\n<p>Centralizing secrets and certificate management on one security platform with standardized workflows and policy is the <a href=\"https://www.hashicorp.com/en/resources/5-best-practices-for-secrets-management\">first step</a> to fixing this gap, but that security platform also needs great reporting features, or you’ll still be scrambling.</p>\n\n<h2>Secrets and certificates inventory reporting features</h2>\n\n<p>Secrets and certificates inventory reporting provides a comprehensive view of all secrets managed by Vault, giving teams the ability to drill into critical details with:</p>\n\n<ul>\n<li><strong>Full inventory visibility</strong>: Understand what secrets exist, where they live, and how they're distributed across your environment</li>\n<li><strong>Lifecycle insights:</strong>\n\n<ul>\n<li>Identify risky, long-lived secrets</li>\n<li>Evaluate when a secret was last accessed or rotated</li>\n<li>Make informed decisions about lifecycle management using data to drive decisions as well as policy</li>\n</ul></li>\n<li><strong>Advanced filtering:</strong> Explore secrets by type, distribution, and access patterns to pinpoint areas that need attention</li>\n<li><strong>Exportable data:</strong> Export reports in CSV and JSON formats to feed into compliance workflows, SIEM tools, or GRC platforms like ServiceNow</li>\n</ul>\n\n<p>These features go beyond simple dashboards, with actionable intelligence that helps security teams end reactive bad practices and become fully proactive at identifying risks and demonstrating compliance (without the manual overhead).</p>\n\n<h2>Inventory reporting availability</h2>\n\n<p>Secrets inventory reporting is available for Azure and AWS clusters for HCP Vault Dedicated customers. Customers can <a href=\"https://developer.hashicorp.com/hcp/docs/vault/reporting\">toggle on reporting</a> for new and existing clusters.</p>\n\n<p>Inventory reports are supported for the following secrets engines:</p>\n\n<ul>\n<li>Key-Value secrets engine v1</li>\n<li>Key-Value secrets engine v2</li>\n<li>Database secrets engine</li>\n<li>PKI secrets engine</li>\n</ul>\n\n<p>Certificates inventory reporting is available for the following certificate types:</p>\n\n<ul>\n<li>SCEP</li>\n<li>ACME</li>\n<li>Vault self-signed certificates</li>\n</ul>\n\n<p>We plan to support additional credentials in the near future.</p>\n\n<h2>How inventory reporting supports CISOs, GRC analysts, and security engineers</h2>\n\n<p>Secrets and certificates inventory reporting is designed for the team members who live at the intersection of security and governance:</p>\n\n<ul>\n<li><strong>The CISO</strong> preparing a board presentation on risk reduction — they need a simple, single pane of glass</li>\n<li><strong>The GRC</strong> analyst who needs to quickly compile evidence for an audit — they don't want to scan hundreds of repositories one-by-one</li>\n<li><strong>The security engineer</strong> trying to clean up years of accumulated credentials — they need to quickly understand which are in use and which can be safely decommissioned (<a href=\"https://www.hashicorp.com/en/products/vault/hcp-vault-radar?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_RISK_vault-secrets-inventory-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">HCP Vault Radar</a> is also a key piece of this workflow)</li>\n</ul>\n\n<p>By surfacing this data directly within the Vault ecosystem, teams no longer need to build custom tooling or rely on incomplete audit logs to answer fundamental questions about their secrets posture.</p>\n\n<h2>A look at the inventory reporting UI</h2>\n\n<p>The HCP Vault Dedicated UI has two inventory reporting tabs:</p>\n\n<ul>\n<li>Secrets Inventory</li>\n<li>Certificates Inventory</li>\n</ul>\n\n<h3>Secrets inventory</h3>\n\n<p>In the secrets inventory tab, you'll see each secret with a name, type, engine, mount path, create date, access date, and modification date. Users can create saved views to quickly show information with relevant filters, sorting, and column selection. The Secrets Inventory tab has three saved views out of the box:</p>\n\n<ul>\n<li><strong>Unused secrets</strong>: Static secrets that have not been accessed in 90+ days</li>\n<li><strong>Upcoming secret rotations</strong>: <a href=\"https://www.hashicorp.com/en/blog/rotated-vs-dynamic-secrets-which-should-you-use\">Auto-rotating</a> secrets that are scheduled to rotate in less than 30 days</li>\n<li><strong>Long-lived secrets</strong>: All secrets that have not been updated in 90+ days</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1770943147-img-1-secrets-and-certificates-inventory-reporting.png\" alt=\"Secrets\" /><p>The user can customize views by selecting and deselecting fields or applying other filters. These customizations can then be saved as saved views. Another useful tool is the search bar, which allows the user to easily look for specific secrets by name. </p>\n<img src=\"https://www.datocms-assets.com/2885/1770943146-img-2-secrets-and-certificates-inventory-reporting.png\" alt=\"Inventory\" /><img src=\"https://www.datocms-assets.com/2885/1770943147-img-3-secrets-and-certificates-inventory-reporting.png\" alt=\"Save\" /><p>To use this data in certain external tools, the user may export the records with a choice of either JSON or CSV file format.</p>\n<img src=\"https://www.datocms-assets.com/2885/1770943146-img-4-secrets-and-certificates-inventory-reporting.png\" alt=\"Export\" /><h3>Certificates inventory</h3>\n\n<p>In the Certificates Inventory tab, you'll see each certificate’s name, status, role, validity, mount path, type, and issuer. You’ll also see two preconfigured quick filters:</p>\n\n<ul>\n<li><strong>Expired certificates:</strong> Certificates that have passed the designated validity period</li>\n<li><strong>Revoked certificates:</strong> Certificates invalidated by the issuing certificate authority (CA).</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1770943146-img-5-secrets-and-certificates-inventory-reporting.png\" alt=\"Certificates\" /><p>In the Clusters tab above the certificates and secrets inventory tabs, a column for reporting will show whether reporting has been “Enabled” or “Disabled”. A cluster can be deployed without immediately enabling reporting, but we recommend enabling reporting upon deployment. Having a gap between cluster deployment and reporting enablement will result in timestamps that only start being recorded upon enablement.</p>\n\n<ul>\n<li>Toggle reporting on for the cluster and apply the changes to enable reporting</li>\n<li>After a complete scan of this cluster, the data in the secrets and certificates inventory tabs will then be populated and timestamped to the enablement time</li>\n<li>Events will be recorded only from that point forward</li>\n<li>Since certificates are not stored in Vault, in the case of Certificates Inventory, only newly issued certificates and newly expired certificates will have event data</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1770943146-img-6-secrets-and-certificates-inventory-reporting.png\" alt=\"Vault\" /><img src=\"https://www.datocms-assets.com/2885/1770943146-img-7-secrets-and-certificates-inventory-reporting.png\" alt=\"Setup\" /><img src=\"https://www.datocms-assets.com/2885/1770943147-img-8-secrets-and-certificates-inventory-reporting.png\" alt=\"Secrets\" /><img src=\"https://www.datocms-assets.com/2885/1770943146-img-9-secrets-and-certificates-inventory-reporting.png\" alt=\"Certs\" /><h2>Getting started</h2>\n\n<p>Certificates and secrets inventory reporting is now available in public beta for <a href=\"https://www.hashicorp.com/en/products/vault?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_vault-secrets-inventory-blog_PRODUCTPAGE&amp;utm_content=end-blog-cta&amp;utm_offer=product_page\">HCP Vault Dedicated</a> Plus tier customers, with future plans to extend support to <a href=\"https://developer.hashicorp.com/vault/install/enterprise\">Vault Enterprise</a> self-managed deployments. Customers can enable reporting from the Active Resources page in HCP or directly on <a href=\"https://developer.hashicorp.com/vault/tutorials/get-started-hcp-vault-dedicated/create-cluster\">HCP Vault Dedicated clusters</a>.</p>\n\n<p>For organizations operating under security and compliance requirements, this improves visibility and makes it easier to gather the evidence auditors ask for.</p>\n","author":"Isabela Palanca Aureus","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"17da4eb612c8d7d79b162144a3fd5ed4fa227bd36654b6b2b0d4c0a8fb920e4a","category":"Tech"}