{"title":"Cobbles, climbs and corners: This is what the Edinburgh Tour stage finishes should be","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/cobbles-climbs-and-corners-this-is-what-the-edinburgh-tour-de-france-stage-finish-should-be","date":1768308325000,"content":"\n      <p><span>The biggest bike race is coming to one of the most beautiful cities in the world. The thought of </span><span><a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\" target=\"_blank\">Tour de France Femmes avec Zwift</a>'s</span><span> carnival-like spectacle of colours and noises ripping through the streets of Edinburgh is enough to delight even the most dour Scot. It is sure to be another stunning moment in a place already steeped in history. </span><b></b></p>\n<p><span>Like all cycling fans in the UK, I am excited by the prospect of not only spectating at the Tours, but also the months of build-up (which have already begun). The anticipation before a sports event is all part of the fun and what makes cycling unique is that the venues are open to all, we can ride on the roads the professionals ride on. As cyclists we come up with our favourite routes for our own rides, but it’s not every year where we can come up with what we would want to see the professionals do.</span><b></b></p>\n<p><span>As a Scot, who lived in Edinburgh, now lives in Cardiff and works in London, three UK nations hosting a stage each is exciting and even before </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-tour-de-france-is-coming-to-the-uk-can-the-world-s-biggest-bike-race-revive-a-dwindling-domestic-racing-scene?srsltid=AfmBOoq_7A3DtjTHsnawL9myfqVZIC2rFCLwOcbep_15xM-7hsECfAiB\"><span>the announcement of the 2027 Tour <em>Grand Départ</em></span></a><span>, I had spent many bike rides and café stops nattering with friends about what a dream Tour stage would look like.</span><b></b></p>\n<p><span>How can the Edinburgh <em>Grand Départ</em> be as memorable as the opening stages in the Basque Country in 2023 in the men's race or the opening stage of the 2025 women's edition in Brittany? Those <em>Grand Départs</em> harnessed the best of what the landscape offered - not to just put a flat sprint stage. The Tour has shown over the past five years that it is ready to rip up its traditional format to make the race more exciting. Let’s hope this continues at the 2027 <em>Grand Départ</em>. It hasn't be announced if the stage will finish in Edinburgh or elsewhere in Scotland, but if the capital is to host the start and finish, it could be a gripping first stage. </span><b></b></p>\n<p><span>Every spring, the cycling world is enthralled by the cobbled Classics like </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument?srsltid=AfmBOor3fSn1eIeB9YXHS-0szfV4nJs0m5gu-m-rrwAWefHAD-yLB01Q\"><span>Tour of Flanders</span></a><span> and </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know?srsltid=AfmBOopOqF2JpBpmY63sbMJfwBg1ALJM31GYIa2aGCljKWwSZS_3zPs2\"><span>Paris Roubaix</span></a><span>, races defined by unique identities of the areas they are staged in. Anyone who has tried cycling in Edinburgh is all too familiar with the following elements: wind, corners, climbs, cobbles. Cycling in Edinburgh is hard. However, what makes a challenging commute has most of the ingredients of a dazzling Tour stage. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AM11346_1024x1024.jpg?v=1768305758\" /></div>\n<p><span></span><em>Edinburgh Castle in yellow for the announcement of the 2027 Grand Départ (Image: Allan McKenzie/SWpix.com)</em><span></span></p>\n<p><span>As merely a fan, not a route designer, I have come up with the final 17km of a stage in Edinburgh, which shows off the city’s sites and would hopefully show off the sport of cycling. I have tried to think in terms of logistics and also what a conventional stage one stage should be — enough intrigue to make an interesting GC battle without it being decided on the first day of the two Tours. </span><b><br /></b></p>\n<h4><span>Rouleur’s proposed finale of the 2027 Tour de France of stage one</span></h4>\n<p><span>Like all of the world’s great cities, you can’t do Edinburgh properly in a quick visit; to get a feel for a place you have to look for the nooks, crannies, and hidden gems.</span><b></b></p>\n<p><span>My proposed finale route is 17km long and would allow the peloton to approach from all sides of the city depending on where the stage start is going to be from. The route takes in several of the famous sites in the city, finishing atop the Royal Mile at the iconic castle.</span><b></b></p>\n<p><span>In 17km it has six cobbled sections, including two ascents of the Royal Mile, totalling 5.5km on cobbles. However, these cobble sections are more like Flanders than Roubaix — the cobblestones are in relatively good condition but they are on climbs and often steep ones. In total there are six climbs (and a few lumps) in the 17km, coming to a total of around 340m elevation gain.</span><b></b></p>\n<p><span>Ideally it could be tackled as a circuit, allowing fans to see the race pass several times and also to give the Classics and punchy riders a chance to use the <em>parcours</em> to their advantage. However, circuits are not often used in the Tour and this proposal is just 17km long starting at the foot of the Royal Mile and climbing up its famous cobbles before ducking down the shoulder on Johnston Terrace. </span><b></b></p>\n<p><span>The route then heads to the Dean Village and Stockbridge areas north of the city centre, tackling some challenging cobbled climbs and then heading back into the city centre, looping around to the east before tackling Arthur’s Seat and its descent before the final brutal climb at the Royal Mile. Whoever gets to the top first will don the famous <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-yellow-jersey-at-the-tour-de-france-a-brief-history\" target=\"_blank\">yellow jersey</a> in the shadow of Edinburgh Castle. </span><b></b></p>\n<p><em>View the proposed route on Strava: <a href=\"https://www.strava.com/routes/3343199453297275404\" target=\"_blank\">Rouleur's Tour final 17km</a></em></p>\n<h3>\n<span>The climbs and cobbles</span><b></b>\n</h3>\n<h4><span>The Royal Mile</span></h4>\n<p><span>The Royal Mile is the vein that runs from the heart of Edinburgh’s Old Town, the castle, to Holyrood Palace, the King’s official residence in the capital. The street is lined by stoned tenements, in between which there are interlocking closes and stairwells, and most importantly cobbles.</span><b></b></p>\n<p><span>The Royal Mile starts at the Scottish Parliament building, a modern structure opened in 2004, near Holyrood Palace, and climbs for around 1.6km to the finish line on Castehill. </span><span>The climb is straight and for the first 600m it is about 5% on tarmac up Canongate, but when it crosses St Mary’s Street, the cobbles begin and the gradient picks up to 8%. It does begin to ease passing St Giles’ Cathedral but only to 5%.</span><b></b></p>\n<p><span>Another 200m of climbing and it reaches Tolbooth Kirk, where on the first time they will descend Johnston Terrace but on the final lap it is another 200m on the cobbles to the line at the Castle, where the stage one winner will be crowned. </span><b></b></p>\n<p><em>Strava segment: <a href=\"https://www.strava.com/segments/1400111\">The Royal Mile</a> </em><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF7261_1024x1024.jpg?v=1768306958\" alt=\"\" /></div>\n<p><em></em><em>The cobbled climb up the Royal Mile leads to Edinburgh Castle and our proposed finish (Image: George Rees)</em></p>\n<h4><span>Comely Bank Avenue</span></h4>\n<p><span>Comely Bank Avenue (300m at 7%) is another straight cobbled climb, where the riders will be able to see the whole way to the top. It will come after a little over 3km after the top of the Royal Mile, giving the peloton little chance for recovery as they pass through the Dean Village area. The foot of the climb is on East Fettes Avenue, an open fast road, which would mean the riders would hit the cobbles at quite some pace but by this point the group would likely be thinned out.</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF7326_1024x1024.jpg?v=1768307240\" alt=\"\" /></div>\n<p><span><em>Comely Bank Avenue is a wide</em></span><em> cobbled climb to the north of the city centre (Image: George Rees)</em></p>\n<h4><span>Gloucester Lane and Queen Street Gardens </span></h4>\n<p><span>Quickly after Comely Bank Avenue, comes the Gloucester Lane — Queen Street Gardens double header. Gloucester Lane is 290m at 8.1% with a section at over 15% and has been aptly named the 'Oude Kwaremont' on Strava after the decisive climb in Flanders. </span></p>\n<p><span>\n<em>Strava segment: <a href=\"https://www.strava.com/segments/12662844\">Gloucester Lane</a> </em></span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF7315_1024x1024.jpg?v=1768307555\" alt=\"\" /></div>\n<p><span><em>Gloucester Lane is a narrow and savage ascent, which could prove decisive in our proposed route</em><em> (Image: George Rees)</em></span></p>\n<p><span>The climb can be extended along Heriot Row, which although is flat is still cobbled, and then a right turn — and still on cobbles — up Queen Street Gardens West (around 200m at just under 10%), making it a total of around 800m on cobbles. </span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF7307_1024x1024.jpg?v=1768307714\" alt=\"\" /></div>\n<p><em>Edinburgh has plenty cobbled streets to choose from (Image: George Rees)</em></p>\n<h4><span>Calton Hill</span></h4>\n<p><span>This one is definitely a hidden gem — at time of writing, it doesn’t even have a Strava segment. After the Gloucester Lane - Queen Street Gardens double header, the route then heads back to the city centre, crossing Princes Street and passing the National Galleries of Scotland up the tarmac lump called The Mound before ducking down Market Street towards Waverly Station and back onto Princes Street. Then instead of continuing on Regent Street, taking a left down Leith Street for only a couple of hundred metres, means the route can take on another cobbled challenge up Calton Hill. Although only 100m long it is about 10% and the sharp bend into it means the riders won’t have much speed going into the bottom.</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSCF7282.jpg?v=1768307843\" alt=\"\" /></span><em>The cobbled climb behind Calton Hill is short but steep (Image: George Rees)</em></p>\n<h4><span>Arthur’s Seat </span></h4>\n<p><span>Seat laps or ‘Slaps’ are a ritual for every cyclist in Edinburgh. The 5km loop around the 640 acre Royal Park in the heart of the city, is closed to cars on Mondays, Fridays and weekends and after 3pm on the other days, making it a safe circuit for cyclists. The 1.4km tarmac climb up to Dunsapie Loch has an average of 5.4% but there is a pinch at over 10%, and the often has a stiff head wind. Coming with only 6km to the finish, it would be the perfect place to launch an attack before the descent and final climb up the Royal Mile.</span><b></b></p>\n<p><em>Strava segment: <a href=\"https://www.strava.com/segments/686793\">Arthur's Seat</a></em><b></b></p>\n<h4><span>What are we missing on our proposed route?</span></h4>\n<p><span>I have spent a lot of time cycling in Edinburgh but doubtless there will be more hidden gems that could be used in the Tour stage. If the race were to come from the south into Edinburgh, the climb in the village of </span><span>Polton</span><span> could be used, although it is narrow and the high speed descent into its base could be dangerous. Likewise, there are options to climb up some of the </span><span>Observatory hill </span><span>in Blackford, which are challenging but may be too narrow and twisting for a Tour stage. </span></p>\n<p><span>There are also areas of the city not included, which would make interesting additions to the stage, such as Costorphine, Craiglockhart and Morningside, but to try and condense the climbs and action together, it is easier to keep the route closer to the city centre. </span></p>\n<p>Alternative finishes to the castle would be up either Ramsey Lane or Cockburn St, both of which are cobbled and are steeper than the Royal Mile but are twisting and due on the fact the Royal Mile is one of the most famous streets in the UK it could make one of the memorable final kilometres in Tour history. </p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"193d2dba77248f43ceb6c3015155e933f55b198d8370a47d5e574b3dd848ade7","category":"Cycling"}