{"title":"My Best Movies in 2024","link":"https://blog.whs.in.th/node/3740","date":1733738926000,"content":"<p>เคยนับอยู่ว่าปีหนึ่งๆ ตั้งเป้าจะดูหนังในโรงประมาณ 2 เรื่องที่น่าสนใจ แต่จริงๆ แล้วเฉลี่ยน่าจะสัก 4 เรื่อง ก็คือไม่ได้เป็นคนดูหนังเยอะ หนังดังๆ นี่จริงๆ ก็แทบไม่เคยดู</p>\n<p>เคยมีครั้งหนึ่ง พี่เก้ง จิระ จาก GDH มาบรรยายที่ Wongnai แล้วเหมือนผมเป็นคนเดียวทั้งทีมที่มาฟัง ที่ไม่เคยดูรถไฟฟ้ามาหานะเธอ (แต่ตอนนั้นผมดู มหาลัยฯ เหมืองแร่ ไปแล้วนะ ที่พี่เก้งอยากเชียร์แต่ขายไม่ออก 555)</p>\n<p>ปีที่ผ่านมาเพิ่งจะมี Netflix ครั้งแรก ปกติไม่ได้อยากดู แต่ว่า Hotstar มันถูก (ปีละพันสองในตอนนั้น) เลยซื้อให้แม่ดู พอใกล้ครบปีมันขึ้นราคาใหม่ให้ใกล้กับบริการอื่นๆ มากขึ้น ก็เลยลองเทียบกันดูว่าจะย้ายไปไหนไหม ก็สรุปว่า Netflix มีหนังที่น่าสนใจมากที่สุด ก็เลยซื้อ Netflix ให้แม่ แต่ก็ไม่ได้มีเวลาดูอะไร</p>\n<p>ปัญหาของ Netflix คือ DRM มันน่ารำคาญมาก Chromecast gen เก่า มันดูได้แค่ 720p ผมดูปุ๊บก็เห็นเลยว่าภาพไม่คม ก็เลยต้องอัพเกรดเป็น Chromecast with Google TV HD (ทีวีเป็น 1080p แต่เดาว่า panel resolution ไม่ถึง) ตัวเก่าก็ถอดทิ้งไว้ และไม่กี่สัปดาห์ต่อมาผมอัพคอมเป็นจอ 2K เพราะจอเก่ามันมีเส้นขึ้นแล้ว เอาจอเก่าไปแจกญาติพี่น้องก็ไม่มีใครเอา ก็เลยยกไปตั้งในห้องนอน แล้วได้ไอเดียว่าก็เอา Chromecast ไปต่อ หาลำโพง 3.5mm สักตัวไปต่อ ก็ดูหนังได้แล้ว เลยเป็นจุดเริ่มต้นว่างั้นน่าจะมาดูหนังสักหน่อย</p>\n<h2>Top 10 Movies of 2024</h2>\n<p>สรุปแล้ว ทั้งปีนี้ดูหนังไปดังต่อไปนี้ เรียงตามความชอบ</p>\n<ol>\n<li><strong>หลานม่า (2024)</strong> 10/10<br />\nเรื่องนี้น้องชวนไปดูในโรง เนื่องจากเป็นแฟนคลับ จริงๆ ก็ไม่ได้สนใจอะไรแต่ปรากฏว่าทำมาได้ดีมากๆ แปลกใจว่าภาพของสังคมไทยแบบนี้ขายต่างประเทศก็ขายดี คงจะมีความคล้ายกันอยู่ บางซีนคิดว่าถ้านอนดูใน Netflix มันจะไม่ได้บรรยากาศเท่าในโรงที่มันบังคับว่าต้องสนใจมันแช่ภาพเลยนะ</li>\n<li><strong>คิดถึงวิทยา (2014)</strong> 10/10<br />\nเรื่องนี้มันคือหนังคนเหงาที่ฟีลมันคล้ายๆ Your Name ว่าชอบคนที่อยู่คนละเวลากันไม่เคยเจอกัน แต่ว่าชอบฉากหลังเรื่องนี้ที่มัน picturesque มากๆ</li>\n<li><strong>Lost in Translation (2003)</strong> 9/10<br />\nเรื่องมันเป็นเหมือนคนเหงา นอนไม่หลับในโตเกียว บรรยากาศมันเลยจะชวนง่วงประมาณนึงแต่คนดูต้องไม่หลับนะ คิดว่าเรื่องนี้ถ้าดูแล้วอินคุณจะอินมากๆ และถ้าดูแล้วไม่อินคุณจะงงว่าเรื่องมันมีอะไร ทำไมดูแล้วชวนง่วง และทำไมมันต้องล้อเลียนสำเนียงคนต่างชาติ</li>\n<li><strong>Seasons Change (2006)</strong> 9/10<br />\nถ้าอ่านบล็อกนี้มาเป็นสิบปีคิดว่าเรื่องนี้มันคือ story of my life เลยแหละ ยกเว้นแต่ว่ายังไม่เคยเจอผู้หญิงแบบอ้อมมั้ง</li>\n<li><strong>พี่มาก..พระโขนง (2013)</strong> 9/10<br />\nเรื่องนี้คิดว่ามันเป็นหนังแมส และหนังผี น่าจะไม่ชอบ แต่เอาเข้าจริงก็เข้าใจเลยว่าทำไมเป็นจุดสูงสุดของหนังไทยในยุคก่อนหลานม่า คือเปิดเรื่องมาเขา set expectation ก่อนเลยว่ามันจะมั่ว อย่าคิดว่ามันเป็นหนังพีเรียดแล้วต้องทำอะไรให้ตรงตามประวัติศาสตร์ ที่เหลือก็รู้สึกว่าจะผสมระหว่างหนังตลก แต่ไม่ทำฟีลตลาดล่าง ฉากโรแมนติกแบบหนังทั่วไป และฉากบังคับว่าคนดูหนังแม่นากน่าจะต้องถามหา</li>\n<li><strong>Schindler’s List (1993)</strong> 9/10<br />\nเรื่องนี้เป็นหนังขาวดำที่ได้ออสการ์ด้วยนะ ความคิดตอนแรกคิดว่าหนังน่าจะทำเป็น thriller ว่าคุณ Schindler จะแอบชาวยิวยังไงแบบเรื่อง Argo แต่ Spielberg ทำเป็นสไตล์สารคดีแทนซึ่งคิดว่าได้ผลเพราะว่าถ้าเป็นหนังทั่วไปไม่ชอบขี้หน้าคนนี้ยิงทิ้งเลยน่าจะเป็น<a href=\"https://www.youtube.com/watch?v=7C-aB09i30E\">หนังตลก</a> แต่พอมันเป็นสารคดีแล้วมันทำให้เห็นความงี่เง่าของสงครามได้โดยไม่มีข้อสงสัยว่าหนังไปใส่สีเติมไข่หรือเปล่า ข้อเสียของเรื่องนี้คิดว่ามันไม่ได้อธิบายบริบททางประวัติศาสตร์ให้มากพอ ถ้าไม่มีพื้นเรื่องคนยิวหรือการเข้าสู่อำนาจของพรรคนาซีแล้วน่าจะยิ่งรู้สึกว่า settings ของเรื่องไม่สมเหตุสมผล</li>\n<li><strong>CODA (2021)</strong> 8/10<br />\nหนังเรื่องคนพิการที่ดีผมแนะนำอยู่สองเรื่องคือเรื่องนี้ กับโจเซ่กับเสือและหมู่ปลา (ไม่อยากให้แนะนำรักไร้เสียง รู้สึกว่า <a href=\"https://store.steampowered.com/app/3068300/Katawa_Shoujo/\">Katawa Shoujo</a> ยังทำดีกว่า) เรื่องนี้เป็นเรื่องของครอบครัวคนหูหนวกแต่มีลูกสาวเป็นคนปกติ แล้วลูกสาวก็มีพรสวรรค์อยากเป็นนักร้อง ซึ่งแน่นอนว่าที่บ้านไม่เข้าใจ</li>\n<li><strong>Everything Everywhere All At Once ซือเจ๊ทะลุมัลติเวิร์ส (2022)</strong> 8/10<br />\nเรื่องนี้พล็อตมันควรจะมั่วๆ ที่เจ๊ร้านซักผ้าไปต่อยกับมนุษย์จากโลกอื่นแบบ Terminator แต่เอาเข้าจริงมันดูรู้เรื่องและคิดว่ามันนำเสนอเรื่อง generation gap ได้ดี</li>\n<li><strong>Suck Seed ห่วยขั้นเทพ (2011)</strong> 8/10<br />\nจะเขียนรีวิวแล้วก็ไม่รู้ว่าเรื่องนี้ติดอันดับเพราะนางเอกหรือว่าเพราะมันดี แต่พอดูหนังที่เป็นเพลงแล้วนอกจาก Seasons Change ที่ได้ 9/10 ไปแล้วก็มี Blue Giant (2023), La La Land (2016) ที่ดูในปีนี้ เลยคิดว่าเรื่องนี้เหมาะสมที่สุด</li>\n<li><strong>ฉลาดเกมโกง (2017)</strong> 8/10<br />\nรู้สึกว่าเรื่องนี้มันไม่ใช่หนังไทยธรรมดา ฟีลมันเหมือนหนังอินเตอร์มากๆ ถึงแม้จะก้าวข้ามความเป็นหนังไทยไปไม่ได้อยู่โดยเฉพาะฉากจบที่เป็นที่ถกเถียงกันมาก แต่ก็ต้องยอมรับว่าคนทำข้อสอบเขาสามารถตัดต่อจนลุ้นเยี่ยวเหนียวได้ยิ่งกว่า Argo (2012) เสียอีก</li>\n</ol>\n<p>Notable mentions</p>\n<ul>\n<li><strong>Das Boot (1981)</strong><br />\nหนังเรือดำน้ำที่ยาวเกือบ 4 ชั่วโมง ไม่รู้นั่งดูไปได้ไงม้วนเดียวจบ แล้วไม่หลับไม่น่าเบื่อด้วย เรื่องมันเล่าถึงเรือดำน้ำเยอรมันที่เหมือนส่งทหารใหม่ไปตาย ความพิเศษของเรื่องนี้คือมันทำให้เราอินได้โดยนักแสดงก็เป็นนักแสดงหน้าใหม่ ตัวเรือดำน้ำทั้งลำเป็นฉากแคบเท่าจริง มีบางจุดต้องมุดรูข้ามไปด้วย แต่หนังไม่เกรงใจผู้กำกับภาพฯ ถึงกับมี 2-3 ฉากที่ถ่ายเทคเดียววิ่งในเรือดำน้ำตั้งแต่ต้นเรือจนถึงท้ายเรือ ตอนแรกคิดว่ามันเป็นหนังสงครามต้องยิงกันจนระเบิด แต่ความเป็นจริงแล้วลูกเรือดำน้ำอยู่แต่ใต้น้ำ แล้วต้องเงียบๆ ไม่ส่งเสียงเพราะจะถูกโซนาร์ข้าศึกจับได้ มันจะอึดอัดเหมือนสู้กับอะไรไม่รู้ที่มีคนเห็นอยู่คนสองคนคนที่เหลือโดนปลุกกันมาออกันเต็มเรือ เป็นภาพสงครามที่รู้สึกว่าทำได้เรียลมากๆ</li>\n<li><strong>The Artist (2011)</strong><br />\nภาพยนตร์เงียบเรื่องที่สองที่ได้รางวัลออสการ์ (เรื่องแรกได้รางวัลในงานออสการ์ครั้งที่ 1 ปี 1929) เป็นเรื่องราวเปลี่ยนผ่านระหว่างยุคหนังเงียบและหนังมีเสียง ว่าง่ายๆ เรื่องนี้จะบอกว่า Talkies kill the movie stars ที่อยากดูคืออยากเข้าใจว่าหนังเงียบมันล้าหลังขนาดไหน แต่ปรากฏว่ามันสนุก คือมันยังมีพล็อตได้ผ่านการ์ดตัวหนังสือบนจอ มันแช่ภาพได้เหมือนหนังสมัยใหม่ และหนังเองถึงจะทำเป็นหนังเงียบแต่ก็ใช้เทคนิคจากอุปกรณ์ภาพและเสียง (?!) สมัยใหม่ด้วยไม่ได้ตั้งใจจะทำให้มัน authentic</li>\n<li><strong>Morrison (2023)</strong><br />\nเรื่องนี้คำโปรยมันคือสิ่งที่เกิดขึ้นกับประเทศไทยหลังสงครามเวียดนาม ก็เลยคิดว่าน่าสนใจดูเพราะไม่ค่อยเห็นหนังไทยกระแสหลักทำแนวประวัติศาสตร์ช่วงสงครามโลกเป็นต้นไป (ที่พอจะนึกออกก็มีเรื่อง โหมโรง กับ คู่กรรม) เอาจริงๆ คือไม่สนุก หนังมัน arthouse มากๆ ถึงผู้กำกับบอกว่าหนังผมไม่มีสัญญะ เห็นอะไรก็เป็นไปอย่างนั้น แต่ไฟดิสโก้ที่ส่องกลางถนนมันตีความตรงตัวไม่ได้เลยว่ามีคนแขวนไฟดิสโก้ส่องไฟรบกวนชาวบ้านโดยไม่ได้มีคนมาสังสรรค์ เรื่องนี้ต้องรีวิวบอกว่ามันคือหนังผีที่ผีมันไม่ออกมา มันเป็นหนังพล็อตที่พล็อตมันก็ไม่ค่อยจะออกมาถ้าจะดูแบบไม่เอาสัญญะ</li>\n</ul>\n<h2><strong>All About Lily Chou-Chou (2001)</strong> ลิลี่ ชูชู แต่เธอตลอดไป</h2>\n<p>จริงๆ เรื่องนี้ดูปีที่แล้ว แต่อยากเขียนถึงมากๆ มันเหมือนเป็น <a href=\"https://en.wikipedia.org/wiki/Ico\">Ico (2001)</a> ของวงการภาพยนตร์เลย เป็นหนังที่ influential มากๆ คิดว่าดูแล้วจะเห็นเลยว่าเรื่องไหนที่ได้แรงบันดาลใจมาจากบางช่วงบางตอนของเรื่องนี้</p>\n<p>เรื่องนี้ตอนดูทีแรกรู้สึกว่าตรงกลางที่เป็น handicam ห่วยมากจนต้องกรอข้ามไป แต่ถึงมันจะเป็นช่วงที่ปวดหัวดูไม่รู้เรื่อง แต่ถ้าไม่ดูมันจะดูหนังที่เหลือไม่รู้เรื่องเหมือนมี plot hole เท่าหลุมอุกกาบาตอยู่ และเนื้อหาในเรื่องหนักมากๆ ทั้งๆ ที่เป็นเรื่องมัธยมแต่มัน dark มากๆ ในขณะที่ภาพเน้นแสงฟุ้งๆ godrays เยอะๆ</p>\n<p>ความเจ๋งของเรื่องนี้คือเราก็ลืมไปว่าในยุค 2001 มันยังเป็นยุคที่ตัวตนออนไลน์ของเรากับตัวตนออฟไลน์มันแยกกันอยู่ ไม่ค่อยเห็นมีหนังที่นำเสนอโลกออนไลน์ในเวลานั้นสักเท่าไร (ถ้าดูซีรีส์สมัยใหม่ คิดว่าการใช้แอพแชตคุยกันในสื่อสมัยใหม่ก็เป็นเรื่องปกติแต่มันจะนำเสนอเหมือนกับคุยกับคนนั้น ไม่ใช่ alter ego ของคนนั้น) แล้วหนังจะเสนอโลกความเป็นจริงที่โหดร้ายมากๆ ผมรู้สึกว่ามันเหมือนการ “รับน้อง” (hazing) ของการดูหนังเลย ผสมไปกับการหนีโลกไปอยู่บนโลกออนไลน์และดนตรีที่เคล้าไปด้วย “อีเทอร์” ซึ่งก็ไม่มีใครอธิบายได้ว่าอีเทอร์คืออะไร แต่ทุ่งข้าวสีเขียวกลายเป็นสัญลักษณ์ของหนังเรื่องนี้ไปแล้ว</p>\n<p><img src=\"https://blog.whs.in.th/wp-content/uploads/2024/12/eP9qVo7HGMi3wxG9Tsnutuh8nlf1.jpg\" alt=\"\" width=\"3464\" height=\"1948\" /></p>\n<p>แล้วอีเทอร์มันเลยกลายเป็นโค้ดลับของวงการคนดู Lily Chouchou ที่แปลกใจคือผมเห็นผู้หญิงหลายคนที่น่าจะเคยดู Lily Chouchou นะ เช่น <a href=\"https://2baht.com/sakodroy-film-japan/\">สะกดรอยหนัง</a> ที่มีสองสาวจูนจูน-เมย์โกะจาก Mary is Happy ก็มีรูปปกเป็นทุ่งอีเทอร์ หรือรถ Tesla Model 3 (Grey market) ของช่อง EV Girls ก็ชื่อ<a href=\"https://www.youtube.com/watch?v=aTPDbEOoRK0\">น้องอีเทอร์</a></p>\n<p></p>","author":"whs","siteTitle":"Quietly Verbose","siteHash":"5f972a6fe70a917eb1b1aa165b3cb2be8a9465af33ab38bf05f34c55c0e40587","entryHash":"1957259fc6a981af1af763ab703753eee50683c9dec248f9dc8ddd874177d192","category":"Thai"}