{"title":"‘Right environment’ or the dernier ressort as Derek Gee-West joins brimming Lidl-Trek squad?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/derek-gee-joins-lidl-trek-for-2026","date":1767949201000,"content":"\n      <p><span>Last season was a tale of two halves for Derek Gee-West (né Gee). He was in the top four in all four stage races he started — winning the Gran Camino in February, finishing fourth at Tirreno-Adriatico in March, third at the Tour of the Alps in April and fourth at the </span><a href=\"https://www.rouleur.cc/pages/giro-ditalia\" target=\"_blank\"><span>Giro d'Italia</span></a><span> in May. The success continued at the Canadian National Championships in June, where he won the road race and was second in the time trial.</span><b></b></p>\n<p><span>All of this happened in the first half of the year. But that was when his season ended and the reports of an unhappy relationship with his team Israel-Premier Tech (now NSN Cycling Team) emerged. The messy split was heavily-publicised and was down to what Gee-West described as a \"personal-belief standpoint that weighed heavily on my conscience.\" </span><b></b></p>\n<p><span>His transfer to Lidl-Trek concludes the period of uncertainty for both parties in a much more amicable way than previously touted. At one point last autumn the Canadian said he might owe €30 million to the team in damages. However, a recent Instagram post from NSN Cycling Team confirms that an agreement has been approved by the UCI to end Gee-West’s contract. So as the dust settles on a stressful period for the Canadian, he will be keen to look to the future and what he can achieve with Lidl-Trek.</span><b></b></p>\n<p><span>“It’s pretty special to be joining Lidl-Trek,” said Gee-West when his signing was announced. “From the outside, you can already see that this is an organisation operating very close to the gold standard in our sport, and that was something that really appealed to me. The ambition, the structure, and the depth of talent across the team are impressive, and it feels like the right environment for the next phase of my career.”</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-7732_f9a78f0e-349e-4081-86b2-ffcbc54f680a_1024x1024.jpg?v=1767873877\" alt=\"\" /></div>\n<p><span></span><em>Image: Zac Williams/SWpix.com</em></p>\n<p><span>But where will he fit in at Lidl-Trek? The Spaniard </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/juan-ayuso-joins-lidl-trek?tag=member\" target=\"_blank\"><span>Juan Ayuso has also joined the team</span></a><span> after his own acrimonious split from a squad in 2025, a fissure from UAE Team Emirates-XRG which included a </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uaes-latest-vuelta-a-espana-win-fails-to-mask-unhappy-team-they-did-it-to-damage-my-image?tag=member\" target=\"_blank\"><span>public falling-out</span></a><span> during September’s </span><a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\" target=\"_blank\"><span>Vuelta a España</span></a><span>. Lidl-Trek’s hilly Classics and stage racer </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/mattias-skjelmose?tag=member\" target=\"_blank\"><span>Mattias Skjelmose</span></a><span> was vocal about his discontentment about the leadership conundrum now facing the expanding squad. And that is before we throw into the mix the ambitions of the other leaders like Mads Pedersen, Giulio Ciccone and Jonathan Milan, as well as the rising stars like Mathias Vacek, Quinn Simmons and Thibau Nys, and the riders who have notable past performances like Tao Geoghegan Hart, Lennard Kämna and Søren Kragh Andersen and Toms Skujiņš. </span><b></b></p>\n<p><span>Lidl-Trek clearly have a task on their hands to juggle racing calendars and keep everyone happy. However, Gee-West seems aware that this could also provide opportunities, which were previously unavailable to him at NSN. </span><b></b></p>\n<p><span>“I’m really looking forward to racing with shared ambitions and multiple options within the team. Lidl-Trek has world-class riders across so many areas of the sport, and being part of a group where we can play different cards in stage races and Grand Tours is something new for me. I’m excited to learn from that, to keep developing as a GC rider, and to see what we can achieve together over the coming years,” he said when his signing was announced. </span><b></b></p>\n<p><span>But could Gee-West have had more opportunities on a different team? The answer isn’t certain. At the height of the summer, rumours swirled about a possible move to Ineos Grenadiers. The British squad have been on the hunt for a new GC option for some time, after their run of dominance at the </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\"><span>Tour de France</span></a><span> ended with Egan Bernal’s overall win in 2019. Gee-West would have been a good fit, but in the end, nothing was signed. </span><b></b></p>\n<p><span>Earlier this winter Ineos announced the signing of Tour fourth-place finisher the Scot </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/winning-a-grand-tour-is-possible-oscar-onleys-rise-from-the-scottish-borders-to-tour-de-france-stardom?tag=member\" target=\"_blank\"><span>Oscar Onley</span></a><span>. Neither rider is capable of challenging the likes of Tadej Pogačar or Jonas Vingegaard, but a Grand Tour podium is not out of the question.  </span><b></b></p>\n<p><span>That is the kind of quality Gee-West brings to any team, and the likes of Team Jayco Alula or EF Education-EasyPost would have been bolstered by the Canadian’s presence. However both teams have their own GC riders. So, ultimately, there wouldn’t have been many options other than Lidl-Trek for Gee-West as most teams have already finalised their rosters or would lack the surplus budget at this time of the year for a rider of his ability.</span><b></b></p>\n<p><span>The signing appears to be a case of a rider in need of a new home and a team with enough of a budget to accommodate him. Gee-West has a history of being adaptable in his riding style, and he will need to do the same in his new squad. </span></p>\n<p><em>Cover Image: Lidl-Trek</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1b541c1161c3561d4e1dc4d8cfb852faf9abcf14941ead4e84b63d48db859192","category":"Cycling"}