{"title":"Opening the AWS European Sovereign Cloud","link":"https://aws.amazon.com/blogs/aws/opening-the-aws-european-sovereign-cloud/","date":1768461174000,"content":"<p><a href=\"#german\">Deutsch</a> | English | <a href=\"#spanish\">Español</a> | <a href=\"#french\">Français</a> | <a href=\"#italian\">Italiano</a></p> \n<p>As a European citizen, I understand first-hand the importance of digital sovereignty, especially for our public sector organisations and highly regulated industries. Today, I’m delighted to share that the <a href=\"https://aws.eu/\">AWS European Sovereign Cloud</a> is now generally available to all customers. <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">We first announced our plans to build this new independent cloud infrastructure in 2023</a>, and today it’s ready to meet the most stringent sovereignty requirements of European customers <a href=\"https://aws.amazon.com/blogs/security/announcing-initial-services-available-in-the-aws-european-sovereign-cloud-backed-by-the-full-power-of-aws/\">with a comprehensive set of AWS services</a>.</p> \n<div>\n <a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211.jpeg\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211-1024x341.jpeg\" alt=\"Brandenburg Gate\" width=\"1024\" height=\"341\" /></a>\n <p>Berlin, Brandenburg Gate at sunset</p>\n</div> \n<p><span><strong>Meeting European sovereignty requirements<br /> </strong></span>Organizations across Europe face increasingly complex regulatory requirements around data residency, operational control, and governance independence. Too often today, European organisations with the highest sovereignty requirements are stuck in legacy on-premises environments or offerings with reduced services and functionality. In response to this critical need, the AWS European Sovereign Cloud is the only fully featured and independently operated sovereign cloud backed by strong technical controls, sovereign assurances, and legal protections. Public sector entities and businesses in highly regulated industries need cloud infrastructure that provides enhanced sovereignty controls that maintain the innovation, security, and reliability they expect from modern cloud services. These organisations require assurance that their data and operations remain under European jurisdiction, with clear governance structures and operational autonomy within the European Union (EU).</p> \n<p><span><strong>A new independent cloud infrastructure for Europe</strong></span><br /> The AWS European Sovereign Cloud represents a physically and logically separate cloud infrastructure, with all components located entirely within the EU. The first <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#region\">AWS Region</a> in the AWS European Sovereign Cloud is located in the state of Brandenburg, Germany, and is generally available today. This Region operates independently from existing AWS Regions. The infrastructure features multiple Availability Zones with redundant power and networking, designed to operate continuously even if connectivity with the rest of the world is interrupted.</p> \n<p>We plan to extend the AWS European Sovereign Cloud footprint from Germany across the EU to support stringent isolation, in-country data residency, and low latency requirements. This will start with new sovereign <a href=\"https://docs.aws.amazon.com/local-zones/latest/ug/what-is-aws-local-zones.html\">Local Zones</a> located in Belgium, the Netherlands, and Portugal. In addition, you will be able to extend the AWS European Sovereign Cloud infrastructure with <a href=\"https://aws.amazon.com/dedicatedlocalzones/\">AWS Dedicated Local Zones</a>, <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/ai-factories/\">AWS AI Factories</a>, or <a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a> in locations you select, including your own on-premises data centres.</p> \n<p>The AWS European Sovereign Cloud and its Local Zones provide enhanced sovereign controls through its unique operational model. The AWS European Sovereign Cloud will be operated exclusively by EU residents located in the EU. This covers activities such as day-to-day operations, technical support, and customer service. We’re gradually transitioning the AWS European Sovereign Cloud <a href=\"https://www.aboutamazon.eu/news/aws/aws-european-sovereign-cloud-to-be-operated-by-eu-citizens\">to be operated exclusively by EU citizens located in the EU</a>. During this transition period, we will continue to work with a blended team of EU residents and EU citizens located in the EU.</p> \n<p>The infrastructure is managed through dedicated European legal entities established under German law. In October 2025, AWS appointed <a href=\"https://www.aboutamazon.eu/news/aws/stephane-israel-appointed-to-lead-the-aws-european-sovereign-cloud\">Stéphane Israël</a>, an EU citizen residing in the EU, as managing director. Stéphane will be responsible for the management and operations of the AWS European Sovereign Cloud, including infrastructure, technology, and services, as well as leading AWS broader digital sovereignty efforts. In January 2026, AWS also appointed <a href=\"https://www.linkedin.com/in/stefanhoechbaue\">Stefan Hoechbauer</a> (Vice President, Germany and Central Europe, AWS) as a managing director of the AWS European Sovereign Cloud. He will work alongside Stéphane Israel to lead the AWS European Sovereign Cloud.</p> \n<p>An advisory board comprised exclusively of EU citizens, and including two independent third-party representatives, provides additional oversight and expertise on sovereignty matters.</p> \n<p><span><strong>Enhanced data residency and control</strong></span><br /> The AWS European Sovereign Cloud provides comprehensive data residency assurances so you can meet the most stringent data residency requirements. As with our existing AWS Regions around the world, all your content remains within the Region you select unless you choose otherwise. Beyond content, customer-created metadata including roles, permissions, resource labels, and configurations also stays within the EU. The infrastructure features its own dedicated <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> and billing system, all operating independently within European borders.</p> \n<p>Technical controls built into the infrastructure <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/design-goals.html\">prevent access to the AWS European Sovereign Cloud from outside the EU</a>. The infrastructure includes <a href=\"https://aws.amazon.com/blogs/security/establishing-a-european-trust-service-provider-for-the-aws-european-sovereign-cloud/\">a dedicated European trust service provider for certificate authority operations</a> and uses dedicated <a href=\"https://aws.amazon.com/route53/\">Amazon Route 53</a> name servers. These servers will only use<a href=\"https://aws.eu/faq/#operational-autonomy\"> European Top-Level Domains (TLDs) for their own names</a>. The AWS European Sovereign Cloud has no critical dependencies on non-EU personnel or infrastructure.</p> \n<p><span><strong>Security and compliance framework<br /> </strong></span>The AWS European Sovereign Cloud maintains the same core security capabilities you expect from AWS, including encryption, key management, access governance, and the <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> for compute isolation. This means your EC2 instances benefit from cryptographically verified platform integrity and hardware-enforced boundaries that prevent unauthorized access to your data without compromising on performance, giving you both the sovereignty controls and the computational power your workloads require. The infrastructure undergoes <a href=\"https://aws.amazon.com/blogs/compute/aws-nitro-system-gets-independent-affirmation-of-its-confidential-compute-capabilities/\">independent third-party audits</a>, with compliance programs including ISO/IEC 27001:2013, SOC 1/2/3 reports, and <a href=\"https://www.bsi.bund.de/EN/Home/home_node.html\">Federal Office for Information Security (BSI)</a> C5 attestation.</p> \n<p>The <a href=\"https://aws.amazon.com/blogs/security/exploring-the-new-aws-european-sovereign-cloud-sovereign-reference-framework/\">AWS European Sovereign Cloud: Sovereign Reference Framework</a> defines the specific sovereignty controls across governance independence, operational control, data residency, and technical isolation. This framework is available in <a href=\"https://aws.amazon.com/artifact/\">AWS Artifact</a> and provides end-to-end visibility through SOC 2 attestation.</p> \n<p><span><strong>Comprehensive service availability<br /> </strong></span>You can access a broad range of AWS services in the AWS European Sovereign Cloud from launch, including <a href=\"https://aws.amazon.com/sagemaker/\">Amazon SageMaker</a> and <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock</a> for artificial intelligence and machine learning (AI/ML) workloads. For compute, you can use <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> and <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>. Container orchestration is available through <a href=\"https://aws.amazon.com/eks/\">Amazon Elastic Kubernetes Service (Amazon EKS)</a> and <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service (Amazon ECS)</a>. Database services include <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora</a>, <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a>, and <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a>. Storage options include <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> and <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a>, with networking through <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (Amazon VPC)</a> and security services including <a href=\"https://aws.amazon.com/kms/\">AWS Key Management Service (AWS KMS)</a> and <a href=\"https://aws.amazon.com/private-ca/\">AWS Private Certificate Authority</a>. For an up-to-date list of services, refer to the <a href=\"https://builder.aws.com/build/capabilities/explore?f=eJyrVipOzUlNLklNCUpNz8zPK1ayUoqOUUotLU7WTUnVTU0sLtE1jFGKVdKBK3QsS8zMSUzKzMksqQSqdsyrVEARqgUA4l8dog&amp;tab=service-feature\">AWS Capabilities matrix</a> recently published on the AWS Builder Center.</p> \n<p>The AWS European Sovereign Cloud is <a href=\"https://aws.amazon.com/blogs/apn/range-of-aws-partner-solutions-set-to-launch-on-the-aws-european-sovereign-cloud/\">supported by AWS Partners</a> who are committed to helping you meet your sovereignty requirements. Partners including Adobe, Cisco, Cloudera, Dedalus, Esri, Genesys, GitLab, Mendix, Pega, SAP, SnowFlake, Trend Micro, and Wiz are making their solutions available in the AWS European Sovereign Cloud, providing you with the tools and services you need across security, data analytics, application development, and industry-specific workloads. This broad partner support helps you build sovereign solutions that combine AWS services with trusted partner technologies.</p> \n<p><span><strong>Significant investment in European infrastructure<br /> </strong></span>The AWS European Sovereign Cloud is backed by a €7.8 billion investment in infrastructure, jobs creation, and skills development. This investment is expected to contribute €17.2 billion to the European economy through 2040 and support roughly 2,800 full-time equivalent jobs annually in local businesses.</p> \n<p><span><strong>Some technical details<br /> </strong></span>The AWS European Sovereign Cloud is available to all customers, regardless of where they are located. You can access the infrastructure using the <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/reference-arns.html\">partition</a> name <code>aws-eusc</code> and the Region name <code>eusc-de-east-1</code>. A partition is a group of AWS Regions. Each AWS account is scoped to one partition.</p> \n<p>The infrastructure supports all standard AWS access methods including the <a href=\"https://console.amazonaws-eusc.eu/\">AWS Management Console</a>, <a href=\"https://aws.amazon.com/tools/\">AWS SDKs</a>, and the <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a>, making it straightforward to integrate into your existing workflows and automation. After having created a new root account for the AWS European Sovereign Cloud partition, you start by creating new IAM identities and roles specific to this infrastructure, giving you complete control over access management within the European sovereign environment.</p> \n<p><span><strong>Getting started<br /> </strong></span>The AWS European Sovereign Cloud provides European organisations with enhanced sovereignty controls whilst maintaining access to AWS innovation and capabilities. You can contract for services through Amazon Web Services EMEA SARL, with pricing in EUR and billing in any of <a href=\"https://aws.amazon.com/legal/aws-emea/\">the eight currencies we support today</a>. The infrastructure uses familiar AWS architecture, service portfolio, and APIs, making it straightforward to build and migrate applications.</p> \n<p>The<a href=\"https://aws.eu/de/esca\"> AWS European Sovereign Cloud addendum</a> contains the additional contractual commitments for the AWS European Sovereign Cloud.</p> \n<p>For me as a European, this launch represents the AWS commitment to meeting the specific needs of our continent and providing the cloud capabilities that drive innovation across industries. I invite you to find out more about the AWS European Sovereign Cloud and how it can help your organisation meet its sovereignty requirements. Read <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/introduction.html\">Overview of the AWS European Sovereign Cloud</a> to learn more about the design goals and approach, <a href=\"https://eusc-de-east-1.signin.amazonaws-eusc.eu/signup?request_type=register\">sign up for a new account</a>, and plan for the deployment of your first workload today.</p> \n<a href=\"https://linktr.ee/sebsto\">— seb</a> \n<hr /> \n<h4>German version</h4> \n<p><strong>Start der AWS European Sovereign Cloud</strong></p> \n<p>Als Bürger Europas weiß ich aus eigener Erfahrung, wie wichtig digitale Souveränität ist, insbesondere für unsere öffentlichen Einrichtungen und stark regulierten Branchen. Ich freue mich, Ihnen heute mitteilen zu können, dass die <a href=\"https://aws.eu/\">AWS European Sovereign Cloud</a> nun für alle Kunden allgemein verfügbar ist. <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">Wir haben unsere Pläne zum Aufbau dieser neuen unabhängigen Cloud-Infrastruktur erstmals im Jahr 2023 vorgestellt</a>. Heute ist diese Infrastruktur bereit, <a href=\"https://aws.amazon.com/blogs/security/announcing-initial-services-available-in-the-aws-european-sovereign-cloud-backed-by-the-full-power-of-aws/\">mit einem umfassenden Angebot an AWS-Services</a> die strengsten Souveränitätsanforderungen europäischer Kunden zu erfüllen.</p> \n<div>\n <a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211.jpeg\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211-1024x341.jpeg\" alt=\"Brandenburg Gate\" width=\"1024\" height=\"341\" /></a>\n <p>Berlin, Brandenburger Tor bei Sonnenuntergang</p>\n</div> \n<p><strong><u>Erfüllung europäischer Souveränitätsanforderungen<br /> </u></strong>Organisationen in ganz Europa sehen sich mit zunehmend komplexen regulatorischen Anforderungen in Bezug auf Datenresidenz, operative Kontrolle und Unabhängigkeit der Governance konfrontiert. Europäische Organisationen mit höchsten Souveränitätsanforderungen sind heutzutage allzu oft in veralteten lokalen Umgebungen oder Angeboten mit eingeschränkten Services und Funktionen gefangen. Die AWS European Sovereign Cloud ist die Antwort auf diesen dringenden Bedarf. Sie ist die einzige unabhängig betriebene souveräne Cloud mit vollem Funktionsumfang, die durch strenge technische Kontrollen, Souveränitätszusicherungen und rechtlichen Schutz abgesichert ist. Einrichtungen des öffentlichen Sektors und Unternehmen in stark regulierten Branchen benötigen eine Cloud-Infrastruktur, die erweiterte Souveränitätskontrollen bietet und gleichzeitig die von modernen Cloud-Services erwartete Innovation, Sicherheit und Zuverlässigkeit gewährleistet. Diese Organisationen benötigen die Zusicherung, dass ihre Daten und Aktivitäten unter europäischer Zuständigkeit bleiben, mit klaren Governance-Strukturen und operativer Autonomie innerhalb der Europäischen Union (EU).</p> \n<p><strong><u>Eine neue unabhängige Cloud-Infrastruktur für Europa</u></strong><br /> Die AWS European Sovereign Cloud ist eine physisch und logisch getrennte Cloud-Infrastruktur, deren Komponenten sich vollständig innerhalb der EU befinden. Die erste <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#region\">AWS-Region</a> in der AWS European Sovereign Cloud befindet sich im deutschen Bundesland Brandenburg und ist ab heute allgemein verfügbar. Diese Region arbeitet unabhängig von bestehenden AWS-Regionen. Die Infrastruktur umfasst mehrere Availability Zones mit redundanter Stromversorgung und Netzwerkverbindung, die auch bei einer Unterbrechung der Verbindung zum Rest der Welt einen kontinuierlichen Betrieb gewährleisten.</p> \n<p>Wir beabsichtigen, die Präsenz der AWS European Sovereign Cloud von Deutschland aus EU-weit auszuweiten, um strenge Anforderungen hinsichtlich Isolierung, Datenresidenz innerhalb einzelner Länder und geringer Latenz zu erfüllen. Dies beginnt mit neuen souveränen <a href=\"https://docs.aws.amazon.com/local-zones/latest/ug/what-is-aws-local-zones.html\">Local Zones</a> in Belgien, den Niederlanden und Portugal. Darüber hinaus können Sie die Infrastruktur der AWS European Sovereign Cloud mit <a href=\"https://aws.amazon.com/dedicatedlocalzones/\">dedizierten AWS Local Zones</a>, <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/ai-factories/\">AWS AI Factories</a> oder <a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a> an Standorten Ihrer Wahl, einschließlich Ihrer eigenen lokalen Rechenzentren, erweitern.</p> \n<p>Dank ihres einzigartigen Betriebsmodells bieten die AWS European Sovereign Cloud und ihre Local Zones erweiterte Souveränitätskontrollen. Der Betrieb der AWS European Sovereign Cloud wird ausschließlich von EU-Bürgern mit Wohnsitz in der EU sichergestellt. Dies umfasst Aktivitäten wie den täglichen Betrieb, den technischen Support und den Kundenservice. Wir stellen die AWS European Sovereign Cloud schrittweise so um, dass <a href=\"https://www.aboutamazon.eu/news/aws/aws-european-sovereign-cloud-to-be-operated-by-eu-citizens\">als Betriebspersonal ausschließlich EU-Bürger mit Wohnsitz in der EU zum Einsatz kommen</a>. Während dieser Übergangsphase werden wir weiterhin mit einem gemischten Team aus in der EU ansässigen Personen und in der EU lebenden EU-Bürgern arbeiten.</p> \n<p>Die Infrastruktur wird durch spezielle europäische juristische Personen nach deutschem Recht verwaltet. Im Oktober 2025 berief AWS <a href=\"https://www.aboutamazon.eu/news/aws/stephane-israel-appointed-to-lead-the-aws-european-sovereign-cloud\">Stéphane Israël</a>, einen in der EU ansässigen EU-Bürger, zum Geschäftsführer. Stéphane wird für das Management und den Betrieb der AWS European Sovereign Cloud verantwortlich zeichnen. Dies umfasst die Bereiche Infrastruktur, Technologie und Services sowie die Federführung bei den breit angelegten Initiativen von AWS auf dem Gebiet der digitalen Souveränität. Im Januar 2026 ernannte AWS zudem <a href=\"https://www.linkedin.com/in/stefanhoechbaue\">Stefan Hoechbauer</a> (Vice President, Germany and Central Europe, AWS) zum Geschäftsführer der AWS European Sovereign Cloud. Er wird gemeinsam mit Stéphane Israel die Leitung der AWS European Sovereign Cloud innehaben.</p> \n<p>Ein Beirat, dem ausschließlich EU-Bürger, einschließlich zwei unabhängigen externen Vertretern, angehören, fungiert als zusätzliche Kontrollinstanz und bringt Fachwissen in Fragen der Souveränität ein.</p> \n<p><strong><u>Verbesserte Datenresidenz und -kontrolle </u></strong><br /> Die AWS European Sovereign Cloud bietet umfassende Garantien hinsichtlich der Datenresidenz, sodass Sie selbst die strengsten Anforderungen in diesem Bereich erfüllen können. Wie auch bei unseren bestehenden AWS-Regionen weltweit verbleiben alle Ihre Inhalte in der von Ihnen ausgewählten Region, sofern Sie keine anderen Einstellungen vornehmen. Neben den Inhalten verbleiben auch die vom Kunden erstellten Metadaten, einschließlich Rollen, Berechtigungen, Ressourcenbezeichnungen und Konfigurationen, innerhalb der EU. Die Infrastruktur verfügt über ein eigenes <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> und ein eigenes Abrechnungssystem – beides wird innerhalb der europäischen Grenzen unabhängig betrieben.</p> \n<p>In die Infrastruktur integrierte technische Kontrollen <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/design-goals.html\">verhindern den Zugriff auf die AWS European Sovereign Cloud von außerhalb der EU</a>. Die Infrastruktur umfasst <a href=\"https://aws.amazon.com/blogs/security/establishing-a-european-trust-service-provider-for-the-aws-european-sovereign-cloud/\">einen dedizierten europäischen Trust Service Provider</a> für Zertifizierungsstellen und nutzt dedizierte <a href=\"https://aws.amazon.com/route53/\">Amazon-Route-53</a>-Namenserver. Diese Server verwenden ausschließlich<a href=\"https://aws.eu/faq/#operational-autonomy\"> europäische Top-Level-Domains (TLDs) für ihre eigenen Namen</a>. Die AWS European Sovereign Cloud unterliegt keinen kritischen Abhängigkeiten hinsichtlich Personal oder Infrastruktur außerhalb der EU.</p> \n<p><strong><u>Sicherheits- und Compliance-Framework<br /> </u></strong>Die AWS European Sovereign Cloud bietet dieselben zentralen Sicherheitsfunktionen, die Sie von AWS erwarten. Dazu gehören Verschlüsselung, Schlüsselverwaltung, Zugriffskontrolle und das <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> für die Isolierung von Rechenressourcen. Dies bedeutet, dass Ihre EC2-Instanzen von einer kryptografisch verifizierten Plattformintegrität und hardwaregestützten Grenzen profitieren, die unbefugten Zugriff auf Ihre Daten verhindern, ohne die Leistung zu beeinträchtigen. So erhalten Sie sowohl die Souveränitätskontrollen als auch die Rechenleistung, die Ihre Workloads erfordern. Die Infrastruktur wird <a href=\"https://aws.amazon.com/blogs/compute/aws-nitro-system-gets-independent-affirmation-of-its-confidential-compute-capabilities/\">unabhängigen Audits durch Dritt</a>e unterzogen. Die Compliance-Programme umfassen ISO/IEC 27001:2013, SOC-1/2/3-Berichte und das C5-Zertifikat des <a href=\"https://www.bsi.bund.de/EN/Home/home_node.html\">Bundesamtes für Sicherheit in der Informationstechnik (BSI)</a>.</p> \n<p>Das <a href=\"https://aws.amazon.com/blogs/security/exploring-the-new-aws-european-sovereign-cloud-sovereign-reference-framework/\">AWS European Sovereign Cloud: Sovereign Reference Framework</a> definiert spezifische Souveränitätskontrollen in den Bereichen Governance-Unabhängigkeit, operative Kontrolle, Datenresidenz und technische Isolierung. Dieses Framework ist in <a href=\"https://aws.amazon.com/artifact/\">AWS Artifact</a> verfügbar und bietet durch SOC-2-Zertifizierung durchgängige Transparenz.</p> \n<p><strong><u>Umfassende Serviceverfügbarkeit<br /> </u></strong>Von Beginn an steht Ihnen in der AWS European Sovereign Cloud eine breite Palette von AWS-Services zur Verfügung – darunter <a href=\"https://aws.amazon.com/sagemaker/\">Amazon SageMaker</a> und <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock</a> für Workloads im Bereich Künstliche Intelligenz und Machine Learning (KI/ML). Für die Rechenleistung stehen Ihnen <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> und <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> zur Verfügung. Die Container-Orchestrierung ist über den <a href=\"https://aws.amazon.com/eks/\">Amazon Elastic Kubernetes Service (Amazon EKS)</a> und den <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service (Amazon ECS)</a> verfügbar. Zu den Datenbank-Services gehören <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora</a>, <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a> und <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a>. Die Speicheroptionen umfassen <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> und <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a> mit Vernetzung über <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (Amazon VPC)</a> und Sicherheits-Services wie <a href=\"https://aws.amazon.com/kms/\">AWS Key Management Service (AWS KMS)</a> und <a href=\"https://aws.amazon.com/private-ca/\">AWS Private Certificate Authority</a>. Eine aktuelle Liste der Services finden Sie in der <a href=\"https://builder.aws.com/build/capabilities/explore?f=eJyrVipOzUlNLklNCUpNz8zPK1ayUoqOUUotLU7WTUnVTU0sLtE1jFGKVdKBK3QsS8zMSUzKzMksqQSqdsyrVEARqgUA4l8dog&amp;tab=service-feature\">AWS-Funktionsmatrix</a>, die kürzlich im AWS Builder Center veröffentlicht wurde.</p> \n<p>Die AWS European Sovereign Cloud wird von <a href=\"https://aws.amazon.com/blogs/apn/range-of-aws-partner-solutions-set-to-launch-on-the-aws-european-sovereign-cloud/\">AWS-Partnern unterstützt</a>, die es sich zur Aufgabe gemacht haben, Ihnen bei der Erfüllung Ihrer Souveränitätsanforderungen zur Seite zu stehen. Partner wie Adobe, Cisco, Cloudera, Dedalus, Esri, Genesys, GitLab, Mendix, Pega, SAP, SnowFlake, Trend Micro und Wiz stellen ihre Lösungen in der AWS European Sovereign Cloud zur Verfügung und bieten Ihnen die Tools und Services, die Sie in den Bereichen Sicherheit, Datenanalyse, Entwicklung von Anwendungen und branchenspezifische Workloads benötigen. Dank dieser umfassenden Unterstützung durch Partner können Sie eigenständige Lösungen, die AWS-Services mit bewährten Partnertechnologien kombinieren, entwickeln.</p> \n<p><strong><u>Erhebliche Investitionen in die europäische Infrastruktur<br /> </u></strong>Hinter der AWS European Sovereign Cloud steht eine Investition in Höhe von 7,8 Milliarden Euro in Infrastruktur, die Schaffung von Arbeitsplätzen und die Entwicklung von Kompetenzen. Diese Investition wird bis 2040 voraussichtlich 17,2 Milliarden Euro zur europäischen Wirtschaftsleistung beitragen und jährlich rund 2 800 Vollzeitstellen in lokalen Unternehmen sichern.</p> \n<p><strong><u>Einige technische Details<br /> </u></strong>Die AWS European Sovereign Cloud steht allen Kunden zur Verfügung, unabhängig davon, wo sie sich befinden. Sie können mit dem <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/reference-arns.html\">Partitionsnamen</a> aws-eusc und dem Regionsnamen eusc-de-east-1 auf die Infrastruktur zugreifen. Eine Partition ist eine Gruppe von AWS-Regionen. Jedes AWS-Konto ist auf eine Partition beschränkt.</p> \n<p>Die Infrastruktur unterstützt alle gängigen AWS-Zugriffsmethoden, einschließlich der <a href=\"https://console.amazonaws-eusc.eu/\">AWS Management Console</a>,<a href=\"https://aws.amazon.com/tools/\"> AWS SDKs</a> und der <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a>, sodass sie sich problemlos in Ihre bestehenden Workflows und Automatisierungsprozesse integrieren lässt. Nachdem Sie ein neues Root-Konto für die Partition der AWS European Sovereign Cloud erstellt haben, beginnen Sie mit der Erstellung neuer IAM-Identitäten und -Rollen, die speziell für diese Infrastruktur vorgesehen sind. Dadurch erhalten Sie die vollständige Kontrolle über die Zugriffsverwaltung innerhalb der europäischen souveränen Umgebung.</p> \n<p><strong><u>Erste Schritte<br /> </u></strong>Die AWS European Sovereign Cloud bietet europäischen Organisationen erweiterte Souveränitätskontrollen und gewährleistet gleichzeitig den Zugriff auf die Innovationen und Funktionen von AWS. Sie können Services über Amazon Web Services EMEA SARL in Auftrag geben. Die Preise werden in Euro angegeben und die Abrechnung erfolgt in <a href=\"https://aws.amazon.com/legal/aws-emea/\">einer der acht Währungen, die wir derzeit unterstützen</a>. Die Infrastruktur basiert auf der bekannten AWS-Architektur, dem AWS-Serviceportfolio und den AWS-APIs, wodurch die Entwicklung und Migration von Anwendungen vereinfacht wird.</p> \n<p>Der <a href=\"https://aws.eu/de/esca\">AWS European Sovereign Cloud Addendum</a> enthält die zusätzlichen vertraglichen Verpflichtungen für die AWS European Sovereign Cloud.</p> \n<p>Für mich als Europäer symbolisiert dieser Launch das Engagement von AWS, den spezifischen Anforderungen unseres Kontinents gerecht zu werden und Cloud-Funktionen bereitzustellen, die Innovationen in allen Branchen vorantreiben. Ich lade Sie ein, mehr über die AWS European Sovereign Cloud zu erfahren und zu entdecken, wie sie Ihrer Organisation dabei helfen kann, ihre Souveränitätsanforderungen zu erfüllen. Lesen Sie die <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/introduction.html\">Übersicht über die AWS European Sovereign Cloud</a> und erfahren Sie mehr über die Designziele und den Ansatz. <a href=\"https://eusc-de-east-1.signin.amazonaws-eusc.eu/signup?request_type=register\">Registrieren Sie sich für ein neues Konto</a> und planen Sie noch heute die Bereitstellung Ihrer ersten Workload.</p> \n<p><a href=\"https://linktr.ee/sebsto\">— seb</a></p> \n<hr /> \n<h4>French version</h4> \n<p><strong>Ouverture de l’AWS European Souvereign Cloud</strong></p> \n<p>En tant que citoyen européen, je mesure personnellement l’importance de la souveraineté numérique, en particulier pour nos organisations du secteur public et les industries fortement réglementées. Aujourd’hui, j’ai le plaisir d’annoncer que l’<a href=\"https://aws.eu/\">AWS European Sovereign Cloud</a> est désormais disponible pour l’ensemble de nos clients. <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">Nous avions annoncé pour la première fois notre projet de construction de cette nouvelle infrastructure cloud indépendante en 2023</a>, et elle est aujourd’hui prête à répondre aux exigences de souveraineté les plus strictes des clients européens, <a href=\"https://aws.amazon.com/blogs/security/announcing-initial-services-available-in-the-aws-european-sovereign-cloud-backed-by-the-full-power-of-aws/\">avec un large ensemble de services AWS</a>.</p> \n<div>\n <a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211.jpeg\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211-1024x341.jpeg\" alt=\"Brandenburg Gate\" width=\"1024\" height=\"341\" /></a>\n <p>Berlin, porte de Brandebourg au coucher du soleil</p>\n</div> \n<p><span><strong>Répondre aux exigences européennes en matière de souveraineté<br /> </strong></span>Partout en Europe, les organisations sont confrontées à des exigences réglementaires de plus en plus complexes en matière de résidence des données, de contrôle opérationnel et d’indépendance de la gouvernance. Trop souvent aujourd’hui, les organisations européennes ayant les besoins de souveraineté les plus élevés se retrouvent contraintes de rester sur des environnements sur site, ou de recourir à des offres cloud aux services et fonctionnalités limités. Pour répondre à cet enjeu critique, l’AWS European Sovereign Cloud est le seul cloud souverain entièrement fonctionnel, exploité de manière indépendante, et reposant sur des contrôles techniques robustes, des garanties de souveraineté et des protections juridiques solides. Les acteurs du secteur public et les entreprises des secteurs fortement réglementés ont besoin d’une infrastructure cloud offrant des contrôles de souveraineté renforcés, sans renoncer à l’innovation, à la sécurité et à la fiabilité attendues des services cloud modernes. Ces organisations doivent avoir l’assurance que leurs données et leurs opérations restent sous juridiction européenne, avec des structures de gouvernance claires et une autonomie opérationnelle au sein de l’Union européenne (UE).</p> \n<p><span><strong>Une nouvelle infrastructure cloud indépendante pour l’Europe</strong></span><br /> L’AWS European Sovereign Cloud repose sur une infrastructure cloud physiquement et logiquement distincte, dont l’ensemble des composants est situé exclusivement au sein de l’UE. La première <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#region\">région AWS</a> de l’AWS European Sovereign Cloud est implantée dans le Land de Brandebourg, en Allemagne, et est disponible dès aujourd’hui. Cette région fonctionne de façon indépendante par rapport aux autres régions AWS existantes. L’infrastructure comprend plusieurs zones de disponibilité, avec des systèmes redondants d’alimentation et de réseau, conçus pour fonctionner en continu même en cas d’interruption de la connectivité avec le reste du monde.</p> \n<p>Nous prévoyons d’étendre l’empreinte de l’AWS European Sovereign Cloud depuis l’Allemagne à l’ensemble de l’UE, afin de répondre aux exigences strictes d’isolation, de résidence des données dans certains pays et de faible latence. Cette extension débutera avec de nouvelles <a href=\"https://docs.aws.amazon.com/local-zones/latest/ug/what-is-aws-local-zones.html\">Local Zones</a> souveraines situées en Belgique, aux Pays-Bas et au Portugal. En complément, vous pourrez étendre l’infrastructure de l’AWS European Sovereign Cloud à l’aide des <a href=\"https://aws.amazon.com/dedicatedlocalzones/\">AWS Dedicated Local Zones</a>, des <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/ai-factories/\">AWS AI Factories</a> ou d’<a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a>, dans les sites de votre choix, y compris au sein de vos propres centres de données sur site.</p> \n<p>L’AWS European Sovereign Cloud et ses Local Zones offrent des contrôles de souveraineté renforcés grâce à un modèle opérationnel unique. L’AWS European Sovereign Cloud est exploité exclusivement par des résidents de l’UE basés dans l’UE. Cela couvre notamment les opérations quotidiennes, le support technique et le service client. Nous sommes en train d’opérer une transition progressive afin que l’AWS European Sovereign Cloud soit <a href=\"https://www.aboutamazon.eu/news/aws/aws-european-sovereign-cloud-to-be-operated-by-eu-citizens\">exploité exclusivement par des citoyens de l’UE résidant dans l’UE</a>. Durant cette période de transition, nous continuons de travailler avec une équipe mixte composée de résidents de l’UE et de citoyens de l’UE basés dans l’UE.</p> \n<p>L’infrastructure est gérée par des entités juridiques européennes dédiées, établies conformément au droit allemand. En octobre 2025, AWS a nommé <a href=\"https://www.aboutamazon.eu/news/aws/stephane-israel-appointed-to-lead-the-aws-european-sovereign-cloud\">Stéphane Israël</a>, citoyen de l’UE résidant dans l’UE, au poste de directeur général. Stéphane est responsable de la gestion et de l’exploitation de l’AWS European Sovereign Cloud, couvrant l’infrastructure, la technologie et les services, ainsi que de la direction des initiatives plus larges d’AWS en matière de souveraineté numérique. En janvier 2026, AWS a également nommé <a href=\"https://www.linkedin.com/in/stefanhoechbaue\">Stefan Hoechbauer</a> (Vice-président, Allemagne et Europe centrale, AWS) comme directeur général de l’AWS European Sovereign Cloud. Il travaillera aux côtés de Stéphane Israël pour piloter l’AWS European Sovereign Cloud.</p> \n<p>Un conseil consultatif, composé exclusivement de citoyens de l’UE et incluant deux représentants indépendants, apporte un niveau supplémentaire de supervision et d’expertise sur les questions de souveraineté.</p> \n<p><span><strong>Résidence des données et contrôle renforcés</strong></span><br /> L’AWS European Sovereign Cloud fournit des garanties complètes en matière de résidence des données afin de répondre aux exigences les plus strictes. Comme dans les régions AWS existantes à travers le monde, l’ensemble de vos contenus reste dans la région que vous sélectionnez, sauf indication contraire de votre part. Au-delà des contenus, les métadonnées créées par les clients — telles que les rôles, les autorisations, les étiquettes de ressources et les configurations — restent également au sein de l’UE. L’infrastructure dispose de son propre système dédié de <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> et de facturation, opérant de manière totalement indépendante à l’intérieur des frontières européennes.</p> \n<p>Des contrôles techniques intégrés à l’infrastructure <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/design-goals.html\">empêchent tout accès à l’AWS European Sovereign Cloud depuis l’extérieur de l’UE</a>. L’infrastructure comprend <a href=\"https://aws.amazon.com/blogs/security/establishing-a-european-trust-service-provider-for-the-aws-european-sovereign-cloud/\">un prestataire européen de services de confiance dédié pour les opérations d’autorité de certification</a> et utilise des serveurs de noms <a href=\"https://aws.amazon.com/route53/\">Amazon Route 53</a> dédiés. Ces serveurs n’utilisent <a href=\"https://aws.eu/faq/#operational-autonomy\">que des domaines de premier niveau (TLD) européens pour leurs propres noms</a>. L’AWS European Sovereign Cloud ne présente aucune dépendance critique vis-à-vis de personnels ou d’infrastructures situés en dehors de l’UE.</p> \n<p><span><strong>Cadre de sécurité et de conformité<br /> </strong></span>L’AWS European Sovereign Cloud conserve les capacités de sécurité fondamentales attendues d’AWS, notamment le chiffrement, la gestion des clés, la gouvernance des accès et le <a href=\"https://aws.amazon.com/ec2/nitro/\">système AWS Nitro</a> pour l’isolation des charges de calcul. Concrètement, vos instances EC2 bénéficient d’une intégrité de plateforme vérifiée cryptographiquement et de frontières matérielles, empêchant tout accès non autorisé à vos données sans compromis sur les performances. Vous bénéficiez ainsi à la fois des contrôles de souveraineté et de la puissance de calcul nécessaires à vos charges de travail. L’infrastructure fait l’objet <a href=\"https://aws.amazon.com/blogs/compute/aws-nitro-system-gets-independent-affirmation-of-its-confidential-compute-capabilities/\">d’audits indépendants réalisés par des tiers</a>, et s’inscrit dans des programmes de conformité incluant ISO/IEC 27001:2013, les rapports SOC 1/2/3, ainsi que l’attestation C5 de l’<a href=\"https://www.bsi.bund.de/EN/Home/home_node.html\">Office fédéral allemand pour la sécurité de l’information (BSI)</a>.</p> \n<p>Le <a href=\"https://aws.amazon.com/blogs/security/exploring-the-new-aws-european-sovereign-cloud-sovereign-reference-framework/\">AWS European Sovereign Cloud: Sovereign Reference Framework</a> définit précisément les contrôles de souveraineté couvrant l’indépendance de la gouvernance, le contrôle opérationnel, la résidence des données et l’isolation technique. Ce cadre est disponible dans <a href=\"https://aws.amazon.com/artifact/\">AWS Artifact</a> et offre une visibilité de bout en bout via une attestation SOC 2.</p> \n<p><span><strong>Disponibilité étendue des services<br /> </strong></span>Dès son lancement, l’AWS European Sovereign Cloud donne accès à un large éventail de services AWS, notamment <a href=\"https://aws.amazon.com/sagemaker/\">Amazon SageMaker</a> et <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock</a> pour les charges de travail d’intelligence artificielle et de machine learning (IA/ML). Pour le calcul, vous pouvez utiliser <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> et <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>. L’orchestration de conteneurs est disponible via <a href=\"https://aws.amazon.com/eks/\">Amazon Elastic Kubernetes Service (Amazon EKS)</a> et <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service (Amazon ECS)</a>. Les services de bases de données incluent <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora</a>, <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a> et <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a>. Les options de stockage comprennent <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> et <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a>, avec des capacités réseau via <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (Amazon VPC)</a> et des services de sécurité tels que <a href=\"https://aws.amazon.com/kms/\">AWS Key Management Service (AWS KMS)</a> et <a href=\"https://aws.amazon.com/private-ca/\">AWS Private Certificate Authority</a>. Pour obtenir la liste la plus à jour des services disponibles, consultez la <a href=\"https://builder.aws.com/build/capabilities/explore?f=eJyrVipOzUlNLklNCUpNz8zPK1ayUoqOUUotLU7WTUnVTU0sLtE1jFGKVdKBK3QsS8zMSUzKzMksqQSqdsyrVEARqgUA4l8dog&amp;tab=service-feature\">matrice des capacités AWS</a> récemment publiée sur l’AWS Builder Center.</p> \n<p>L’AWS European Sovereign Cloud est <a href=\"https://aws.amazon.com/blogs/apn/range-of-aws-partner-solutions-set-to-launch-on-the-aws-european-sovereign-cloud/\">supporté par de nombreux partenaires AWS</a> engagés à vous aider à répondre à vos exigences de souveraineté. Des partenaires tels qu’Adobe, Cisco, Cloudera, Dedalus, Esri, Genesys, GitLab, Mendix, Pega, SAP, SnowFlake, Trend Micro et Wiz rendent leurs solutions disponibles sur l’AWS European Sovereign Cloud, vous offrant ainsi les outils et services nécessaires dans les domaines de la sécurité, de l’analyse de données, du développement applicatif et des charges de travail spécifiques à certains secteurs industriels. Cet ensemble de partenaires vous permet de construire des solutions souveraines combinant les services AWS et des technologies de partenaires de confiance.</p> \n<p><span><strong>Un investissement majeur dans l’infrastructure européenne<br /> </strong></span>L’AWS European Sovereign Cloud s’appuie sur un investissement de 7,8 milliards d’euros dans l’infrastructure, la création d’emplois et le développement des compétences. Cet investissement devrait contribuer à hauteur de 17,2 milliards d’euros à l’économie européenne d’ici 2040 et soutenir environ 2.800 emplois équivalent temps plein par an au sein des entreprises locales.</p> \n<p><span><strong>Quelques détails techniques<br /> </strong></span>L’AWS European Sovereign Cloud est accessible à tous les clients, quel que soit leur lieu d’implantation. Vous pouvez accéder à l’infrastructure en utilisant le nom de <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/reference-arns.html\">partition</a> <code>aws-eusc</code> et le nom de région <code>eusc-de-east-1</code>. Une partition correspond à un ensemble de régions AWS. Chaque compte AWS est rattaché à une seule partition.</p> \n<p>L’infrastructure prend en charge toutes les méthodes d’accès AWS standards, y compris la <a href=\"https://console.amazonaws-eusc.eu/\">console de gestion AWS</a>, les <a href=\"https://aws.amazon.com/tools/\">AWS SDKs</a> et la <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a>, ce qui facilite son intégration dans vos flux de travail et vos automatisations existants. Après avoir créé un nouveau compte racine pour la partition AWS European Sovereign Cloud, vous commencez par définir de nouvelles identités et rôles IAM spécifiques à cette infrastructure, vous donnant un contrôle total sur la gestion des accès au sein de l’environnement souverain européen.</p> \n<p><span><strong>Pour commencer<br /> </strong></span>L’AWS European Sovereign Cloud offre aux organisations européennes des contrôles de souveraineté renforcés tout en leur permettant de continuer à bénéficier de l’innovation et des capacités d’AWS. Vous pouvez contractualiser les services via Amazon Web Services EMEA SARL, avec une tarification en euros et une facturation possible dans l’une des <a href=\"https://aws.amazon.com/legal/aws-emea/\">huit devises que nous prenons en charge aujourd’hui</a>. L’infrastructure repose sur une architecture, un portefeuille de services et des API AWS familiers, ce qui simplifie le développement et la migration des applications.</p> \n<p>L’<a href=\"https://aws.eu/de/esca\">avenant AWS European Sovereign Cloud</a> précise les engagements contractuels supplémentaires propres à l’AWS European Sovereign Cloud.</p> \n<p>En tant qu’Européen, ce lancement illustre l’engagement d’AWS à répondre aux besoins spécifiques de notre continent et à fournir les capacités cloud qui stimulent l’innovation dans tous les secteurs. Je vous invite à découvrir l’AWS European Sovereign Cloud et à comprendre comment il peut aider votre organisation à satisfaire ses exigences de souveraineté. Consultez <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/introduction.html\">Overview of the AWS European Sovereign Cloud</a> (en anglais) pour en savoir plus sur les objectifs de conception et l’approche retenue, <a href=\"https://eusc-de-east-1.signin.amazonaws-eusc.eu/signup?request_type=register\">créez un nouveau compte</a> et planifiez dès aujourd’hui le déploiement de votre première charge de travail.</p> \n<a href=\"https://linktr.ee/sebsto\">— seb</a> \n<hr /> \n<h4>Italian version</h4> \n<p><strong>Lancio di AWS European Sovereign Cloud</strong></p> \n<p>Come cittadino europeo, conosco benissimo l’importanza della sovranità digitale, in particolare per le nostre organizzazioni del settore pubblico e dei settori altamente regolamentati. Oggi sono lieto di annunciare che <a href=\"https://aws.eu/\">AWS European Sovereign Cloud</a> è ora generalmente disponibile per tutti i clienti. <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">Abbiamo annunciato per la prima volta i nostri piani per la creazione di questa nuova infrastruttura cloud indipendente nel 2023.</a> Finalmente oggi è pronta a soddisfare i più rigorosi requisiti di sovranità dei clienti europei <a href=\"https://aws.amazon.com/blogs/security/announcing-initial-services-available-in-the-aws-european-sovereign-cloud-backed-by-the-full-power-of-aws/\">con un set completo di servizi AWS</a>.</p> \n<div>\n <a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211.jpeg\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/12/13/AdobeStock_426378211-1024x341.jpeg\" alt=\"Brandenburg Gate\" width=\"1024\" height=\"341\" /></a>\n <p>Berlino, Porta di Brandeburgo al tramonto</p>\n</div> \n<p><strong><u>Soddisfare i requisiti di sovranità europea<br /> </u></strong>Le organizzazioni di tutta Europa devono far fronte a requisiti normativi sempre più complessi in materia di residenza dei dati, controllo operativo e indipendenza della governance. Troppo spesso, le organizzazioni europee con i più elevati requisiti di sovranità sono bloccate a causa di offerte o ambienti on-premises legacy con funzionalità e servizi ridotti. In risposta a questa esigenza fondamentale, l’AWS European Sovereign Cloud rappresenta l’unico cloud sovrano con funzionalità complete e a gestione autonoma. supportato da solidi controlli tecnici, garanzie di sovranità e protezioni legali. Gli enti pubblici e le aziende di settori altamente regolamentati necessitano di un’infrastruttura cloud che fornisca controlli di sovranità avanzati che garantiscano l’innovazione, la sicurezza e l’affidabilità che si aspettano dai moderni servizi cloud. Queste organizzazioni devono essere certe che i propri dati e le proprie operazioni restino sotto la giurisdizione europea, con chiare strutture di governance e autonomia operativa nell’ambito dell’Unione europea (UE).</p> \n<p><strong><u>Una nuova infrastruttura cloud indipendente per l’Europa</u></strong><br /> L’AWS European Sovereign Cloud rappresenta un’infrastruttura cloud separata fisicamente e logicamente, con tutti i componenti situati interamente all’interno dell’UE. La prima <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#region\">Regione AWS</a> nell’AWS European Sovereign Cloud, situata nello stato di Brandeburgo (Germania) e ora disponibile a livello generale, opera indipendentemente dalle Regioni AWS esistenti. L’infrastruttura presenta diverse zone di disponibilità con risorse di alimentazione e rete ridondanti, progettate per funzionare continuamente anche in caso di interruzione della connettività con il resto del mondo.</p> \n<p>Abbiamo intenzione di estendere la presenza dell’AWS European Sovereign Cloud dalla Germania all’intera UE per supportare i rigorosi requisiti di isolamento, residenza dei dati all’interno di un determinato Paese e bassa latenza. Inizieremo con nuove <a href=\"https://docs.aws.amazon.com/local-zones/latest/ug/what-is-aws-local-zones.html\">zone locali</a> sovrane situate in Belgio, nei Paesi Bassi e in Portogallo. Inoltre, sarà possibile estendere l’infrastruttura AWS European Sovereign Cloud con <a href=\"https://aws.amazon.com/dedicatedlocalzones/\">Zone locali AWS dedicate</a>, <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/ai-factories/\">AWS AI Factories</a> o <a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a> in posizioni selezionate, inclusi i data center on-premises.</p> \n<p>L’AWS European Sovereign Cloud e le relative zone locali forniscono controlli sovrani avanzati tramite un modello operativo esclusivo. L’AWS European Sovereign Cloud sarà gestito esclusivamente da residenti UE che si trovano nell’UE. Ciò copre attività come operazioni quotidiane, supporto tecnico e servizio clienti. Stiamo gradualmente trasformando l’AWS European Sovereign Cloud <a href=\"https://www.aboutamazon.eu/news/aws/aws-european-sovereign-cloud-to-be-operated-by-eu-citizens\">in modo che sia gestito esclusivamente da cittadini UE che si trovano nell’UE</a>. Durante questo periodo di transizione, continueremo a lavorare con un team misto di residenti e cittadini comunitari che si trovano nell’UE.</p> \n<p>L’infrastruttura è gestita da entità giuridiche europee dedicate, costituite secondo il diritto tedesco. Nell’ottobre 2025, AWS ha assegnato l’incarico di managing director a <a href=\"https://www.aboutamazon.eu/news/aws/stephane-israel-appointed-to-lead-the-aws-european-sovereign-cloud\">Stéphane Israël</a>, cittadino comunitario residente nell’UE. Sarà responsabile della gestione e delle operazioni dell’AWS European Sovereign Cloud, inclusi infrastruttura, tecnologia e servizi, oltre a guidare le più ampie iniziative di sovranità digitale di AWS. Nel gennaio 2026, AWS ha inoltre nominato managing director dell’AWS European Sovereign Cloud <a href=\"https://www.linkedin.com/in/stefanhoechbaue\">Stefan Höchbauer</a> (vicepresidente, Germania ed Europa centrale, AWS). Collaborerà con Stéphane Israël per guidare l’AWS European Sovereign Cloud.</p> \n<p>Un comitato consultivo composto esclusivamente da cittadini comunitari, inclusi due rappresentanti terzi indipendenti, fornirà ulteriore supervisione e competenza in materia di sovranità.</p> \n<p><strong><u>Ottimizzazione del controllo e della residenza dei dati</u></strong><br /> L’AWS European Sovereign Cloud offre garanzie complete sulla residenza dei dati in modo da poter soddisfare i requisiti più rigorosi in materia. Come per le nostre Regioni AWS esistenti a livello mondiale, tutti i contenuti restano all’interno della Regione selezionata, a meno che non si scelga diversamente. Oltre ai contenuti, anche i metadati creati dai clienti, tra cui ruoli, autorizzazioni, etichette delle risorse e configurazioni, restano nell’ambito dell’UE. L’infrastruttura è dotata di un proprio sistema <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (AWS IAM)</a> e di fatturazione dedicato, completamente gestito in modo indipendente all’interno dei confini europei.</p> \n<p>I controlli tecnici integrati nell’infrastruttura <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/design-goals.html\">impediscono l’accesso all’AWS European Sovereign Cloud dall’esterno dell’UE</a>. L’infrastruttura include <a href=\"https://aws.amazon.com/blogs/security/establishing-a-european-trust-service-provider-for-the-aws-european-sovereign-cloud/\">un provider di servizi fiduciari europeo dedicato per le operazioni delle autorità di certificazione</a> e utilizza nameserver <a href=\"https://aws.amazon.com/route53/\">Amazon Route 53</a> dedicati. Questi server utilizzeranno solo <a href=\"https://aws.eu/faq/#operational-autonomy\">domini di primo livello (TLD) europei per i propri nomi</a>. L’AWS European Sovereign Cloud non ha dipendenze fondamentali da personale o infrastrutture non UE.</p> \n<p><strong><u>Framework di sicurezza e conformità<br /> </u></strong>L’AWS European Sovereign Cloud mantiene le stesse funzionalità di sicurezza di base di AWS, tra cui crittografia, gestione delle chiavi, governance degli accessi e <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> per l’isolamento computazionale. Ciò significa che le istanze EC2 beneficiano dell’integrità della piattaforma verificata a livello di crittografia e dei limiti imposti dall’hardware che impediscono l’accesso non autorizzato ai dati senza compromettere le prestazioni, offrendo i controlli di sovranità e la potenza di calcolo richiesti dai carichi di lavoro. L’infrastruttura è sottoposta ad <a href=\"https://aws.amazon.com/blogs/compute/aws-nitro-system-gets-independent-affirmation-of-its-confidential-compute-capabilities/\">audit di terze parti indipendenti</a>, con programmi di conformità che includono ISO/IEC 27001:2013, report SOC 1/2/3 e attestazione C5 dell’<a href=\"https://www.bsi.bund.de/EN/Home/home_node.html\">Ufficio Federale per la Sicurezza Informatica (BSI)</a>.</p> \n<p>L’<a href=\"https://aws.amazon.com/blogs/security/exploring-the-new-aws-european-sovereign-cloud-sovereign-reference-framework/\">AWS European Sovereign Cloud: Sovereign Reference Framework</a> definisce i controlli di sovranità specifici in termini di indipendenza della governance, controllo operativo, residenza dei dati e isolamento tecnico. Questo framework è disponibile in <a href=\"https://aws.amazon.com/artifact/\">AWS Artifact</a> e fornisce visibilità end-to-end tramite l’attestazione SOC 2.</p> \n<p><strong><u>Disponibilità completa del servizio<br /> </u></strong>Dal momento del lancio, sarà possibile accedere a un’ampia gamma di servizi AWS nell’AWS European Sovereign Cloud, tra cui <a href=\"https://aws.amazon.com/sagemaker/\">Amazon SageMaker</a> e <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock</a> per carichi di lavoro di intelligenza artificiale e machine learning (IA/ML). Per i calcoli, è possibile utilizzare <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> e <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>. L’orchestrazione di container è disponibile tramite <a href=\"https://aws.amazon.com/eks/\">Amazon Elastic Kubernetes Service (Amazon EKS)</a> e <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service (Amazon ECS)</a>. I servizi di database includono <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora</a>, <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a> e <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a>. Le opzioni di storage includono <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> e <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a>, con connessione in rete tramite <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (Amazon VPC)</a> e servizi di sicurezza tra cui <a href=\"https://aws.amazon.com/kms/\">Servizio AWS di gestione delle chiavi (AWS KMS)</a> e <a href=\"https://aws.amazon.com/private-ca/\">Autorità di certificazione privata AWS (AWS Private CA)</a>. Per un elenco aggiornato dei servizi, è possibile consultare l’<a href=\"https://builder.aws.com/build/capabilities/explore?f=eJyrVipOzUlNLklNCUpNz8zPK1ayUoqOUUotLU7WTUnVTU0sLtE1jFGKVdKBK3QsS8zMSUzKzMksqQSqdsyrVEARqgUA4l8dog&amp;tab=service-feature\">elenco delle funzionalità AWS</a> pubblicato di recente su AWS Builder Center.</p> \n<p>L’AWS European Sovereign Cloud è <a href=\"https://aws.amazon.com/blogs/apn/range-of-aws-partner-solutions-set-to-launch-on-the-aws-european-sovereign-cloud/\">supportato dai partner AWS</a>, che aiutano a soddisfare i propri requisiti di sovranità. Partner come Adobe, Cisco, Cloudera, Dedalus, Esri, Genesys, GitLab, Mendix, Pega, SAP, SnowFlake, Trend Micro e Wiz stanno rendendo disponibili le loro soluzioni nell’AWS European Sovereign Cloud, fornendo gli strumenti e i servizi necessari per la sicurezza, l’analisi dei dati, lo sviluppo di applicazioni e i carichi di lavoro specifici del settore. Questo ampio supporto dei partner aiuta a creare soluzioni sovrane che combinano i servizi AWS con tecnologie di partner affidabili.</p> \n<p><strong><u>Investimenti significativi nelle infrastrutture europee<br /> </u></strong>L’AWS European Sovereign Cloud è sostenuto da un investimento di 7,8 miliardi di euro destinati a infrastrutture, creazione di posti di lavoro e sviluppo delle competenze. Si prevede che questo investimento contribuirà con 17,2 miliardi di euro all’economia europea fino al 2040 e sosterrà circa 2.800 posti di lavoro equivalenti a tempo pieno all’anno nelle aziende locali.</p> \n<p><strong><u>Alcuni dettagli tecnici<br /> </u></strong>L’AWS European Sovereign Cloud è disponibile per tutti i clienti, indipendentemente da dove si trovino. È possibile accedere all’infrastruttura utilizzando il nome della <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/reference-arns.html\">partizione</a> aws-eusc e il nome della Regione eusc-de-east-1. Una partizione è un gruppo di Regioni AWS. Ogni account AWS è associato a una partizione.</p> \n<p>L’infrastruttura supporta tutti i metodi di accesso AWS standard, tra cui la <a href=\"https://console.amazonaws-eusc.eu/\">Console di gestione AWS</a>, gli <a href=\"https://aws.amazon.com/tools/\">SDK AWS</a> e l’<a href=\"https://aws.amazon.com/cli/\">interfaccia della linea di comando AWS (AWS CLI)</a>, semplificando l’integrazione nell’automazione e nei flussi di lavoro esistenti. Dopo aver creato un nuovo account root per la partizione Di AWS European Sovereign Cloud, si inizia creando nuove identità e ruoli IAM specifici per questa infrastruttura, che consentiranno di avere il controllo completo sulla gestione degli accessi all’interno dell’ambiente sovrano europeo.</p> \n<p><strong><u>Nozioni di base<br /> </u></strong>L’AWS European Sovereign Cloud fornisce alle organizzazioni europee controlli di sovranità avanzati pur mantenendo l’accesso all’innovazione e alle funzionalità di AWS. È possibile contrattare servizi tramite Amazon Web Services EMEA SARL, con prezzi in EUR e fatturazione in una <a href=\"https://aws.amazon.com/legal/aws-emea/\">delle otto valute supportate oggi</a>. L’infrastruttura utilizza l’architettura AWS, il portafoglio di servizi e le API tradizionali, semplificando la creazione e la migrazione delle applicazioni.</p> \n<p>L’<a href=\"https://aws.eu/de/esca\">addendum di AWS European Sovereign Cloud</a> include gli impegni contrattuali aggiuntivi per l’AWS European Sovereign Cloud.</p> \n<p>Per me come europeo, questo lancio rappresenta l’impegno di AWS per soddisfare le esigenze specifiche del nostro continente e fornire le funzionalità cloud che guidano l’innovazione in tutti i settori. Invito tutti a scoprire di più sull’AWS European Sovereign Cloud e su come può aiutare le organizzazioni a soddisfare i requisiti di sovranità. Nella <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/introduction.html\">Panoramica di AWS European Sovereign Cloud</a> sono disponibili maggiori informazioni sugli obiettivi e sull’approccio di progettazione, <a href=\"https://eusc-de-east-1.signin.amazonaws-eusc.eu/signup?request_type=register\">creare un nuovo account </a> e pianificare l’implementazione del primo carico di lavoro oggi stesso.</p> \n<p><a href=\"https://linktr.ee/sebsto\">— seb</a></p> \n<hr /> \n<h4>Spanish version</h4> \n<p><strong>Apertura de AWS European Sovereign Cloud</strong></p> \n<p>Como ciudadano europeo, comprendo de primera mano la importancia de la soberanía digital, especialmente para las organizaciones de nuestro sector público y las industrias altamente reguladas. Hoy me complace anunciar que la <a href=\"https://aws.eu/\">AWS European Sovereign Cloud</a> ya está disponible de forma generalizada para todos los clientes. <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">Anunciamos por primera vez nuestros planes de crear esta nueva infraestructura de nube independiente en 2023</a>, y hoy está lista para cumplir los requisitos de soberanía más estrictos de los clientes europeos <a href=\"https://aws.amazon.com/blogs/security/announcing-initial-services-available-in-the-aws-european-sovereign-cloud-backed-by-the-full-power-of-aws/\">con un exhaustivo conjunto de servicios de AWS</a>.</p> \n<p>Berlín, Puerta de Brandeburgo al atardecer</p> \n<p><strong><u>Cumplimiento de los requisitos de soberanía europeos<br /> </u></strong>Las organizaciones de toda Europa se enfrentan a unos requisitos normativos cada vez más complejos en relación con la residencia de los datos, el control operativo y la independencia de la gobernanza. Hoy en día, con demasiada frecuencia, las organizaciones europeas con los requisitos de soberanía más estrictos se ven atrapadas en entornos locales heredados u ofertas con servicios y funcionalidades reducidos. En respuesta a esta necesidad crítica, la AWS European Sovereign Cloud es la única nube soberana independiente con todas las características que está respaldada por sólidos controles técnicos, garantías de soberanía y protecciones legales. Las entidades del sector público y las empresas de industrias altamente reguladas necesitan una infraestructura en la nube que proporcione controles de soberanía mejorados que mantengan la innovación, la seguridad y la fiabilidad que se esperan de los servicios modernos en la nube. Estas organizaciones necesitan la garantía de que sus datos y operaciones permanecen bajo la jurisdicción europea, con estructuras de gobernanza claras y autonomía operativa dentro de la Unión Europea (UE).</p> \n<p><strong><u>Una nueva infraestructura de nube independiente para Europa</u></strong><br /> La AWS European Sovereign Cloud es una infraestructura de nube separada de manera física y lógica, en la que todos los componentes están ubicados íntegramente dentro de la UE. La primera <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#region\">región de AWS</a> de la AWS European Sovereign Cloud se encuentra en el estado de Brandeburgo (Alemania) y ya está disponible para el público en general. Esta región opera de forma independiente de las regiones de AWS existentes. La infraestructura cuenta con varias zonas de disponibilidad con fuentes de alimenacion y redes redundantes, diseñadas para funcionar de forma continua incluso si se interrumpe la conectividad con el resto del mundo.</p> \n<p>Tenemos previsto ampliar la presencia de la AWS European Sovereign Cloud de Alemania a toda la UE para cumplir los requisitos de aismlamiento estrictos, residencia de los datos dentro del país y baja latencia. Esto comenzará con nuevas <a href=\"https://docs.aws.amazon.com/local-zones/latest/ug/what-is-aws-local-zones.html\">zonas locales</a> soberanas ubicadas en Bélgica, los Países Bajos y Portugal. Además, podrá ampliar la infraestructura de la AWS European Sovereign Cloud con <a href=\"https://aws.amazon.com/dedicatedlocalzones/\">zonas locales dedicadas de AWS</a>, <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/ai-factories/\">AWS AI Factories</a> o <a href=\"https://aws.amazon.com/outposts/\">AWS Outposts</a> en las ubicaciones que elija, incluidos sus propios centros de datos locales.</p> \n<p>La AWS European Sovereign Cloud y sus zonas locales proporcionan controles soberanos mejorados a través de su modelo operativo único. La AWS European Sovereign Cloud será operada exclusivamente por residentes de la UE ubicados en la UE. Abarca actividades como las operaciones diarias, la asistencia técnica y el servicio de atención al cliente. Estamos realizando una transición gradual de la AWS European Sovereign Cloud para que <a href=\"https://www.aboutamazon.eu/news/aws/aws-european-sovereign-cloud-to-be-operated-by-eu-citizens\">se opere exclusivamente por ciudadanos de la UE ubicados en la UE</a>. Durante este período de transición, seguiremos trabajando con un equipo mixto de residentes de la UE y ciudadanos de la UE ubicados en la UE.</p> \n<p>La infraestructura se administra a través de entidades jurídicas europeas especializadas constituidas en el marco de la legislación alemana. En octubre de 2025, AWS nombró director general a <a href=\"https://www.aboutamazon.eu/news/aws/stephane-israel-appointed-to-lead-the-aws-european-sovereign-cloud\">Stéphane Israël</a>, ciudadano de la UE que reside en la UE. Stéphane será responsable de la administración y las operaciones de la AWS European Sovereign Cloud, lo que incluye la infraestructura, la tecnología y los servicios, además de liderar los esfuerzos más amplios de AWS en materia de soberanía digital. En enero de 2026, AWS también nombró a <a href=\"https://www.linkedin.com/in/stefanhoechbaue\">Stefan Hoechbauer</a> (vicepresidente de AWS para Alemania y Europa Central) director general de la AWS European Sovereign Cloud. Stefan dirigirá la AWS European Sovereign Cloud junto con Stéphane Israël.</p> \n<p>Un consejo consultivo compuesto exclusivamente por ciudadanos de la UE, que incluye a dos representantes independientes externos, proporciona supervisión y experiencia adicional en materia de soberanía.</p> \n<p><strong><u>Mejor control y residencia de datos</u></strong><br /> La AWS European Sovereign Cloud ofrece amplias garantías de residencia de datos para que pueda cumplir los requisitos más estrictos en materia de residencia de datos. Al igual que ocurre con nuestras regiones de AWS existentes en todo el mundo, todo el contenido permanece dentro la región que elija, a menos que decida lo contrario. Además del contenido, los metadatos creados por los clientes, incluidos los roles, los permisos, las etiquetas de recursos y las configuraciones, también permanecen dentro de la UE. La infraestructura cuenta con su propio sistema dedicado de <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (AWS IAM)</a> y facturación, que funciona de forma independiente dentro de las fronteras europeas.</p> \n<p>Los controles técnicos integrados en la infraestructura <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/design-goals.html\">impiden el acceso a la AWS European Sovereign Cloud desde fuera de la UE</a>. La infraestructura incluye <a href=\"https://aws.amazon.com/blogs/security/establishing-a-european-trust-service-provider-for-the-aws-european-sovereign-cloud/\">un proveedor de servicios de confianza europeo dedicado para las operaciones de las autoridades de certificación</a> y utiliza servidores de nombres de <a href=\"https://aws.amazon.com/route53/\">Amazon Route 53</a> dedicados. Estos servidores solo usarán<a href=\"https://aws.eu/faq/#operational-autonomy\"> dominios de nivel superior europeos para sus propios nombres</a>. La AWS European Sovereign Cloud no tiene dependencias críticas de personal o infraestructura fuera de la UE.</p> \n<p><strong><u>Marco de seguridad y cumplimiento<br /> </u></strong>La AWS European Sovereign Cloud mantiene las mismas capacidades de seguridad básicas que cabe esperar de AWS, como el cifrado, la administración de claves, la gobernanza del acceso y <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> para el aislamiento de la computación. Esto significa que sus instancias de EC2 se benefician de la integridad de la plataforma verificada criptográficamente y de los límites impuestos por el hardware que impiden el acceso no autorizado a sus datos sin comprometer el rendimiento, lo que le proporciona tanto los controles de soberanía como la potencia computacional que requieren sus cargas de trabajo. La infraestructura se somete a <a href=\"https://aws.amazon.com/blogs/compute/aws-nitro-system-gets-independent-affirmation-of-its-confidential-compute-capabilities/\">auditorías independientes externas</a>, con programas de cumplimiento que incluyen la norma ISO/IEC 27001:2013, informes SOC 1/2/3 y la certificación C5 de la <a href=\"https://www.bsi.bund.de/EN/Home/home_node.html\">Oficina Federal de Seguridad de la Información</a>.</p> \n<p>El <a href=\"https://aws.amazon.com/blogs/security/exploring-the-new-aws-european-sovereign-cloud-sovereign-reference-framework/\">marco de referencia de soberanía de la AWS European Sovereign Cloud</a> define los controles de soberanía específicos en relación con la independencia de la gobernanza, el control operativo, la residencia de datos y el aislamiento técnico. Este marco está disponible en <a href=\"https://aws.amazon.com/artifact/\">AWS Artifact</a> y proporciona visibilidad total a través de la certificación SOC 2.</p> \n<p><strong><u>Disponibilidad total del servicio<br /> </u></strong>Puede acceder a una amplia variedad de servicios de AWS en la AWS European Sovereign Cloud desde su lanzamiento, incluidos <a href=\"https://aws.amazon.com/sagemaker/\">Amazon SageMaker</a> y <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock</a> para cargas de trabajo de inteligencia artificial y machine learning. Para el procesamiento, puede usar <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> y <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a>. La orquestación de contenedores está disponible a través de <a href=\"https://aws.amazon.com/eks/\">Amazon Elastic Kubernetes Service (Amazon EKS)</a> y <a href=\"https://aws.amazon.com/ecs/\">Amazon Elastic Container Service (Amazon ECS)</a>. Los servicios de bases de datos incluyen <a href=\"https://aws.amazon.com/rds/aurora/\">Amazon Aurora</a>, <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a> y <a href=\"https://aws.amazon.com/rds/\">Amazon Relational Database Service (Amazon RDS)</a>. Dispone de opciones de almacenamiento como <a href=\"https://aws.amazon.com/s3/\">Amazon Simple Storage Service (Amazon S3)</a> y <a href=\"https://aws.amazon.com/ebs/\">Amazon Elastic Block Store (Amazon EBS)</a>, con redes a través de <a href=\"https://aws.amazon.com/vpc/\">Amazon Virtual Private Cloud (Amazon VPC)</a> y servicios de seguridad como <a href=\"https://aws.amazon.com/kms/\">AWS Key Management Service (AWS KMS)</a> y <a href=\"https://aws.amazon.com/private-ca/\">AWS Private Certificate Authority</a>. Para obtener una lista actualizada de los servicios, consulte la <a href=\"https://builder.aws.com/build/capabilities/explore?f=eJyrVipOzUlNLklNCUpNz8zPK1ayUoqOUUotLU7WTUnVTU0sLtE1jFGKVdKBK3QsS8zMSUzKzMksqQSqdsyrVEARqgUA4l8dog&amp;tab=service-feature\">matriz de capacidades de AWS</a> que se ha publicado recientemente en AWS Builder Center.</p> \n<p>La AWS European Sovereign Cloud <a href=\"https://aws.amazon.com/blogs/apn/range-of-aws-partner-solutions-set-to-launch-on-the-aws-european-sovereign-cloud/\">cuenta con el respaldo de los socios de AWS</a>, que se comprometen a ayudarle a cumplir sus requisitos de soberanía. Socios como Adobe, Cisco, Cloudera, Dedalus, Esri, Genesys, GitLab, Mendix, Pega, SAP, SnowFlake, Trend Micro y Wiz ofrecen sus soluciones en la AWS European Sovereign Cloud, lo que le proporciona las herramientas y los servicios que necesita en materia de seguridad, análisis de datos, desarrollo de aplicaciones y cargas de trabajo específicas del sector. Este amplio apoyo de los socios le ayuda a crear soluciones soberanas que combinan los servicios de AWS con tecnologías de socios de confianza.</p> \n<p><strong><u>Inversión importante. en la infraestructura europea<br /> </u></strong>La AWS European Sovereign Cloud está respaldada por una inversión de 7.800 millones de EUR en infraestructura, creación de empleo y desarrollo de habilidades. Se espera que esta inversión aporte 17.200 millones de EUR a la economía europea para 2040 y ayude a crear el equivalente a aproximadamente 2.800 puestos de trabajo a tiempo completo por año en empresas locales.</p> \n<p><strong><u>Algunos detalles técnicos<br /> </u></strong>La AWS European Sovereign Cloud está disponible para todos los clientes, independientemente de dónde se encuentren. Puede acceder a la infraestructura utilizando el nombre de <a href=\"https://docs.aws.amazon.com/IAM/latest/UserGuide/reference-arns.html\">partición</a> aws-eusc y el nombre de región eusc-de-east-1. Una partición es un grupo de regiones de AWS. Cada cuenta de AWS tiene limitado su alcance a una sola partición.</p> \n<p>La infraestructura admite todos los métodos de acceso estándar de AWS, como la <a href=\"https://console.amazonaws-eusc.eu/\">Consola de administración de AWS</a>, los <a href=\"https://aws.amazon.com/tools/\">AWS SDK</a> y la <a href=\"https://aws.amazon.com/cli/\">Interfaz de la línea de comandos de AWS (AWS CLI)</a>, lo que facilita la integración en sus flujos de trabajo y automatización existentes. Tras crear una nueva cuenta raíz para la partición de la AWS European Sovereign Cloud, primero deberá crear nuevas identidades y roles de IAM específicos para esta infraestructura, lo que le permitirá tener un control total sobre la administración del acceso en el entorno soberano europeo.</p> \n<p><strong><u>Cómo empezar<br /> </u></strong>La AWS European Sovereign Cloud proporciona a las organizaciones europeas controles de soberanía mejorados, al tiempo que mantiene el acceso a la innovación y las capacidades de AWS. Puede contratar los servicios a través de Amazon Web Services EMEA SARL, con precios en EUR y facturación en cualquiera de <a href=\"https://aws.amazon.com/legal/aws-emea/\">las ocho divisas que admitimos actualmente</a>. La infraestructura utiliza la arquitectura, la cartera de servicios y las API habituales de AWS, lo que facilita la creación y la migración de aplicaciones.</p> \n<p>La <a href=\"https://aws.eu/de/esca\">adenda de la AWS European Sovereign Cloud</a> contiene los compromisos contractuales adicionales para la AWS European Sovereign Cloud.</p> \n<p>Para mí, como europeo, este lanzamiento representa el compromiso de AWS de satisfacer las necesidades específicas de nuestro continente y proporcionar las capacidades en la nube que impulsan la innovación en todos los sectores. Le invito a descubrir más sobre la AWS European Sovereign Cloud y cómo puede ayudar a su organización a cumplir sus requisitos de soberanía. Lea la <a href=\"https://docs.aws.amazon.com/whitepapers/latest/overview-aws-european-sovereign-cloud/introduction.html\">descripción general de la AWS European Sovereign Cloud</a> para obtener más información sobre los objetivos y el enfoque del diseño, <a href=\"https://eusc-de-east-1.signin.amazonaws-eusc.eu/signup?request_type=register\">regístrese para obtener una nueva cuenta</a> y planifique hoy mismo el despliegue de su primera carga de trabajo.</p> \n<p><a href=\"https://linktr.ee/sebsto\">— seb</a></p>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"1e70eb0b1eaf537b26bb19596d6074f1ec95b2093dc843adababcb640160b44f","category":"Tech"}