{"title":"macOS 26.3 might have just spilled Apple’s biggest March 4 secrets","link":"https://www.macworld.com/article/3066403/macos-26-3-might-have-just-confirmed-apples-biggest-march-4-surprises.html","date":1771594020000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As we have extensively covered, Apple is rumored to soon introduce new products, as the company recently confirmed a <a href=\"https://www.macworld.com/article/3064717/apples-march-event-might-bring-several-days-of-surprises.html\">special announcement for March 4</a>. Among the expected products are a low-cost MacBook and a new generation of Studio Display.</p>\n\n\n\n<p>If you needed more evidence that these products will soon be arriving in stores, here’s proof from Apple itself. Code from macOS 26.3, released last week to the public, confirms the existence of such devices.</p>\n\n\n\n<p>As discovered by Macworld, the final build of <a href=\"https://www.macworld.com/article/3056433/ios-26-3-is-here-with-a-focus-on-switchers-and-stalking-check-out-whats-new.html\">macOS 26.3</a> released to the public on February 11 includes kernel extensions (kexts) for three new devices identified as J700, J427, and J527. The codenames match previous reports, including those based on an internal build of iOS 26 leaked last year.</p>\n\n\n\n<h2>Low-cost MacBook essentially confirmed</h2>\n\n\n\n<p>J700 is the codename for the rumored new low-cost MacBook. This Mac is expected to be priced lower than the current MacBook Air, and will be the first Apple silicon Mac to be powered by an A-series chip instead of an M-series one.</p>\n\n\n\n<p>More specifically, the new entry-level MacBook will reportedly have the same A18 Pro chip as the iPhone 16 Pro models. Benchmark tests show that the A18 Pro performs slightly better than the M1, which is good enough for most casual users who will be the target audience for this new laptop.</p>\n\n\n\n<p>More recently, <a href=\"https://www.macworld.com/article/3061517/low-cost-macbook-in-fun-colors-leads-flurry-of-upcoming-mac-releases.html\">Bloomberg’s Mark Gurman reported</a> that the laptop will have a display that’s slightly under 13 inches and will be made of aluminum, despite its lower price. Some analysts believe it will cost as low as $599, but a price between $699 and $799 is more likely.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2025/12/Apple-Studio-Display-4.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Studio Display on a desk\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>Apple’s Studio Display is nearly four years old and in need of an update.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Studio Display 2 may have an extra surprise</h2>\n\n\n\n<p>In addition to the highly anticipated MacBook, macOS 26.3 includes drivers for two other unreleased devices: J427 and J527, both variants of a new generation of Studio Display.</p>\n\n\n\n<p>As Macworld <a href=\"https://www.macworld.com/article/3007295/apple-studio-display-2-leak-reveals-promotion-hdr-a19-chip-upgrades.html\">previously reported</a>, an internal build of iOS 26 revealed that Studio Display 2 is expected to have significant improvements, including ProMotion with a 120Hz refresh rate and HDR support. The new display is also expected to have an A19 chip inside to handle smart features such as Spatial Audio and webcam image processing.</p>\n\n\n\n<p>But perhaps the most intriguing aspect here is the existence of not one, but two new displays. The differences between the two models are unclear, but the two most likely scenarios are either a larger screen size option, or a lower-end version with fewer features  </p>\n\n\n\n<h2>What about other Macs?</h2>\n\n\n\n<p>Based on the latest rumors, Apple has also been working on new <a href=\"https://www.macworld.com/article/2942089/macbook-pro-m5-pro-max-release-specs-price.html\">MacBook Pro models with higher-end versions of the M5 chip</a> and a <a href=\"https://www.macworld.com/article/2655094/m5-macbook-air-design-display-specs-release-price.html\">MacBook Air refresh</a>, as well as a <a href=\"https://www.macworld.com/article/2973459/2026-mac-studio-what-we-know-about-the-upcoming-m5-update.html\">new generation of Mac Studio</a>. However, these models are not referenced in macOS 26.3.</p>\n\n\n\n<p>This doesn’t mean they won’t be released next month, as Apple could simply roll out a new 26.3.1 build specifically for these machines. Still, the fact that macOS 26.3 supports at least the new MacBook and Studio Display strongly suggests that these products will arrive sooner than later.</p>\n\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"1f868884ca37bfdf614e962732e80496b4ac7c9b558ae5e938893761fb949835","category":"Apple"}