{"title":"‘Excited, motivated, calm’ and on the scoreboard - Jonathan Milan and the sprinter’s need for an early win","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/excited-motivated-calm-and-on-the-scoreboard-jonathan-milan-and-the-sprinter-s-need-for-an-early-win","date":1769529536000,"content":"\n      <p><span>For cycling’s best sprinters, confidence comes from winning, the more wins the better — and earlier in the season, even better. It’s one of the main reasons why sprinters opt to go to the Middle Eastern races in the early part of the year — these races offer the opportunity to get accustomed to racing again after the off season, to establish or re-establish relationships with their leadout riders, and most importantly allow them to grab their first victory. </span></p>\n<p><span>That is certainly the case for one of the world’s best, Jonathan Milan (Lidl-Trek), winner of last year’s green jersey at the </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\"><span>Tour de France</span></a><span>, who was itching to be back racing his bike before the start of the AlUla Tour.</span></p>\n<p><span>“Finally we are back in the races. I’m pretty excited, motivated and calm,” Milan said before the start of the five-day stage race in Saudi Arabia, Milan said: “The AlUla Tour has a lot of opportunities for us sprinters, of course, but it also lets you have a bit of fun with some missions, maybe in the wind.”</span></p>\n<p><span>The Italian was correct in his assessment of how these desert races can pan out, as he won stage one from a splinter group which formed in the crosswinds on the way to the AlUla Camel Cup Track. And so 2026 couldn’t have started better for the rider from Buja, in the Udine province of Italy.</span></p>\n<p><span>“I’m super happy to start this season in a really good way,” said Milan after the stage. Despite his calm demeanour before the race, he knows that the first win is the nerve-settler, especially for a rider who is used to wracking up annual wins in the double-digits — the longer it takes to nab the first one, the more anxious a sprinter can become. Hence the desire to start things off as they wish to carry on. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_5_1024x1024.png?v=1769528792\" alt=\"\" /></div>\n<p><span></span><em>Jonathan Milan made the front group in the crosswinds on stage one of the AlUla Tour (Image: ASO)</em></p>\n<p><span>If things continue in the same trajectory for the 25-year-old, 2026 could be his best yet. But Milan was coy about his ambitions for the year.</span></p>\n<p><span>“The first goal is always to have fun, to keep riding like we did in the last few years, to keep improving, to keep winning. To reach the highest level that we can. I think for the beginning of the season, there will be real focus on the sprints here in AlUla, but then I would like to do well in the Classics,” said Milan.</span></p>\n<p><span>Back in 2024, Milan told </span><span><em>Rouleur</em> </span><span>his dream races were </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2024-everything-you-need-to-know\"><span>Milan-Sanremo</span></a><span> and </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\"><span>Paris-Roubaix</span></a><span> — the latter is not the conventional choice for a sprinter, especially one with a background on the wooden boards of the velodrome (he was part of the gold medal-winning Italian Team Pursuit at the Tokyo 2020 Olympics) rather than the cobbles of northern Europe. Grand Tour stages and points jerseys are more commonplace on a sprinter’s wishlist. But after a couple of seasons at the very top of the sport, which did indeed include Tour and </span><a href=\"https://www.rouleur.cc/pages/giro-ditalia\"><span>Giro d’Italia</span></a><span> points jerseys and stage wins, are Sanremo and Roubaix still his dream races? </span></p>\n<p><span>Milan smiles and nods with intention. Roubaix has always been its own beast, but Sanremo, once dubbed the ‘Sprinters’ Monument’ — won by the likes of Mark Cavendish — has for the last decade been animated by puncheurs like Julian Alaphilippe, Classics riders like Mathieu van der Poel and the undefinable Tadej Pogačar. The last time a pure sprinter won came 10 years ago when Arnaud Démare took the spoils. In 2024, one of Milan’s challengers for cycling’s sprinter crown, Jasper Philipsen took victory, and in doing so cemented the new style of sprinter: one who can challenge over all sorts of terrain, something which Milan is hoping to emulate. </span></p>\n<p><span>But even still Sanremo will always be in the balance for a rider like Milan, something which he is aware of.</span></p>\n<p><span>“You know how it went also last year (when Pogačar attacked on the Cipressa and only Van der Poel and Filippo Ganna could follow). For me, the little step that I'm trying to find here is to arrive on the top of the Poggio with maybe the first bunch, or in the first 20 riders. But you have to be realistic. I think the guys from UAE will do a big pace already in the Capi (the trio of climbs that precede the Cipressa: Mele, Cervo, Berta),” said Milan.</span></p>\n<p><span>The Lidl-Trek rider also told </span><span><em>Rouleur</em> </span><span>that he is a rider who likes to have multiple targets.</span></p>\n<p><span>“Of course, I cannot just focus on Sanremo because for me, the big goal of the year is to be as consistent as I can,” said Milan. </span></p>\n<p><span>So, what about the obvious, that flat finish to Burgas in Bulgaria on stage one of the Giro, and the chance to claim the race’s first </span><span>maglia rosa</span><span>?</span></p>\n<p><span>“That, of course, is 100% a big dream for anyone. So that's also another goal. We will try our best to be in the best shape for the first stage of Giro.”</span></p>\n<p>Milan may be built in the ilk of a 2020s sprinter, not satisfied with just winning bunch sprints and not afraid to try his hand at the more challenging <em>parcours</em>, but he shares in an experience that sprinters of all cycling’s eras know well: winning in January is a good thing.</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"1fef1e56fa0e6ebfafc03fbf7a0e9f2f72aa66f4bfb9c6e18adc865007fe5ad7","category":"Cycling"}