{"title":"AWS Weekly Roundup: Amazon EC2 G7e instances, Amazon Corretto updates, and more (January 26, 2026)","link":"https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ec2-g7e-instances-with-nvidia-blackwell-gpus-january-26-2026/","date":1769444746000,"content":"<p>Hey! It’s my first post for 2026, and I’m writing to you while watching our driveway getting dug out. I hope wherever you are you are safe and warm and your data is still flowing!</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/26/IMG_0652-1024x676.jpg\" alt=\"Our driveway getting snow plowed\" width=\"1024\" height=\"676\" /></p> \n<p>This week brings exciting news for customers running GPU-intensive workloads, with the launch of our newest graphics and AI inference instances powered by NVIDIA’s latest Blackwell architecture. Along with several service enhancements and regional expansions, this week’s updates continue to expand the capabilities available to AWS customers.</p> \n<p><span><strong>Last week’s launches<br /> </strong></span>I thought these projects, blog posts, and news items were also interesting:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/blogs/aws/announcing-amazon-ec2-g7e-instances-accelerated-by-nvidia-rtx-pro-6000-blackwell-server-edition-gpus/\">Amazon EC2 G7e instances are now generally available</a> — The new G7e instances accelerated by NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs deliver up to 2.3 times better inference performance compared to G6e instances. With two times the GPU memory and support for up to 8 GPUs providing 768 GB of total GPU memory, these instances enable running medium-sized models of up to 70B parameters with FP8 precision on a single GPU. G7e instances are ideal for generative AI inference, spatial computing, and scientific computing workloads. Available now in US East (N. Virginia) and US East (Ohio).</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-corretto-january-2026-quarterly-updates/\">Amazon Corretto January 2026 Quarterly Updates</a> — AWS released quarterly security and critical updates for Amazon Corretto Long-Term Supported (LTS) versions of OpenJDK. Corretto 25.0.2, 21.0.10, 17.0.18, 11.0.30, and 8u482 are now available, ensuring Java developers have access to the latest security patches and performance improvements.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-ecr-cross-repository-layer-sharing/\">Amazon ECR now supports cross-repository layer sharing</a> — Amazon Elastic Container Registry now enables you to share common image layers across repositories through blob mounting. This feature helps you achieve faster image pushes by reusing existing layers and reduce storage costs by storing common layers once and referencing them across repositories.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-cloudwatch-database-insights-on-demand-analysis-available-additional-regions/\">Amazon CloudWatch Database Insights expands to four additional regions</a> — CloudWatch Database Insights on-demand analysis is now available in Asia Pacific (New Zealand), Asia Pacific (Taipei), Asia Pacific (Thailand), and Mexico (Central). This feature uses machine learning to help identify performance bottlenecks and provides specific remediation advice.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-connect-conditional-logic-real-time-updates-step-by-step-guides/\">Amazon Connect adds conditional logic and real-time updates to Step-by-Step Guides</a> — Amazon Connect Step-by-Step Guides now enables managers to build dynamic guided experiences that adapt based on user interactions. Managers can configure conditional user interfaces with dropdown menus that show or hide fields, change default values, or adjust required fields based on prior inputs. The feature also supports automatic data refresh from Connect resources, ensuring agents always work with current information.</li> \n</ul> \n<p>For a full list of AWS announcements, be sure to keep an eye on the <a href=\"https://aws.amazon.com/new/?trk=769a1a2b-8c19-4976-9c45-b6b1226c7d20&amp;sc_channel=el\">What’s New with AWS?</a> page.</p> \n<p><span><strong>Upcoming AWS events<br /> </strong></span>Keep a look out and be sure to sign up for these upcoming events:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/best-of-reinvent/\">Best of AWS re:Invent</a> (January 28-29, Virtual) — Join us for this free virtual event bringing you the most impactful announcements and top sessions from AWS re:Invent. AWS VP and Chief Evangelist Jeff Barr will share highlights during the opening session. Sessions run January 28 at 9:00 AM PT for AMER, and January 29 at 9:00 AM SGT for APJ and 9:00 AM CET for EMEA. Register to access curated technical learning, strategic insights from AWS leaders, and live Q&amp;A with AWS experts.</li> \n <li><a href=\"https://awsahmedabad.community/\">AWS Community Day Ahmedabad</a> (February 28, 2026, Ahmedabad, India) — The 11th edition of this community-driven AWS conference brings together cloud professionals, developers, architects, and students for expert-led technical sessions, real-world use cases, tech expo booths with live demos, and networking opportunities. This free event includes breakfast, lunch, and exclusive swag.</li> \n</ul> \n<p>Join the <a href=\"https://builder.aws.com\">AWS Builder Center</a> to learn, build, and connect with builders in the AWS community. Browse for upcoming in-person and virtual developer-focused events in your area.</p> \n<hr /> \n<p>That’s all for this week. Check back next Monday for another Weekly Roundup!</p> \n<p>~ micah</p>","author":"Micah Walter","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"20776c2eea5301bd92f15a1569b9e3711eff5d40259d832ae1c4b5e1ef15d3ef","category":"Tech"}