{"title":"AI In UX: Achieve More With Less","link":"https://smashingmagazine.com/2025/10/ai-ux-achieve-more-with-less/","date":1760688000000,"content":"<p>I have made a lot of mistakes with AI over the past couple of years. I have wasted hours trying to get it to do things it simply cannot do. I have fed it terrible prompts and received terrible output. And I have definitely spent more time fighting with it than I care to admit.</p>\n<p>But I have also discovered that when you stop treating AI like magic and start treating it like what it actually is (a very enthusiastic intern with zero life experience), things start to make more sense.</p>\n<p>Let me share what I have learned from working with AI on real client projects across user research, design, development, and content creation.</p>\nHow To Work With AI\n<p>Here is the mental model that has been most helpful for me. Treat AI like an <strong>intern with zero experience</strong>.</p>\n<p>An intern fresh out of university has lots of enthusiasm and qualifications, but no real-world experience. You would not trust them to do anything unsupervised. You would explain tasks in detail. You would expect to review their work multiple times. You would give feedback and ask them to try again.</p>\n<p>This is exactly how you should work with AI.</p>\n<h3>The Basics Of Prompting</h3>\n<p>I am not going to pretend to be an expert. I have just spent way too much time playing with this stuff because I like anything shiny and new. But here is what works for me.</p>\n<ul>\n<li><strong>Define the role.</strong><br />Start with something like <em>“Act as a user researcher”</em>  or <em>“Act as a copywriter.”</em>  This gives the AI context for how to respond.</li>\n<li><strong>Break it into steps.</strong><br />Do not just say <em>“Analyze these interview transcripts.”</em> Instead, say <em>“I want you to complete the following steps. One, identify recurring themes. Two, look for questions users are trying to answer. Three, note any objections that come up. Four, output a summary of each.”</em></li>\n<li><strong>Define success.</strong><br />Tell it what good looks like. <em>“I am looking for a report that gives a clear indication of recurring themes and questions in a format I can send to stakeholders. Do not use research terminology because they will not understand it.”</em></li>\n<li><strong>Make it think.</strong><br />Tell it to think deeply about its approach before responding. Get it to create a way to test for success (known as a rubric) and iterate on its work until it passes that test.</li>\n</ul>\n<p>Here is a real prompt I use for online research:</p>\n<blockquote>Act as a user researcher. I would like you to carry out deep research online into [brand name]. In particular, I would like you to focus on what people are saying about the brand, what the overall sentiment is, what questions people have, and what objections people mention. The goal is to create a detailed report that helps me better understand the brand perception.<br /><br />Think deeply about your approach before carrying out the research. Create a rubric for the report to ensure it is as useful as possible. Keep iterating until the report scores extremely high on the rubric. Only then, output the report.</blockquote>\n\n<p>That second paragraph (the bit about thinking deeply and creating a rubric), I basically copy and paste into everything now. It is a universal way to get better output.</p>\n<h3>Learn When To Trust It</h3>\n<p>You should never fully trust AI. Just like you would never fully trust an intern you have only just met.</p>\n<p>To begin with, double-check absolutely everything. Over time, you will get a sense of when it is losing its way. You will spot the patterns. You will know when to start a fresh conversation because the current one has gone off the rails.</p>\n<p>But even after months of working with it daily, I still check its work. I still challenge it. I still make it <strong>cite sources</strong> and <strong>explain its reasoning</strong>.</p>\n<p>The key is that even with all that checking, it is still faster than doing it yourself. Much faster.</p>\nUsing AI For User Research\n<p>This is where AI has genuinely transformed my work. I use it constantly for five main things.</p>\n<h3>Online Research</h3>\n<p>I love AI for this. I can ask it to go and research a brand online. What people are saying about it, what questions they have, what they like, and what frustrates them. Then do the same for competitors and compare.</p>\n<p>This would have taken me days of trawling through social media and review sites. Now it takes minutes.</p>\n<p>I recently did this for an e-commerce client. I wanted to understand what annoyed people about the brand and what they loved. I got detailed insights that shaped the entire conversion optimization strategy. All from one prompt.</p>\n<h3>Analyzing Interviews And Surveys</h3>\n<p>I used to avoid open-ended questions in surveys. They were such a pain to review. Now I use them all the time because AI can analyze hundreds of text responses in seconds.</p>\n<p>For interviews, I upload the transcripts and ask it to identify recurring themes, questions, and requests. I always get it to quote directly from the transcripts so I can verify it is not making things up.</p>\n<p>The quality is good. Really good. As long as you give it <strong>clear instructions</strong> about what you want.</p>\n<h3>Making Sense Of Data</h3>\n<p>I am terrible with spreadsheets. Put me in front of a person and I can understand them. Put me in front of data, and my eyes glaze over.</p>\n<p>AI has changed that. I upload spreadsheets to ChatGPT and just ask questions. <em>“What patterns do you see?”</em> <em>“Can you reformat this?”</em> <em>“Show me this data in a different way.”</em></p>\n<p><a href=\"https://clarity.microsoft.com/\">Microsoft Clarity</a> now has Copilot built in, so you can ask it questions about your analytics data. <a href=\"https://www.triplewhale.com/\">Triple Whale</a> does the same for e-commerce sites. These tools are game changers if you struggle with data like I do.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/1-microsoft-clarity.png\" /></p>\n<h3>Research Projects</h3>\n<p>This is probably my favorite technique. In ChatGPT and Claude, you can create projects. In other tools, they are called spaces. Think of them as self-contained folders where everything you put in is available to every conversation in that project.</p>\n<p>When I start working with a new client, I create a project and throw everything in. Old user research. Personas. Survey results. Interview transcripts. Documentation. Background information. Site copy. Anything I can find.</p>\n<p>Then I give it custom instructions. Here is one I use for my own business:</p>\n<blockquote>Act as a business consultant and marketing strategy expert with good copywriting skills. Your role is to help me define the future of my <a href=\"https://boagworld.com/l/ux-consultant/\">UX consultant business</a> and better articulate it, especially via my website. When I ask for your help, ask questions to improve your answers and challenge my assumptions where appropriate.</blockquote>\n\n<p>I have even uploaded a virtual board of advisors (people I wish I had on my board) and asked AI to research how they think and respond as they would.</p>\n<p>Now I have this project that knows everything about my business. I can ask it questions. Get it to review my work. <strong>Challenge my thinking.</strong> It is like having a co-worker who never gets tired and has a perfect memory.</p>\n<p>I do this for every client project now. It is invaluable.</p>\n<h3>Creating Personas</h3>\n<p>AI has reinvigorated my interest in personas. I had lost heart in them a bit. They took too long to create, and clients always said they already had marketing personas and did not want to pay to do them again.</p>\n<p>Now I can create what I call <a href=\"https://www.smashingmagazine.com/2025/09/functional-personas-ai-lean-practical-workflow/\">functional personas</a>. Personas that are actually useful to people who work in UX. Not marketing fluff about what brands people like, but real information about what questions they have and what tasks they are trying to complete.</p>\n<p>I upload all my research to a project and say:</p>\n<blockquote>Act as a user researcher. Create a persona for [audience type]. For this persona, research the following information: questions they have, tasks they want to complete, goals, states of mind, influences, and success metrics. It is vital that all six criteria are addressed in depth and with equal vigor.</blockquote>\n\n<p>The output is really good. Detailed. Useful. Based on actual data rather than pulled out of thin air.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/2-ai-creating-personas.png\" /></p>\n<p>Here is my challenge to anyone who thinks AI-generated personas are somehow fake. What makes you think your personas are so much better? Every persona is a story of a <strong>hypothetical user</strong>. You make judgment calls when you create personas, too. At least AI can process far more information than you can and is brilliant at pattern recognition.</p>\n<p>My only concern is that relying too heavily on AI could disconnect us from real users. We still need to talk to people. We still need that empathy. But as a tool to synthesize research and create reference points? It is excellent.</p>\nUsing AI For Design And Development\n<p>Let me start with a warning. AI is not production-ready. Not yet. Not for the kind of client work I do, anyway.</p>\n<p>Three reasons why:</p>\n<ol>\n<li>It is slow if you want something specific or complicated.</li>\n<li>It can be frustrating because it gets close but not quite there.</li>\n<li>And the quality is often subpar. Unpolished code, questionable design choices, that kind of thing.</li>\n</ol>\n<p>But that does not mean it is not useful. It absolutely is. Just not for final production work.</p>\n<h3>Functional Prototypes</h3>\n<p>If you are not too concerned with matching a specific design, AI can quickly prototype functionality in ways that are hard to match in Figma. Because Figma is terrible at prototyping functionality. You cannot even create an active form field in a Figma prototype. It’s the biggest thing people do online other than click links — and you cannot test it.</p>\n<p>Tools like <a href=\"https://www.relume.io/\">Relume</a> and <a href=\"https://bolt.new/\">Bolt</a> can create quick functional mockups that show roughly how things work. They are great for non-designers who just need to throw together a prototype quickly. For designers, they can be useful for showing developers how you want something to work.</p>\n<p>But you can spend ages getting them to put a hamburger menu on the right side of the screen. So use them for quick iteration, not pixel-perfect design.</p>\n<h3>Small Coding Tasks</h3>\n<p>I use AI constantly for small, low-risk coding work. I am not a developer anymore. I used to be, back when dinosaurs roamed the earth, but not for years.</p>\n<p>AI lets me create the little tools I need. <a href=\"https://boagworld.com/boagworks/convince-the-boss/\">A calculator that calculates the ROI of my UX work</a>. An app for running top task analysis. Bits of JavaScript for hiding elements on a page. WordPress plugins for updating dates automatically.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/3-bolt-tool.png\" /></p>\n<p>Just before running my workshop on this topic, I needed a tool to create calendar invites for multiple events. All the online services wanted £16 a month. I asked ChatGPT to build me one. One prompt. It worked. It looked rubbish, but I did not care. It did what I needed.</p>\n<p>If you are a developer, you should absolutely be using tools like <a href=\"https://cursor.com/\">Cursor</a> by now. They are invaluable for pair programming with AI. But if you are not a developer, just stick with Claude or Bolt for quick throwaway tools.</p>\n<h3>Reviewing Existing Services</h3>\n<p>There are some great tools for getting quick feedback on existing websites when budget and time are tight.</p>\n<p>If you need to conduct a <a href=\"https://boagworld.com/l/ux-audit/\">UX audit</a>, <a href=\"https://wevo.ai/takeapulse/\">Wevo Pulse</a> is an excellent starting point. It automatically reviews a website based on personas and provides visual attention heatmaps, friction scores, and specific improvement recommendations. It generates insights in minutes rather than days.</p>\n<p>Now, let me be clear. This does not replace having an experienced person conduct a proper UX audit. You still need that human expertise to understand context, make judgment calls, and spot issues that AI might miss. But as a starting point to identify obvious problems quickly? It is a great tool. Particularly when budget or time constraints mean a full audit is not on the table.</p>\n<p>For e-commerce sites, <a href=\"https://baymard.com/product/ux-ray\">Baymard has UX Ray</a>, which analyzes flaws based on their massive database of user research.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/4-baymard-ux-ray.png\" /></p>\n<h3>Checking Your Designs</h3>\n<p><a href=\"https://attentioninsight.com/\">Attention Insight</a> has taken thousands of hours of eye-tracking studies and trained AI on it to predict where people will look on a page. It has about 90 to 96 percent accuracy.</p>\n<p>You upload a screenshot of your design, and it shows you where attention is going. Then you can play around with your imagery and layout to guide attention to the right place.</p>\n<p>It is great for dealing with stakeholders who say, <em>“People won’t see that.”</em> You can prove they will. Or equally, when stakeholders try to crowd the interface with too much stuff, you can show them attention shooting everywhere.</p>\n<p>I use this constantly. Here is a real example from a pet insurance company. They had photos of a dog, cat, and rabbit for different types of advice. The dog was far from the camera. The cat was looking directly at the camera, pulling all the attention. The rabbit was half off-frame. Most attention went to the cat’s face.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/5-attention-insight.png\" /></p>\n<p>I redesigned it using AI-generated images, where I could control exactly where each animal looked. Dog looking at the camera. Cat looking right. Rabbit looking left. All the attention drawn into the center. Made a massive difference.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/6-redesigned-ai-version.png\" /></p>\n<h3>Creating The Perfect Image</h3>\n<p>I use AI all the time for creating images that do a specific job. My preferred tools are <a href=\"https://www.midjourney.com/\">Midjourney</a> and Gemini.</p>\n<p>I like Midjourney because, visually, it creates stunning imagery. You can dial in the tone and style you want. The downside is that it is not great at following specific instructions.</p>\n<p>So I produce an image in Midjourney that is close, then upload it to Gemini. Gemini is not as good at visual style, but it is much better at following instructions. <em>“Make the guy reach here”</em> or <em>“Add glasses to this person.”</em> I can get pretty much exactly what I want.</p>\n<p>The other thing I love about Midjourney is that you can upload a photograph and say, <em>“Replicate this style.”</em> This keeps <strong>consistency</strong> across a website. I have a master image I use as a reference for all my site imagery to keep the style consistent.</p>\nUsing AI For Content\n<p>Most clients give you terrible copy. Our job is to improve the user experience or conversion rate, and anything we do gets utterly undermined by bad copy.</p>\n<p>I have completely stopped asking clients for copy since AI came along. Here is my process.</p>\n<h3>Build Everything Around Questions</h3>\n<p>Once I have my information architecture, I get AI to generate a massive list of questions users will ask. Then I run a <a href=\"https://www.smashingmagazine.com/2022/05/top-tasks-focus-what-matters-must-defocus-what-doesnt/\">top task analysis</a> where people vote on which questions matter most.</p>\n<p>I assign those questions to pages on the site. Every page gets a list of the questions it needs to answer.</p>\n<h3>Get Bullet Point Answers From Stakeholders</h3>\n<p>I spin up the content management system with a really basic theme. Just HTML with very basic formatting. I go through every page and assign the questions.</p>\n<p>Then I go to my clients and say: <em>“I do not want you to write copy. Just go through every page and bullet point answers to the questions. If the answer exists on the old site, copy and paste some text or link to it. But just bullet points.”</em></p>\n<p>That is their job done. Pretty much.</p>\n<h3>Let AI Draft The Copy</h3>\n<p>Now I take control. I feed ChatGPT the questions and bullet points and say:</p>\n<blockquote>Act as an online copywriter. Write copy for a webpage that answers the question [question]. Use the following bullet points to answer that question: [bullet points]. Use the following guidelines: Aim for a ninth-grade reading level or below. Sentences should be short. Use plain language. Avoid jargon. Refer to the reader as you. Refer to the writer as us. Ensure the tone is friendly, approachable, and reassuring. The goal is to [goal]. Think deeply about your approach. Create a rubric and iterate until the copy is excellent. Only then, output it.</blockquote>\n\n<p>I often upload a full style guide as well, with details about how I want it to be written.</p>\n<p>The output is genuinely good. As a first draft, it is excellent. Far better than what most stakeholders would give me.</p>\n<h3>Stakeholders Review And Provide Feedback</h3>\n<p>That goes into the website, and stakeholders can comment on it. Once I get their feedback, I take the original copy and all their comments back into ChatGPT and say, <em>“Rewrite using these comments.”</em></p>\n<p>Job done.</p>\n<p>The great thing about this approach is that even if stakeholders make loads of changes, they are making changes to a good foundation. The overall quality still comes out better than if they started with a blank sheet.</p>\n<p>It also makes things go smoother because you are not criticizing their content, where they get defensive. They are criticizing AI content.</p>\n<h3>Tools That Help</h3>\n<p>If your stakeholders are still giving you content, <a href=\"https://hemingwayapp.com/\">Hemingway Editor</a> is brilliant. Copy and paste text in, and it tells you how readable and scannable it is. It highlights long sentences and jargon. You can use this to prove to clients that their content is not good web copy.</p>\n<p><img src=\"https://files.smashing.media/articles/ai-ux-achieve-more-with-less/7-hemingway-editor.png\" /></p>\n<p>If you pay for the pro version, you get AI tools that will rewrite the copy to be more readable. It is excellent.</p>\nWhat This Means for You\n<p>Let me be clear about something. None of this is perfect. AI makes mistakes. It hallucinates. It produces bland output if you do not push it hard enough. It requires constant checking and challenging.</p>\n<p>But here is what I know from two years of using this stuff daily. It has made me <strong>faster</strong>. It has made me <strong>better</strong>. It has freed me up to do <strong>more strategic thinking</strong> and <strong>less grunt work</strong>.</p>\n<p>A report that would have taken me five days now takes three hours. That is not an exaggeration. That is real.</p>\n<p>Overall, AI probably gives me a 25 to 33 percent increase in what I can do. That is significant.</p>\n<p>Your value as a UX professional lies in your ideas, your questions, and your thinking. Not your ability to use Figma. Not your ability to manually review transcripts. Not your ability to write reports from scratch.</p>\n<p>AI cannot innovate. It cannot make creative leaps. It cannot know whether its output is good. It cannot understand what it is like to be human.</p>\n<p>That is where you come in. That is where you will always come in.</p>\n<p>Start small. Do not try to learn everything at once. Just ask yourself throughout your day: Could I do this with AI? Try it. See what happens. Double-check everything. Learn what works and what does not.</p>\n<p>Treat it like an enthusiastic intern with zero life experience. Give it clear instructions. Check its work. Make it try again. Challenge it. Push it further.</p>\n<p>And remember, it is not going to take your job. It is going to change it. For the better, I think. As long as we learn to work with it rather than against it.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"2222a67819306b8377899dca59222a6ae31ca8dcdfe50394665e5b7c36650320","category":"Tech"}