{"title":"How Duke Energy enforces cloud security at scale with Terraform & Vault, and 6 lessons","link":"https://www.hashicorp.com/blog/how-duke-energy-enforces-cloud-security-at-scale-with-terraform-vault-6-lessons","date":1770656400000,"content":"<p>Seven years ago, managing security and compliance was fairly straightforward at Duke Energy. Most of the company’s applications ran on-premises. Security teams had complete control over almost everything. </p>\n\n<p>But when the 100-year-old, regulated utility moved to the cloud, all of that changed. Enforcing security without hampering delivery speed became much more complicated. In <a href=\"https://www.hashicorp.com/en/events/webinars/cloud-in-action-how-duke-energy-scales-cloud-security?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_SPEED_duke-energy-blog_WEBINAR&amp;utm_content=intro-blog-cta&amp;utm_offer=webinar\">our conversation</a> with Duke Energy, they told us about their requirements around maintaining <em>speed under regulation</em>.</p>\n\n<p>In this post, you’ll see how Duke Energy used infrastructure management standardization, <a href=\"https://www.hashicorp.com/en/blog/policy-as-code-explained\">policy as code</a>, and centralized secrets management to scale cloud security without slowing developers down. We’ll wrap up with six lessons learned from their story.</p>\n<h2>From datacenters to the cloud</h2>\n\n<p>Duke Energy began its cloud journey much like many other organizations — with the realization that aging datacenters limited agility, and the cloud had so much more to offer. </p>\n\n<p>The energy sector was changing, and if the company was going to “build a smarter, cleaner energy future”, it needed new digital services and a more modern computing platform.  </p>\n\n<p>Moving to the cloud, however, meant inheriting new security responsibilities that could only be solved through automation, governance, and a standardized developer experience.</p>\n\n<blockquote>\n<p>“As we started moving to the cloud, security was one of the biggest concerns for us. We really had to be careful about how applications were deployed, where pipelines got secrets from, and how they were stored.”<br />— Travis Rutledge, Senior Cloud Engineer, Duke Energy</p>\n</blockquote>\n\n<h2>Standardizing on Terraform Enterprise and Sentinel</h2>\n\n<p>Early on, Duke Energy adopted the community version of <a href=\"https://www.hashicorp.com/en/products/terraform?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_SPEED_duke-energy-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">Terraform</a> to bring consistency to cloud provisioning. But the <a href=\"https://www.hashicorp.com/en/resources/what-is-a-platform-team-and-why-do-we-need-them\">platform team</a> manually reviewed all of the pull requests made by product teams as a security checkpoint. This caused two problems, and both increased risk: </p>\n\n<ol>\n<li>As teams multiplied, the process became unscalable</li>\n<li>Humans often made mistakes</li>\n</ol>\n\n<blockquote>\n<p>“We had very preliminary service control policies, but nothing that stopped actions at the infrastructure layer.”<br />— Travis Rutledge, Senior Cloud Engineer, Duke Energy </p>\n</blockquote>\n\n<p>To address this issue, the company introduced an open source security policy tool to help. But they soon outgrew the tool’s capabilities — they discovered that the tool had no way of evaluating all the input or local variables in a Terraform resource, which meant someone could unknowingly introduce an attack vector, and the policy wouldn’t catch it. </p>\n\n<p>That’s when they implemented <a href=\"https://www.hashicorp.com/en/products/terraform?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_SPEED_duke-energy-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">Terraform Enterprise</a> and <a href=\"https://www.hashicorp.com/en/sentinel\">Sentinel</a>. Sentinel evaluates Terraform plans before infrastructure is applied, acting as a security gate that prevents unsafe resources — such as S3 buckets accidentally left open to the public — from ever being deployed.</p>\n\n<h2>From secrets everywhere to managed secrets</h2>\n\n<p>One major challenge in Duke Energy’s early cloud adoption was <a href=\"https://www.hashicorp.com/en/resources/what-is-secret-sprawl-why-is-it-harmful\">secret sprawl</a>: secrets were siloed and decentralized in multiple systems, depending on the team or the use case. This was <a href=\"https://www.hashicorp.com/en/resources/5-best-practices-for-secrets-management\">not best practice</a>.</p>\n\n<p>They implemented <a href=\"https://www.hashicorp.com/en/products/vault?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_duke-energy-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">HashiCorp Vault</a> to bring more structure to secrets management, which alleviated most of the sprawl, but some AWS applications still need secrets in AWS Secrets Manager as well.</p>\n\n<blockquote>\n<p>“As we grew in the cloud, we really didn’t have a central secret store, even though we were using Vault. We needed to define exactly what Vault is the standard for and still allow secrets to get where they need to go for things like Secrets Manager, Azure Key Vault, you name it.”<br />— Travis Rutledge, Senior Cloud Engineer, Duke Energy </p>\n</blockquote>\n\n<p>Vault also has the capability to <a href=\"https://developer.hashicorp.com/vault/docs/sync\">sync secrets</a> and integrate a variety of cloud native secret stores so that secrets can still be centrally managed in one cloud-agnostic repository.</p>\n\n<p>In addition to working on the centralization problem, the company is systematically using Vault to eliminate long-lived IAM user credentials and replace them with <a href=\"https://www.hashicorp.com/en/blog/why-we-need-short-lived-credentials-and-how-to-adopt-them\">short-lived, just-in-time credentials</a> to reduce the risk of them falling into the wrong hands. Even if a short-lived credential (also called a “dynamic secret”) falls into the wrong hands, the attacker won’t have much time to cause harm.</p>\n\n<h2>The rise of no-code infrastructure</h2>\n\n<p>As cloud usage grew, the company hit a scaling wall: developers were spending more time debugging Sentinel policies and writing Terraform code than building applications.</p>\n\n<p>To reduce cognitive load while preserving security, the company began using <a href=\"https://www.hashicorp.com/en/blog/terraform-without-writing-code-how-to-build-self-service-with-no-code-modules\">Terraform no-code modules</a> — pre-built, hardened infrastructure builds exposed through a simplified interface. This allowed developers to stand up services like API Gateways or S3 without touching Terraform code at all.</p>\n\n<blockquote>\n<p>“We’re implementing this [no-code modules] now. Our goal is to make things easy. For example, if developers want an S3 bucket, they just click a few buttons, fill out a couple of parameters, and they’re off to the races.”<br />— Travis Rutledge, Senior Cloud Engineer, Duke Energy</p>\n</blockquote>\n\n<h2>Building a full lifecycle platform: From Day 0 to Day 2+</h2>\n\n<p>Duke Energy’s cloud journey started with teams reinventing the wheel across the organization. They might be deploying the same thing, but they build it 15 different bespoke ways across the org.  </p>\n\n<p>That’s more work for those teams, and it’s more work for the platform team to support and do maintenance across those different processes. What the platform team wanted was a more structured model to govern cloud infrastructure.</p>\n\n<p>By standardizing multiple processes into one, they save time for developers and operators across the org, while also making everything more maintainable for the central platform team. This is the end-to-end, standardized infrastructure and security automation workflow that they’ve built so far:</p>\n\n<h3>Day 0 — Getting started fast</h3>\n\n<p>Developers receive:</p>\n\n<ul>\n<li>Pre-seeded GitHub repositories with Terraform authentication</li>\n<li>Backend configuration and patterns already embedded</li>\n</ul>\n\n<p>This allows them to focus on development, not platform plumbing. They’re also able to deploy quickly to non-production environments for fast prototyping.</p>\n\n<p>The company wants the next evolution to be a marketplace-style “vending machine”  using no-code modules and something like <a href=\"https://www.hashicorp.com/en/blog/how-to-enable-developer-self-service-at-scale-with-terraform-and-waypoint\">HCP Waypoint</a> so developers can pick the resources they need and deploy securely, without having to worry about Terraform configurations for common use cases.</p>\n\n<h3>Day 1 — Deploying with guardrails</h3>\n\n<p>When teams are ready to deploy to production, they go right to Day 1. Everything is built with Terraform standardized modules and checked with Sentinel. Manual ClickOps deployments are limited to isolated sandbox accounts only. No circumvention of governance controls, no break-glass <a href=\"https://www.hashicorp.com/en/resources/how-can-i-prevent-configuration-drift\">configuration drift</a>.</p>\n\n<h3>Day 2+ — Operating securely at scale</h3>\n\n<p>This is where most enterprises struggle, and Duke Energy is no exception. Patching databases, rotating secrets, upgrading runtimes, and remediating vulnerabilities is time-consuming and inconsistent across teams.</p>\n\n<p>To address this, the company is exploring ways to automate Day 2 operations by driving Vault adoption and using things like no-code modules, GitHub Actions, and <a href=\"https://developer.hashicorp.com/hcp/docs/waypoint/concepts/actions\">Waypoint Actions</a> so that users don’t need to “get into the box” to manage those things. The goal is to make environments more consistent, secure, and supportable.</p>\n\n<h2>A better developer experience, without sacrificing security</h2>\n\n<p>Duke Energy’s story shows that happy developers and strong security can coexist. A central theme in the company’s journey is that security and developer productivity can reinforce each other when automation is applied thoughtfully.</p>\n\n<p>By shifting governance into policy as code and abstracting infrastructure behind no-code modules, Duke Energy reduced developer friction while strengthening security.</p>\n\n<h3>How do Duke Energy’s leaders know if developer experience is getting better?</h3>\n\n<p>They ask. Leaders monitor sentiment across teams, run periodic surveys, and listen carefully to the “temperature” of the developer community.</p>\n\n<p>When things are going well, Rutledge says, “There’s less noise, smoother deployments, and fewer urgent requests.”</p>\n\n<blockquote>\n<p>To learn more about how you can improve developer experience while ensuring security and regulatory compliance, read our cheatsheet: <a href=\"https://www.hashicorp.com/en/on-demand/13-proven-best-practices-to-build-your-devex-program?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_SPEED_duke-energy-blog_WHITEPAPER&amp;utm_content=end-blog-cta&amp;utm_offer=whitepaper\">13 proven best practices to build your DevEx program</a>.</p>\n</blockquote>\n\n<h2>Duke Energy’s next steps</h2>\n\n<p>Looking forward, Duke Energy aims to industrialize the entire infrastructure lifecycle:</p>\n\n<ul>\n<li>A full marketplace of no-code modules for common patterns</li>\n<li>Migrating from Terraform Enterprise (self-managed) to HCP Terraform (SaaS)</li>\n<li>Automated Day 2 remediation and operations</li>\n<li>Secure dynamic credentials through <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/dynamic-provider-credentials/workload-identity-tokens\">workload identity</a></li>\n<li>Multi-cloud governance with cloud-agnostic policies in Sentinel</li>\n<li>Faster onboarding of emerging services like AWS Bedrock</li>\n</ul>\n\n<blockquote>\n<p>“We have a bold vision. We want to be the Amazon of infrastructure. If you need a thing, you can have it the same day.”<br />— Travis Rutledge, Senior Cloud Engineer, Duke Energy</p>\n</blockquote>\n\n<h2>Lessons learned</h2>\n\n<p>Duke Energy’s story offers several clear lessons for organizations scaling cloud securely:</p>\n\n<h3>1. <strong>Standardize early and ruthlessly</strong></h3>\n\n<p>Every shortcut you tolerate early becomes a tax on future scalability.</p>\n\n<h3>2. <strong>Automate governance, not just provisioning</strong></h3>\n\n<p>Policy as code prevents configuration drift and human error at scale.</p>\n\n<h3>3. <strong>Reduce cognitive load for developers</strong></h3>\n\n<p>No-code and abstractions allow teams to deploy safely without mastering every AWS, Azure,GCP, or on-prem nuance.</p>\n\n<h3>4. <strong>Centralize secrets and eliminate static credentials</strong></h3>\n\n<p>Dynamic workload identity is becoming essential for both security and auditability.</p>\n\n<h3>5. <strong>Invest deeply in Day 2+ automation</strong></h3>\n\n<p>Most breaches, outages, and inefficiencies happen after deployment, not during it.</p>\n\n<h3>6. <strong>Build for long-term maintainability</strong></h3>\n\n<p>“If we had focused on maintainability from day one, we would have been farther in our journey today,” says Rutledge.</p>\n\n<h2>Take the next step</h2>\n\n<p>Duke Energy’s cloud security journey demonstrates what is possible when a large, regulated enterprise rethinks how infrastructure should be built and operated. With a focus on four key areas:</p>\n\n<ul>\n<li>Standardization</li>\n<li>Policy as code</li>\n<li>Secret lifecycle management</li>\n<li>No-code abstractions</li>\n</ul>\n\n<p>…they’ve built a platform that scales securely without slowing innovation.</p>\n\n<p>You can watch our full conversation with Duke Energy here: <a href=\"https://www.hashicorp.com/en/events/webinars/cloud-in-action-how-duke-energy-scales-cloud-security?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_SPEED_duke-energy-blog_WEBINAR&amp;utm_content=end-blog-cta&amp;utm_offer=webinar\">Cloud in action: How Duke Energy scales cloud security</a>.</p>\n","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"22711503cab1517ca2c52d62544fa29ccb832ccf9e8db4230f50341598aaed09","category":"Tech"}