{"title":"Announcing replication support and Intelligent-Tiering for Amazon S3 Tables","link":"https://aws.amazon.com/blogs/aws/announcing-replication-support-and-intelligent-tiering-for-amazon-s3-tables/","date":1764692354000,"content":"<p>Today, we’re announcing two new capabilities for <a href=\"https://aws.amazon.com/s3/features/tables/\">Amazon S3 Tables</a>: support for the new Intelligent-Tiering storage class that automatically optimizes costs based on access patterns, and replication support to automatically maintain consistent <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables.html\">Apache Iceberg</a> table replicas across <a href=\"https://docs.aws.amazon.com/global-infrastructure/latest/regions/aws-regions.html\">AWS Regions</a> and <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#account\">accounts</a> without manual sync.</p> \n<p>Organizations working with tabular data face two common challenges. First, they need to manually manage storage costs as their datasets grow and access patterns change over time. Second, when maintaining replicas of Iceberg tables across Regions or accounts, they must build and maintain complex architectures to track updates, manage object replication, and handle metadata transformations.</p> \n<p><span><strong>S3 Tables Intelligent-Tiering storage class<br /> </strong></span>With the S3 Tables Intelligent-Tiering storage class<strong>,</strong> data is automatically tiered to the most cost-effective access tier based on access patterns. Data is stored in three low-latency tiers: Frequent Access, Infrequent Access (40% lower cost than Frequent Access), and Archive Instant Access (68% lower cost compared to Infrequent Access). After 30 days without access, data moves to Infrequent Access, and after 90 days, it moves to Archive Instant Access. This happens without changes to your applications or impact on performance.</p> \n<p>Table maintenance activities, including compaction, snapshot expiration, and unreferenced file removal, operate without affecting the data’s access tiers. Compaction automatically processes only data in the Frequent Access tier, optimizing performance for actively queried data while reducing maintenance costs by skipping colder files in lower-cost tiers.</p> \n<p>By default, all existing tables use the Standard storage class. When creating new tables, you can specify Intelligent-Tiering as the storage class, or you can rely on the default storage class configured at the table bucket level. You can set Intelligent-Tiering as the default storage class for your table bucket to automatically store tables in Intelligent-Tiering when no storage class is specified during creation.</p> \n<p><span><strong>Let me show you how it works<br /> </strong></span>You can use the <a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a> and the <code>put-table-bucket-storage-class</code> and <code>get-table-bucket-storage-class</code> commands to change or verify the storage tier of your S3 table bucket.</p> \n<pre><code># Change the storage class\naws s3tables put-table-bucket-storage-class \\\n   --table-bucket-arn $TABLE_BUCKET_ARN  \\\n   --storage-class-configuration storageClass=INTELLIGENT_TIERING\n\n# Verify the storage class\naws s3tables get-table-bucket-storage-class \\\n   --table-bucket-arn $TABLE_BUCKET_ARN  \\\n\n{ \"storageClassConfiguration\":\n   { \n      \"storageClass\": \"INTELLIGENT_TIERING\"\n   }\n}</code></pre> \n<p><span><strong>S3 Tables replication support<br /> </strong></span>The new S3 Tables replication support helps you maintain consistent read replicas of your tables across AWS Regions and accounts. You specify the destination table bucket and the service creates read-only replica tables. It replicates all updates chronologically while preserving parent-child snapshot relationships. Table replication helps you build global datasets to minimize query latency for geographically distributed teams, meet compliance requirements, and provide data protection.</p> \n<p>You can now easily create replica tables that deliver similar query performance as their source tables. Replica tables are updated within minutes of source table updates and support independent encryption and retention policies from their source tables. Replica tables can be queried using <a href=\"https://aws.amazon.com/sagemaker/unified-studio/\">Amazon SageMaker Unified Studio</a> or any Iceberg-compatible engine including <a href=\"https://duckdb.org/\">DuckDB</a>, <a href=\"https://py.iceberg.apache.org/\">PyIceberg</a>, <a href=\"https://spark.apache.org/\">Apache Spark</a>, and <a href=\"https://trino.io/\">Trino</a>.</p> \n<p>You can create and maintain replicas of your tables through the <a href=\"https://console.aws.amazon.com\">AWS Management Console</a> or APIs and <a href=\"https://aws.amazon.com/tools/\">AWS SDKs</a>. You specify one or more destination table buckets to replicate your source tables. When you turn on replication, S3 Tables automatically creates read-only replica tables in your destination table buckets, backfills them with the latest state of the source table, and continually monitors for new updates to keep replicas in sync. This helps you meet time-travel and audit requirements while maintaining multiple replicas of your data.</p> \n<p><span><strong>Let me show you how it works<br /> </strong></span>To show you how it works, I proceed in three steps. First, I create an S3 table bucket, create an Iceberg table, and populate it with data. Second, I configure the replication. Third, I connect to the replicated table and query the data to show you that changes are replicated.</p> \n<p>For this demo, the S3 team kindly gave me access to an <a href=\"https://aws.amazon.com/emr\">Amazon EMR</a> cluster already provisioned. You can follow <a href=\"https://docs.aws.amazon.com/emr/latest/ManagementGuide/emr-gs.html\">the Amazon EMR documentation to create your own cluster</a>. They also created two S3 table buckets, a source and a destination for the replication. Again, <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables-buckets-create.html\">the S3 Tables documentation will help you to get started</a>.</p> \n<p>I take a note of the two S3 Tables bucket Amazon Resource Names (ARNs). In this demo, I refer to these as the environment variables <code>SOURCE_TABLE_ARN</code> and <code>DEST_TABLE_ARN</code>.</p> \n<p><strong>First step: Prepare the source database</strong></p> \n<p>I start a terminal, connect to the EMR cluster, start a Spark session, create a table, and insert a row of data. The commands I use in this demo are documented in <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables-integrating-open-source.html\">Accessing tables using the Amazon S3 Tables Iceberg REST endpoint</a>.</p> \n<pre><code>sudo spark-shell \\\n--packages \"org.apache.iceberg:iceberg-spark-runtime-3.5_2.12:1.4.1,software.amazon.awssdk:bundle:2.20.160,software.amazon.awssdk:url-connection-client:2.20.160\" \\\n--master \"local[*]\" \\\n--conf \"spark.sql.extensions=org.apache.iceberg.spark.extensions.IcebergSparkSessionExtensions\" \\\n--conf \"spark.sql.defaultCatalog=spark_catalog\" \\\n--conf \"spark.sql.catalog.spark_catalog=org.apache.iceberg.spark.SparkCatalog\" \\\n--conf \"spark.sql.catalog.spark_catalog.type=rest\" \\\n--conf \"spark.sql.catalog.spark_catalog.uri=https://s3tables.us-east-1.amazonaws.com/iceberg\" \\\n--conf \"spark.sql.catalog.spark_catalog.warehouse=arn:aws:s3tables:us-east-1:012345678901:bucket/aws-news-blog-test\" \\\n--conf \"spark.sql.catalog.spark_catalog.rest.sigv4-enabled=true\" \\\n--conf \"spark.sql.catalog.spark_catalog.rest.signing-name=s3tables\" \\\n--conf \"spark.sql.catalog.spark_catalog.rest.signing-region=us-east-1\" \\\n--conf \"spark.sql.catalog.spark_catalog.io-impl=org.apache.iceberg.aws.s3.S3FileIO\" \\\n--conf \"spark.hadoop.fs.s3a.aws.credentials.provider=org.apache.hadoop.fs.s3a.SimpleAWSCredentialProvider\" \\\n--conf \"spark.sql.catalog.spark_catalog.rest-metrics-reporting-enabled=false\"\n\nspark.sql(\"\"\"\nCREATE TABLE s3tablesbucket.test.aws_news_blog (\ncustomer_id STRING,\naddress STRING\n) USING iceberg\n\"\"\")\n\nspark.sql(\"INSERT INTO s3tablesbucket.test.aws_news_blog VALUES ('cust1', 'val1')\")\n\nspark.sql(\"SELECT * FROM s3tablesbucket.test.aws_news_blog LIMIT 10\").show()\n+-----------+-------+\n|customer_id|address|\n+-----------+-------+\n|      cust1|   val1|\n+-----------+-------+</code></pre> \n<p>So far, so good.</p> \n<p><strong>Second step: Configure the replication for S3 Tables</strong></p> \n<p>Now, I use the <span>CLI</span> on my laptop to configure the S3 table bucket replication.</p> \n<p>Before doing so, I create an <a href=\"https://aws.amazon.com/iam/\">AWS Identity and Access Management (IAM)</a> policy to authorize the replication service to access my S3 table bucket and encryption keys. <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables-replication-tables.html\">Refer to the S3 Tables replication documentation for the details</a>. The permissions I used for this demo are:</p> \n<pre><code>{\n    \"Version\": \"2012-10-17\",\n    \"Statement\": [\n        {\n            \"Effect\": \"Allow\",\n            \"Action\": [\n                \"s3:*\",\n                \"s3tables:*\",\n                \"kms:DescribeKey\",\n                \"kms:GenerateDataKey\",\n                \"kms:Decrypt\"\n            ],\n            \"Resource\": \"*\"\n        }\n    ]\n}</code></pre> \n<p>After having created this IAM policy, I can now proceed and configure the replication:</p> \n<pre><code>aws s3tables-replication put-table-replication \\\n--table-arn ${SOURCE_TABLE_ARN} \\\n--configuration  '{\n    \"role\": \"arn:aws:iam::&lt;MY_ACCOUNT_NUMBER&gt;:role/S3TableReplicationManualTestingRole\", \n    \"rules\":[\n        {\n            \"destinations\": [\n                {\n                    \"destinationTableBucketARN\": \"${DST_TABLE_ARN}\"\n                }]\n        }\n    ]\n</code></pre> \n<p>The replication starts automatically. Updates are typically replicated within minutes. The time it takes to complete depends on the volume of data in the source table.</p> \n<p><strong>Third step: Connect to the replicated table and query the data</strong></p> \n<p>Now, I connect to the EMR cluster again, and I start a second Spark session. This time, I use the destination table.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/11/14/2025-11-14_13-59-13.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/11/14/2025-11-14_13-59-13.png\" alt=\"S3 Tables replication - destination table\" width=\"802\" height=\"424\" /></a></p> \n<p>To verify the replication works, I insert a second row of data on the source table.</p> \n<pre><code>spark.sql(\"INSERT INTO s3tablesbucket.test.aws_news_blog VALUES ('cust2', 'val2')\")\n</code></pre> \n<p>I wait a few minutes for the replication to trigger. I follow the status of the replication with the <code>get-table-replication-status</code> command.</p> \n<pre><code>aws s3tables-replication get-table-replication-status \\\n--table-arn ${SOURCE_TABLE_ARN} \\\n{\n    \"sourceTableArn\": \"arn:aws:s3tables:us-east-1:012345678901:bucket/manual-test/table/e0fce724-b758-4ee6-85f7-ca8bce556b41\",\n    \"destinations\": [\n        {\n            \"replicationStatus\": \"pending\",\n            \"destinationTableBucketArn\": \"arn:aws:s3tables:us-east-1:012345678901:bucket/manual-test-dst\",\n            \"destinationTableArn\": \"arn:aws:s3tables:us-east-1:012345678901:bucket/manual-test-dst/table/5e3fb799-10dc-470d-a380-1a16d6716db0\",\n            \"lastSuccessfulReplicatedUpdate\": {\n                \"metadataLocation\": \"s3://e0fce724-b758-4ee6-8-i9tkzok34kum8fy6jpex5jn68cwf4use1b-s3alias/e0fce724-b758-4ee6-85f7-ca8bce556b41/metadata/00001-40a15eb3-d72d-43fe-a1cf-84b4b3934e4c.metadata.json\",\n                \"timestamp\": \"2025-11-14T12:58:18.140281+00:00\"\n            }\n        }\n    ]\n}</code></pre> \n<p>When replication status shows <code>ready</code>, I connect to the EMR cluster and I query the destination table. Without surprise, I see the new row of data.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/11/14/2025-11-14_14-44-40.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2025/11/14/2025-11-14_14-44-40.png\" alt=\"S3 Tables replication - target table is up to date\" width=\"778\" height=\"126\" /></a></p> \n<p><span><strong>Additional things to know<br /> </strong></span>Here are a couple of additional points to pay attention to:</p> \n<ul> \n <li>Replication for S3 Tables supports both Apache Iceberg V2 and V3 table formats, giving you flexibility in your table format choice.</li> \n <li>You can configure replication at the table bucket level, making it straightforward to replicate all tables under that bucket without individual table configurations.</li> \n <li>Your replica tables maintain the storage class you choose for your destination tables, which means you can optimize for your specific cost and performance needs.</li> \n <li>Any Iceberg-compatible catalog can directly query your replica tables without additional coordination—they only need to point to the replica table location. This gives you flexibility in choosing query engines and tools.</li> \n</ul> \n<p><span><strong>Pricing and availability<br /> </strong></span>You can track your storage usage by access tier through <a href=\"https://docs.aws.amazon.com/cur/latest/userguide/what-is-cur.html\">AWS Cost and Usage Reports</a> and <a href=\"https://aws.amazon.com/cloudwatch/\">Amazon CloudWatch</a> metrics. For replication monitoring, <a href=\"https://aws.amazon.com/cloudtrail/\">AWS CloudTrail</a> logs provide events for each replicated object.</p> \n<p>There are no additional charges to configure Intelligent-Tiering. You only pay for storage costs in each tier. Your tables continue to work as before, with automatic cost optimization based on your access patterns.</p> \n<p>For S3 Tables replication, you pay the S3 Tables charges for storage in the destination table, for replication PUT requests, for table updates (commits), and for object monitoring on the replicated data. For cross-Region table replication, you also pay for inter-Region data transfer out from Amazon S3 to the destination Region based on the Region pair.</p> \n<p>As usual, refer to the <a href=\"https://aws.amazon.com/s3/pricing/\">Amazon S3 pricing page</a> for the details.</p> \n<p>Both capabilities are available today in all AWS Regions where <a href=\"https://docs.aws.amazon.com/general/latest/gr/s3.html#s3_region\">S3 Tables are supported</a>.</p> \n<p>To learn more about these new capabilities, visit the <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables.html\">Amazon S3 Tables documentation</a> or try them in the <a href=\"https://console.aws.amazon.com/s3/table-buckets\">Amazon S3 console</a> today. Share your feedback through AWS re:Post for Amazon S3 or through your AWS Support contacts.</p> \n<p><a href=\"https://linktr.ee/sebsto\">— seb</a></p>","author":"Sébastien Stormacq","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"22ddb74b5dfd694e40f8811c383460cda92fb41399057bd94981666d3b7853e9","category":"Tech"}