{"title":"These scientists built their own Stone Age tools to figure out how they were used","link":"https://arstechnica.com/?p=2004311","date":1710013811000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/toolTOP-800x530.jpg\" alt=\"Testing replica Stone Age tools with a bit of wood-scraping.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/toolTOP.jpg\">Enlarge</a> <span>/</span> Testing replica Stone Age tools with a bit of wood-scraping. (credit: A. Iwase et al., 2024/Tokyo Metropolitan University)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When Japanese scientists wanted to learn more about how ground stone tools dating back to the Early Upper Paleolithic might have been used, they decided to build their own replicas of adzes, axes, and chisels and used those tools to perform tasks that might have been typical for that era. The resulting fractures and wear enabled them to develop new criteria for identifying the likely functions of ancient tools, according to a <a href=\"https://www.sciencedirect.com/science/article/pii/S0305440323001711?via%3Dihub\">recent paper</a> published in the Journal of Archaeological Science.  If these kinds of traces were indeed found on genuine Stone Age tools, it would be evidence that humans had been working with wood and honing techniques significantly earlier than previously believed.</p>\n<p>The development of tools and techniques for woodworking purposes started out simple, with the manufacture of cruder tools like the spears and throwing sticks common in the early Stone Age. Later artifacts dating back to Mesolithic and Neolithic time periods were more sophisticated, as people learned how to use polished stone tools to make canoes, bows, wells, and to build houses. Researchers typically date the emergence of those stone tools to about 10,000 years ago. However, archaeologists have found lots of stone artifacts with ground edges dating as far back as 60,000 to 30,000 years ago. But it's unclear how those tools might have been used.</p>\n<p>So Akira Iwase of Tokyo Metropolitan University and co-authors made their own replicas of adzes and axes out of three raw materials common to the region between 38,000 and 30,000 years ago: semi-nephrite rocks, hornfels rocks, and tuff rocks. They used a stone hammer and anvil to create various long oval shapes and polished the edges with either a coarse-grained sandstone or a medium-grained tuff. There were three types of replica tools: adze-types, with the working edge oriented perpendicular to the long axis of a bent handle; axe-types, with a working edge parallel to the bent handle's long axis; and chisel-types, in which a stone tool was placed at the end of a straight handle.</p></div><p><a href=\"https://arstechnica.com/?p=2004311#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004311&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"23f98de2dd6ca1fb9ef38cad537be5534bdf97af7549c41b300e5940d0b40c6e","category":"Tech"}