{"title":"How to Force Restart an iPhone","link":"https://support.apple.com/guide/iphone/force-restart-iphone-iph8903c3ee6/ios","date":1771348801000,"content":"\n<p>Apple Support:</p>\n\n<blockquote>\n  <p>If iPhone isn’t responding, and you can’t <a href=\"https://support.apple.com/guide/iphone/turn-iphone-on-or-off-iph841379c3d/26/ios/26#iph6c6b41f36\">turn it off then\non</a>, try forcing it to restart.</p>\n\n<ol>\n<li>Press and quickly release the volume up button.</li>\n<li>Press and quickly release the volume down button.</li>\n<li>Press and hold the side button.</li>\n<li>When the Apple logo appears, release the side button.</li>\n</ol>\n</blockquote>\n\n<p>I upgraded my iPhone 17 Pro to <a href=\"https://www.macrumors.com/guide/ios-26-3-features/\">iOS 26.3</a> this morning (straight from the release version of iOS 26.2 — I skipped the 26.3 betas), and by noon, it was stuck at the lock screen. Pressing and holding the side button and either of the volume buttons at the same time did not bring up the expected screen with “Slide to power off”, “Medical ID”, and “Emergency Call”.</p>\n\n<p>The above force-restart method worked, though. I knew it existed but I’d forgotten how to do it. Luckily, I was sitting right at my Mac, so I had another machine to use to look it up. I’d have been in a jam, though, if I’d been somewhere with only my (stuck) iPhone, so I think this one is worth memorizing.</p>\n\n<p>Step 3, the “press and hold the side button” step, takes quite a few seconds before the screen turns off. So I’m memorizing the process as three steps:</p>\n\n<ol>\n<li>Click the volume up button.</li>\n<li>Click the volume down button.</li>\n<li>Press and hold the side button, patiently, until the Apple logo appears.</li>\n</ol>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/17/how-to-force-restart-an-iphone\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"244c7372ee9a2c94af6cd3933783594b9079f1f475b2552041ae94b74e9e15c5","category":"Tech"}