{"title":"Amazon’s Spending on ‘Melania’ Is a Barely Concealed Bribe","link":"https://www.nytimes.com/2026/01/28/business/media/amazon-melania-trump-film-critics.html?unlocked_article_code=1.IFA.R85v.5ZtNe8FttfaD","date":1769699957000,"content":"\n<p>Nicole Sperling and Brooks Barnes, reporting for The New York Times:</p>\n\n<blockquote>\n  <p>Amazon paid Ms. Trump’s production company $40 million for the\nrights to “Melania,” about $26 million more than the next closest\nbidder, Disney. The fee includes a related docuseries that is\nscheduled to air later this year. The budget for “Melania” is\nunknown, but documentaries that follow a subject for a limited\namount of time usually cost less than $5 million to produce. The\n$35 million for marketing is 10 times what some other high-profile\ndocumentaries have received.</p>\n\n<p>All of which has a lot of Hollywood questioning whether Amazon’s\npush is anything more than the company’s attempt to ingratiate\nitself with President Trump.</p>\n</blockquote>\n\n<p>This is a good story, with multiple industry sources with experience making political documentaries, but the Times’s own subhead downplays Amazon’s spending on the film: “The tech giant is spending $35 million to promote its film about the first lady, far more than is typical for documentaries.” They’re spending $35 million now, to promote it, but they already paid $40 million for the rights to the film, <a href=\"https://www.huffpost.com/entry/melania-trump-documentary-speculation_n_6978f160e4b051911224d57f\">$28 million of which is believed to have gone to Melania Trump herself</a>. A $35 million total spend would be a lot compared to other high-profile documentaries, but it’s a $75 million total spend. This is not just a little fishy — it’s a veritable open air seafood market.</p>\n\n<p>Back to the Times:</p>\n\n<blockquote>\n  <p>To grasp just how uncustomary Amazon’s marketing push for\n“Melania” is, consider how Magnolia Pictures handled “<a href=\"https://www.nytimes.com/2018/05/03/movies/rbg-review-documentary.html\">RBG</a>,”\na portrait of Ruth Bader Ginsburg during her 25th year as a\nSupreme Court justice, in 2018.</p>\n\n<p>CNN Films produced “RBG” for around $1 million. The promotional\nbudget, including an awards campaign that helped it land two Oscar\nnominations, totaled about $3 million. The film debuted in 34\ntheaters and expanded into 432 locations over several weeks. It\nultimately collected $14 million, enough to rank as the year’s No.\n1 political documentary.</p>\n</blockquote>\n\n<p>And:</p>\n\n<blockquote>\n  <p>On Friday, “Melania” will also be released in 1,600 theaters\noverseas, where FilmNation, a New York company, is handling\ndistribution in more than 20 countries. International ticket sales\nare expected to be weak, according to box office analysts.</p>\n</blockquote>\n\n<p>Shocker.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/29/amazon-melania-spending\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"261353995afc7a2e8b2ad7fc2f8e3e64588b86590269e2a0ac05d0cf37f9c64a","category":"Tech"}