{"title":"‘Our competition is not with each other… Our competition is with other sports’ - Jonathan Vaughters on Pogačar’s dominance and salary caps in cycling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/our-competition-is-not-with-each-other-our-competition-is-with-other-sports-jonathan-vaughters-on-pogacar-s-dominance-and-salary-caps-in-cycling","date":1768488003000,"content":"\n      <p><em>Jonathan Vaughters, former professional cyclist and current manager of EF Education-EasyPost, and Thomas Van Den Spiegel, CEO of Flanders Classics and sports business expert, joined Rachel Jary on stage at <a href=\"https://www.rouleur.cc/pages/rouleur-live\">Rouleur Live 2025</a> to discuss the future of cycling. Drawing from their extensive experience, they explored how tradition, fan engagement, and business innovation intersect in pro racing, and highlighted the urgent need for unified structures and new strategies to make the sport more accessible, sustainable, and engaging for a global audience.</em></p>\n<p>Watch the talk here:</p>\n<div></div>\n<p><strong>It might be a good place to start if each of you explain a little bit about who you are, what you do, and why you’re so involved in these conversations about our sport.</strong></p>\n<p><em><strong>Jonathan Vaughters:</strong></em> I started racing bikes when I was twelve years old, and here I am fifty-two years old. So it’s forty years in the sport. And basically, it’s my life, I’m incredibly passionate about it and I always want to see it improve. Obviously, from a business standpoint, I’m on the team side of things, where we’re constantly trying to develop better environments, better financial environments, better financial outcomes and more sustainability long term, so we don’t see teams going away and riders becoming unemployed. We actually very much enjoy working with organisers in making those outcomes better.</p>\n<p><em><strong>Thomas Van Den Spiegel:</strong></em> It’s clear, I’m not a former cyclist, but I’ve been a professional basketball player for almost two decades. With a huge passion for sports business, I went to football when I retired and then after five years, I was asked to become the CEO of Flanders Classics. Coming from Flanders, living in Ghent, we have cycling in our DNA and it was a great honour. I’ve been the CEO of Flanders Classics since 2018 trying to turn not only our company, but the whole sport of cycling into a future-proof business. We see that happening all around us in other sports today, and I would love to be in that picture one day, where we can all say that we’ve created a sustainable environment for every stakeholder in the cycling landscape.</p>\n<p><strong>We want more people to watch cycling and get involved. What are the reasons why that’s not happening? Why do you think fans sometimes struggle to engage with this sport?</strong></p>\n<p><em><strong>JV:</strong></em> For those of you who have been lifelong cycling fans, you probably understand it, because you’ve grown up with it, in that you know there are all kinds of races all over the world that don’t really relate to one another. For somebody who’s watched it their whole life, they get it, but for a new entrant, for somebody who’s a new fan of the sport, our sport is impossible to understand and it doesn’t make any sense.</p>\n<p>The best example of this that I remember is in 2013, Dan Martin won Liège-Bastogne-Liège and we were sponsored by Garmin then. So very excitedly, at the finish line of Liège-Bastogne-Liège, I call up the CEO of Garmin and say, “oh my god, we won a monument! We won Liège-Bastogne-Liège wearing a Garmin jersey!” And he says, “oh, where’s that race?” He had no idea. He says, “so does this mean that our team qualified for the Tour de France this year?” Again, to him Liège-Bastogne-Liège had no meaning outside the context of the Tour de France.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-7155_1024x1024.jpg?v=1768480424\" alt=\"\" /></div>\n<p><em>2025 marked the 111th edition of the men's Liège-Bastogne-Liège (Image: Zac Williams/SWpix.com)</em></p>\n<p>And for most people, even when I introduce myself when I’m in the US, they’ll say, “what do you do?” I can’t say, “I run a bicycle racing team”. That makes no sense to your average person in the US. If I say, “well, have you ever watched the Tour de France on TV?” Quite a few people in the US will say, “yes, I have.” And I’ll say, “okay, well, I run one of the teams that races in the Tour de France.” And then they say, “oh, great!” And that’s all well and good, but that’s extremely limiting, that essentially our audience is all focused in on one race every year and the rest of the calendar is just a gobbledygook of nothingness.</p>\n<p><strong>Thomas, we were talking about how Flanders Classics organises those races in the lead up to the Tour of Flanders and then that’s the landmark event. That’s kind of an example of what Jonathan’s speaking about here, how we can lead up to the big landmark event, everyone’s watching it and understands the kind of narrative before that. Can you talk a bit about how, within your races, you try to engage fans in that way?</strong></p>\n<p><em><strong>TVDS:</strong></em> Our position is that what we do today has become more competitive, because our competitors are not just other sports, but also the entertainment business. Attention spans are reduced. Our kids have a hard time concentrating for more than a few minutes today, so how are we going to keep the attention of cycling fans today with six hour races? </p>\n<p>So what we try to do is to create day experiences. We went for circuits, respecting the heritage of cycling, so we still use the same hills, the same climbs, the same landmarks as we used to, but we try to create day experiences where fans come in the morning, they stay all day, they see the riders multiple times. We create hospitality areas. We really want to offer them something else than just seeing sixty seconds of a peloton flying by. </p>\n<p>We’ve been quite innovative with those ideas. Today, we host 15,000 VIPs at the Tour of Flanders, which I think is the biggest VIP event in cycling today. Formula One does that every week. It’s completely different, but we try to become more modern and try to attract the attention of more fans than just the regular cycling fans that we see here today, because the challenge we face today is that not that we have to preserve the existing fans, but we also have to attract new fans, younger fans, fans that understand the sport, because it all starts with the calendar and the product. </p>\n<p>The calendar is a crazy patchwork that only the real fans understand today, but if you look at Formula One, the NBA, the NFL, that’s really a uniform product, where everybody understands the competition and what they’re working towards. And even for regular cycling fans, it’s sometimes hard to understand, we have a lot of overlap. </p>\n<p>The pinnacle is the WorldTour, but we have two hundred days of racing in the WorldTour, and some days we have three WorldTour races at the same time. So try to explain to a new fan that the stars are racing in three different races on the same day. Not to mention the ProSeries races and the 1.1 races where they might go as well.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-104645_be144b5d-3352-46e3-8265-2a5659b973d9_1024x1024.jpg?v=1768480581\" alt=\"\" /></div>\n<p><em>Every year thousands of fans gather at the roadside to spectate at the Tour of Flanders (Image: Zac Williams/SWpix.com)</em></p>\n<p><em><strong>JV: </strong></em>And those people say, “well, which race is more important?” And you can’t answer it. A lot of times we’ve got overlapping races. You can’t answer it. One of the interesting things is we studied up on what the audience sizes are. What are we doing right in cycling? What are we doing wrong? What are they doing right in Formula One and some other sports? What are they doing wrong?</p>\n<p>Interestingly, cycling has about 65-70% of the total audience of Formula One. You think it doesn’t seem that way, right? Almost everybody knows about Formula One and cycling is much more of a niche sport, but the top line audience is about the same. But what happens is, Formula One funnels down. You get this huge level of spectators and it goes to ten teams and twenty drivers. That’s it. All of your fame, all of your sponsorship, all of the revenue is just driven right down into this funnel. And so it becomes an incredibly easy to follow and very concentrated audience base.</p>\n<p>In cycling, what do we do? Instead, we go, here’s our top line audience, which is great, and we provide a lot of value. But instead, we go out to five hundred race days with six hundred athletes. Who do you follow? You know? And the default is, “well, I’ll follow the Tour de France.” Which is like, “no, no, no, no! But there’s so many other great races, and there’s so many great riders and there’s so many great teams.” But instead, we dilute it out into nothing, as opposed to concentrating it.<br /> <br /><strong>If we don’t dilute all of those races and say we only have ten, what then happens to those smaller organisers, to those smaller races and to the riders who aren’t racing those top ten landmark events?</strong></p>\n<p><em><strong>JV:</strong></em> Well, I think the key in this is to develop firmer partitions between first division races, second division races and third division races. For instance, this year in Trofeo Laigueglia. I don’t know how many people know about Trofeo Laigueglia, it’s a 1.Pro race in the south of Italy, a small race. Juan Ayuso won it. Congratulations to Juan Ayuso, but here’s a rider getting paid maybe €3-4 million a year that wins the thing.</p>\n<p>There are Italian Continental-level pros there that are racing, that basically have to work in a pizza shop in the off-season in order to survive. That race should be a third division race for third division teams and there’s a series for the third division teams, and the winner of that series, you know, is something prestigious. And then there’s a second division, a firm second division, and the winner of those races at the end of the season also gets something. And then your first division races.</p>\n<p>As opposed to having UAE [Team Emirates-XRG], who quite often this year would send a roster with a total value of probably over €10 million to a little tiny village race in the south of Italy. And we’re diluting the value of our own sport by doing that.</p>\n<p><em><strong>TVDS:</strong></em> We have two hundred WorldTour racedays today. And the question is which races would be the pinnacle in the future? We need to reduce those two hundred days. That’s for sure. Do we go to sixty days? To eighty days? What do we do? We all believe that the Tour de France, rightfully so, is the biggest race in the world. It’s almost three and a half weeks. Should the Giro and the Vuelta in the future also be three and a half weeks? Because we need to reduce that number of race days. It’s clear, the monuments are the monuments. Which are the other races that we want in that top tier?</p>\n<p>But creating a top tier that has a reduced number of days will also create a strong second tier, because a lot of races that are WorldTour today are very well organised. And I don’t mind, both on the organisational level, but also on the team level, to work with a real promotion and relegation system where sporting merit plays a role and where you incentivise the bottom to try to get better. Because what we have today, not only amongst teams, but also amongst organisers, there’s no real standard of organisation today.</p>\n<p>We always say about ourselves that we want to be an A-level brand in organising, so we really put the standards high for ourselves, because we think if we do that, that we’ll drag in the whole system. But that’s, of course, a little bit naive, because we see races today that are also part of the WorldTour, that we think don’t have the organisational standards to be part of the WorldTour.</p>\n<p><em><strong>JV: </strong></em>And with the Tour of Flanders, the Flanders week is a perfect idea for the future of cycling, right? It builds all week, you know. You start out with E3 [Harelbeke], Gent-Wevelgem, then you move on to Waregem [Dwars door Vlaanderen], and then boom! The big event at the end of the week, the Tour of Flanders. It’s a building, you can follow it all week. You can follow the same riders competing all week. You can see which ones are coming on the form, which ones aren’t, and then boom! The Tour of Flanders, the crown jewel of the week. To me, that’s the template. Like, what you guys do, honestly is the template of how things should go forward.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-100238_1024x1024.jpg?v=1768480869\" alt=\"\" /></div>\n<p><em>E3 Saxo Classic, alongside Gent-Wevelgem and Dwars door Vlaanderen, is a key race in the build up to the Tour of Flanders (Image: Zac Williams/SWpix.com)</em></p>\n<p><em><strong>TVDS: </strong></em>But then still, we get frustrated sometimes. Because we always said we want the best riders in the best races, and we think that the Tour of Flanders is one of the best one-day races in the world. But at the same time, we don’t always get the participation field that we would like, because we also see riders that might be competitive in our race that prefer not to race it, because it’s not fitting into their schedule. And so it’s always a challenge for us as well to get the field that we think would be the ideal field for our product to grow.<br />  <br /><strong>The Tour de France is <em>the</em> landmark race. ASO have this monopoly, they have all of the power. Could we really see these changes whilst they still have this massive stranglehold on the economics of our sport? Is it possible to do that without them being on board?</strong></p>\n<p><em><strong>JV:</strong></em> That’s hard. The media valuation of the Tour de France versus all the other races, from a commercial standpoint, you would be blown away if you knew how much. This is how when we get our commercial end-of-year report on which races gave our sponsors value, you could combine every race we do all year long, and it’s still not as much as the Tour de France alone. </p>\n<p>From a commercial valuation standpoint, winning a stage of the Tour de France, being in the breakaway à la Ben Healy on stage six of the Tour de France is worth more than winning the entire Vuelta by a long way. So obviously that’s the way it is, that’s the reality that we exist in.</p>\n<p>But what I would say is, what would be great is if we could build up all of these other events and the Tour de France can be the crown jewel, without a doubt. But let’s really try to make all these other races more international, more interesting to a broader audience and more understandable on a year-long evergreen format, so that people can follow it, like Formula One series week to week.</p>\n<p><em><strong>TVDS:</strong></em> I don’t want to sound frustrated, because I think we still run the most beautiful sport in the world. It’s the people’s sport as well. It’s very attractive. You can get close to the stars, which is very exceptional. But at the same time, I think we’re really missing the boat here. And if we don’t pay attention, by 2040 if you see all of the other sports that target younger audiences coming up, you see a lot of private equity, private investment going into other sports, our competition is growing, and we really need to make sure as a sport, that we that we become future proof. And for that, and here it becomes maybe a little bit political, but for that we will need ASO and we will need the UCI, because there have been tries over the past two decades to start something new, to change the calendar, even to mention a breakaway [competition]. But it’s not going to happen because our sport is so complicated, and we will need everybody, and we will need everybody to understand that if we don’t pay attention, we might be in danger.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_1024x1024.png?v=1768481774\" alt=\"\" /></div>\n<p><em>The Tour de France is the biggest race in the sport (Image: Zac Williams/SWpix.com)</em></p>\n<p><em><strong>JV: </strong></em>This is about making, as opposed to the teams fighting with each other, or the events fighting with each other to gain an uphold inside of cycling, it’s about saying, “no, no, cycling is a sport. Our competition is not with each other.” Sure on the road it’s each other. Our competition is other sports, other forms of entertainment. </p>\n<p>And this is the way, for those of you that watch American football, because it seems like it’s getting pretty popular here in London, the National Football League (NFL), that is one business. Each of those teams is a franchise of that business. The teams are not separate businesses on their own. They are franchises of the NFL. So that means when the NFL decides to do something from a strategic standpoint, they’re doing that for all the players, all the teams. They’re making a global decision and saying we’re going that way or going that way.</p>\n<p>In cycling, what we do is one race or organiser says we’re going to go that way, one team says we’re going to go that way, the UCI says we’re going to go that way, ASO says we’re going to go that way, and we don’t grab a hold of new audiences because of that dilution.</p>\n<p><strong>Everyone who’s watched professional cycling this season will have seen dominance from one team and one rider in particular, UAE Team Emirates and Tadej Pogačar. Some might argue that is diluting the entertainment value of these races. We do see budget caps in other sports. Do you think that’s something that we might see introduced in cycling?</strong></p>\n<p><em><strong>JV:</strong></em> It’s definitely time for it. I mean, you’ve got UAE [Team Emirates-XRG], speaking in US dollars, that’s functioning on about $75 million, competing against quite a few teams that are functioning on $20 million. I mean, there’s a disparity there. It’s more than three times, so you know who’s going to win. Well, I’ll give you two guesses.</p>\n<p>But one of the interesting things in US sports, starting in 1994 the NFL National Football League introduced a hard salary cap. Major League Baseball (MLB) chose not to, and if you look at the audience growth in the NFL, it’s gone up, whereas baseball has stayed fairly steady. Why is that? Because in baseball, the same teams from the big markets (i.e. New York and Los Angeles) win year after year, after year, after year. The smaller teams, I’m from Colorado, we’ve got the Colorado Rockies, people don’t even show up to the games anymore because they’re going to lose. </p>\n<p>So if you are a fan of a team that you just know is going to lose because they’re at such a huge sporting disadvantage, are you going to watch? So again, it’s about bringing more people in. So think of it this way, because people get a little bit upset about budget caps and salary caps. Why don’t you just let the best rider be on the best team? But how much fun would it be if we had this, right? So Pogačar, the greatest rider in the world, strongest rider in the world, probably the best rider of all time, will be proven in a few more years, but he has to race for Cofidis. </p>\n<p>Now imagine that. The racing is going to be pretty fun from this standpoint, because he’s going to have a team that has no capacity of controlling the race whatsoever. He’s going to have to figure it out on his own, whereas there’s this other team and they maybe have five strong riders. They’re not as good as Tadej by any stretch of the imagination, but they’ve got more depth. Well, now who wins? Now the race is pretty interesting, because the outcome is not certain, whereas right now, we watched a hundred of the two-hundred race days that we were talking about won by one team, just monotonously over and over again.</p>\n<p>And of course, you could say, “okay JV, you’re just jealous here.” And you’re right, I am. But what I would say is, what I’m more concerned about is that the racing becomes boring and that there’s just this one guy that keeps winning, or it’s just this one team that’s super rich that keeps winning. Then, that hurts all of the sport. That’s not just hurting me or hurting Thomas, it hurts everybody, including UAE.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_3930_a74cfcdc-3356-4c66-8ad9-7f2cf93554fc_1024x1024.jpg?v=1768481894\" /></div>\n<p><em>Tadej Pogačar has dominated the sport in the past few seasons (Image: Zac Williams/SWpix.com)</em></p>\n<p><em><strong>TVDS:</strong></em> At the same time, in an ideal world, everyone would be making money, and then budget caps and salary caps are easier to implement. Today no one is making money, except for ASO and RCS, maybe some others. But if you name those other sports, those are sports where everyone is making a whole lot of money today, so they have all of the interest to keep the level playing field and to make it a very competitive environment. </p>\n<p>Today, everyone is just looking at their front yard and trying to take care of themselves, and some do better than others. And I think today we also see a lot of discrepancy in the WorldTour between the first and eighteenth team in terms of professionalism, in the way they approach the sport. And I think the differences are still too big to start discussing salary caps and budget caps today. I think we really need everyone to step up their game today. </p>\n<p>For me, everything starts with the calendar and the product, and then eventually everyone will start making money, and then we can start discussing budget caps, salary caps and try to preserve the product.</p>\n<p><em><strong>JV</strong></em>: It’s interesting. This is from Nielsen ratings of relative return on investment of sponsorships in cycling versus Formula One and football. It’s actually fascinating. In cycling, we do incredibly well when we go into pitch sponsorships. So here’s sort of the operating budget comparison, right? So you’re like, “woah! We’re way down here.” Over there, that’s the value that we’re giving our sponsors versus these other sports per dollar spent. I mean you think, “what the heck? We should be growing.” </p>\n<p>The audience is there. The people are there, but we're just not getting traction off of that. We’re providing incredible value. But now we’ve just got to make it a little more accessible to more people, so that they want to come in. As opposed to these other sports, which we’re beating dollar for dollar, no problem. It’s time for us to kind of change the direction a little bit.</p>\n<p><strong>What would you say is stopping that? Cycling is so loved because of its tradition and history, so there are a lot of people who maybe aren’t so open to these changes.</strong></p>\n<p><em><strong>JV: </strong></em>I think the sport has grown organically over 120 years. There’s a lot of races that have always been in this one little town, and it’s a great little town. It’s just sort of the way it’s always been. And it’s always been in the third week of August. Nobody has actually stepped back and said, “we need to come up with a strategy for the sport.” </p>\n<p>And that is one of the lovely things about cycling. The 140-year history. It’s one of the most incredible parts about it. It’s quirky and kind of fun that these little races have grown up to be these big things, and you kind of don’t want to mess with the history. By no means would I ever suggest turning a 270km monument into a television-friendly 30km criterium. That’s a horrible idea. But the limitation is pushing against that 140 years of organic growth. </p>\n<p>And you know, to be blunt, the UCI isn’t really incentivised to limit that. I mean, one of the biggest sources of revenue for the UCI is sanctioning fees for races. So for them, the more races there are, the more money they’re going to make. So, I mean, it’s like “hell! Let’s have a thousand days of racing. Let’s just keep going with it.” So I think there’s some roadblocks of tradition and some finance, just some sort of old fashioned “well, it’s just always been this way” that we’ve got to get over the top of.</p>\n<p><em><strong>TVDS:</strong></em> And you have a monopolist in the room, of course. We can all point a finger at ASO and we often do so. At the same time, if we were in their shoes, maybe we’d be doing the same thing, because they control the whole sport, so we really can’t blame them. At the same time, there’s also this misperception in Western Europe that we’re a global sport. You’re from the US, but in Western Europe, we really think that cycling is big. Especially in Flanders, we think it’s the biggest sport in the world. </p>\n<p>We’re not a global sport today, but we do have the potential to become a global sport. And for that reason, we need a mix of heritage, but we also need to be able to conquer new markets. Cycling as a participation sport is huge in North and South America, for example, but we’ve never been able to turn that into a business model for professional cycling. </p>\n<p>So we have a lot of challenges, not only ASO, but there’s also a lot of other political elements in the room. There’s this whole history of all these organisers that we’re dragging with us that are not willing to modernise and to look at it the way we and some other people look at the business today. So it’s quite a challenge. </p>\n<p>At the same time, I think we’ve put in so much effort over the past years. We’ve discussed it with so many people, I think eventually it will happen. And it will happen with the international federation, it will probably happen, maybe not in the first phase, but I’m sure afterwards with ASO. But it has to happen, because if not, it’s going to be a real challenge for us, for the teams. </p>\n<p>We’ve seen these past weeks, how hard it is for a lot of teams, even at the WorldTour level, to find sponsorship. Even a couple of teams have folded. So it’s really challenging times. At the same time, I think it might be a wake up call or a first wake up call, and some will follow in the following years, and then eventually, we will be able to turn it into a global sport one day.<br />  <br /><strong>Standing by the side of the road and seeing the riders for free, there’s pretty much no other sport in the world where you can do that. When talking about putting things in circuits and selling tickets to VIPs, how do you balance that with keeping what makes cycling special and unique?</strong></p>\n<p><em><strong>TVDS:</strong></em> I think cycling has been free forever and a big aspect of it will always be that we use the public domain and the public domain is not ours. It’s not a stadium. It belongs to everyone, so people will be able to see their cycling for free at the same time. I really think that we should start thinking about business models. As Flanders Classics, we have to start thinking about business models where we are able to turn fans into customers.</p>\n<p>At the same time, I think the real leverage is not the individual leverage, it’s not the team’s individual additional business that they can generate. I think it needs to be a global identity where we package rights, where we package even hospitality rights, where we package media rights, because then the leverage will be much bigger if we all do it together today. Our media rights individually and compared to the Tour de France, we are a fraction. </p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_108686_1024x1024.jpg?v=1768482206\" alt=\"\" /></div>\n<p><em>(Image: Zac Williams/SWpix.com)</em></p>\n<p>I told JV before this talk, we’re really in favour of a model in which we share with all the stakeholders in the cycling world today, because they have the stars and they don’t generate any money out of the media rights that we generate today. At the same time, if we would have to share our profits today with eighteen WorldTour teams, they wouldn’t even be able to afford maybe a fifth of the salary of one of their riders, and they have thirty riders. </p>\n<p>So it doesn’t make any sense today, but if we would be able to package all of our rides together into a clear, very understandable calendar, then you will generate a lot of sponsorship interest from global brands, a lot of international media deals that go way beyond what we’re all making individually today.</p>\n<p><em><strong>JV:</strong></em> It’s really just about turning cycling into one entity that is trying to be competitive on the global stage, as opposed to fighting each other. I mean, Thomas and I obviously agree with each other. Now if you had Janelle Monero, the head of ASO, on stage, or David Lappartient, the head of the UCI, we would probably have some bigger differences to be discussing.<br />  <br /><strong>This is clearly a really productive, open dialogue between the two of you, but it’s probably not like that across the whole calendar. Do you think teams and organisers could work better together? Is that the solution?</strong></p>\n<p><em><strong>JV:</strong></em> I mean, we have to. This is a great working relationship. But you’ve also got, on Thomas’ side, a very entrepreneurial race organisation that’s actually seeing how other sports are operating. They’re coming at it from the entrepreneur’s angle. They’re coming at it from a strategic angle. </p>\n<p>Again, a lot of race organisers are not looking at growing the sport. They’re looking at guarding what they have. They’re not interested in making this bigger and better. Ultimately, it is about making it better. Better viewing, more interesting, so that you can follow the races week to week and that it’s actually building towards something. Building towards a true championship.</p>\n<p>Right now with the UCI rankings, do you care who wins the UCI rankings? No, but what you do care about is who finishes nineteenth, because that team is getting spat out at the end. Everyone’s following the race for nineteenth. We should all be interested in who’s going to win the rankings, and in order to do that, you’ve got to have a series of races that make sense and aren't just all over the place.</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"26b6878c4a46e1d0278ff7457d0eb3cff050d62959b1e9d6ddafcb9f5ed079c4","category":"Cycling"}