{"title":"WebKit features for Safari 26.3","link":"https://webkit.org/blog/17798/webkit-features-for-safari-26-3/","date":1770832849000,"content":"<p>Safari 26.3 is here, with practical improvements for performance and user experience. This release gives you new tools for optimizing how your content is delivered and better control over navigation in single-page applications. We’ve also fixed issues developers have run into with anchor positioning, multi-column layouts, and other features — making them more robust and reliable. Plus, we’ve refined the everyday browsing experience by fixing issues we found while testing real websites.</p>\n<h3>Video in visionOS</h3>\n<p>Now in Safari 26.3 in visionOS, fullscreen video playback automatically dims the user’s surroundings to help put the focus on content.</p>\n<figure><img src=\"https://webkit.org/wp-content/uploads/world_around_video_dimmed_Safari263_visionOS.png\" alt=\"A floating rectangular image of a dog running at a dog show, covered by the site &quot;The Ultimate Spectacular&quot;. This rectangle is floating in a world covered by sandy hills, with mountains in the background, and a big cloudy sky above. This is a 3D environment in visionOS. The image is a video that's full brightness, while the environment around it is not as bright as normal. It's dimmed.\" width=\"1920\" height=\"1080\" srcset=\"https://webkit.org/wp-content/uploads/world_around_video_dimmed_Safari263_visionOS.png 1920w, https://webkit.org/wp-content/uploads/world_around_video_dimmed_Safari263_visionOS-300x169.png 300w, https://webkit.org/wp-content/uploads/world_around_video_dimmed_Safari263_visionOS-1024x576.png 1024w, https://webkit.org/wp-content/uploads/world_around_video_dimmed_Safari263_visionOS-768x432.png 768w, https://webkit.org/wp-content/uploads/world_around_video_dimmed_Safari263_visionOS-1536x864.png 1536w\" /><figcaption>Now when a user plays a video in Safari (like <a href=\"https://www.youtube.com/watch?v=Z6wnDWzhaDA\">this trailer</a> on YouTube for <a href=\"https://tv.apple.com/us/show/top-dogs/umc.cmc.6snqtei46tkkch7odsnoq9nac\"><i>Top Dogs</i></a>) and enters fullscreen, the world around the video is dimmed in visionOS 26.3.</figcaption></figure>\n<h2>Zstandard</h2>\n<p>Safari 26.3 supports Zstandard (Zstd), a compression algorithm you can use to make your website’s files smaller before sending them to browsers. Like gzip and Brotli, it compresses text-based assets — HTML, CSS, JavaScript, JSON, and SVG — so less data travels over the network.</p>\n<p>Zstandard decompresses quickly, reducing the workload on users’ devices. It also compresses fast enough to do on-the-fly, whereas Brotli is typically pre-compressed during your build process.</p>\n<p>To use it, configure your server to compress responses with Zstandard and send the <code>Content-Encoding: zstd</code> header. Servers will automatically fall back to other compression methods for browsers that don’t have support yet.</p>\n<p>Zstandard support is available in Safari 26.3 on iOS 26.3, iPadOS 26.3, visionOS 26.3, and macOS Tahoe 26.3 — and not in Safari 26.3 on earlier versions of macOS. This is because support comes from the system networking stack used by Safari.</p>\n<h2>Navigation API</h2>\n<p>When building single-page applications with the Navigation API, you might need a reliable way to cancel ongoing work when a navigation gets interrupted. Maybe the user clicked another link before the previous navigation finished, they hit the back button, or your code called <code>navigation.navigate()</code> again. Whatever the reason, you don’t want to keep processing a navigation that’s no longer relevant.</p>\n<p>In Safari 26.3, the Navigation API exposes a <code>AbortSignal</code> on <code>NavigateEvent</code> which triggers when the navigation is aborted, giving you a standard way to clean up and cancel work:</p>\n<pre><code><span>navigation</span>.<span>addEventListener</span>(<span>'navigate'</span>, (<span>event</span>) <span>=</span><span>&gt;</span> {\n  <span>event</span>.<span>intercept</span>({\n    <span>async</span> <span>handler</span>() {\n      <span>const</span> <span>response</span> <span>=</span> <span>await</span> <span>fetch</span>(<span>'/api/data'</span>, {\n        <span>signal</span><span>:</span> <span>event</span>.<span>signal</span>  <span>// Automatically cancels if navigation is aborted\n</span>      });\n\n      <span>const</span> <span>data</span> <span>=</span> <span>await</span> <span>response</span>.<span>json</span>();\n      <span>renderContent</span>(<span>data</span>);\n    }\n  });\n});\n</code></pre>\n<p>If the user navigates away before the fetch completes, the request automatically cancels. You can also listen to the signal’s <code>abort</code> event to clean up other resources like timers or animations.</p>\n<p>This gives you fine-grained control over what happens when navigations don’t complete, helping you avoid memory leaks and unnecessary work.</p>\n<h2>Bug fixes and more</h2>\n<p>Along with the new features, WebKit for Safari 26.3 includes additional improvements to existing features.</p>\n<h3>CSS</h3>\n<ul>\n<li>Fixed a style resolution loop that occurred when a <code>position-try</code> box was inside a <code>display: none</code> ancestor. (163691885)</li>\n<li>Fixed an issue where anchor-positioned elements repeatedly transitioning from <code>display: block</code> to <code>display: none</code> cause position jumps during animation. (163862003)</li>\n<li>Fixed an issue where <code>fixed</code>-positioned boxes using <code>position-area</code> were incorrectly included in the scrollable containing block calculation. (164017310)</li>\n<li>Fixed an issue where <code>text-decoration: underline</code> was rendered too high when <code>text-box-trim</code> was applied to the root inline box. (165945326)</li>\n<li>Fixed a multi-column layout issue where the <code>widows</code> and <code>text-indent</code> properties are applied cause an incorrect indent on the portion of the paragraph that flows into the next column. (165945497)</li>\n<li>Fixed an issue where CSS cursors like <code>move</code>, <code>all-scroll</code>, <code>ew-resize</code>, and <code>ns-resize</code> did not display correctly. (166731882)</li>\n</ul>\n<h3>DOM</h3>\n<ul>\n<li>Fixed incorrect timestamp handling and switched to use the raw touch timestamp. (164262652)</li>\n</ul>\n<h3>Media</h3>\n<ul>\n<li>Fixed an issue where the fullscreen button in visionOS inline video controls did not visually indicate interactivity by extending the glow effect to all <code>button.circular</code> elements. (164259201)</li>\n<li>Fixed Video Viewer mode for <code>iframe</code> videos on macOS. (164484608)</li>\n<li>Fixed an issue where Safari could not play live videos when the <code>sourceBuffer</code> content is removed and re-added causing the seek to not complete. (165628836)</li>\n</ul>\n<h3>Rendering</h3>\n<ul>\n<li>Fixed an issue where positioned or transformed <code>&lt;img&gt;</code> elements containing HDR JPEGs with gain maps would incorrectly render as SDR. (163517157)</li>\n</ul>\n<h3>Safe Browsing</h3>\n<ul>\n<li>Fixed a bug where if Safe Browsing queried for an entry on the Public Suffix List, and a Safe Browsing vendor responded that the whole effective TLD was unsafe, the whole site would be marked as unsafe. (168155375)</li>\n</ul>\n<h2>Feedback</h2>\n<p>We love hearing from you. To share your thoughts, find us online: Jen Simmons on <a href=\"https://bsky.app/profile/jensimmons.bsky.social\">Bluesky</a> / <a href=\"https://front-end.social/@jensimmons\">Mastodon</a>, Saron Yitbarek on <a href=\"https://bsky.app/profile/saron.bsky.social\">BlueSky</a> / <a href=\"https://front-end.social/@saron\">Mastodon</a>, and Jon Davis on <a href=\"https://bsky.app/profile/jondavis.bsky.social\">Bluesky</a> / <a href=\"https://mastodon.social/@jondavis\">Mastodon</a>. You can follow WebKit <a href=\"https://www.linkedin.com/in/apple-webkit/\">on LinkedIn</a>.</p>\n<p>If you run into any issues, we welcome your <a href=\"https://bugs.webkit.org/\">bug report</a>. Filing issues really does make a difference.</p>\n<p>You can also find this information in the <a href=\"https://developer.apple.com/documentation/safari-release-notes/\">Safari release notes</a>.</p>","author":"","siteTitle":"Blog – WebKit","siteHash":"7f8dbea0b8f53db2e11a2faa08c6dca9954c01638d09a2ce585b77a60d10f7a1","entryHash":"2a85bb14362fbaa8dc7ba5653f1915e151461fa0b30725a5231e0a08aa8dd29a","category":"Tech"}