{"title":"ภาษี","link":"https://lewcpe.com/blog/archives/2343/tax/","date":1733412650000,"content":"<p>สองสามวันนี้การเมืองไทยมีประเด็นเรื่องภาษี คิดเรื่องนี้ไว้หลายอย่าง เลยจดรวมๆ กันมา</p>\n\n\n\n<ul>\n<li><strong>การลดภาษีควรลดเป็นเครดิต:</strong> ประเด็นหนึ่งที่ไม่เท่าเทียมกันอย่างมากในไทย คือการ “ลดหย่อนภาษี” แปลว่าไม่ใครจ่ายภาษีฐานไหนอยู่ ก็จะได้รับการลดหย่อน ตัดภาษีออกจากฐานสูงสุด การลดหย่อนแบบนี้ไม่ดีและไม่แฟร์ ไม่ดีเพราะคนฐานภาษีสูงๆ จะสามารถซื้อมั่วซั่วอะไรก็ได้ยังไงก็กำไรภาษี ทั้งที่การลดหย่อนควรเป็นการจูงใจให้เขาได้เลือกการลงทุนที่ดีและนำไปสู่การลงทุนอื่นๆ ต่อไป ไม่แฟร์เพราะคนที่เริ่มมีเงินเก็บบ้างฐานภาษีไม่สูงมาก กลับมีการจูงใจน้อย ทุกวันนี้คนภาษีฐานต่ำๆ โอดโอยกันว่ากองทุนที่ซื้อมายังขาดทุนกันอยู่ กาารให้เป็นเครดิตควรล็อกเป็น % ตายตัว เช่น ซื้อ RMF ลดภาษีได้ 15% ซื้อแสนนึงลดได้ 15,000 บาท ก็ลดได้เท่านี้ทุกคน ซื้อพลาดกองขาดทุนเกิน 15% ก็ขาดทุนเท่ากัน คนที่ฐานภาษีสูงมากๆ 25-35% นั้นไม่ต้องไปจูงใจเขามาก เขาก็ลงทุนกันเองเป็นอยู่แล้ว (แต่ก็ให้ควรให้เท่าๆ กันเพื่อความแฟร์)</li>\n\n\n\n<li><strong>ฐานภาษีควรสูงกว่านี้:</strong> ฐานภาษีสูงสุดของไทยอยู่ที่ 35% นั้นสูงไม่พอ ส่วนตัวมองว่าไปได้ถึง 49% สำหรับคนยอดพิรามิดสูงสุด</li>\n\n\n\n<li><strong>การลดภาษีบุคคล ควรอาศัยการเลื่อนขั้นบันได:</strong> อ้างถึงข้อก่อนหน้า ว่าเราไม่จำเป็นต้องขึ้นภาษีอย่างเดียว แม้จะคงขั้นบันใดเอาไว้ หรือเพิ่มบันไดขั้นสูง แต่เราควรพิจารณาปรับเลื่อนขั้นบันไดตามช่วงเวลา เงินเดือนสองหมื่นยังถือว่าควรจ่ายขั้นไหน อาจจะมองถึงการแข่งขันในกรณีแรงงานข้ามชาติที่เข้ามาทำงานในไทยว่าอัตราภาษีรวมเราก็ต้องแข่งขันได้</li>\n\n\n\n<li><strong>เพิ่มฐานภาษีต่ำๆ:</strong> แม้จะเลื่อนฐานภาษีได้ แต่ควรพยายามขยายฐานผู้จ่าย (ก่อนลดหย่อน) ให้มากขึ้น คนมีรายได้เกินระดับพออยู่ได้ควรต้องยื่นและต้องจ่ายในฐานต่ำมากๆ เช่น หากอยากลดภาษีให้เพิ่มฐาน 1% เข้ามาแทนที่ฐาน 5% เดิม แล้วเลื่อนฐาน 5% ออกไป คนจ่ายฐาน 1% อาจจะแทบไม่ได้จ่ายเพราะลดหย่อนต่างๆ ก็ได้คืนหมด แต่ก็ให้อยู่ในระบบภาษี ให้ต้องยื่น และอาจจะต้องจ่ายบ้างหากไม่ได้ลดหย่อนอะไรเลย</li>\n\n\n\n<li><strong>ภาษีอื่นๆ นอกจากภาษีรายได้ ควรปรับขึ้น:</strong> ภาษีมรดก ภาษีที่ดิน ภาษีลาภลอย (รถไฟฟ้า ทางด่วน ผ่านหน้าบ้าน) แม้จะมีแล้วแต่อ่อนแอมาก มีช่องโหว่และถูกไป ภาษีเชิงลงโทษอย่างพื้นที่รกร้างว่างเปล่าต้องมีปรับขึ้นไปเรื่อยๆ จนถึง 10-20% ของราคาประเมินต่อปี (ไม่จ่ายครบ X ปีให้ที่ดินตกเป็นของท้องถิ่น) พื้นที่ธุรกิจที่ปรับเป็นภาษีที่ดินแล้วกลับจ่ายถูกกว่าภาษีโรงเรือนต้องปรับกลับใหม่ให้เท่าเดิม</li>\n\n\n\n<li><strong>VAT ขึ้นได้แต่ควรมีมาตรการชดเชย:</strong> VAT ของเราถูกเกินไปและควรขึ้นมาสักพักแล้ว แต่ก็ต้องมีมาตรการช่วยเหลือ ส่วนที่เพิ่มอาจจะกันบางส่วนเข้าเป็นบัตรสวัสดิการ เปิดรอบสมัครอย่างชัดเจน มีเกณฑ์สมัครชัดเจน (เปิดยิ่งถี่ยิ่งดี ให้ดีมากคือใครเริ่มจนสมัครได้ทันที เหมือนสวัสดิการตกงานของประกันสังคม)  แทนที่ทุกวันนี้ที่ต้องรอลุ้น อันนี้ไปเลียนแบบสิงคโปร์ที่เรียกบัตรคนจนของเขาว่าบัตร GST เลยทีเดียว</li>\n</ul>","author":"lewcpe","siteTitle":"LewCPE's Blog","siteHash":"be60e5c67c985916e913225e0fa8794018c33c335df997dc89cd85d60cc43d78","entryHash":"2bac2ff7b4cb7ac4d74dd81cfb3fbebf07e60bf121ab34a3af52929cfdba64c3","category":"Thai"}