{"title":"Smashing Animations Part 7: Recreating Toon Text With CSS And SVG","link":"https://smashingmagazine.com/2025/12/smashing-animations-part-7-recreating-toon-text-css-svg/","date":1765965600000,"content":"<p>After finishing a project that required me to learn everything I could about CSS and SVG animations, I started writing this series about Smashing Animations and “<a href=\"https://www.smashingmagazine.com/2025/05/smashing-animations-part-1-classic-cartoons-inspire-css/\">How Classic Cartoons Inspire Modern CSS</a>.” To round off this year, I want to show you how to use modern CSS to create that element that makes Toon Titles so impactful: their typography.</p>\nTitle Artwork Design\n<p>In the silent era of the 1920s and early ’30s, the typography of a film’s title card created a mood, set the scene, and reminded an audience of the type of film they’d paid to see.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/1-typographic-title-cards.png\" /></p>\n<p>Cartoon title cards were also branding, mood, and scene-setting, all rolled into one. In the early years, when major studio budgets were bigger, these title cards were often illustrative and painterly. </p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/2-tom-jerry-title-cards.png\" /></p>\n<p>But when television boomed during the 1950s, budgets dropped, and cards designed by artists like Lawrence “Art” Goble adopted a new visual language, becoming more graphic, stylised, and less intricate.</p>\n<p><strong>Note:</strong> <em>Lawrence “Art” Goble is one of the often overlooked heroes of mid-century American animation. He primarily worked for Hanna-Barbera during its most influential years of the 1950s and 1960s.</em></p>\n<p>Goble wasn’t a character animator. His role was to create atmosphere, so he designed environments for <em>The Flintstones</em>, <em>Huckleberry Hound</em>, <em>Quick Draw McGraw</em>, and <em>Yogi Bear</em>, as well as the opening title cards that set the tone. His title cards, featuring paintings with a logo overlaid, helped define the iconic look of Hanna-Barbera.</p>\n<p>Goble’s artwork for characters such as Quick Draw McGraw and Yogi Bear was effective on smaller TV screens. Rather than reproducing a still from the cartoon, he focused on presenting a single, strong idea — often in silhouette — that captured its essence. In “The Buzzin’ Bear,” Yogi buzzes by in a helicopter. He bounces away, pic-a-nic basket in hand, in “Bear on a Picnic,” and for his “Prize Fight Fright,” Yogi boxes the title text.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/3-title-cards-yogi-bear.png\" /></p>\n<p>With little or no motion to rely on, Goble’s single frames had to create a mood, set the scene, and describe a story. They did this using flat colours, graphic shapes, and typography that was frequently integrated into the artwork.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/4-title-cards-quick-draw-mcgraw.png\" /></p>\n<p>As designers who work on the web, toon titles can teach us plenty about how to convey a brand’s personality, make a first impression, and set expectations for someone’s experience using a product or website. We can learn from the artists’ techniques to create effective banners, landing-page headers, and even good ol’ fashioned splash screens.</p>\nToon Title Typography\n<p>Cartoon title cards show how merging type with imagery delivers the punch a header or hero needs. With a handful of <code>text-shadow</code>, <code>text-stroke</code>, and <code>transform</code> tricks, modern CSS lets you tap into that same energy.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/5-title-cards-augie-doggie.png\" /></p>\nThe Toon Text Title Generator\n<p>Partway through writing this article, I realised it would be useful to have a tool for generating text styled like the cartoon titles I love so much. <a href=\"https://stuffandnonsense.co.uk/toon-text/tool.html\">So I made one.</a></p>\n<p>My Toon Text Title Generator lets you experiment with colours, strokes, and multiple text shadows. You can adjust paint order, apply letter spacing, preview your text in a selection of sample fonts, and then copy the generated CSS straight to your clipboard to use in a project.</p>\nToon Title CSS\n<p>You can simply copy-paste the CSS that the Toon Text Title Generator provides you. But let’s look closer at what it does.</p>\n<h3>Text shadow</h3>\n<p>Look at the type in this title from Augie Doggie’s episode “Yuk-Yuk Duck,” with its pale yellow letters and dark, hard, offset shadow that lifts it off the background and creates the illusion of depth.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/6-toon-text-collection.png\" /></p>\n<p>You probably already know that <code>text-shadow</code> accepts four values: (1) horizontal and (2) vertical offsets, (3) blur, and (4) a colour which can be solid or semi-transparent. Those offset values can be positive or negative, so I can replicate “Yuk-Yuk Duck” using a hard shadow pulled down and to the right:</p>\n<pre><code>color: #f7f76d;\ntext-shadow: 5px 5px 0 #1e1904;\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/7-toon-text-collection.png\" /></p>\n<p>On the other hand, this “Pint Giant” title has a different feel with its negative semi-soft shadow:</p>\n<pre><code>color: #c2a872;\ntext-shadow:\n  -7px 5px 0 #b100e,\n  0 -5px 10px #546c6f;\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/8-toon-text-collection.png\" /></p>\n<p>To add extra depth and create more interesting effects, I can layer multiple shadows. For “Let’s Duck Out,” I combine four shadows: the first a solid shadow with a negative horizontal offset to lift the text off the background, followed by progressively softer shadows to create a blur around it:</p>\n<pre><code>color: #6F4D80;\ntext-shadow:\n  -5px 5px 0 #260e1e, /* Shadow 1 */\n  0 0 15px #e9ce96,   /* Shadow 2 */\n  0 0 30px #e9ce96,   /* Shadow 3 */\n  0 0 30px #e9ce96;   /* Shadow 4 */\n</code></pre>\n\n<p>These shadows show that using <code>text-shadow</code> isn’t just about creating lighting effects, as they can also be decorative and add personality.</p>\n<h3>Text Stroke</h3>\n<p>Many cartoon title cards feature letters with a bold outline that makes them stand out from the background. I can recreate this effect using <code>text-stroke</code>. For a long time, this property was only available via a <code>-webkit-</code> prefix, but that also means it’s now supported across modern browsers.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/9-toon-text-collection.png\" /></p>\n<p><code>text-stroke</code> is a shorthand for two properties. The first, <code>text-stroke-width</code>, draws a contour around individual letters, while the second, <code>text-stroke-color</code>, controls its colour. For “Whatever Goes Pup,” I added a <code>4px</code> blue stroke to the yellow text:</p>\n<pre><code>color: #eff0cd;\n-webkit-text-stroke: 4px #7890b5;\ntext-stroke: 4px #7890b5;\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/10-toon-text-collection.png\" /></p>\n<p>Strokes can be especially useful when they’re combined with shadows, so for “Growing, Growing, Gone,” I added a thin <code>3px</code> stroke to a barely blurred <code>1px</code> shadow to create this three-dimensional text effect:</p>\n<pre><code>color: #fbb999;\ntext-shadow: 3px 5px 1px #5160b1;\n-webkit-text-stroke: 3px #984336;\ntext-stroke: 3px #984336;\n</code></pre>\n\n<h3>Paint Order</h3>\n<p>Using <code>text-stroke</code> doesn’t always produce the expected result, especially with thinner letters and thicker strokes, because by default the browser draws a stroke over the fill. Sadly, CSS still does not permit me to adjust stroke placement as I often do in Sketch. However, the <code>paint-order</code> property has values that allow me to place the stroke behind, rather than in front of, the fill.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/11-paint-order.png\" /></p>\n<p><code>paint-order: stroke</code> paints the stroke first, then the fill, whereas <code>paint-order: fill</code> does the opposite:</p>\n<pre><code>color: #fbb999;\npaint-order: fill;\ntext-shadow: 3px 5px 1px #5160b1;\ntext-stroke-color:#984336;\ntext-stroke-width: 3px;\n</code></pre>\n\n<p>An effective stroke keeps letters readable, adds weight, and — when combined with shadows and paint order — gives flat text real presence.</p>\nBackgrounds Inside Text\n<p>Many cartoon title cards go beyond flat colour by adding texture, gradients, or illustrated detail to the lettering. Sometimes that’s a texture, other times it might be a gradient with a subtle tonal shift. On the web, I can recreate this effect by using a background image or gradient behind the text, and then clipping it to the shape of the letters. This relies on two properties working together: <code>background-clip: text</code> and <code>text-fill-color: transparent</code>.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/12-toon-text-collection.png\" /></p>\n<p>First, I apply a background behind the text. This can be a bitmap or vector image or a CSS gradient. For this example from the Quick Draw McGraw episode “Baba Bait,” the title text includes a subtle top–bottom gradient from dark to light:</p>\n<pre><code>background: linear-gradient(0deg, #667b6a, #1d271a);\n</code></pre>\n\n<p>Next, I clip that background to the glyphs and make the text transparent so the background shows through:</p>\n<pre><code>-webkit-background-clip: text;\n-webkit-text-fill-color: transparent;\n</code></pre>\n\n<p>With just those two lines, the background is no longer painted behind the text; instead, it’s painted within it. This technique works especially well when combined with strokes and shadows. A clipped gradient provides the lettering with colour and texture, a stroke keeps its edges sharp, and a shadow elevates it from the background. Together, they recreate the layered look of hand-painted title cards using nothing more than a little CSS. As always, test clipped text carefully, as browser quirks can sometimes affect shadows and rendering.</p>\n<h3>Splitting Text Into Individual Characters</h3>\n<p>Sometimes I don’t want to style a whole word or heading. I want to style individual letters — to nudge a character into place, give one glyph extra weight, or animate a few letters independently.</p>\n<p>In plain HTML and CSS, there’s only one reliable way to do that: wrap each character in its own <code>span</code> element. I could do that manually, but that would be fragile, hard to maintain, and would quickly fall apart when copy changes. Instead, when I need per-letter control, I use a text-splitting library like <a href=\"https://www.spltjs.com\">splt.js</a> (although other solutions are available). This takes a text node and automatically wraps words or characters, giving me extra hooks to animate and style without messing up my markup.</p>\n<p>It’s an approach that keeps my HTML readable and semantic, while giving me the fine-grained control I need to recreate the uneven, characterful typography you see in classic cartoon title cards. However, this approach comes with accessibility caveats, as most screen readers read text nodes in order. So this:</p>\n<pre><code>&lt;h2&gt;Hum Sweet Hum&lt;/h2&gt;\n</code></pre>\n\n<p>…reads as you’d expect:</p>\n<blockquote>Hum Sweet Hum</blockquote>\n\n<p>But this:</p>\n<pre><code>&lt;h2&gt;\n&lt;span&gt;H&lt;/span&gt;\n&lt;span&gt;u&lt;/span&gt;\n&lt;span&gt;m&lt;/span&gt;\n&lt;!-- etc. --&gt;\n&lt;/h2&gt;\n</code></pre>\n\n<p>…can be interpreted differently depending on the browser and screen reader. Some will concatenate the letters and read the words correctly. Others may pause between letters, which in a worst-case scenario might sound like:</p>\n<blockquote>“H…” “U…” “M…”</blockquote>\n\n<p>Sadly, some splitting solutions don’t deliver an always accessible result, so I’ve written my own text splitter, <a href=\"https://stuffandnonsense.co.uk/toon-text/splinter.html#section-install\">splinter.js</a>, which is currently in beta.</p>\n<h3>Transforming Individual Letters</h3>\n<p>To activate my Toon Text Splitter, I add a <code>data-</code> attribute to the element I want to split:</p>\n<pre><code>&lt;h2 data-split=\"toon\"&gt;Hum Sweet Hum&lt;/h2&gt;\n</code></pre>\n\n<p>First, my script separates each word into individual letters and wraps them in a <code>span</code> element with class and ARIA attributes applied:</p>\n<pre><code>&lt;span class=\"toon-char\" aria-hidden=\"true\"&gt;H&lt;/span&gt;\n&lt;span class=\"toon-char\" aria-hidden=\"true\"&gt;u&lt;/span&gt;\n&lt;span class=\"toon-char\" aria-hidden=\"true\"&gt;m&lt;/span&gt;\n</code></pre>\n\n<p>The script then takes the initial content of the split element and adds it as an aria attribute to help maintain accessibility:</p>\n<div>\n<pre><code>&lt;h2 data-split=\"toon\" aria-label=\"Hum Sweet Hum\"&gt;\n  &lt;span class=\"toon-char\" aria-hidden=\"true\"&gt;H&lt;/span&gt;\n  &lt;span class=\"toon-char\" aria-hidden=\"true\"&gt;u&lt;/span&gt;\n  &lt;span class=\"toon-char\" aria-hidden=\"true\"&gt;m&lt;/span&gt;\n&lt;/h2&gt;\n</code></pre>\n</div>\n\n<p>With those class attributes applied, I can then style individual characters as I choose. </p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/13-toon-text-collection.png\" /></p>\n<p>For example, for “Hum Sweet Hum,” I want to replicate how its letters shift away from the baseline. After using my Toon Text Splitter, I applied four different <code>translate</code> values using several <code>:nth-child</code> selectors to create a semi-random look:</p>\n<pre><code>/* 4th, 8th, 12th... */\n.toon-char:nth-child(4n) { translate: 0 -8px; }\n/* 1st, 5th, 9th... */\n.toon-char:nth-child(4n+1) { translate: 0 -4px; }\n/* 2nd, 6th, 10th... */\n.toon-char:nth-child(4n+2) { translate: 0 4px; }\n/* 3rd, 7th, 11th... */\n.toon-char:nth-child(4n+3) { translate: 0 8px; }\n</code></pre>\n\n<p>But <code>translate</code> is only one property I can use to <code>transform</code> my toon text. </p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/14-toon-text-collection.png\" /></p>\n<p>I could also rotate those individual characters for an even more chaotic look:</p>\n<pre><code>/* 4th, 8th, 12th... */\n.toon-line .toon-char:nth-child(4n) { rotate: -4deg; }\n/* 1st, 5th, 9th... */\n.toon-char:nth-child(4n+1) { rotate: -8deg; }\n/* 2nd, 6th, 10th... */\n.toon-char:nth-child(4n+2) { rotate: 4deg; }\n/* 3rd, 7th, 11th... */\n.toon-char:nth-child(4n+3) { rotate: 8deg; }\n</code></pre>\n\n<p>But <code>translate</code> is only one property I can use to <code>transform</code> my toon text. I could also <code>rotate</code> those individual characters for an even more chaotic look:</p>\n<pre><code>/* 4th, 8th, 12th... */\n.toon-line .toon-char:nth-child(4n) {\nrotate: -4deg; }\n\n/* 1st, 5th, 9th... */\n.toon-char:nth-child(4n+1) {\nrotate: -8deg; }\n\n/* 2nd, 6th, 10th... */\n.toon-char:nth-child(4n+2) {\nrotate: 4deg; }\n\n/* 3rd, 7th, 11th... */\n.toon-char:nth-child(4n+3) {\nrotate: 8deg; }\n</code></pre>\n\n<p>And, of course, I could add animations to jiggle those characters and bring my toon text style titles to life. First, I created a keyframe animation that rotates the characters:</p>\n<div>\n<pre><code>@keyframes jiggle {\n0%, 100% { transform: rotate(var(--base-rotate, 0deg)); }\n25% { transform: rotate(calc(var(--base-rotate, 0deg) + 3deg)); }\n50% { transform: rotate(calc(var(--base-rotate, 0deg) - 2deg)); }\n75% { transform: rotate(calc(var(--base-rotate, 0deg) + 1deg)); }\n}\n</code></pre>\n</div>\n\n<p>Before applying it to the <code>span</code> elements created by my Toon Text Splitter:</p>\n<pre><code>.toon-char {\nanimation: jiggle 3s infinite ease-in-out;\ntransform-origin: center bottom; }\n</code></pre> \n\n<p>And finally, setting the rotation amount and a delay before each character begins to jiggle:</p>\n<pre><code>.toon-char:nth-child(4n) { --base-rotate: -2deg; }\n.toon-char:nth-child(4n+1) { --base-rotate: -4deg; }\n.toon-char:nth-child(4n+2) { --base-rotate: 2deg; }\n.toon-char:nth-child(4n+3) { --base-rotate: 4deg; }\n\n.toon-char:nth-child(4n) { animation-delay: 0.1s; }\n.toon-char:nth-child(4n+1) { animation-delay: 0.3s; }\n.toon-char:nth-child(4n+2) { animation-delay: 0.5s; }\n.toon-char:nth-child(4n+3) { animation-delay: 0.7s; }\n</code></pre> \n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-7-recreating-toon-text-css-svg/15-toon-text-collection.png\" /></p>\nOne Frame To Make An Impression\n<p>Cartoon title artists had one frame to make an impression, and their typography was as important as the artwork they painted. The same is true on the web.</p>\n<p>A well-designed header or hero area needs clarity, character, and confidence — not simply a faded full-width background image.</p>\n<p>With a few carefully chosen CSS properties — shadows, strokes, clipped backgrounds, and some restrained animation — we can recreate that same impact. I love toon text not because I’m nostalgic, but because its design is intentional. Make deliberate choices, and let a little toon text typography add punch to your designs.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"2d4292daa650f29d62eacc4e7f285837df5e0826d8b6c0fd7f7e1c0c08ddebfa","category":"Tech"}