{"title":"Apple's Low-Cost Colorful MacBook: All the Rumors","link":"https://www.macrumors.com/2026/02/20/low-cost-macbook-latest-rumors/","date":1771627059000,"content":"Apple has been developing a more affordable version of the MacBook, and it's rumored to be launching in under two weeks. This is going to be one of Apple's most unique Macs, because there hasn't really been anything quite like it before.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2025/12/Low-Cost-A18-Pro-MacBook-Feature-Pink.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\nWe've rounded up everything we know about the low-cost MacBook ahead of its March debut.\r<br />\n\r<br />\n<h2>Design</h2>\r<br />\nRumors about the MacBook's design make it sound a lot like the <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>. It will have an aluminum chassis in various colors, and a 12.9-inch or 13-inch display, depending on the rumor.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/Multicolored-Low-Cost-A18-Pro-MacBook-Feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\nIt's possible the low-cost MacBook will have a thin and light design because it's going to use a lower power A-series chip that doesn't require a lot of heat dissipation, but that's not yet confirmed. Apple used to have a 12-inch MacBook with a thin design and a low-power Core M chip, and it's been suggested that this new MacBook could be something of a revival of that machine.\r<br />\n\r<br />\nThinner and lighter typically means more expensive with Apple products, so a super slim design might not be what Apple is optimizing for. Making the low-cost MacBook thinner than the ‌MacBook Air‌ could just confuse the MacBook lineup.\r<br />\n\r<br />\nWith the low-cost <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, Apple keeps the price down by using older display technology that's not as thin, so we could see that same strategy with the low-cost MacBook. A thicker chassis and a super efficient chip could mean a long battery life, which would be ideal for an educational environment.\r<br />\n\r<br />\n<h2>Colors</h2>\r<br />\nThe MacBook is going to come in a <a href=\"https://www.macrumors.com/2026/02/16/low-cost-macbook-yellow-green-blue-pink/\">selection of fun colors</a>, and Apple has tested light yellow, light green, blue, pink, silver, and dark gray, according to <em>Bloomberg</em>. Not all of those colors are likely to ship, but it sounds like we'll get at least four of them.\r<br />\n\r<br />\nApple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> thinks the MacBook will come in yellow, silver, blue, and pink, which would be the same colors that Apple offers for the ‌iPad‌.\r<br />\n\r<br />\n<h2>A-Series Chip</h2>\r<br />\nThe most consistent rumor we've heard about the MacBook is its planned chip. Rather than an M-series Mac chip, Apple is planning to use an A-series chip. The low-cost MacBook is expected to use the A18 Pro chip, which Apple first debuted in the <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/09/A18-Pro-Chip.jpg\" alt=\"\" width=\"1600\" height=\"900\" />\r<br />\nThe A18 Pro uses a second-generation 3-nanometer process. It has a 6-core CPU with four performance cores and two efficiency cores, along with a 6-core GPU and a 16-core Neural Engine for AI-based tasks. In Geekbench benchmarks, the A18 Pro has an average single-core score of 3451, and a multi-core score of 8572. For comparison, the M4 <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> earns a single-core score of 3694 and a multi-core score of 13732 (Apple's next ‌MacBook Air‌ is going to use the M4 chip).\r<br />\n\r<br />\nThe A18 Pro outperforms the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a>, which is the chip that Apple kept around in a lower-cost version of the ‌MacBook Air‌ for several years. An A18 MacBook wouldn't be too far off from the M4 Mac/‌iPad‌ chips in terms of single-core performance, but there would be a difference in multi-core performance.\r<br />\n\r<br />\nA MacBook with the A18 chip would be more than powerful enough for day-to-day use like web browsing, document creation, watching videos, and even light photo and video editing. It won't be ideal for system-intensive games or tasks like 4K video editing and 3D rendering, but it will do almost everything an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or ‌iPad‌ can do.\r<br />\n\r<br />\nApple is developing the low-cost MacBook with students in mind, and it sounds like it will be the Apple equivalent of the affordable Chromebook PCs that are often used by students.\r<br />\n\r<br />\n<h2>RAM</h2>\r<br />\nMacs start with 16GB RAM, but the ‌iPhone 16‌ Pro has 8GB RAM, the minimum for <a href=\"https://www.macrumors.com/guide/apple-intelligence/\">Apple Intelligence</a>. We can expect an A18 Pro MacBook to have at least 8GB RAM so it can support ‌Apple Intelligence‌, but it's possible Apple will give it the 16GB that all Macs have.\r<br />\n\r<br />\n<h2>Storage</h2>\r<br />\nThe ‌MacBook Air‌ starts with 256GB of storage, but Apple could possibly launch the low-cost MacBook with 128GB.\r<br />\n\r<br />\n<h2>Ports</h2>\r<br />\nThe A18 Pro chip in the ‌iPhone 16‌ Pro models doesn't support Thunderbolt, so the MacBook will be limited to USB-C (10GB/s) and won't offer Thunderbolt speeds. That will limit display connectivity, so it's likely the A18 Pro MacBook will only support a single external display.\r<br />\n\r<br />\n<h2>Naming</h2>\r<br />\nIt's not really clear what Apple will name the low-cost Mac notebook. We have the ‌MacBook Air‌ and the <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro</a>, so it's entirely possible it will be called \"MacBook.\" Apple has used the MacBook name multiple times in the past, and it's not in use at the moment.\r<br />\n\r<br />\n<h2>Price</h2>\r<br />\nPricing on the ‌MacBook Air‌ starts at $999, and the low-cost MacBook is expected to be priced much lower.\r<br />\n\r<br />\nApple probably won't want to undercut its ‌iPad‌ pricing by too much. The low-cost ‌iPad‌ with A16 chip starts at $349, and the <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> with <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> chip starts at $599. A price between $599 and $799 could make the most sense because it wouldn't be as expensive as the ‌MacBook Air‌ or ‌iPad Pro‌, but would come in at or just over the ‌iPad Air‌'s cost.\r<br />\n\r<br />\n$599 would be on par with some of the highly rated Chromebook options that people often purchase for school use, while a $699 or $799 price would be in the same general pricing area, but a little more of a premium price tag. $599 is also the cost of the <a href=\"https://www.macrumors.com/roundup/iphone-16e/\">iPhone 16e</a>, Apple's most affordable ‌iPhone‌ that uses a slightly less powerful A18 chip.\r<br />\n\r<br />\n<h2>Launch Date</h2>\r<br />\nRumors suggest that the low-cost MacBook will be introduced at or just before Apple's March 4 Special Experience that's taking place in New York, London, and Shanghai. Apple could announce the MacBook in a press release ahead of the experience.\r<br />\n\r<br />\nSelect members of the media have been invited to the mini event, and it's likely to provide them with a chance to try the new MacBook and other new devices.<br />This article, \"<a href=\"https://www.macrumors.com/2026/02/20/low-cost-macbook-latest-rumors/\">Apple's Low-Cost Colorful MacBook: All the Rumors</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-low-cost-colorful-macbook-all-the-rumors.2478001/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"2d857bea92ea05db2f30106dc33001a272f7e5361f189bd188c7bd30f17b0004","category":"Apple"}