{"title":"Embracing Innovation: Moots' Transition to UDH-Compatible Frames","link":"https://moots.com/blogs/news/embracing-innovation-moots-transition-to-udh-compatible-frames","date":1736210375000,"content":"\n      <figure><img src=\"https://moots.com/wp-content/uploads/2025/01/DSCF2608_Edited.jpg\" alt=\"\" /></figure>\n<p>Let's talk about something buzzing in the biking world, UDH, Universal Derailleur Hanger. At first glance, it might seem like just another component, but recently, it's become much more.</p>\n<p>Thanks to SRAM's recent transmission innovations, T-Type, and now called Full-Mount, UDH is quickly becoming the must-have feature for every serious rider. Are you curious about what all these fancy terms mean and how they impact your Moots riding experience? Follow along, and we'll break it all down.</p>\n<h2><br /></h2>\n<p>UNDERSTANDING UDH, FULL MOUNT, AND T-TYPE FROM SRAM</p>\n<p>This is our timeline of the SRAM component introductions. Disclaimer: The timeline or naming may not be perfect, but it's how we recall it!</p>\n<p><strong>2019</strong> - SRAM introduced UDH to the world, designing a derailleur hanger to simplify maintenance for all riders by having one standard that every bike can use worldwide.</p>\n<p><strong>2023</strong> - SRAM introduced Eagle Transmission, T-Type, a drivetrain system that no longer bolts onto a derailleur hanger, but the derailleur/transmission attaches directly to the frame using the same interface as the UDH.</p>\n<p><strong>2024</strong> - SRAM introduced the RED XPLR 13-speed gravel groupset. Transmission/T-Type was renamed to Full Mount. Full Mount is essentially the same as the prior Eagle Transmission, using the UDH frame interface to mount the derailleur directly to the frame and bypassing the use of a derailleur hanger.</p>\n<p>UDH is compatible with SRAM's Full Mount drivetrain line-up, including the Eagle Transmission and RED XPLR AXS groupsets. Full Mount derailleurs work around the rear axle's center, optimizing shift performance and eliminating unnecessary parts.</p>\n<h2><br /></h2>\n<p>I CAME HERE TO HEAR ABOUT MOOTS</p>\n<p>Ok, here is what we have been doing here at Moots:</p>\n<p><strong>July 2023</strong> - Introduction of the Routt CRD, our first UDH-compatible frame.</p>\n<p><strong>January 2024</strong> - Womble, Mountaineer, and Forager all were revised to be UDH compatible.</p>\n<p><strong>April 2024</strong> - MXC was introduced as a new model in the XC/adventure MTB sector of the model line-up…obviously with UDH-compatible dropouts.</p>\n<p><strong>June 2024</strong> - Routt RSL redesigned to include several updates, one being UDH compatibility.</p>\n<p><strong>October 2024</strong> - Routt 45 and Routt YBB reworked to incorporate UDH-compatible dropouts.</p>\n<p>Moots may have \"taken our time\" adapting the UDH interface into our frames. We wish we could've moved faster, but it's not simple! Aside from the three-year bike boom, when everything went well, a few other things slowed our progress in making the transition.</p>\n<p>We have always, and will continue, to make practical decisions to enhance the ride characteristics of a titanium bike with all of our design choices. UDH is complicated from a metal bike perspective. Essentially, 7.1mm of the driveside dropout goes away and becomes part of either the hanger or the derailleur. This means the titanium dropouts, in this case, are asymmetric from the center line of the frame and balanced out in the end by the hanger or derailleur. When we set out to build a frame, every step throughout production focuses on creating a dead, straight frame for the end user. Balancing and managing the offset all the way through took time to retool and develop unique processes that we had never done before.</p>\n<p>Prior to UDH, the average thickness of our replaceable derailleur hangers was around 7mm. A UDH has a cross-section of 20mm. Our team and partners worked on creating dropout designs that elegantly accommodated the interface, but not all made it past the early design phase.</p>\n<p>So, what does this mean? All Moots MTB &amp; Gravel bikes are now available with UDH-compatible dropouts.</p>\n<p>GREAT! WHAT DOES THIS MEAN FOR THE MOOTS THAT I ALREADY OWN?</p>\n<p>We understand that many of our loyal customers own non-UDH frames, and we want to assure you that your bikes remain a testament to our commitment to quality and craftsmanship. Each Moots bike, regardless of the derailleur hanger system, is designed with intention, precision, and a deep appreciation for the art of hand-building bikes. We will continue to manufacture and supply hangers for our previous models.</p>\n<p>Whether you're riding a well-loved classic or one of our latest models, know that your Moots bike is built to perform and inspire countless adventures. Our journey is about creating exceptional experiences for every rider, and we're excited to continue this journey with you.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"2edc7fc9dd12e781c109a0c5496355d7292c23de3db51577ca2d9952df32dca7","category":"Cycling"}