{"title":"What It’s Like to Get Undressed by Grok","link":"https://www.rollingstone.com/culture/culture-features/grok-sexualized-image-xai-elon-musk-women-1235501436/","date":1769526427000,"content":"\n<p>Ella Chakarian, writing for Rolling Stone (<a href=\"https://apple.news/AHps_VbIRQuGmIFYQ7zjz3Q\">News+</a>):</p>\n\n<blockquote>\n  <p>On a recent Saturday afternoon, Kendall Mayes was mindlessly\nscrolling on X when she noticed an unsettling trend surface on her\nfeed. Users were prompting Grok, the platform’s built-in AI\nfeature, to “nudify” women’s images. Mayes, a 25-year-old media\nprofessional from Texas who uses X to post photos with her friends\nand keep up with news, didn’t think it would happen to her — until it did.</p>\n\n<p>“Put her in a tight clear transparent bikini,” an X user ordered\nthe bot under a photo that Mayes posted from when she was 20. Grok\ncomplied, replacing her white shirt with a clear bikini top. The\nwaistband of her jeans and black belt dissolved into thin,\ntranslucent strings. The see-through top made the upper half of\nher body look realistically naked.</p>\n\n<p>Hiding behind an anonymous profile, the user’s page was filled\nwith similar images of women, digitally and nonconsensually\naltered and sexualized. Mayes wanted to cuss the faceless user\nout, but decided to simply block the account. She hoped that would\nbe the end of it. Soon, however, her comments became littered with\nmore images of herself in clear bikinis and skin-tight latex\nbodysuits. Mayes says that all of the requests came from anonymous\nprofiles that also targeted other women. Though some users have\nhad their accounts suspended, as of publication, some of the\nimages of Mayes are still up on X.</p>\n</blockquote>\n\n<p>And:</p>\n\n<blockquote>\n  <p>Emma, a content creator, was at the grocery store when she saw the\nnotifications of people asking Grok to undress her images. [...]\nNumbness washed over Emma when the images finally loaded on her\ntimeline. A selfie of her holding a cat had been transformed into\na nude. The cat was removed from the photo, Emma says, and her\nupper body was made naked.</p>\n\n<p>Emma immediately made her account private and reported the images.\nIn an email response reviewed by Rolling Stone, X User Support\nasked her to upload an image of her government-issued ID so they\ncould look into the report, but Emma responded that she didn’t\nfeel comfortable doing so. [...] In our call, she checked to see\nif some of the image edits she was aware of were still up on X.\nThey were. “Oh, my God,” she says, letting out a defeated sigh.\n“It has 15,000 views. Oh, that’s so sad.”</p>\n</blockquote>\n\n<p>This fun app is available, free of charge, on the App Store, which means you know it’s safe and approved by Apple. Get it today.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/27/what-its-like-to-get-undressed-by-grok\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"2f16129b1a5a7c79e4f681a5e140e9077e02aa9c63c5a339fd1dd361b05c6025","category":"Tech"}