{"title":"Design for Amiability: Lessons from Vienna","link":"https://alistapart.com/article/design-for-amiability-lessons-from-vienna/","date":1760542500000,"content":"\n<p>Today’s web is not always an amiable place. Sites greet you with a popover that demands assent to their cookie policy, and leave you with Taboola ads promising “One Weird Trick!” to cure your ailments. Social media sites are tuned for engagement, and few things are more engaging than a fight. Today it seems that people want to quarrel; I have seen flame wars among birders.  </p>\n\n\n\n<p>These tensions are often at odds with a site’s goals. If we are providing support and advice to customers, we don’t want those customers to wrangle with each other. If we offer news about the latest research, we want readers to feel at ease; if we promote upcoming marches, we want our core supporters to feel comfortable and we want curious newcomers to feel welcome. </p>\n\n\n\n<p>In a study for a conference on the History of the Web, I looked to the origins of Computer Science in Vienna <a>(1928-1934</a>)  for a case study of the importance of amiability in a research community and the disastrous consequences of its loss. That story has interesting implications for web environments that promote amiable interaction among disparate, difficult (and sometimes disagreeable) people.</p>\n\n\n\n<h2>The Vienna Circle</h2>\n\n\n\n<p>Though people had been thinking about calculating engines and thinking machines from antiquity, Computing really got going in Depression-era Vienna.  The people who worked out the theory had no interest in building machines; they wanted to puzzle out the limits of reason in the absence of divine authority. If we could not rely on God or Aristotle to tell us how to think, could we instead build arguments that were self-contained and demonstrably correct? Can we be sure that mathematics is consistent? Are there things that are true but that cannot be expressed in language? </p>\n\n\n\n<p>The core ideas were worked out in the weekly meetings (Thursdays at 6) of a group remembered as the Vienna Circle. They got together in the office of Professor Moritz Schlick at the University of Vienna to discuss problems in philosophy, math, and language. The intersection of physics and philosophy had long been a specialty of this Vienna department, and this work had placed them among the world leaders.  Schlick’s colleague Hans Hahn was a central participant, and by 1928 Hahn brought along his graduate students Karl Menger and Kurt Gödel. Other frequent participants included philosopher Rudolf Carnap, psychologist Karl Popper, economist Ludwig von Mises (brought by his brother Frederick, a physicist),  graphic designer Otto Neurath (inventor of infographics), and architect Josef Frank (brought by his physicist brother, Phillip).  Out-of-town visitors often joined, including the young Johnny von Neumann, Alfred Tarski, and the irascible Ludwig Wittgenstein. </p>\n\n\n\n<p>When Schlick’s office grew too dim, participants adjourned to a nearby café for additional discussion with an even larger circle of participants.  This convivial circle was far from unique.  An intersecting circle–Neurath, von Mises, Oskar Morgenstern–established the Austrian School of free-market economics. There were theatrical circles (Peter Lorre, Hedy Lamarr, Max Reinhardt), and literary circles. The café was where things happened.</p>\n\n\n\n<p>The interdisciplinarity of the group posed real challenges of temperament and understanding. Personalities were often a challenge. Gödel was convinced people were trying to poison him. Architect Josef Frank depended on contracts for public housing, which Mises opposed as wasteful. Wittgenstein’s temper had lost him his job as a secondary school teacher, and for some of these years he maintained a detailed list of whom he was willing to meet. Neurath was eager to detect muddled thinking and would interrupt a speaker with a shouted “Metaphysics!” The continuing amity of these meetings was facilitated by the personality of their leader, Moritz Schlick, who would be remembered as notably adept in keeping disagreements from becoming quarrels.</p>\n\n\n\n<h2>In the Café</h2>\n\n\n\n<p>The Viennese café of this era was long remembered as a particularly good place to argue with your friends, to read, and to write. Built to serve an imperial capital, the cafés found themselves with too much space and too few customers now that the Empire was gone. There was no need to turn tables: a café could only survive by coaxing customers to linger. Perhaps they would order another coffee, or one of their friends might drop by. One could play chess, or billiards, or read newspapers from abroad. Coffee was invariably served with a glass of purified spring water, still a novelty in an era in which most water was still unsafe to drink. That water glass would be refilled indefinitely. </p>\n\n\n\n<p>In the basement of one café, the poet Jura Soyfer staged “The End Of The World,” a musical comedy in which Professor Peep has discovered a comet heading for earth.</p>\n\n\n\n<blockquote>\n<blockquote>\n<p></p>\n</blockquote>\n</blockquote>\n\n\n\n<blockquote>\n<blockquote>\n<p>Prof. Peep: The comet is going to destroy everybody!</p>\n\n\n\n<p>Hitler:  Destroying everybody is my business.</p>\n</blockquote>\n</blockquote>\n\n\n\n<p>Of course, coffee can be prepared in many ways, and the Viennese café developed a broad vocabulary to represent precisely how one preferred to drink it: melange, Einspänner, Brauner, Schwarzer, Kapuziner. This extensive customization, with correspondingly esoteric conventions of service, established the café as a comfortable and personal third space, a neutral ground in which anyone who could afford a coffee would be welcome. Viennese of this era were fastidious in their use of personal titles, of which an abundance were in common use. Café waiters greeted regular customers with titles too, but were careful to address their patrons with titles a notch or two greater than they deserved. A graduate student would be Doktor, an unpaid postdoc Professor.  This assurance mattered all the more because so many members of the Circle (and so many other Viennese) came from elsewhere: Carnap from Wuppertal, Gödel from Brno, von Neumann from Budapest. No one was going to make fun of your clothes, mannerisms, or accent. Your friends wouldn’t be bothered by the pram in the hall. Everyone shared a Germanic Austrian literary and philosophical culture, not least those whose ancestors had been Eastern European Jews who knew that culture well, having read all about it in books.</p>\n\n\n\n<p>The amiability of the café circle was enhanced by its openness. Because the circle sometimes extended to architects and actors, people could feel less constrained to admit shortfalls in their understanding. It was soon discovered that marble tabletops made a useful surface for pencil sketches, serving all as an improvised and accessible blackboard.</p>\n\n\n\n<p>Comedies like “The End Of The World” and fictional newspaper sketches or feuilletons of writers like Joseph Roth and Stefan Zweig served as a second defense against disagreeable or churlish behavior. The knowledge that, if one got carried away, a parody of one’s remarks might shortly appear in Neue Freie Presse surely helped Professor Schlick keep matters in hand.</p>\n\n\n\n<h2>The End Of Red Vienna</h2>\n\n\n\n<p>Though Austria’s government drifted to the right after the War, Vienna’s city council had been Socialist, dedicated to public housing based on user-centered design, and embracing  ambitious programs of public outreach and adult education. In 1934 the Socialists lost a local election, and this era soon came to its end as the new administration focused on the imagined threat of the International Jewish Conspiracy. Most members of the Circle fled within months: von Neumann to Princeton, Neurath to Holland and Oxford, Popper to New Zealand, Carnap to Chicago. Prof. Schlick was murdered on the steps of the University by a student outraged by his former association with Jews.  Jura Soyfer, who wrote “The End Of The World,” died in Buchenwald.</p>\n\n\n\n<p>In 1939, von Neumann finally convinced Gödel to accept a job in Princeton. Gödel was required to pay large fines to emigrate. The officer in charge of these fees would look back on this as the best posting of his career; his name was Eichmann.</p>\n\n\n\n<h2>Design for Amiability</h2>\n\n\n\n<p>An impressive literature recounts those discussions and the environment that facilitated the development of computing. How can we design for amiability?  This is not just a matter of choosing rounded typefaces and a cheerful pastel palette. I believe we may identify eight distinct issues that exert design forces in usefully amiable directions.</p>\n\n\n\n<p><strong>Seriousness</strong>: The Vienna Circle was wrestling with a notoriously difficult book—Wittgenstein’s Tractus Logico-Philosophicus—and a catalog of outstanding open questions in mathematics. They were concerned with consequential problems, not merely scoring points for debating. Constant reminders that the questions you are considering matter—not only that they are consequential or that those opposing you are scoundrels—help promote amity.</p>\n\n\n\n<p><strong>Empiricism</strong>: The characteristic approach of the Vienna Circle demanded that knowledge be grounded either in direct observation or in rigorous reasoning. Disagreement, when it arose, could be settled by observation or by proof. If neither seemed ready to hand, the matter could not be settled. On these terms, one can seldom if ever demolish an opposing argument, and trolling is pointless.</p>\n\n\n\n<p><strong>Abstraction</strong>: Disputes grow worse when losing the argument entails lost face or lost jobs. The Vienna Circle’s focus on theory—the limits of mathematics, the capability of language—promoted amity. Without seriousness, abstraction could have been merely academic, but the limits of reason and the consistency of mathematics were clearly serious.</p>\n\n\n\n<p><strong>Formality</strong>: The punctilious demeanor of waiters and the elaborated rituals of coffee service helped to establish orderly attitudes amongst the argumentative participants. This stands in contrast to the contemptuous sneer that now dominates social media.  </p>\n\n\n\n<p><strong>Schlamperei</strong>: Members of the Vienna Circle maintained a global correspondence, and they knew their work was at the frontier of research. Still, this was Vienna, at the margins of Europe: old-fashioned, frumpy, and dingy. Many participants came from even more obscure backwaters. Most or all harbored the suspicion that they were really schleppers, and a tinge of the ridiculous helped to moderate tempers. The director of “The End Of The World” had to pass the hat for money to purchase a moon for the set, and thought it was funny enough to write up for publication.</p>\n\n\n\n<p><strong>Openness</strong>: All sorts of people were involved in discussion, anyone might join in. Each week would bring different participants. Fluid borders reduce tension, and provide opportunities to broaden the range of discussion and the terms of engagement. Low entrance friction was characteristic of the café: anyone could come, and if you came twice you were virtually a regular. Permeable boundaries and café culture made it easier for moderating influences to draw in raconteurs and storytellers to defuse awkward moments, and Vienna’s cafés had no shortage of humorists. Openness counteracts the suspicion that promoters of amiability are exerting censorship.</p>\n\n\n\n<p><strong>Parody</strong>: The environs of the Circle—the university office and the café—were unmistakably public. There were writers about, some of them renowned humorists. The prospect that one’s bad taste or bad behavior might be ridiculed in print kept discussion within bounds. The sanction of public humiliation, however, was itself made mild by the veneer of fiction; even if you got a little carried away and a character based on you made a splash in some newspaper fiction, it wasn’t the end of the world.</p>\n\n\n\n<p><strong>Engagement</strong>: The subject matter was important to the participants, but it was esoteric: it did not matter very much to their mothers or their siblings. A small stumble or a minor humiliation could be shrugged off in ways that major media confrontations cannot.</p>\n\n\n\n<p>I believe it is notable that this environment was designed to promote amiability through several different voices.  The café waiter flattered each newcomer and served everyone, and also kept out local pickpockets and drunks who would be mere disruptions. Schlick and other regulars kept discussion moving and on track. The fiction writers and raconteurs—perhaps the most peripheral of the participants—kept people in a good mood and reminded them that bad behavior could make anyone ridiculous.  Crucially, each of these voices were human: you could reason with them. Algorithmic or AI moderators, however clever, are seldom perceived as reasonable. The café circles had no central authority or Moderator against whom everyone’s resentments might be focused. Even after the disaster of 1934, what people remembered were those cheerful arguments.</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"324e06333477c7d6f45a8f876c6f8827f4e0978f71b593aced24945f1a17d40e","category":"Tech"}