{"title":"Kyle Richardson’s North East Summits Route Preparation","link":"https://moots.com/blogs/news/kyle-richardson-s-north-east-summits-route-preparation","date":1762458442000,"content":"\n      <p>Adventure means something different to Kyle Richardson. This September, he’s setting out on the North East Summits Route—a 20-day, self-supported bike-to-run journey from New York City to New Hampshire. With a Moots Routt ESCas his companion, Kyle is chasing discovery across pavement, singletrack, and summits.</p>\n<p>---</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/KR_1.jpg?v=1762458479\" alt=\"\" /></p>\n<p>Wilco’s <i>Yankee Hotel Foxtrot </i>spins on vinyl, filling Kyle’s studio with a relaxed, methodical energy as I find him amidst last-minute trip preparations. He’s headed east for a bike-to-run tour—one he devised as an expression of his intrinsic drive to explore mountain ranges under his own power. When I asked Kyle what it’s all about, he replied simply. “Distill things down. What do you need to travel self-supported? Load that on your bike, toss in your running shoes, and off you go. Find an objective that inspires you, and commit to the journey.” Starting from New York City, Kyle will aim for New Hampshire by way of a series of running and climbing objectives. All told, he’ll spend about 20 days out. <i>“NES or North East Summits is a route that follows the greater Northern Appalachian mountains. From the biggest city to the tallest summits, the inspiration and motivation lies in exploring the in-between spaces of some of the world’s oldest mountains.” </i>Kyle’s riding the MOOTS Routt ESC for its mix of long-range comfort and readiness to handle the unexpected. The terrain will shift between forgotten doubletrack, winding singletrack, and quiet stretches of rolling pavement. Everything fits on the bike—no pack required. Feathers in the seat bag, running shoes in the handlebar roll, tent/tools/water/food in the frame bag. Navigation runs through Gaia GPS, with a solar-powered Garmin Enduro watch logging the journey. We roll the bike outside for a final check. Kyle steps back, admiring the refined setup. I can tell he’s both anxious and eager—ready for the full immersion in discovery.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/KR_2.jpg?v=1762458480\" alt=\"\" /></p>\n<p>• MOOTS Routt ESC</p>\n<p>• 2.4 Maxxis Ikon tires</p>\n<p>• Chris King carbon wheelset</p>\n<p>• SRAM AXS drivetrain</p>\n<p>• White Industries Crankset</p>\n<p>• ENVE Adventure Bars</p>\n<p>• Brooks C15 Saddle</p>\n<p>• Custom frame bag by Thomas Woodson</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/KR_3.jpg?v=1762458480\" alt=\"\" /></p>\n<p>Follow his adventure through September at: i<a href=\"https://www.instagram.com/kylerichardson/\">nstagram.com/kylerichardson</a></p>\n<p> </p>\n<p>Written by Thomas Woodson</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"33632f14468b3ca9f62a578b0a559fc5469b12154052e27a1e0b82c07c0f501e","category":"Cycling"}