{"title":"New Mexico: The Land of Enchantment & Very Sore Legs","link":"https://moots.com/blogs/news/new-mexico-the-land-of-enchantment-very-sore-legs","date":1734060142000,"content":"\n      <figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/NM-BLOG-1.jpg?v=1762209932\" alt=\"\" /></figure>\n<p>Occasionally, I like to find a feat of strength that helps me decompress from life. The harder the feat, the more I gain confidence and the ability to return to the mundane absurdity of my life. This feat was significantly more epic than anything I'd ever attempted. Six days riding from Santa Fe, NM, to Las Cruces, NM, most of which would be off-road. Winter arrived early in New Mexico this year to make things more interesting. Forty-eight hours before the start of the ride, New Mexico received two feet of snow along the route followed the first three days. And when we made it out of the snow, the cold remained. Most of the other days started with temperatures in the high teens. Suffice it to say, this feat of strength nearly killed me, but it was totally worth it. This ride was what I needed this year. Sometimes, when you go past the limits you thought you had, nothing is impossible. I'm lucky to have friends who push me to ride harder and go further than I'd ever go on my own, and it's changed my life. I'm also fortunate my wife introduced me to Moots in the mid-2000s. Moots is the real reason I can ride further, harder, and more efficiently than ever. When a friend proposed this ride, I knew it was the perfect opportunity to get my friends Colin and Jonathan of ACME Bicycle Company NYC to design me a new Routt CRD. Doing so remotely added more of a challenge, but it will be okay with a fit team this good. ACME designed me a rocket ship and fit me perfectly to the high-performance edge I'd need to keep up with the excellent team members I'd be riding alongside for the week. I selected some super fast 40MM ZIPP XPLR SLICK tires to easily keep up with the boys on the road sections. This tire selection proved more insane as we approached the multiple national wildlife refuges along the route. Luckily, I brought my legacy rig and my beloved Baxter monster gravel bike for the more single-track sections. It was an absolute blast bombing down frozen National Forest Service roads in the middle of nowhere on this rig. The Baxter did NOT care! The sheer beauty of New Mexico was truly overwhelming. Getting to experience this beauty on a brand new Routt CRD and with the most incredible group of guys was one of the most powerful moments I've experienced as a rider. Every day brought more stunning parts of a country I'd never imagined existed. Every day, we met more interesting New Mexicans along the route at food and drink stops or while pausing on a totally remote dirt road. This route was as much a test of riding strength as the ability to reconnect with America! And on both accounts, it was simply fantastic. It isn't easy to pinpoint my favorite part of this trek because it was the most meticulously planned and stunning 500 miles I'd ever ridden linked together. However, if I had to choose one, the most beautiful part of this ride was our day in the Cibola National Forest. It was a chilly start to the day, but I barely noticed it because the National Forest was so breathtaking. After a stretch of tarmac, we turned onto a fire road and rode across the vast array of twenty-eight 25-meter radio telescopes on railroad tracks. As I climbed to the peak that would drop me over the Sierra Ladrones and onto the road to our evening stop in Magdalena, I noticed I was following giant bear tracks up the mountain. I thought to myself, \"That's about right.\" I hurt so bad and was so high on endorphins from the previous days and miles it seemed perfectly reasonable that there was a chance I'd now have to fight a bear to the death to reach my final destination for the day. Luckily, my bear friend was long gone when I reached the top. I finished this ride with a newfound respect for my friends, a new appreciation for how to train, and a madly in love with the new Routt CRD. The Routt CRD is the ultimate gravel weapon, and I look forward to training on this rig this offseason to prepare for the 2025 race season. Thanks to this bike, guaranteed personal bests will fall, and I will achieve even more. If you are considering this rig, call me, and I'll tell you what it can do!</p>\n<h2>BIKE DEETS:</h2>\n<p>2024 ROUTT CRD</p>\n<p>1X SRAM RED EXPLORO</p>\n<p>ZIPP 303 XPLR WHEELSET</p>\n<p>MOOTS GRAVEL BAR</p>\n<p>ZIPP XPLORO SLICK 40MM TIRES</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/NM-BLOG-3.jpg?v=1762209932\" alt=\"\" /></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/NM-BLOG-5.jpg?v=1762209932\" alt=\"\" /></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/NM-BLOG-4.jpg?v=1762209932\" alt=\"\" /></p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"37e5a8821c0a07838a9c374a64db5549fa1c1692300322852326d828c71f0492","category":"Cycling"}