{"title":"Effectively Monitoring Web Performance","link":"https://smashingmagazine.com/2025/11/effectively-monitoring-web-performance/","date":1762855200000,"content":"<p>This article is a sponsored by <a href=\"https://www.debugbear.com/?utm_campaign=sm-10\">DebugBear</a></p>\n<p><a href=\"https://www.smashingmagazine.com/2023/08/running-page-speed-test-monitoring-versus-measuring/\">There’s no single way to measure website performance.</a> That said, the <a href=\"https://www.smashingmagazine.com/2024/04/monitor-optimize-google-core-web-vitals/\">Core Web Vitals</a> metrics that Google <a href=\"https://www.debugbear.com/docs/page-speed-seo?utm_campaign=sm-10\">uses as a ranking factor</a> are a great starting point, as they cover different aspects of visitor experience:</p>\n<ul>\n<li><strong>Largest Contentful Paint (LCP):</strong> Measures the initial page load time.</li>\n<li><strong>Cumulative Layout Shift (CLS)</strong>: Measures if content is stable after rendering.</li>\n<li><strong>Interaction to Next Paint (INP)</strong>: Measures how quickly the page responds to user input.</li>\n</ul>\n<p>There are also <a href=\"https://www.debugbear.com/docs/web-performance-metrics?utm_campaign=sm-10\">many other web performance metrics</a> that you can use to track technical aspects, like page weight or server response time. While these often don’t matter directly to the end user, they provide you with insight into what’s slowing down your pages.</p>\n<p>You can also use the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Performance_API/User_timing\">User Timing API</a> to track page load milestones that are important on your website specifically.</p>\nSynthetic And Real User Data\n<p>There are <a href=\"https://www.debugbear.com/blog/synthetic-vs-rum?utm_campaing=sm-10\">two different types</a> of web performance data:</p>\n<ul>\n<li><strong>Synthetic tests</strong> are run in a controlled test environment.</li>\n<li><strong>Real user data</strong> is collected from actual website visitors.</li>\n</ul>\n<p>Synthetic monitoring can provide super-detailed reports to help you identify page speed issues. You can configure exactly how you want to collect the data, picking a specific network speed, device size, or test location.</p>\n<p>Get a hands-on feel for synthetic monitoring by using the free <a href=\"https://www.debugbear.com/test/website-speed?utm_campaign=sm-10\">DebugBear website speed test</a> to check on your website.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/1-debugbear-page-speed-report.png\" /></p>\n<p>That said, your synthetic test settings might not match what’s typical for your real visitors, and you can’t script all of the possible ways that people might interact with your website.</p>\n<p>That’s why you also need real user monitoring (RUM). Instead of looking at one experience, you see different load times and how specific visitor segments are impacted. You can review specific page views to identify what caused poor performance for a particular visitor.</p>\n<p>At the same time, real user data isn’t quite as detailed as synthetic test reports, due to web API limitations and performance concerns.</p>\n<p>DebugBear offers both <a href=\"https://www.debugbear.com/synthetic-website-monitoring?utm_campaign=sm-10\">synthetic monitoring</a> and <a href=\"https://www.debugbear.com/real-user-monitoring?utm_campaign=sm-10\">real user monitoring</a>:</p>\n<ul>\n<li>To set up synthetic tests, you just need to enter a website URL, and</li>\n<li>To collect real user metrics, you need to install an analytics snippet on your website.</li>\n</ul>\nThree Steps To A Fast Website\n<p>Collecting data helps you throughout the lifecycle of your web performance optimizations. You can follow this three-step process:</p>\n<ol>\n<li><strong>Identify</strong>: Collect data across your website and identify slow visitor experiences.</li>\n<li><strong>Diagnose</strong>: Dive deep into technical analysis to find optimizations.</li>\n<li><strong>Monitor</strong>: Check that optimizations are working and get alerted to performance regressions.</li>\n</ol>\n<p>Let’s take a look at each step in detail.</p>\nStep 1: Identify Slow Visitor Experiences\n<p>What’s prompting you to look into website performance issues in the first place? You likely already have some specific issues in mind, whether that’s from customer reports or because of poor scores in the <a href=\"https://www.debugbear.com/blog/search-console-core-web-vitals?utm_campaign=sm-10\">Core Web Vitals section of Google Search Console</a>.</p>\n<p>Real user data is the best place to check for slow pages. It tells you whether the technical issues on your site actually result in poor user experience. It’s easy to collect across your whole website (while synthetic tests need to be set up for each URL). And, you can often get a view count along with the performance metrics. A moderately slow page that gets two visitors a month isn’t as important as a moderately fast page that gets thousands of visits a day.</p>\n<p>The Web Vitals dashboard in DebugBear’s RUM product checks your site’s performance health and surfaces the most-visited pages and URLs where many visitors have a poor experience.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/2-web-vitals-dashboard-debugbear-rum-product.png\" /></p>\n<p>You can also run a <a href=\"https://www.debugbear.com/docs/website-scan?utm_campaign=sm-10\">website scan</a> to get a list of URLs from your sitemap and then check each of these pages against real user data from Google’s <a href=\"https://developer.chrome.com/docs/crux\">Chrome User Experience Report (CrUX)</a>. However, this will only work for pages that meet a minimum traffic threshold to be included in the CrUX dataset.</p>\n<p>The scan result highlights pages with poor web vitals scores where you might want to investigate further.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/3-website-scan-result-debugbear.png\" /></p>\n<p>If no real-user data is available, then there is a scanning tool called <a href=\"https://www.debugbear.com/software/unlighthouse-website-scan\">Unlighthouse</a>, which is based on Google’s Lighthouse tool. It runs synthetic tests for each page, allowing you to filter through the results in order to identify pages that need to be optimized.</p>\nStep 2: Diagnose Web Performance Issues\n<p>Once you’ve identified slow pages on your website, you need to look at what’s actually happening on your page that is causing delays.</p>\n<h3>Debugging Page Load Time</h3>\n<p>If there are issues with page load time metrics — like the <a href=\"https://www.debugbear.com/docs/metrics/largest-contentful-paint?utm_campaign=sm-10\">Largest Contentful Paint (LCP)</a> — synthetic test results can provide a detailed analysis. You can also run <a href=\"https://www.debugbear.com/docs/experiments?utm_campaign=sm-10\">page speed experiments</a> to try out and measure the impact of certain optimizations.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/4-page-speed-recommendations.png\" /></p>\n<p>Real user data can still be important when debugging page speed, as load time depends on many user- and device-specific factors. For example, depending on the size of the user’s device, the page element that’s responsible for the LCP can vary. RUM data can provide a breakdown of possible influencing factors, like CSS selectors and image URLs, across all visitors, helping you zero in on what exactly needs to be fixed.</p>\n<h3>Debugging Slow Interactions</h3>\n<p>RUM data is also generally needed to properly diagnose issues related to the <a href=\"https://debugbear.com/docs/rum/fix-inp-issues?utm_campaign=sm-10\">Interaction to Next Paint (INP)</a> metric. Specifically, real user data can provide insight into what causes slow interactions, which helps you answer questions like:</p>\n<ul>\n<li>What page elements are responsible?</li>\n<li>Is time spent processing already-active background tasks or handling the interaction itself?</li>\n<li>What scripts contribute the most to overall CPU processing time?</li>\n</ul>\n<p>You can view this data at a high level to identify trends, as well as review specific page views to see what impacted a specific visitor experience.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/5-inp-interaction-element.png\" /></p>\nStep 3: Monitor Performance &amp; Respond To Regressions\n<p>Continuous monitoring of your website performance lets you track whether the performance is improving after making a change, and alerts you when scores decline.</p>\n<p>How you respond to performance regressions depends on whether you’re looking at lab-based synthetic tests or real user analytics.</p>\n<h3>Synthetic Data</h3>\n<p>Test settings for synthetic tests are standardized between runs. While infrastructure changes, like browser upgrades, occasionally cause changes, performance is more generally determined by resources loaded by the website and the code it runs.</p>\n<p>When a metric changes, DebugBear lets you view a before-and-after comparison between the two test results. For example, the next screenshot displays a regression in the First Contentful Paint (FCP) metric. The comparison reveals that new images were added to the page, <a href=\"https://www.debugbear.com/blog/bandwidth-competition-page-speed?utm_campaign=sm-10\">competing for bandwidth with other page resources</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/6-synthetic-tests.png\" /></p>\n<p>From the report, it’s clear that a CSS file that previously took 255 milliseconds to load now takes 915 milliseconds. Since stylesheets are required to render page content, this means the page now loads more slowly, giving you better insight into what needs optimization.</p>\n<h3>Real User Data</h3>\n<p>When you see a change in real user metrics, there can be two causes:</p>\n<ol>\n<li>A shift in visitor characteristics or behavior, or</li>\n<li>A technical change on your website.</li>\n</ol>\n<p>Launching an ad campaign, for example, often increases redirects, reduces cache hits, and shifts visitor demographics. When you see a regression in RUM data, the first step is to find out if the change was on your website or in your visitor’s browser. Check for view count changes in ad campaigns, referrer domains, or network speed to get a clearer picture.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/7-lcp-utm-campaign.png\" /></p>\n<p>If those visits have different performance compared to your typical visitors, then that suggests the repression is not due to a change on your website. However, you may still need to make changes on your website to better serve these visitor cohorts and deliver a good experience for them.</p>\n<p>To identify the cause of a technical change, take a look at component breakdown metrics, such as <a href=\"https://www.smashingmagazine.com/2025/03/how-to-fix-largest-contentful-issues-with-subpart-analysis/\">LCP subparts</a>. This helps you narrow down the cause of a regression, whether it is due to changes in server response time, new render-blocking resources, or the LCP image.</p>\n<p>You can also check for shifts in page view properties, like different LCP element selectors or specific scripts that cause poor performance.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/8-lcp-subparts.png\" /></p>\nConclusion\n<p>One-off page speed tests are a great starting point for optimizing performance. However, a monitoring tool like DebugBear can form the basis for a more comprehensive web <strong>performance strategy</strong> that helps you stay fast for the long term.</p>\n<p><img src=\"https://files.smashing.media/articles/effectively-monitoring-web-performance/9-debugbear-web-performance.png\" /></p>\n<p>Get <a href=\"https://www.debugbear.com/?utm_campaign=sm-10\">a free DebugBear trial</a> on our website!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"39629f9a771e36fa5532ac0f11444bc5efeafe693a64ec99b6474764ee0b319b","category":"Tech"}