{"title":"My Generative AI Guideline","link":"https://blog.whs.in.th/node/3761","date":1749400771000,"content":"<p>ตอนนี้ Gen AI มันกำลังเปลี่ยนแปลงโลกไปพอๆ กับการมาของ iPhone แต่คิดว่าตัวเองพยายามเลี่ยงใช้งานมันอยู่เพราะเหตุผลหลายๆ อย่างที่จะเล่าต่อไปนี้ เลยคิดว่าควรจะเขียนให้ชัดเจนดีกว่าว่าอะไรที่จะใช้หรือไม่ใช้บ้าง จะได้เป็นเข็มทิศนำทางได้ถูกว่า AI ตัวไหนที่เราจะใช้ได้หรือไม่ได้บ้าง</p>\n<h2>Copyright</h2>\n<p>ประเด็นใหญ่ๆ ของ AI คือเราไม่ได้มีปัญหากับ AI ยังไงมันก็จะเปลี่ยนแปลงโลก เราไม่ได้สนใจว่า AI จะทำให้คนตกงานเพราะมันคือความคิดแบบ <a href=\"https://en.wikipedia.org/wiki/Luddite\">Luddite</a> ที่มีตั้งแต่ยุคปฏิวัติอุตสาหกรรมแล้ว</p>\n<p>ประเด็นใหญ่คือเรื่องลิขสิทธิ์ คิดว่ามีคนจำนวนมากไม่รู้ว่า AI หลายๆ ตัว ถูกสร้างขึ้นมาโดยการละเมิดลิขสิทธิ์ อย่างที่เป็นข่าวว่า <a href=\"https://torrentfreak.com/meta-torrented-over-81-tb-of-data-through-annas-archive-despite-few-seeders-250206/\">Meta โหลดข้อมูลมาเทรนจาก Anna’s Archive</a> ซึ่งภายในนั้นก็มีหนังสือและงานวิจัยที่มีลิขสิทธิ์ และวงการนักวาดก็มักจะ boycott งานภาพที่ใช้ AI สร้างขึ้น ซึ่งคิดว่าต้องดูดีๆ มีทั้งสองกลุ่มคือ Luddite ว่านักวาดจะตกงาน และกลุ่มที่บอกว่า AI ที่คุณใช้ น่าจะเป็นตัวนี้ ซึ่งเทรนมาจากข้อมูลมีลิขสิทธิ์</p>\n<h3>Copyright has nuance</h3>\n<p>ปัญหาของนักวาด หลังๆ มักจะจบไปโดยที่ Adobe บอกว่าเทรนโมเดลขึ้นมาเองจากคลังภาพของตัวเอง ซึ่งผมยังไม่ได้ดูรายละเอียดนัก ก็จะเขียนไปโดยทั่วไปว่า AI Generate ภาพยุคถัดมาจะบอกว่าเราใช้ภาพที่ถูกลิขสิทธิ์เท่านั้นในการเทรน</p>\n<p>คำถามคือการได้มาซึ่งลิขสิทธิ์ตรงนั้นมาจากไหน เขายอมจริงหรือเปล่า เพราะคลังภาพ Stock photo ถูกสะสมมานานมากๆ แล้ว ถึงผู้สร้างสรรค์อาจจะให้ลิขสิทธิ์คลังภาพว่าสามารถนำไปขาย นำไปใช้งานได้อิสระ แต่ในเวลาที่ให้สิทธิ์นั้น AI อาจจะยังไม่เกิดขึ้นไม่รู้ว่าการให้สิทธิ์นี้สามารถนำไปให้ AI ได้ (อย่าง Gettys เองในปัจจุบันก็กำหนดว่าซื้อภาพไปแล้วไม่อนุญาตให้นำไปทำ AI) รวมถึงเราไม่รู้ว่าผู้ขายงานให้ Stock photo เขามีสิทธิ์ที่จะ opt out หรือเปล่าว่าสามารถขายงานให้นำไปใช้งานได้ แต่ห้ามนำไปฝึก AI</p>\n<p>จุดนี้คิดว่า ถ้าจะใช้ AI generate ภาพ อาจจะต้องศึกษาที่มาที่ไปมากขึ้น ซึ่งตอนนี้ยังไม่ได้ศึกษาโดยละเอียด และหลายๆ ครั้งผู้สร้าง GenAI ก็มักจะไม่เปิดเผยที่มาของข้อมูลโดยละเอียดด้วย ในกรณีนี้อาจจะต้องมองลบไว้ก่อน</p>\n<h3>Permissive code</h3>\n<p>อีกมุมหนึ่งคือโค้ด ซึ่ง AI Model แทบทุกตัว รวมถึงคลังข้อมูลอย่าง <a href=\"https://huggingface.co/datasets/bigcode/the-stack\">The Stack</a> ใช้มุมมองว่าโค้ดที่อยู่ใน Stackoverflow ไม่มีลิขสิทธิ์ ซึ่งอาจจะจริงในกรณีที่เป็น snippet สั้นๆ อีกมุมก็มองว่าโค้ดที่เป็น permissive license เช่น MIT license, BSD license, Apache license เป็นต้น สามารถนำไปใช้ฝึกได้เพราะไม่มีข้อกำหนดในการใช้งาน</p>\n<p>สำหรับโค้ดที่เป็น license จำกัดมากขึ้น เช่น GPL เท่าที่ทราบในปัจจุบันไม่มีโมเดลใดเปิดเผยว่านำไปใช้งาน</p>\n<p>แต่ในความเป็นจริง license เหล่านี้ยังมีข้อกำหนดการใช้งานอยู่คือห้ามเคลมว่าเป็นผลงานของตัวเอง ต้องมีข้อมูลลิขสิทธิ์เดิมติดไว้เสมอ</p>\n<p>ปัญหานี้เป็นที่ถกเถียงกันอยู่ในจุดต่างๆ ของการใช้งาน LLM</p>\n<ol>\n<li><strong>คลังข้อมูล</strong> เช่น The Stack ระบุชัดเจนว่าการนำข้อมูลไปใช้ ต้องปฏิบัติตามข้อกำหนดของโค้ดเดิมรวมถึงการให้เครดิต</li>\n<li><strong>ตัวชิ้นงานโมเดล</strong> มองว่าเป็น derivative work ของข้อมูลตั้งต้นหรือไม่ที่จะต้องมีข้อมูลลิขสิทธิ์ของผลงานทั้งหมด ซึ่งปัจจุบันโมเดลหลายตัวแม้จะเป็น open weight ก็ไม่บอกแหล่งที่มาครบถ้วน\n<ul>\n<li>บางคนมองว่า โมเดลไม่ใช่ผลงานต่อยอด เพราะไม่สามารถชี้แล้วบอกได้เลยว่าส่วนใดของโมเดลมาจากผลงานเดิม หรือถ้าเจอชิ้นงานหนึ่งก็มีจำนวนบิตไม่ถึงหยิบมือหนึ่ง แม้จะมี<a href=\"https://arxiv.org/abs/2012.07805\">งานวิจัยที่พยายามสกัดข้อมูลตั้งต้นออกจาก GPT-2</a> ก็พบว่าทำได้จริงแต่ได้บางส่วน</li>\n<li>บางคนใช้ analogy มามองว่าถ้าให้คนไปอ่านโค้ด บทความหรือตำรา แล้วได้ความรู้มาเขียนใหม่ งานใหม่ งานใหม่นั้นก็ไม่ควรเป็น derivative work ของงานเก่า เช่นเดียวกัน ถ้าฝึก AI โดยกลั่นข้อมูลออกมาแล้วนั้นก็ไม่ต่างกันให้คนไปเรียนวิชาจึงไม่มีลิขสิทธิ์</li>\n<li><a href=\"https://www.npr.org/2025/01/14/nx-s1-5258952/new-york-times-openai-microsoft\">New York Times กำลังฟ้อง OpenAI ในขณะนี้</a> โดย NYT อ้างว่าสามารถทำให้ ChatGPT แสดงผลบทความของ NYT ซึ่งมีลิขสิทธิ์ได้และทำให้คนไม่เข้าไปอ่านที่ NYT โดยตรง ส่วน OpenAI ไม่ได้ปฏิเสธตรงนี้แต่ระบุว่าการนำข้อมูลมาเทรนนั้นอยู่ภายใต้ Fair use โดยกระบวนการเทรนนับว่าเป็นการ transformative แล้วและสิ่งที่ NYT พยายามให้ ChatGPT คืนบทความมาได้นั้นต้องทำหลายครั้ง ในคดีนี้ NYT เรียกร้องค่าเสียหาย และขอให้ทำลายข้อมูลของ ChatGPT ทิ้งทั้งหมด</li>\n<li><a href=\"https://githubcopilotlitigation.com/\">GitHub กำลังถูกฟ้องร้องแบบกลุ่มในขณะนี้</a> โดยเรียกร้องว่าบริการ Copilot ไม่ได้แสดงลิขสิทธิ์ของผู้เขียนตามที่สัญญาอนุญาตต่างๆ ระบุไว้ รวมไปถึง permissive license ต่างๆ ด้วย ซึ่งผิดทั้งลิขสิทธิ์, กฎหมาย DMCA ที่ห้ามลบข้อมูลลิขสิทธิ์, ข้อตกลงการใช้งานและนโยบายความเป็นส่วนตัวของ GitHub เอง ที่จะไม่นำโค้ดไปเผยแพร่ภายนอก GitHub</li>\n<li>ผมยังไม่มีความเห็นในเรื่องลิขสิทธิ์ของตัวชิ้นงาน AI แต่ไม่คิดว่าการนำข้อมูลไปสร้าง AI เป็น Fair use ดังนั้น ผู้สร้าง AI ต้องมีสิทธิ์ใช้งานข้อมูลนั้นด้วยไม่เช่นนั้นเป็นการละเมิดลิขสิทธิ์ ที่ผ่านมาผู้สร้าง AI จึงมักจะใช้คลังข้อมูลขนาดใหญ่ของเจ้าของลิขสิทธิ์ที่ไม่น่าจะฟ้องร้อง ซึ่งก็แสดงว่าการให้เงินเพื่อใช้งาน AI เป็นการสนับสนุนขบวนการละเมิดลิขสิทธิ์</li>\n</ul>\n</li>\n<li><strong>ผลลัพท์ของโมเดล</strong> ปัจจุบันผู้พัฒนาโมเดลเพื่อให้มีคนใช้งานมาก มักจะมีสัญญาชัดเจนว่าผู้ใช้งาน AI เป็นเจ้าของลิขสิทธิ์ผลลัพท์ของโมเดล หรือบางครั้งอาจจะไม่ได้ระบุว่าใครเป็นเจ้าของแต่ผู้ใช้งาน AI มีสิทธิ์ใช้งานได้เต็ม (ซึ่งอีกนัยหนึ่งคือผู้สร้าง AI ก็ไม่แน่ใจว่าใครเป็นเจ้าของ) และอาจจะมี indemnity clause ให้ด้วยว่าหากถูกฟ้องร้องเรื่องลิขสิทธิ์ ทางผู้สร้าง AI จะรับจบให้ ปัญหามักจะเกิดเมื่อ AI คืนผลลัพท์ที่ตรงกับงานที่มีลิขสิทธิ์ขึ้นมาโดยที่ผู้ใช้ไม่ทราบว่างานนั้นมีลิขสิทธิ์ วิธีแก้ไขสำหรับ AI เขียนโค้ดในปัจจุบันคือระบบรัน AI จะเอาผลลัพท์ไปค้นหาดูก่อนว่าตรงกับข้อมูลใดหรือไม่ ถ้าตรงก็จะยกเลิกผลลัพท์ออกไปเลย ซึ่งแสดงว่าลิขสิทธิ์ของโมเดลจริงๆ แล้วยังกำกวมอยู่\n<ul>\n<li>สำหรับเรื่องตัวลิขสิทธิ์ของโมเดลเอง ปัจจุบันเวลามีคนถาม ผมมักจะใช้ analogy ว่า ถ้าไปจ้างคนมาวาดภาพ แล้วเขาใช้ Windows เถื่อน ใช้ Adobe Illustrator เถื่อน สร้างภาพขึ้นมา ภาพที่วาดออกมาถ้าสร้างขึ้นมาเองจริงก็ไม่มีปัญหาใช้งานได้ปกติ หรือไปซื้อเนื้อหมูในห้างก็แสดงว่ามันต้องมีคนฆ่าหมู เป็นปัญหาศีลธรรมแทนว่าแล้วเราจะสนับสนุนคนแบบนี้หรอ</li>\n</ul>\n</li>\n</ol>\n<p>ดังนั้นผมคิดว่าโมเดลที่ใช้งานได้โดยไม่ละเมิดลิขสิทธิ์ มีอยู่สามประเภทคือ</p>\n<ol>\n<li>ไม่ใช้ข้อมูลที่มีข้อกำหนดในสัญญาอนุญาตมาฝึก AI เลย เช่น ซื้อข้อมูลมาจากเจ้าของลิขสิทธิ์อย่างถูกต้อง รวมกับข้อมูลที่ไม่มีลิขสิทธิ์ (public domain) ดูเหมือนว่า AI สำหรับสร้างรูปภาพบางตัวจะไปทางนี้</li>\n<li>ใช้เฉพาะข้อมูลที่ไม่มีลิขสิทธิ์ ซึ่งเท่าที่หามามีคนทำอยู่บ้างสำหรับงานภาพและวิดีโอ ส่วนงานที่เป็นตัวอักษรยังไม่มีใครทำเพราะข้อมูลมีจำนวนน้อย</li>\n<li>ทำให้โมเดลปฏิบัติตามสัญญาอนุญาตทุกครั้งที่ใช้ข้อมูล เช่น ถ้าเขียนโค้ดแล้วคืนโค้ดที่มีลิขสิทธิ์ให้อ้างอิงแหล่งที่มาทุกครั้ง ซึ่งปัญหานี้น่าจะทำได้จริงยากมากเพราะโมเดลยังสามารถ hallucinate หรือการใช้ข้อมูลที่ไม่มีจริงได้อยู่ ก็เป็นไปได้ว่าการอ้างอิงที่ให้อาจจะไม่ถูกต้องและยังละเมิดลิขสิทธิ์</li>\n</ol>\n<h2>The Free Internet</h2>\n<p>ปัญหาที่น่ากลัวของ LLM คือมันกำลังจะทำลายอินเตอร์เน็ตที่เสรีลง เพราะว่าการฝึกสอน LLM ต้องใช้ข้อมูลจำนวนมากและเป็นปัจจุบัน ทำให้ผู้สร้าง AI หลายรายทำเหมืองข้อมูลจากอินเตอร์เน็ต จนแทบจะเรียกว่า strip mining</p>\n<p>บล็อกผมก็เช่นเดียวกันที่ถูกดูดข้อมูลไปใช้งานจนต้องมีระบบป้องกัน เพราะไม่ใช่แค่ดูด แต่ดูดหนักจนเซิร์ฟเวอร์ล่มหลายครั้ง</p>\n<p>เว็บไซต์รายใหญ่ โดยเฉพาะ social media หลายๆ เว็บพบว่าข้อมูลในเว็บจากที่ไม่มีมูลค่านอกจากส่งให้เก็บเป็นจดหมายเหตุไว้ กลายเป็นขุมทรัพย์ในการฝึก AI จนต้องออกมาตรการป้องกันไม่ให้ผู้ผลิต AI นำข้อมูลออกไปได้เด็ดขาดถ้าไม่จ่ายเงิน ซึ่งก็ส่งผลให้อินเตอร์เน็ตโดยรวมปิดมากขึ้น (Twitter เดี๋ยวนี้ก็ต้องล็อคอินก่อนเข้าใช้เพราะเหตุนี้ หรือ reddit เองก็ปิด API เสรีไปแล้ว) ถ้า Web 2.0 คือ interoperable web ยุค Web 4.0 กับ AI คือเราจะไม่ interoperate กันแล้ว นอกจาก self-bot ด้วย MCP</p>\n<p>ที่ยังต้องเน้นย้ำคือ บล็อกผมไม่ได้มีสัญญาอนุญาตแปะไว้นานแล้ว แปลว่าบทความภายในนี้มีลิขสิทธิ์ นำไปเทรน AI ไม่ได้ แต่แน่นอนว่าผู้ผลิต AI ที่ดูดไป จับมือใครดมไม่ได้ และจับได้ไปฟ้องก็ไม่มีหลักฐานด้วยว่าเขานำไปเทรน AI จริงๆ เพราะถ้าจะอ่านบทความผมเฉยๆ อ่านฟรี จะโหลดเก็บไว้แบบที่หาอ่านใน Google Search/Cache ด้วย ก็มีคำตัดสินแล้วว่าถูกกฎหมาย แล้วจะพิสูจน์จนได้หมายค้นได้อย่างไรว่าบทความผมถูกนำไปฝึก AI หรือไม่</p>\n<h2>Piracy</h2>\n<p>ส่วนตัวไม่ได้คิดว่าลิขสิทธิ์ต้องเป็น 0 บางอย่างละเมิดลิขสิทธิ์เล็กน้อยผมคิดว่ารับได้ ยิ่งถ้าเป็นงาน non-commercial แล้วผมเฉยๆ ว่าต้องทำให้ถูกลิขสิทธิ์ เหมือนคลิป YouTube บางทีก็อัพคอนเสิร์ตขึ้นมาให้ดู บางทีดูดคลิปช่องหนึ่งไปลงอีกช่องหนึ่ง คือผู้สร้างคลิปเนี่ยผิดเต็มๆ แต่คนดูคลิปก็ดูเพื่อความบันเทิงส่วนตัวเฉยๆ ก็ควรจะทำได้ ถ้าเอาไปเปิดในที่สาธารณะก็อีกอย่างหนึ่ง</p>\n<p>ดังนั้นพวก LLM ที่เป็นตัวหนังสือ ถ้าจะใช้งานทั่วไป คิดเลขให้หน่อย แนะนำ แก้ปัญหาชีวิตให้หน่อย หรือจะใช้คุยเป็นเพื่อนยามเหงา พวกนี้ผมคิดว่าเฉยๆ ถูกลิขสิทธิ์หรือเปล่าไม่รู้แต่ใช้งานได้ แต่ถ้าจะใช้งานในระดับมืออาชีพ ทำงานที่คิดเงิน ควรจะเข้าใจที่มาที่ไปว่ามันได้มาอย่างผิดกฎหมาย (หลายคนตื่นเต้นกับ AI โดยไม่ทราบเลย) แต่มันไม่ได้บาปมาก เหมือนบริษัทให้ใช้ Windows เถื่อนทำงานก็ทำๆ ไปเถอะเพราะเราไม่ได้โดนจับไปด้วย แต่ถ้าไปแจ้งตำรวจอาจได้สินบนนำจับนะ</p>\n<h2>My Threat Model</h2>\n<p>สรุปแล้ว จุดยืนของผมกับ Generative AI คือ</p>\n<ol>\n<li>ถ้าใช้ส่วนตัว ก็ใช้ได้ แต่ระมัดระวังว่าอย่าหลุดจาก context ส่วนตัว เช่นเอาไปทำเว็บแล้วมีคนมาใช้เพื่อประโยชน์ของเขา อันนี้ไม่ส่วนตัวแล้ว</li>\n<li>ถ้าใช้สำหรับสั่งงานให้ทำตามคำสั่งของเรา โดยที่ output ชัดเจนว่าเป็นคำสั่งของเราทั้งหมด คิดว่าควรจะใช้งานได้ ส่วนลิขสิทธิ์โมเดลปล่อยให้เขาจัดการไปก่อน</li>\n<li>แต่ถ้าคำสั่งมันกำกวมมากขึ้น เช่น เขียนโค้ดโดยไม่ได้บอกชื่อ function ที่จะต้องเรียกชัดเจน (ไม่ว่าจะบอกเอง หรือเครื่องมือบอกให้ เช่น ส่งรายชื่อ autocomplete ไปให้) คิดว่ามีความเสี่ยงที่จะเป็นงานมีลิขสิทธิ์ ผมคิดว่าถ้าเขาจ้างมาเขียนโค้ดโดยนายจ้างเป็นเจ้าของลิขสิทธิ์ แล้วเราส่งมอบงานที่อาจไม่มีสิทธิ์ให้นายจ้างเป็นเจ้าของลิขสิทธิ์ได้ และนายจ้างก็แยกแยะไม่ได้ (ไม่เหมือนใช้ library ภายนอกที่แยกได้ชัดเจน) มันไม่เป็นมืออาชีพ แต่ถ้าเป็นงานที่เขาจ้างเพื่อเอาผลลัพท์แต่ไม่ได้โค้ดไป ก็ควรจะเหมือนเราใช้ซอฟต์แวร์เถื่อนทำงานแล้วก็ลบออกไปซึ่งก็แล้วแต่ศีลธรรมของแต่ละคน</li>\n<li>AI สำหรับสร้างภาพหรือวิดีโอ ผมคิดว่าการใช้งานเหมือน meme คือ meme หลายอันแคปมาจากในหนัง หรือ stock photo แต่ก็เผยแพร่ออกไปแพร่หลาย ซึ่งก็อาจจะเข้าข่าย Fair Use ได้ว่าใช้เพื่อล้อเลียน แต่ไม่ควรเอาไปใช้ในงานที่ไม่ใช่ Fair Use</li>\n</ol>\n<p>อีก 10 ปี วันที่อุตสาหกรรม AI เลิกละเมิดลิขสิทธิ์แล้ว เขาจะฟอกขาวประวัติศาสตร์ของวงการเขามั้ยนะ เหมือนกับที่ Crunchyroll เคยเป็นเว็บเถื่อนมาก่อนที่ตอนนี้ก็เป็นเว็บลิขสิทธิ์เว็บหนึ่ง…</p>","author":"whs","siteTitle":"Quietly Verbose","siteHash":"5f972a6fe70a917eb1b1aa165b3cb2be8a9465af33ab38bf05f34c55c0e40587","entryHash":"3a35e994696a4a9355489010e38e4df108152ad2e6156ac1168e1b90730068b6","category":"Thai"}