{"title":"WINNER: Celebrating The Radavist’s 20th Anniversary with a Paul Klamper Set for One Lucky Member","link":"https://theradavist.com/celebrating-the-radavist-20th-anniversary","date":1771788611000,"content":"<p><strong>We pulled a winner this week. Congrats to Mike H for taking home a Paul Component Klamper kit!. Be sure you’re signed up for <a href=\"https://theradavist.com/membership/join\" target=\"_blank\">The Radavist Membership</a> to be entered in future giveaways!</strong></p>\n<p>This used brake kit is just for representation purposes only; you’ll receive a brand new brake kit if you win!</p>\n<p>2026 is a big year for us. It’s this website’s 20th anniversary, and we’re stoked you’re part of it. Founded in 2006, this website has seen various waves of content, but one thing has remained the same: our love for small makers. So it’s fitting we team up with one of our favorites to kick off our 20th!</p>\n<p>This month, we’ve teamed up with <a href=\"https://www.paulcomp.com/shop/\" target=\"_blank\">Paul Component Engineering</a> to give away a Paul Klamper brake kit. Included in this giveaway is a pair of Paul Klampers in whatever pull and finish (that’s currently in stock) you want, with matching levers.</p>\n<p>To be entered to win, all you’ve got to do is be a <a href=\"https://theradavist.com/membership/join\" target=\"_blank\">Radavist Member</a> with an active subscription.</p>\n<p>The winter months are hard for bike media. We’re still cranking out content every day, but our advertising revenue is usually half of what it is in the spring through fall months. Help us out by becoming a Radavist Member for a little as $5 a month. Every cent of your contributions keeps our staff paid and this website running smoothly.</p>\n<p><strong><a href=\"https://theradavist.com/membership/join\" target=\"_blank\">Subscribe here to support our independent Reportage and be entered for your chance to win!</a></strong></p>\n<p>The post <a href=\"https://theradavist.com/celebrating-the-radavist-20th-anniversary\">WINNER: Celebrating The Radavist’s 20th Anniversary with a Paul Klamper Set for One Lucky Member</a> appeared first on <a href=\"https://cms.theradavist.com\">The Radavist</a>.</p>","author":"John Watson","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"3a6c5599632ce60447cb9c9336a0fec32b1125f6213bc312db0820281916e4c2","category":"Cycling"}