{"title":"Triumph against the odds: Magdeleine Vallieres on resilience, breakthroughs and the path to Montréal 2026","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/chasing-rainbows-magdeleine-vallieres-on-her-breakthrough-moments-and-the-path-to-world-championships-success","date":1767872055000,"content":"\n      <p><em>Magdeleine Vallieres took to the stage at <a href=\"https://www.rouleur.cc/pages/rouleur-live\">Rouleur Live 2025</a> to share her journey from the UCI World Cycling Centre to her first professional contract and a defining win at the World Championships in Rwanda. Speaking to Rachel Jary, the Canadian rider discusses how mentorship, resilience and determination fuelled her breakthrough, while also reflecting on the evolution of women’s cycling and her ambitions for the future.</em><b></b></p>\n<div></div>\n<p> </p>\n<p> </p>\n<p><strong>When did the contract with EF Pro Cycling come about? How did those conversations start?</strong></p>\n<p><span>After two years with the UCI World Cycling Centre, I signed with EF-Tibco-SVB for two years, which was a bit different than the team now, and when I signed that contract, that kind of opened up more big races and being professional.</span></p>\n<p><strong>What was it about that team that kind of drew you to them? Did they offer you a plan for your career?</strong></p>\n<p><span>No, actually, when they signed me, we went over the calendar and they actually had no clue of what kind of rider I would be, so they put me in a bit of everything to try to figure it out. So I did the Classics, I did the Grand Tours, I ended up racing quite a lot that year and then I think they started to see that I could be a helpful member of the team, and they valued me a bit more.</span></p>\n<p><strong>You finished most of the races in your debut season. Do you think you’ve got that kind of grit and determination, which says “I’m never going to pull out of this race unless I really have to”?</strong><b></b></p>\n<p><span>I don’t think I finished all of them, but in my head, I knew my teammates had more experience and were stronger, so for me, it was what can I do so that we can make the team get the best result possible? So that was more my goal. How do we get the team where we want to be?</span><b></b></p>\n<p><strong>What did you learn from those more experienced riders in your team?</strong><b></b></p>\n<p><span>I had a lot of mentors through the year, and they were always showing me “now you need to ride the front”, “now you need to be in that breakaway”, “follow that move now”, “bring us to this point in front” and how to manage everything else around it. I’ve had good mentors through the years.</span><b></b></p>\n<p><strong>What’s the best piece of advice you were given.</strong><b></b></p>\n<p><span>Alison [Jackson] said to “embrace the chaos a bit and go for it.”</span></p>\n<p><strong>As you were going through all those races and experiences, were you starting to figure out what type of rider you wanted to be and which type of races you enjoyed?</strong></p>\n<p><span>I enjoy all of them, so it’s a bit hard to say, but I’m starting to focus more towards the Ardennes Classics, the one-day races and also the Grand Tours.</span></p>\n<p><strong>It seems that you thrive in those hilly races. A lot of that is about positioning and making sure you’re at the front. Was that almost harder to perfect than the physical side of it?</strong></p>\n<p><span>I think by helping my teammates, I learned a lot of tricks of when we need to be in front for them to save the most energy, and the times that are the most important in the race. So I can take this with me into every race. Also, the harder the race, the better it is.</span><b></b></p>\n<p><strong>Riding for a slightly smaller team, did you feel that you had to fight a little bit more for your position, or maybe that you can’t demand the sort of respect that the experienced riders can? Did that make it harder at all?</strong><b></b></p>\n<p><span>Yeah, for sure, but I think we’re getting more and more respect as a team in the peloton. It’s nice to see throughout the last four years with EF, how we’re now a lot more respected in the bunch, it’s easier to position than it used to be.</span><b></b></p>\n<p><strong>From a rider’s perspective, what have been those key changes within the team in the last few years?</strong><b></b></p>\n<p><span>The two first years I was with EF-Tibco-SVB was a completely different team than EF-Oatly. It’s a different management now and we also merged with the men’s team.</span><b></b></p>\n<p><strong>Are you working quite closely with the men’s team now?</strong></p>\n<p><span>Yeah, it’s the same team now. That’s the big difference.</span></p>\n<p><strong>Does that help with the equipment side of things? The training, knowledge, nutrition and things like that?</strong></p>\n<p><span>Yeah, I think now we can share everything, and we get a lot more teammates. It’s nice.</span></p>\n<p><strong>Your first professional win was at the Trofeo Palma Femenina in 2024. That must have felt like a real breakthrough moment in your career.</strong></p>\n<p><span>It was a really special moment, because also my teammate Noemi [Rüegg] won the day before, and then to win, we were two wins back to back. Also for me, it showed me that maybe I can do a different role in the team, so it opened my eyes a lot.</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_9283_1024x1024.jpg?v=1767872312\" alt=\"\" /></div>\n<p><em>Image: Alex Whitehead/SWpix.com</em></p>\n<p><strong>Can you talk us through that race? How did you win?</strong></p>\n<p><span>We attacked just before one of the climbs and in the descent, I got away with Silvia Persico, and in the end, she crashed and then I just continued, went all in and then just pushed to the finish and finished solo.</span></p>\n<p><strong>Do you think that win changed you a little bit as a person and your confidence?</strong></p>\n<p><span>It gave me a lot more confidence, that’s for sure, but I’m the same person, I would say.</span><b></b></p>\n<p><strong>From there you were twelfth at Trofeo Binda. When you were finding yourself riding at that level, did you get the feeling that you could compete with the best and beat them?</strong></p>\n<p><span>I mean, it’s special to have your idols as competitors, that you can also try things against them, so for sure, it’s been good.</span></p>\n<p><strong>The sport is growing at an unprecedented rate. Does it feel like you’re coming up at a really positive time for women cycling?</strong><b></b></p>\n<p><span>Yeah, for sure. I’m glad I came in at this time, I think it’s continuing to grow for the future generation, so it’s really good.</span><b></b></p>\n<p><strong>You’re a bit of an all rounder, you can compete in one day races and stage races. What’s your preference?</strong><b></b></p>\n<p><span>I do love the stage races. You get to race back to back every day, and I like when people get tired, when the races are harder, so the more days, the better.</span><b></b></p>\n<p><strong>It seems like you kind of thrive in those really tough, attritional races.</strong></p>\n<p><span>I’m suffering, but I think I can suffer quite a lot, so it’s okay. I just suffer, I continue suffering and then I stay.</span><b></b></p>\n<p><strong>Do you ever think about the early days and those bikepacking experiences with your dad? Do you think that you learned to suffer?</strong><b></b></p>\n<p><span>We weren’t going very fast. We were probably leaving at 7am and coming home at 7pm, doing 100km, so I was not suffering so much. My dad was probably suffering more than me, hearing me talk a lot the whole day.</span><b></b></p>\n<p><strong>The World Championships was obviously the big highlight for you this season. In the months leading up to it, did you have a feeling that this was going to be your year? Did you find earlier in the season that you were getting that confidence?</strong></p>\n<p><span>In the Tour [de France Femmes], I saw that I’m not so far off. We were riding for Cédrine [Kerbaol] and we actually had a really good Tour. Sadly, she crashed on the last mountain stage, but that gave me a lot of confidence for what was next and I knew my form would keep getting better, so I really focused on Worlds, because my coach had told me the course was perfect for me, like it was made for me. So yeah, I went all in for it and the one thing that was really important was I didn’t want to have any regrets on that day. So that’s how I prepared myself for it.</span><b></b></p>\n<p><strong>So you knew that the World Championships was going to be the target of your season very early on. At what point did you begin building up to it?</strong></p>\n<p><span>Already from the beginning of the season, it was always in the back of my mind. It was a big goal, for sure. But of course, I needed to get selected first. Then at the Tour, when I saw that now my form was getting good, my coach said “we keep on pressing”. We pushed the limit in training, we tried some different things and we really made sure I was gonna target that one.</span><b></b></p>\n<p><strong>When you say you and coach tried some different things in training, what did you change?</strong></p>\n<p><span>Well, he made me do a lot of special things. Sometimes I would come back from training and say “I don’t know why we did this.” Normally, it’s rare I cannot finish a training session. If I can’t, I’m really disappointed. But then sometimes I would finish really on the limit and say “is that normal?” Then he made me do ten times ten minutes torque training, a lot of torque, and then after he laughed and said “I didn’t think you were going to be able to do it”. Okay, that’s why I felt so bad. But yeah, we just tried a lot of things and really pushed it to make sure I would be ready.</span><b></b></p>\n<p><strong>As the World Championships were approaching, how did you make sure that your form was peaking for those exact days?</strong></p>\n<p><span>I did altitude training just before, and then included some races with [Grand Prix de] Wallonie just before. I left it to my coach to plan the whole thing. I trust him.</span><b></b></p>\n<p><strong>Some riders are so involved in that process, but are you someone who takes a step back rather than delving into the science side of it yourself?</strong></p>\n<p><span>I think I’m a bit of a mix, but I cannot be too much into it, because I need someone to tell me to stop. I would crack myself, for sure I would do too much, so it’s good I have him.</span><b></b></p>\n<p><strong>You said that when you saw the course in Rwanda, you knew straight away that it was suited to you. What was it about the parcours that was especially good for you?</strong></p>\n<p><span>The short climbs, steep and also that you have to repeat it a lot. Everyone gets more and more tired. Also at altitude with heat, just a lot of suffering.</span><b></b></p>\n<p><strong>There was a lot of talk about the fact that the championships were in Africa for the first time. What was that experience actually like being there, with the fans, the heat, the humidity? Everything was so different.</strong><b></b></p>\n<p><span>It was really, really hard. The days before, I had interval training over there and it was one of the rare times that I could not do the training, and I was really demoralised after. Then my coach said “you can either take it as a positive or as a negative. It depends how you see it, everyone’s suffering, so it’s positive, or your suffering, it’s negative.” So then I chose to use it in a positive way. But the conditions were really, really hard, but we also had such a nice welcome. Everyone was so nice. And people were dancing the whole time we were racing. I think they were also doing something crazy, dancing for I don’t know how many hours without stopping and singing. It was impressive.</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-104725_1024x1024.jpg?v=1767872469\" alt=\"\" /></div>\n<p><span></span><em>Image: Zac Williams/SWpix.com</em></p>\n<p><strong>Going into that race with your Canadian teammates, had you spent a lot of time together as a group, getting to know each other and racing together?</strong></p>\n<p><span>No, not really, because I only knew I was selected maybe two weeks before, so it’s hard to prepare with them first. But with Alison [Jackson], I had raced the whole last three years, so I knew how to race with her and she was a really big help. Also the girls, they all said they wanted to help me, which gave me a lot of confidence and belief that I could go for it.</span><b></b></p>\n<p><strong>Before the race, was there a discussion that you would be the sole leader and they were all going to support you in doing that?</strong></p>\n<p><span>The DS asked us what we wanted to get out of this event and everyone started to say “oh, we want to support you.” That really gave me a lot. I was surprised, but really happy about it. Then I said “okay, if you guys believe that much in me, I will also believe.” It was a big goal for me, so I told them I wanted a big result. I didn’t expect to win.</span><b></b></p>\n<p><strong>The World Championships are so unpredictable. Did you have a game plan, or was it quite instinctive?</strong></p>\n<p><span>I knew I needed to be patient for the first half, that was sure. Don’t do any hard efforts, because with the heat and the altitude, when you go too much into the red, then it’s hard to come back. So I stayed patient and the girls really helped me to save as much energy as possible. Then, it was more of an instinct. I was in a good place when the break went and I said “oh then I’ll go.” Our team DS, Carmen Small, told me: “when you go, commit.” So then I just committed all in and I said “no regrets.”</span><b></b></p>\n<p><strong>Some riders say when they’re about to get a big result, you feel that it’s your day to do it. Did you have that feeling?</strong></p>\n<p><span>Well, the legs had been amazing for the last few weeks, so I thought I could be in good shape, but as I said, the two days before, I really struggled. But I knew everyone was struggling, so I tried to just focus on the race and see how it went lap by lap.</span><b></b></p>\n<p><strong>Can you talk us through the dynamics in the breakaway group? Were you speaking to each other? Were you working together?</strong></p>\n<p><span>We weren’t really working super well together, I would say. We were three, with Niamh [Fisher-Black] and Mavi [Garcia], we were working quite a lot. So then at some point, we got away, just the three of us. Niamh and I were working a lot, but we were trying to encourage everyone to work, but most girls were just sitting on, so I was a bit frustrated. But yeah, it’s cycling.</span><b></b></p>\n<p><strong>How do you make the calculation of when to go on the front and take a turn, and when to not?</strong></p>\n<p><span>I was thinking I’m doing a lot, maybe it’s not so smart, also if we get caught back, but as I said, I just committed. I thought “this is my best chance. This is the chance.” I just go. I just continued, I felt good, so I just kept pressing on.</span><b></b></p>\n<p><strong>Could you tell who the strongest riders were within that group?</strong></p>\n<p><span>It’s hard to say, because everyone’s playing a bit of a game, so sometimes some were saying “I cannot take a pull.” But then they attacked, so then you just never know. It’s hard to say.</span><b></b></p>\n<p><strong>Obviously, you race with these riders all year, so you have an awareness of who riders like Niamh Fisher-Black and Mavi Garcia are. Did you know that they were the biggest names that you needed to keep an eye on?</strong><b></b></p>\n<p><span>The group was actually all really strong girls, so it’s hard to say, but for sure with these two girls, I knew they had a really good chance of doing it if we got to the end.</span><b></b></p>\n<p><strong>When you made your winning attack, how did you know that that was the moment?</strong></p>\n<p><span>I thought if I don’t go, then it’s a sprint, and I don’t want to wait for the sprint. I know my three to four-minute power is good, so I just tried something. Like I said, no regrets, so I just went. A few metres later, I thought maybe this was a mistake, but in the end, it wasn’t.</span><b></b></p>\n<p><strong>You didn’t have a race radio, so you had no idea where the favourites were. Were you expecting some of the favourites to catch up to you at one point?</strong><b></b></p>\n<p><span>Yeah, I was sure someone was going to catch me.</span><b></b></p>\n<p><strong>What were you thinking about in those final few hundred metres?</strong><b></b></p>\n<p><span>Pain, so much pain. But I was like, you have to keep on pushing, you’re almost there. It’s the World Championship. What is happening? It’s not possible. Don’t care about the pain. Just continue. Then I was taking in the crowds and just trying to get to the line.</span><b></b></p>\n<p><strong>When you crossed the line, you were almost too exhausted to even celebrate until you saw your teammates. What was that feeling like?</strong><b></b></p>\n<p><span>The best feeling, I would say. Surprise, but also so nice to have them at the end. They played a huge part in it and that I could celebrate with them. I just realised my dream, so for sure, it’s super special.</span><b></b></p>\n<p><strong>How long did it take you to kind of fully process what you did?</strong><b></b></p>\n<p><span>I’m still processing it. I know it’s real, but it’s still a bit unreal to me that it really happened.</span><b></b></p>\n<p><strong>Did you sleep in your rainbow jersey?</strong><b></b></p>\n<p><span>Everyone has been telling me this, but I don’t want to get it dirty or something. At the moment, it’s in my closet, but I want to put it in a frame or something. Yeah, I’m working on it.</span><b></b></p>\n<p><strong>What was the response like back home in Canada? Did you get contacted by people back home straight away, congratulating you?</strong><b></b></p>\n<p><span>Yeah, all my family, my friends and everyone through my journey contacted me to say congratulations. It’s been super special. I’ve received so much love.</span><b></b></p>\n<p><strong>Have you had a chance to actually go back to Canada yet?</strong><b></b></p>\n<p><span>Yeah, I spent three weeks there after Worlds. Well, after the last two Italian races, I went back.</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-102880_1024x1024.jpg?v=1767872525\" alt=\"\" /></div>\n<p><span></span><em>Image: Zac Williams/SWpix.com</em></p>\n<p><strong>What were you doing there? How was it to go back home with this new World title?</strong><b></b></p>\n<p><span>A mix of everything. The most important thing for me was to see my friends, my family and everyone that supported me since the beginning, so that was my priority. And then I did go on a talk show and met a few people, but it was good.</span><b></b></p>\n<p><strong>Has it been weird to kind of get this new attention? Or are you dealing with it quite well?</strong><b></b></p>\n<p><span>I’m just going with the flow. For sure, it’s really different than what I’m used to. I’m used to a quiet life, I would say. Training, resting, training, resting, sleeping. But yeah, I’m going with the flow.</span><b></b></p>\n<p><strong>You raced again quite quickly after winning the World Championships. What was it like getting the kit and the bike from the team?</strong><b></b></p>\n<p><span>It was really good. I always said that I knew I would have made it when I would have my own custom bike and then Cannondale made me my rainbow bike, and they actually drove two days to make sure I had it for the race. They built it in the evening before the race. So yeah, it was super special. I really wanted to do those races to be with my teammates and celebrate it with the team.</span><b></b></p>\n<p><strong>Was there a bit more pressure knowing that you were going into that race with the rainbow stripes on?</strong><b></b></p>\n<p><span>Yeah, for sure, it’s maybe a bit more pressure, but also a lot of motivation. I mean, it’s an honour to be able to wear this jersey, so every time I get to wear it, it’s special.</span><b></b></p>\n<p><strong>Do you find that people were treating you differently in the peloton after that?</strong><b></b></p>\n<p><span>Well, a lot of girls came to say congratulations and say “wow, nice bike!” Yeah, I know it’s a nice bike. It was just really nice being in the peloton again and I was really excited to finish the season with the rainbow jersey.</span><b></b></p>\n<p><strong>Next year, the World Championships are taking place in Montreal. Are you excited to have the World Championships in your home country?</strong><b></b></p>\n<p><span>Yeah I mean, it’s incredible. It’s going to be an hour and a half from home. I get to race at home, I never get to race at home, and then have all my family, all my friends, hopefully all of you. We get to bring all the peloton to Canada, to Quebec. It will be an incredible event, that’s for sure.</span><b></b></p>\n<p><strong>Obviously, you know those roads very well. What can you tell us about the race? What can we expect from the course?</strong><b></b></p>\n<p><span>It’s going to be a hard course. We finish on a circuit with the Mont Royal. Yeah, it will be a hard course. I think, really exciting, a big show, I would say.</span><b></b></p>\n<p><strong>Well, you said before that you like a hard course. Do you think it’s going to suit you?</strong><b></b></p>\n<p><span>For sure, it’s going to be a big goal. But also, winning the rainbow jersey one time is already, I think something really special, but for sure it will be a big goal. We’re going to try.</span><b></b></p>\n<p><strong>What does the rest of this offseason look like for you now? Are you getting back into training soon?</strong><b></b></p>\n<p><span>Tomorrow we have a training camp with the team. First one, so it’s started already. We’re getting ready for 2026. Big goals.</span><b></b></p>\n<p><strong>Is there anything specific that you’re working on this winter that you’re trying to improve with your coach?</strong><b></b></p>\n<p><span>Just keep on continuing the training and progression we’ve been going through the last few years. Trying to get better. But with the team, I’m going to get more opportunities to go for it, so I’m excited to see how it turns out.</span><b></b></p>\n<p><strong>Which races really stick out to you next season as the real goals for you?</strong><b></b></p>\n<p><span>The Ardennnes, for sure. They’re always races I really like. And then the Grand Tours.</span><b></b></p>\n<p><strong>Does going into those races with the rainbow jersey make you feel more confident? Everyone talks about the curse of the rainbow jersey. Everyone’s watching. Everyone knows what you can do. How do you think you’ll manage that?</strong><b></b></p>\n<p><span>I will have to see. It’s not something I’ve experienced before, but I think it’s going to be fun. And as I said, it’s an honour to wear it, so I’m going to prepare well and I’m going to do what I can.</span><b></b></p>\n<p><strong>Will it be mostly the one day races that you’re targeting? Or could we expect to maybe see you riding for GC at any point?</strong><b></b></p>\n<p><span>I would like to ride for GC at some point. But I’m still young, I still have a lot to develop. I think slowly, step by step, maybe I’ll get there. But I still have a lot to learn and to get better, to ride for a top step on GC. So yeah, step by step.</span><b></b></p>\n<p><strong>Are you ready for some big showdowns next year?</strong><b></b></p>\n<p><span>Yeah, let’s bring it.</span><b></b></p>\n<p><strong>Winning the rainbow jersey is the pinnacle of cycling. But what other races stand out to you as dream races to win?</strong><b></b></p>\n<p><span>Like I said, the Ardennes would be nice to win. One of the monuments.</span><b></b></p>\n<p><strong>Have you had a look at the Tour de France Femmes route yet for next year?</strong><b></b></p>\n<p><span>Yeah, a little bit. It will be a hard one. A good one, I would say.</span><b></b></p>\n<p><strong>We’ve got a mountain time trial, which we’ve never seen before in the women’s race. What are your thoughts about that?</strong><b></b></p>\n<p><span>For me? Yeah, we’ll have to see. I’ve never done one, so it’s hard to say, but I think for our team, it will suit us quite well.</span><b></b></p>\n<p><strong>Being the World Champion, you’re now a real figurehead in the sport, and people will be wanting your opinions on things. And I think a big discussion in women’s cycling at the moment is the length of the Tour de France Femmes. What are your thoughts on that?</strong><b></b></p>\n<p><span>As I said, I like the harder and the longer it is, so for me, I like that we keep adding days. But for sure, we can’t go from seven days to a month-long race. It needs to be step by step, but I think slowly we’ll get there. But also, it’s exciting that it’s shorter. I think more things happen in the race. It’s like non-stop all the time.</span><b></b></p>\n<p><strong>If you could meet your younger self now and speak to that girl who’s just starting out, what piece of advice would you give yourself?</strong><b></b></p>\n<p><span>To trust the process and that there’s going to be highs and lows, but don’t get too disappointed in the lows, just keep on trusting the process and continue to reach the highs as they happen. I mean, they happened, so it happened.</span></p>\n<p><em>Find out more about <a href=\"https://www.rouleur.cc/pages/rouleur-live\">Rouleur Live</a></em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"3b32254386f4c1c8bb585b9656338cebd91d2e930ca056f82531b79ab804eba8","category":"Cycling"}