{"title":"Lauren Hall: Summer Miles, New Friends, and Giving Back","link":"https://moots.com/blogs/news/lauren-hall-summer-miles-new-friends-and-giving-back","date":1762458300000,"content":"\n      <div>First, a quick apology for the late post-the end of June and start of July had me sidelined with COVID, and for two solid weeks there was zero exercise of any kind. Once I was back on my feet, though, the summer cycling calendar hit full speed, and I've been soaking up every mile and every moment since.</div>\n<div> <img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/LH_1.jpg?v=1762458332\" alt=\"\" />\n</div>\n<div>In July, the team and I hosted the USA Cycling Foundation's annual Tour de France Femmes trip, a tradition we plan for our major supporters. Not just to watch, but to truly experience it - riding up the legendary Cols before the pros arrived, feeling the crowd's roar echo off the mountains, and sharing those moments with an incredible group who believe in supporting the next generation of cyclists and women's cycling! These trips mean so much to me.</div>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/LH_2.jpg?v=1762458332\" alt=\"\" /></div>\n<div>From the French Alps, I swapped tarmac for dirt and headed to the Leadville 100 - this time with a microphone instead of a number plate. I had the privilege of commentating for the Life Time Grand Prix series, which gave me a front-row seat to the grit, dust, and determination that make Leadville legendary. Being there to call the action while cheering on my gravel family was such a great weekend.</div>\n<div> </div>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/LH_3.jpg?v=1762458332\" alt=\"\" /></div>\n<div> </div>\n<div>And now, I'm closing out the season by hosting an athlete at my home - a small way to give back after so many people opened their doors, their wisdom, and their hearts to me during my own racing career. Watching the next generation chase their dreams reminds me why I fell in love with the sport in the first place.</div>\n<div> </div>\n<div>Cycling has always been about more than the miles. It's about the stories we share, the roads we ride together, and the way we lift each other up along the way. This summer has been full of all three - and I wouldn't trade it for anything.</div>\n<div> </div>\n<div>Next up, USA Cycling Foundation event in Aspen, CO - August 21st, followed by commentating Chequamegon in September!</div>\n<div> </div>\n<div>-Lauren Hall</div>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"3b6e56a9741c21894325d7a00b34653eb592a69ea08dd140af1a2c3cff6ae90d","category":"Cycling"}