{"title":"Apple TV Sports Content Including F1, MLS, and Friday Night Baseball Coming to Bars and Restaurants","link":"https://www.macrumors.com/2026/02/19/apple-tv-sports-content-everpass/","date":1771535293000,"content":"Apple has inked a deal <a href=\"https://www.businesswire.com/news/home/20260219070713/en/EverPass-Media-and-Apple-Announce-Distribution-Agreement-Bringing-Apple-TV-Sports-to-Commercial-Venues-Nationwide\">with EverPass Media</a> to bring <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> sports content to EverPass customers in the United States. EverPass is a company that bundles premium sports content for restaurants, hotels, casinos, sports bars, and other businesses that want to air sporting events.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2025/10/Apple-exclusive-F1-partner.jpg\" alt=\"\" width=\"3840\" height=\"2160\" />\r<br />\nEverPass will now be able to offer Formula 1, Major League Soccer, and Major League Baseball content to its customers at no additional cost through the main EverPass Core content package. That package also includes Paramount+'s UEFA Champions League, Prime Video's Thursday Night Football, NBA, WNBA and more.\r<br />\n\r<br />\nThe deal includes all-access coverage of every F1 Grand Prix, including practice, qualifying, and Sprint sessions. For MLS, EverPass customers will be able to show enhanced feature matches every weekend during the regular season, plus MLS All-Star Game, Leagues Cup, MLS Cup, and pre-and post-match programming. Also included is Friday Night Baseball, with two MLB Friday night games per week.\r<br />\n\r<br />\n‌Apple TV‌ sporting content will be available through EverPass alongside NFL Sunday Ticket, Peacock Sports Pass, Prime Video sports content, and Paramount+.<br />This article, \"<a href=\"https://www.macrumors.com/2026/02/19/apple-tv-sports-content-everpass/\">Apple TV Sports Content Including F1, MLS, and Friday Night Baseball Coming to Bars and Restaurants</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-tv-sports-content-including-f1-mls-and-friday-night-baseball-coming-to-bars-and-restaurants.2477951/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"3cc63f9aea49799203e796cbfc509f94583644351ba4063dee91e3dc79e368f2","category":"Apple"}