{"title":"Here Are All the M3 Macs Still Expected This Year","link":"https://www.macrumors.com/2024/03/09/m3-macs-still-expected-2024/","date":1710010399000,"content":"Earlier this week, Apple <a href=\"https://www.macrumors.com/2024/03/04/apple-announces-m3-macbook-air/\">announced</a> new 13-inch and 15-inch MacBook Air models, the first Mac updates of the year featuring M3 series chips. But there are other Macs in Apple's lineup still to be updated to the latest M3 processors.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/M3-Mac-Pro-Studio-Mini-Feature-2.jpg\" width=\"2138\" height=\"1202\" />\r<br />\nSo, where do the Mac mini, Mac Studio, and Mac Pro fit into Apple's M3 roadmap for the year ahead? Here's what the latest rumors say.\r<br />\n\r<br />\n<h2>Mac Mini</h2>\r<br />\nApple announced ‌M2‌ and ‌M2‌ Pro Mac mini models in January 2023, which at the time of writing is over 400 days ago. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/M3-Mac-Mini-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n<em>Bloomberg</em>'s Mark Gurman said in July that he believes a new Mac mini won't emerge <a href=\"https://www.macrumors.com/2023/07/23/new-macbook-pro-and-mac-mini-with-m3-2024-launch/\">until late 2024 at the earliest</a>, and we haven't heard any other rumors that move the dial since then. On the other hand, Apple may choose not to upgrade the Mac mini this year and skip the M3 entirely. Approximately 26 months passed between the launch of the M1 Mac mini and the update to the M2 Mac mini​​. Going forward, perhaps the company has an 18-month upgrade cycle in mind, which would mean we could see an M4 Mac mini in the spring of 2025.\r<br />\n\r<br />\n<h2>Mac Studio</h2>\r<br />\nApple updated the ‌Mac Studio with ‌M2‌ series chips in June 2023. ‌Mac Studio‌ models come with either the ‌M2‌ Max or ‌M2‌ Ultra chip, so logic would suggest we should expect equivalent M3 variants.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/M3-Mac-Studio-Feature-1.jpg\" width=\"2271\" height=\"1278\" />\r<br />\nHowever, according to a <a href=\"https://www.macrumors.com/2024/01/05/m3-ultra-mac-studio-to-launch-in-mid-2024/\">January</a> report by Taiwanese research firm TrendForce, a new Mac Studio model will launch in mid-2024 with a more powerful M3 Ultra chip than we might otherwise expect.\r<br />\n\r<br />\nAccording to the report, the M3 Ultra chip will be fabricated with TSMC's N3E node, just like the A18 chip that is expected to debut in the iPhone 16 lineup later this year. This means it would be Apple's first N3E chip. N3E is an enhanced version of TSMC's 3nm process, offering slightly better performance and higher production yield.\r<br />\n\r<br />\nA couple of days after the TrendForce report, Gurman said he believes Apple is working on a new Mac Studio that is likely to be offered with the <a href=\"https://www.macrumors.com/2024/01/07/apple-working-on-new-mac-studio-and-mac-pro/\">as-yet-unannounced fourth variant of the M3 chip</a>. This will, like previous generations, double the components of the \"Max\" version, meaning that it will feature up to 32 CPU cores and 80 GPU cores. Gurman says that it is likely to launch in the second half of 2024.\r<br />\n\r<br />\n<h2>Mac Pro</h2>\r<br />\nAlong with the Mac Studio, Apple updated the Mac Pro with ‌M2‌ series chips during WWDC in June 2023. The ‌Mac Pro‌ is only available in a single chip configuration, and currently ships with the ‌M2‌ Ultra chip that's used in the Mac Studio.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/03/M3-Mac-Pro-Feature-1.jpg\" width=\"2271\" height=\"1278\" />\r<br />\nLogically then, we should expect the next ‌Mac Pro‌ to receive an update to add the same M3 Ultra chip alongside the ‌Mac Studio‌, just like it received the ‌M2‌ Ultra chip last year. Like previous generations, this will likely double the components of the \"Max\" version, meaning that it will feature up to 32 CPU cores and 80 GPU cores.\r<br />\n\r<br />\nIndeed, Gurman thinks Apple is likely to refresh the Mac Pro with this new high-end chip in the <a href=\"https://www.macrumors.com/2024/01/07/apple-working-on-new-mac-studio-and-mac-pro/\">second half of the year</a>. Notably, he does not believe that Apple is likely to again abandon the machine after only one year.\r<br />\n\r<br />\n<h2>MacBook Pro – Already Updated</h2>\r<br />\nApple in November 2023 <a href=\"https://www.macrumors.com/2023/10/30/apple-announces-m3-macbook-pros/\">updated its MacBook Pro lineup</a> with M3 and M3 Pro chips, so the company's work is already done in that regard.  \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/New-MacBook-Pros-Launching-Tomorrow-With-These-4-New-Features-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nApple has so far adopted an 18-month cycle of M1 to M2, and M2 to M3, so it would be reasonable to assume a 2025 launch for M4 MacBook Pro models if Apple sticks with the same tempo. Incidentally, such a roadmap tallies with rumors of the first MacBook Pro with an <a href=\"https://www.macrumors.com/2023/01/11/touchscreen-macs-report/\">OLED display and possibly even a touchscreen</a>. <div>Tag: <a href=\"https://www.macrumors.com/guide/m3/\">M3</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/09/m3-macs-still-expected-2024/\">Here Are All the M3 Macs Still Expected This Year</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/here-are-all-the-m3-macs-still-expected-this-year.2421520/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"400770b7e9570048de8516689b4f37af784750becbb89e62f780c1c4c6fb3bad","category":"Apple"}