{"title":"‘TextEdit and the Relief of Simple Software’","link":"https://www.newyorker.com/culture/infinite-scroll/textedit-and-the-relief-of-simple-software","date":1769457295000,"content":"\n<p>Perhaps at the opposite end of the complexity and novelty spectrum from <a href=\"https://daringfireball.net/linked/2026/01/26/viticci-on-clawdbot\">Federico Viticci’s intro to Clawdbot</a> is <a href=\"https://www.newyorker.com/culture/infinite-scroll/textedit-and-the-relief-of-simple-software\">this piece by Kyle Chayka</a>, writing at The New Yorker, from October:</p>\n\n<blockquote>\n  <p>Amid the accelerating automation of our computers — and the\nproliferation of assistants and companions and agents designed to\nexecute tasks for us — I’ve been thinking more about the desktop\nthat’s hidden in the background of the laptop I use every day.\nMine is strewn with screenshots and Word documents and e-books.\nWhat I’ve accrued the most of by far, though, are TextEdit files,\nfrom the bare-bones Mac app that just lets you type stuff into a\nblank window. Apple computers have come with text-editing software\nsince the original Mac was released, in 1984; the current\niteration of the program launched in the mid-nineties and has\nsurvived relatively unchanged. Over the past few years, I’ve found\nmyself relying on TextEdit more as every other app has grown more\ncomplicated, adding cloud uploads, collaborative editing, and now\ngenerative A.I. TextEdit is not connected to the internet, like\nGoogle Docs. It is not part of a larger suite of workplace\nsoftware, like Microsoft Word. You can write in TextEdit, and you\ncan format your writing with a bare minimum of fonts and styling.\nThose files are stored as RTFs (short for rich-text format), one\nstep up from the most basic TXT file. TextEdit now functions as my\nto-do-list app, my e-mail drafting window, my personal calendar,\nand my stash of notes to self, which act like digital Post-its.</p>\n\n<p>I trust in TextEdit. It doesn’t redesign its interface without\nwarning, the way Spotify does; it doesn’t hawk new features, and\nit doesn’t demand I update the app every other week, as Google\nChrome does. I’ve tried out other software for keeping track of my\nrandom thoughts and ideas in progress — the personal note-storage\napp Evernote; the task-management board Trello; the collaborative\ndigital workspace Notion, which can store and share company\ninformation. Each encourages you to adapt to a certain philosophy\nof organization, with its own formats and filing systems. But\nnothing has served me better than the brute simplicity of\nTextEdit, which doesn’t try to help you at all with the process of\nthinking. Using the app is the closest you can get to writing\nlonghand on a screen. I could make lists on actual paper, of\ncourse, but I’ve also found that my brain has been so irredeemably\nwarped by keyboards that I can only really get my thoughts down by\ntyping.</p>\n</blockquote>\n\n<p>Old habits are hard to break. And trust me, I, <a href=\"https://daringfireball.net/projects/markdown/\">of all people</a>, know the value of writing stuff — all sorts of stuff — in plain text files. (RTF isn’t plain text, but it is a stable and standard format.) I’ve been using BBEdit <a href=\"https://www.barebones.com/company/history.html\">since 1992</a>, not just as an occasional utility, but as part of my daily arsenal of essential tools.</p>\n\n<p>But I get the feeling that Chayka would be better served switching from TextEdit to Apple Notes for most of these things he’s creating. Saving a whole pile of notes to yourself as text files on your desktop, with no organization into sub-folders, isn’t wrong. The whole point of “just put it on the desktop” is to absolve yourself of thinking about where to file something properly. That’s friction, and if you face a bit of friction every time you want to jot something down, it increases the likelihood that <em>you won’t jot it down</em> because you didn’t want to deal with the friction.</p>\n\n<p>You actually don’t need to save or name documents in TextEdit anymore. One of the best changes to MacOS in the last two decades has been <a href=\"https://support.apple.com/guide/mac-help/change-desktop-dock-settings-mchlp1119/15.0/mac\">the  persistence of open document windows</a>, including unsaved changes to existing files, and never-saved untitled document windows. Try this: open TextEdit, make a new untitled document, and type something — anything — into the new window. Next, don’t just quit TextEdit, but force quit it (⌥⌘Esc). Relaunch TextEdit, and your unsaved new document should be right where you left it, with every character you typed.</p>\n\n<p>But a big pile of unorganized RTF files on your desktop — or a big pile of unsaved document windows that remain open, in perpetuity, in TextEdit — is no way to live. You can use TextEdit like that, it <em>supports</em> being used like that, but it wasn’t <em>designed</em> to be used like that.</p>\n\n<p>Apple Notes was designed to be used like this. Open Notes, ⌘N, type whatever you want, and switch back to whatever you were doing before. There is no Save command. There are no files. And while a few dozen text files on your desktop starts to look messy, and makes individual items hard to find, you can stash <em>thousands</em> of notes in Apple Notes and they just organize themselves into a simple list, sorted, by default, by most recently modified. You can create folders and assign tags in Notes, but you don’t need to. Don’t make busy work for yourself. And with iCloud, you get fast reliable syncing of all your notes to all of your other Apple devices: iPhone, iPad, Vision Pro, <a href=\"https://support.apple.com/guide/watch/create-and-view-notes-apdc6fb0a03f/watchos\">even your Watch now</a>.</p>\n\n<p>Sometimes you just want to stick with what you’re used to. I get it. I am, very much, a creature of habit. And TextEdit is comforting for its simplicity, reliability, and unchanging consistency spanning literally decades. But there’s no question in my mind that nearly everyone using TextEdit as a personal notes system would be better served — and happier, once they adjust to the change — by switching to Apple Notes.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/26/chayka-textedit\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"41c4af4a758963f63d6f3603a6423423d9c7fddf33243b850a1e12fe2eb20aa5","category":"Tech"}