{"title":"The Ineos exodus and the attraction of Red Bull: why cycling’s best minds are all making the same move","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-ineos-exodus-and-the-attraction-of-red-bull-why-cycling-s-best-minds-are-all-making-the-same-move","date":1769510909000,"content":"\n      <p><span>It’s set to be the season when an ambitious team becomes a superteam. Red Bull-Bora-hansgrohe, backed financially by the biggest energy drinks company in the world, plan on embarking on a revolution in 2026, spearheaded by their <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-really-impressive-its-what-i-looking-for-remco-evenepoel-already-thriving-at-red-bull-bora-hansgrohe?srsltid=AfmBOooeXZ9tM457yaWTSDYq0kce1R8lca3UVNEzG3k7PH7pjby603N7&amp;tag=member\">new superstar signing Remco Evenepoel</a>. Behind the scenes they’ve also overhauled their sporting structure, shipping out old names and bringing in new figures as they attempt to rival the sport’s preeminent team, UAE Team Emirates-XRG, in every single bike race. </span><b></b></p>\n<p><span>A common denominator in their recruitment drive has been staff crossing over from Ineos Grenadiers to Red Bull. Not just one, but </span><em>five</em><span>. Zak Dempster has become chief of sports, and he’ll be responsible for the German team’s sporting division; fellow sports director Oliver Cookson has joined as head of racing; Xabier Artetxe, a former trainer at Ineos to Egan Bernal and Carlos Rodríguez, has become coach; and for the past year Red Bull’s engineering department has been headed up by Dan Bigham, who is supported by Jonny Wale.</span><b></b></p>\n<p><span>What is it about Red Bull that Ineos doesn’t have? “Excitement, ambition, direction, willingness to change,” a candid Bigham tells <em>Rouleur</em> at Red Bull’s 2026 launch. “I think this project is the most exciting thing in cycling, at least from my perspective and what I want to do. I could not say no to that as an offer. </span><b></b></p>\n<p><span>“If you spoke to Jonny and Zak you’d get different answers, but for me it was the opportunity to be involved in engineering and push things forward, and forward quickly. The amount of investment, resource and backing I’ve had is unmatched versus what I had at Ineos. It’s hard standing in front of people and saying we need to invest six figures into this and they don’t even necessarily understand why, but they say, ‘We trust you, go and do it’. I didn’t get that elsewhere but I absolutely get it here.”</span></p>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_52_1_f9ead567-57f5-4764-bb10-8bb50516e226.png?v=1769442011\" alt=\"\" /><br />Bigham won multiple national, European, world and Olympic titles on the track in his racing days. Image: Alex Whitehead/<a href=\"http://SWpix.com\"><span>SWpix.com</span></a>.</em></p>\n<p><span>For many years Bigham has been cycling’s foremost expert in aerodynamics. A former track rider himself, who won a silver medal at the 2024 Paris Olympics, and a<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/behind-the-scenes-of-dan-bighams-hour-record-part-one?srsltid=AfmBOop7C3NquEZVf2MPBQVv1q1WtEzI1A-LLI8s-hOae-NdRErqgU7W\"> one-time Hour Record holder,</a> his recruitment was seen as a coup for Red Bull. It also further represented the slow demise of Ineos. Bigham continues: “Don’t get me wrong, the pressure is high – we want to win the biggest races and we have the people who can win the biggest races. Soo it’s up to people like me that we are on the startline with the best equipment ever, the best pacing strategies and the best execution plans, because if not then I’ve done a shit job and I don’t want to do a shit job; I want to win these races and I’m fully supported to do that.”</span></p>\n<p><span>The projections of both teams are vastly different. While Ineos dominated the sport in the 2010s, winning seven Tours de France mostly under their former iteration of Team Sky, they have tailed off significantly. Dave Brailsford, their former guru, is back in charge, but few envisage Ineos claiming Grand Tour success in the forthcoming years. Red Bull-Bora-hansgrohe, meanwhile, have been on a much slower project, only now after 15 years sitting towards the very top of the sport. In Evenepoel and Florian Lipowitz, the last two riders to finish third at the <a href=\"https://www.rouleur.cc/pages/tour-de-france?srsltid=AfmBOoq_RrVPF1hD7lN0EFBuEwp8jNYhjAk-QNcJVRnpph1T64lckEXf\">Tour de France,</a> Grand Tour success should be imminent. </span></p>\n<p><span>It’s no coincidence that the German team have been poaching from the British team. “Ineos, and before as Sky, were for me always the benchmark team,” Ralph Denk, the team’s manager and founder, says. “When I entered pro cycling in 2010 it was also the first year for Team Sky. They won the Tour de France a lot of times, and a lot of other Grand Tours, and they definitely did something very good. Maybe, and this is just a feeling from my side, but there was not really a proper leadership in the last few years there, and that’s why the guys decided to move on and go and join another project. I can’t really give you the answer as to why they left Ineos, but the fact is they were considering leaving Ineos and it’s nice for us that guys of this high-quality join our project.”</span><b></b></p>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_53_1_7286ebd4-add1-41dc-80d6-96e83862822b.png?v=1769442010\" alt=\"\" /><br /></em><em><span>Dempster (left) and Denk (right) have a history going back over a decade. Image: </span>Red Bull-Bora-hansgrohe/Maximilian Fries</em></p>\n<p><span>The addition of Dempster was particularly intriguing. The Australian, who spent five years racing for Denk, began his career as a DS in 2020 aged 32, and quickly became one of Ineos’s most trusted sports directors. The 38-year-old replacing the more experienced Rolf Aldag at Red Bull came as a surprise to many observers, but Denk evidently trusts him enormously with delivering on the potential that Evenepoel and his new teammates are promising. </span><b></b></p>\n<p><span>“I’m really grateful and really enjoyed my time at Ineos – I learned a lot and I’d like to think I was able to contribute to the success of the team along the way,” Dempster says. “But it's a performance sport and I think about this project here, what they’re building, the roster, the resources, the riders… I think it’s less about an Ineos exodus and [instead] about this whole new performance team with all different ideas. We’re in a position where we can create </span><em>our</em><span> way. I think it’s testament to the strength of this project and I think it’s a really exciting team on more than just a rider level.”</span><b></b></p>\n<p><span>The message is that Ineos, a fading power, can’t compete with Red Bull, a rising star. What’s more, Ineos’s staff losses are Red Bull’s gain; as Red Bull go from strength to strength, Ineos are weakened as a result. It says a lot about Ineos’s current status within the sport: they are most definitely no longer among cycling’s most attractive teams, neither for riders nor staff. And that’s in stark contrast to before. Red Bull-Bora-hansgrohe, meanwhile, are the sport’s new powerhouse, fuelled by Ineos Grenadiers’s one-time experts. Funny how things change.</span></p>\n<p><em>Cover image: Con Chronis/Getty Images</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"42768a69d3114c9e72bcaa813f279cdfaf9dd9d2c30a294140be76709d91c3ba","category":"Cycling"}