{"title":"Saving banks from technical debt: How Atruvia built secure, self-service infrastructure","link":"https://www.hashicorp.com/blog/saving-banks-from-technical-debt-how-atruvia-built-secure-self-service-infrastructure","date":1771520400000,"content":"<p>Outdated IT systems cost financial services firms an average of <a href=\"https://www.fisglobal.com/insights/modernization-in-financial-services\">$100 million annually</a>, including $31.7 million in losses from cyber threats. For IT service providers like Atruvia — responsible for maintaining the core infrastructure behind hundreds of banks and millions of customer transactions — this reality underscores the urgency of modernization.</p>\n\n<p>Serving over 900 financial institutions in Germany, including Volksbank and Raiffeisenbank, Atruvia manages one of Europe’s largest financial IT ecosystems:</p>\n\n<ul>\n<li>  91 million accounts</li>\n<li>  9.3 billion annual transactions</li>\n<li>  26,000 self-service machines nationwide.</li>\n</ul>\n\n<p>Like many enterprises born in a pre-digital era, it faced fragmented automation, sprawling hybrid environments, and rising compliance demands. To keep delivering trusted, always-on banking services, Atruvia had to evolve from within.</p>\n\n<p>With HashiCorp’s support, the company:</p>\n\n<ul>\n<li>  Reduced cluster provisioning from 3 months to 2 hours</li>\n<li>  Cut network setup time from weeks to minutes</li>\n<li>  Standardized pipelines and configurations across hybrid environments</li>\n<li>  Established a company-wide standard for infrastructure as code (IaC)</li>\n</ul>\n\n<h2>Challenge: Manual workflows and process debt</h2>\n\n<p>After years of struggling with a fragmented tech stack, Atruvia announced a new strategic direction: Evolve from a traditional IT service provider into a digitalization partner for Germany’s cooperative banking sector.</p>\n\n<p>But Atruvia’s infrastructure had been built up over decades. While it supported mission-critical banking services, its core workflows hadn’t caught up with modern development needs.</p>\n\n<p>Key operational challenges included:</p>\n\n<ul>\n<li>  Manual provisioning and ticket-based workflows</li>\n<li>  Siloed automation tools</li>\n<li>  Scattered documentation and siloed knowledge</li>\n<li>  No unified APIs for core systems</li>\n<li>  Compliance requirements that added friction to already slow delivery cycles</li>\n</ul>\n\n<blockquote>\n<p>“We were operating with a weird stack of tooling that you fuse together, and it was still always process-oriented rather than product-oriented.” <br />— Martin Pelke, Product Owner for Infrastructure as Code, Atruvia</p>\n</blockquote>\n\n<p>And the legacy culture didn’t help: “Whoever you would talk to, they would always say it’s automated,” Pelke added. “But when you ask a development team with infrastructure needs, they'd say, ‘I don't know, it's ticket ops.’”</p>\n\n<p>With regulatory demands increasing, the cost of manual processes was measured in both developer time and growing security risks. To match its new strategy and role in Germany’s banking future, Atruvia needed a modern foundation that enabled speed and scale without compromising compliance.</p>\n\n<h2>Solution: A platform mindset</h2>\n\n<p>Atruvia’s first priority was provisioning. The team needed to update their manual processes and ticket-based system to an automated, product-based workflow. Having worked with HashiCorp on smaller projects, Atruvia was eager to expand its partnership with them, starting with Terraform.</p>\n\n<p>As Pelke explained:</p>\n\n<blockquote>\n<p>“We wanted a single source of truth and a descriptive view of everything we run everywhere. That’s what led us to Terraform.”</p>\n</blockquote>\n\n<p>This move helped Atruvia pivot from reactive support to proactive enablement with platform-as-a-product thinking — made possible with IaC templates and automation.</p>\n\n<p>They focused on the public cloud first, where APIs and standardization made automation easier. From there, they expanded to other environments, using:</p>\n\n<ul>\n<li>  <strong>Terraform Enterprise</strong> for GitOps workflows and reusable IaC modules</li>\n<li>  <strong>GitLab pipelines</strong> for version-controlled, automated delivery</li>\n<li>  <strong><a href=\"https://www.hashicorp.com/en/blog/terraform-without-writing-code-how-to-build-self-service-with-no-code-modules\">Self-service patterns</a></strong> to empower developers</li>\n</ul>\n\n<p>This new model enabled application teams to spin up environments quickly and securely.</p>\n\n<blockquote>\n<p>“That’s where we can really shine: Standardized environments that make life easier for our app teams.”<br />— Martin Pelke, Product Owner for Infrastructure as Code, Atruvia</p>\n</blockquote>\n\n<h3>Integrating security</h3>\n\n<p>Infrastructure speed meant little without strong security. So, the team turned its attention to Vault, HashiCorp’s security solution.</p>\n\n<p>With Vault, Atruvia was able to:</p>\n\n<ul>\n<li>  Centralize secrets management</li>\n<li>  Enable secure injection into CI/CD pipelines</li>\n<li>  Lay the groundwork for <a href=\"https://www.hashicorp.com/en/blog/why-we-need-dynamic-secrets\">dynamic secrets</a> and namespace provisioning</li>\n</ul>\n\n<p>Though operated by a separate team, Vault integrated tightly into the Terraform workflows, allowing Atruvia to move fast without compromising security compliance.</p>\n\n<p>By embedding Vault into their CI/CD pipelines, Atruvia improved visibility and created a reusable, scalable security foundation. Teams no longer had to manage secrets with their own bespoke processes. Instead, they tapped into a centralized platform that enforced best practices by default.</p>\n\n<h3>Selling the platform to internal teams</h3>\n\n<p>A great solution means nothing if your teams won’t use it. To <a href=\"https://www.hashicorp.com/en/blog/5-steps-to-set-up-vault-for-widespread-adoption-at-your-org\">drive adoption</a>, Atruvia didn’t issue top-down mandates. Instead, Pelke and Lukas Essig, a Platform Engineer at Atruvia, built and demonstrated successful patterns.</p>\n\n<blockquote>\n<p>“We showed and didn’t tell. We created a GitOps onboarding pattern, and more teams adopted it because it worked.”<br />— Lukas Essig, Platform Engineer, Atruvia</p>\n</blockquote>\n\n<p>They also invested in enablement:</p>\n\n<ul>\n<li>  Two consultants were trained to guide teams step-by-step</li>\n<li>  Live sessions replaced long documents</li>\n</ul>\n\n<p>This taught teams how to build and deploy infrastructure “the Atruvia way.”</p>\n\n<h2>The ROI of automation</h2>\n\n<p>Atruvia’s transformation streamlined operations and redefined how the organization builds, delivers, and secures infrastructure at scale. By shifting to IaC and standardizing workflows through Terraform and Vault, the team unlocked substantial gains:</p>\n\n<ul>\n<li>  Provisioning time dropped from 3 months to 2 hours</li>\n<li>  Network configuration setup took 15 minutes instead of weeks</li>\n<li>  New clusters deployed in hours, not weeks</li>\n<li>  IaC ended formerly fragmented processes and helped to initiate a cultural shift</li>\n<li>  Developers gained fast, compliant self-service capabilities</li>\n<li>  Audit trails and policy checks are built into every deployment</li>\n</ul>\n\n<p>“We rebuilt an entire cloud-native network segment in an hour — including troubleshooting. Without Terraform, that would’ve taken weeks.”<br />\n— Martin Pelke, Product Owner for Infrastructure as Code, Atruvia</p>\n\n<h2>Roadmapping resilience</h2>\n\n<p>With a scalable, compliant automation foundation in place, Atruvia is continuing to evolve its platform strategy.</p>\n\n<p>Looking ahead, the team is focusing on</p>\n\n<ul>\n<li>  Deeper GitLab and Vault integration for <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/dynamic-provider-credentials/vault-backed\">just-in-time secrets injection</a></li>\n<li>  Scaling <a href=\"https://www.hashicorp.com/en/blog/policy-as-code-explained\">policy as code</a> to enforce compliance across all platforms</li>\n<li>  Standardizing internal APIs for product-like infrastructure delivery</li>\n</ul>\n\n<p>Terraform and Vault are now embedded in the company’s strategic roadmap, enabling speed, security, and innovation. For Atruvia, that means more than modernization. It means delivering the digital future of banking, one secure deployment at a time.</p>\n\n<p><strong>You can read the full story on our Case Studies library (no registration):</strong></p>\n","author":"Maile Chaffin-Quiray","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"44858c4f5d126083be19558fb7a89940b226d67c5eaf8524ecab323d682f0bf7","category":"Tech"}