{"title":"Comparing the Classic and Unified Views in iOS 26’s Phone App","link":"https://tidbits.com/2025/11/10/comparing-the-classic-and-unified-views-in-ios-26s-phone-app/","date":1769645430000,"content":"\n<p>Adam Engst, back in November, at TidBITS:</p>\n\n<blockquote>\n  <p>Did you know that, regardless of view, you can now swipe left on\nany call to reveal a blue clock icon that lets you create a\nreminder to call back in 1 hour, tonight, tomorrow, or at any\ncustom time (below left, slightly doctored)? Reminders appear at\nthe top of the Calls list and in your default Reminders list. You\ncan also touch and hold a call associated with a contact to\nconnect with them in other ways (below right), or touch and hold a\ncall from an unknown caller to add them to Contacts.</p>\n</blockquote>\n\n<p>I did not know this, until I read Engst’s article.</p>\n\n<p>One criticism I’ve seen a few times (but to be clear, not from Engst) ever since Apple debuted the new Unified interface for the Phone app back at WWDC, is that it’s somehow wrong that Apple offers it as an option alongside the Classic interface. “<em>When does Apple ever offer options like this?</em>”</p>\n\n<p>I’d argue that Apple <em>used</em> to offer options like this all the time. The Music app on the original iPhone (which app was actually named “iPod” for a while) let you customize all the tabs at the bottom. All of Apple’s good Mac apps (the AppKit ones, primarily) still let you <a href=\"https://support.apple.com/guide/mac-help/customize-toolbars-mchlb294260e/mac\">customize the entire toolbar</a>. The problem isn’t that Apple now offers two very different interfaces for the Phone app. The problem is that Apple stopped offering users ways to significantly tailor apps to their own needs and tastes — and the proof that they stopped is that so many people now think it’s so strange that they’re offering two options for how the Phone app should look and work.</p>\n\n<p>Overall, I like the new Unified layout in the Phone app. But what I love is there remains an option for those who don’t, and that you can switch between the two in a very obvious, easily discoverable (dare I say, hard to miss) way right in the app itself. No need to dig two or three levels deep into the Settings app. You can just switch right there in the main screen of the Phone app itself. It’s things like this that keep me <a href=\"https://bsky.app/profile/sdw.bsky.social/post/3mdjaglq52c2m\">optimistic</a> that Apple is still capable of great <em>new</em> work in UI design.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/28/comparing-the-classic-and-unified-views-in-ios-26s-phone-app\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4560fa5b59243d87346a608fbd3c2e3668c79925b2d88b18e2834a238c4a1184","category":"Tech"}