{"title":"Wunderkind Albert Philipsen can do it all but preaches patience: ‘I don’t think about what everyone else wants me to be’","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/wunderkind-albert-philipsen-has-the-world-at-his-feet-but-preaches-patience-i-don-t-think-about-what-everyone-else-wants-me-to-be","date":1771318802000,"content":"\n      <p><span>Compile a list of cycling’s next superstars and Albert Philipsen is an inevitable, unavoidable inclusion. A multidisciplinarian, he can climb, time trial and defend a lead – hallmarks of a GC rider – and ride the crosswinds, tame the cobbles and sprint – prerequisites of a <a href=\"https://www.rouleur.cc/products/issue-126-classics?srsltid=AfmBOorfzuqIrrQZx92UF0kq9B3tdDXEFBHuXxpPDFoaf7QyU6AdVnts\">Classics</a> rider. He’s seemingly got it all, the entire cycling world at his feet, at a luxury to pick and choose how and where he wants to dominate. </span><b></b></p>\n<p><span>He’s also in absolutely no hurry whatsoever. “I would prefer to show it in races rather than speak about it in an interview,” the 19-year-old says of his ambitions. “I don’t really have a rush with anything. Maybe I’ll get a big result this year, maybe it will take three more years. I just need time. I definitely hope to be one of these big names in the future. Maybe it’s in two years, maybe in five. I think I need to have a bit of patience, not to rush anything and see how my development goes.”</span><b></b></p>\n<p><span>Outside and inside<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/not-a-lot-of-teams-will-ever-do-this-lidl-trek-s-giro-greatness-the-inside-story\" target=\"_blank\"> Lidl-Trek</a> – the team who won an intense budding war for then-school-age teenager’s signature – there is great excitement about the Dane. Though the sport is still in the midst of the Tadej Pogačar era and may be for some time yet, attention is turning to his likely successor(s). <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/resilience-drive-and-passion-isaac-del-toro-is-cycling-s-next-superstar?srsltid=AfmBOoo4D3Rjx9vVlpMqCv4r4l2QlSaR-6Zg7hecVrLrhYNo7qPwCaLk\">Isaac Del Toro</a> (22), Jarno Widar (20), Paul Seixas (19), and Philipsen (19) are cited as his probable heir(s). The chatter and expectation all comes so naturally to the modest, humble Philipsen. “From quite a young age I’ve been putting a lot of pressure on myself so having the pressure from the outside was not a big surprise to me,” he says. “I think quite quickly I got used to it happening. It’s a bit weird in some way, but we are all still humans, and I’m still the person that I was before anybody knew my name.”</span><span><br /></span><em><br /></em></p>\n<div><img alt=\"\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_50_1_c5a7c50e-7077-470e-91eb-c3ab8b33bd88_1024x1024.png?v=1769443068\" /></div>\n<p><em>Philipsen won the junior world title on the road in Glasgow in 2023 aged just 16. (Image: Pauline Ballet/<span>SWpix.com)</span></em><span></span></p>\n<p><span>Growing up on the outskirts of the Danish capital Copenhagen, Philipsen began riding a mountain bike aged five. A decade later – only four years ago – he got his first road bike. “I didn’t think I was going to do so much on the road as I was just doing it for training,” he says. He was wrong: he was going to do </span><em>a lot</em><span><em> </em>on the road. As a first-year junior he won a handful of national races, and then the Junior World Championships at the age of 16 – there has never been a younger winner. At the same time he was national champion in four different disciplines, he also became world champion in mountain biking, and European time trial champion. The young man was the hottest property in the sport. </span><b></b></p>\n<p><span>He credits his superiority to Denmark’s depth of cycling talent. “There are so many fast riders in Denmark that we develop each other,” he says. “The level is so high from such a young age that the competition is pretty crazy. That pushes everybody to get better and then you’ll always be a little bit in front of everyone else.”</span><b></b></p>\n<p><span>Philipsen’s first love was MTB, but success on the road changed his focus. “It was when I won the junior Worlds that I decided I wanted to focus more on the road. Now it’s the main discipline for me and it’s where I want to be the best rider.” But that’s not to say he’ll abandon the discipline of flat bars and wider tyres. “I have a dream of going to the Olympics on the mountain bike in 2028 so with the team we’re trying to make a timeline that goes until then with the two disciplines,” he says.</span></p>\n<p><span>As a child he was less fixated </span><span>on the <a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\" target=\"_blank\">Paris-Roubaix</a>, and more obsessed by steep drops and tight forests. Nino Schurter, the </span>17<span>-time mountain bike world champion, is singled out as his idol. “He was the biggest, probably best rider there has probably ever been in my opinion,” Philipsen says. But the young Dane was attentive to events on the road, inspired by the riders he’s now competing against. “Of course I also looked up to some current riders: Mathieu [van der Poel], Pogi, and others like this, and it’s definitely something I strive to be in the future.”</span><b></b></p>\n<p> </p>\n<p><span>At the end of the 2025 season, and six months after he won the U23 Paris-Roubaix, Philipsen won the sprint for second at the Tre Valli Varesine hilly one-day race in Italy. Only Pogačar</span><span> </span><span>was ahead of him. “It was a super nice confidence boost and definitely something I can carry into next year,” he says. “It will be super good for my racing to have achieved these goals and to have ridden these finals, but I don’t think it makes a huge difference to the pressure.”</span><b></b></p>\n<p><span>The reality is probably somewhat different: the sport has now seen that Philipsen, just weeks after turning 19, could compete with the world’s best. He’ll soon be duelling it out regularly with more of the current and future stars. “It makes cycling a lot more enjoyable to watch when you have these big rivalries,” he says, “and it’s for sure something I’d like to give back to the sport in the future. Also watching as a kid it was super nice to see some of these battles and it’d be really cool to be able to create them myself.”</span><b></b></p>\n<div><img alt=\"\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_49_1_db5d5ab1-9ee9-4da9-951f-358ce100d64e_1024x1024.png?v=1769443068\" /></div>\n<p><span><em>Philipsen's focus in the early part of the 2026 season will be on the cobbled Classics. Image: Lidl-Trek.</em><br /><br /></span><b></b><span>Where and how exactly is the question and the doubt. Philipsen could go in any direction he wants, and it appears so far that he’s choosing the one-day route. But the decision remains fluid, open to change. “I don’t really want to specify which kind of rider I am,” he says. “I really enjoy just being able to do everything: to do a bit of the Classics, some of the climbing races, cobbled Classics, gravel races. I think it’s more interesting and it’s good for my development riding all these different kinds of terrain. So far I like the kind of rider I am – an all-rounder – and in the future I can specify a bit more.”</span><b></b></p>\n<p><span>At 184cm (6ft) and sporting wide shoulders, he’s got the stature to excel in the northern European Classics, in the same way his compatriot and teammate Mads Pedersen has. “I think he’s a good example of what it could be nice to be in the future,” Philipsen says, perhaps presciently. “He’s one of the best Classics riders in the peloton. It’s unlimited how many things I can learn from him.” </span></p>\n<p><span>This spring he's set to be given a Classics schedule, making his bow at Opening Weekend and then heading to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\" target=\"_blank\">Strade Bianche</a>, the race he “enjoys the most”. But don’t rule Philipsen out of competing for top honours in stage racing. “Maybe I will develop in that direction in a few years,” he says of Grand Tour racing. “Or maybe I’ll become a full Classics rider and only want to do those hard, flat cobbled races. I’ll see.”</span></p>\n<p><span>He will and we will, too. Cycling is just getting familiar to Albert Philipsen, and so much more is promised. But the grounded, mature, reserved and quietly-spoken young man wants to remind everyone that even if everyone else is eager to see him fulfil his potential as soon as possible, he’s happier taking a more measured approach. Time, he preaches, is on his side. “I’m not really stressing about anything. I have a lot of time,\" he insists, again. \"It was only my first year and hopefully I have a long career ahead of me so I see no reason to rush anything or try to make any fast decisions. I’ll just take it how it comes. I just try to be myself and not think so much about what everyone else wants me to be, but more what I want to be myself.”</span></p>\n<p><em>Cover image: Lidl-Trek</em></p>\n\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"45bbd712b04b03b08d8ec1d0a2084375ac3501a70798743a2cea5abdb2fdf2c5","category":"Cycling"}