{"title":"Apple Invites Media to Special ‘Experience’ in New York, London, and Shanghai on March 4","link":"https://www.macrumors.com/2026/02/16/apple-announces-special-event-in-new-york/","date":1771373325000,"content":"\n<p>Hartley Charlton, MacRumors:</p>\n\n<blockquote>\n  <p>Apple invited select members of the media to the event in three\nmajor cities around the world. It is simply described as a\n“special Apple Experience,” and there is no further information\nabout what it may entail. The invitation features a 3D Apple logo\ndesign composed of yellow, green, and blue discs.</p>\n\n<p>It is notable that Apple is specifically using the word\n“experience,” rather than “event.” Unlike a full live-streamed\nevent from Apple Park, the March 4 event in other cities is likely\nto be smaller in scale.</p>\n</blockquote>\n\n<p>Among the products expected soon — either by annual schedule predictability, or via the rumor mill — are the iPhone 17e, an updated iPad Air (going from the M3 to M4), an updated base-model iPad (going from A16 to A18), updated MacBook Pros with the M5 Pro and Max, updated MacBook Airs (going from M4 to M5 — the M4 models were <a href=\"https://www.apple.com/newsroom/2025/03/apple-introduces-the-new-macbook-air-with-the-m4-chip-and-a-sky-blue-color/\">released in early March last year</a>), and, <a href=\"https://www.bloomberg.com/news/newsletters/2026-02-15/tesla-carplay-delays-related-to-ios-26-and-fsd-apple-s-new-siri-delays-ios-27\">per Gurman</a>, the long-rumored new lower-cost MacBook with an A18 chip (a “MacBook e”, if you will, although I certainly don’t think that will be the name — my guess is Apple will just call it “MacBook” without an adjective).</p>\n\n<p>What strikes me is that March 4 — the “experience” day — is a Wednesday. So my spitball guess is that they announce all these products via Newsroom press releases, day-by-day. Like, say, the iPhone 17e on Monday, new iPad(s) on Tuesday, and new MacBooks on Wednesday. And then the “experience” will be a hands-on thing with in-person demos. Spread the announcements out across a few days, but then have in-person events for members of the media to get a hands-on experience with all of them, station-by-station, without needing to produce an Apple Event keynote film.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/17/apple-special-experience-march-4\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"472577d999eb0c37852396672e8d84493c70dd01e216a6d9e174ad311d555ee2","category":"Tech"}