{"title":"Tim Cook Wrote a Memo on the ‘Events in Minneapolis’","link":"https://www.macrumors.com/2026/01/27/tim-cook-responds-after-minneapolis-shootings/","date":1769627621000,"content":"\n<p>Tim Cook, in a company-wide memo (first published by <a href=\"https://www.bloomberg.com/news/articles/2026-01-28/apple-s-cook-calls-for-deescalation-after-latest-ice-shooting\">Mark Gurman</a>):</p>\n\n<blockquote>\n  <p>Team, <br />\nI’m heartbroken by the events in Minneapolis, and my prayers and\ndeepest sympathies are with the families, with the communities,\nand with everyone that’s been affected.</p>\n\n<p>This is a time for deescalation. I believe America is strongest\nwhen we live up to our highest ideals, when we treat everyone with\ndignity and respect no matter who they are or where they’re from,\nand when we embrace our shared humanity. This is something Apple\nhas always advocated for. I had a good conversation with the\npresident this week where I shared my views, and I appreciate his\nopenness to engaging on issues that matter to us all.</p>\n\n<p>I know this is very emotional and challenging for so many. I am\nproud of how deeply our teams care about the world beyond our\nwalls. That empathy is one of Apple’s greatest strengths and it is\nsomething I believe we all cherish.</p>\n\n<p>Thank you for all that you do. <br />\nTim</p>\n</blockquote>\n\n<p>“Events” is doing a lot of work there, to describe what has happened and is happening in Minneapolis.</p>\n\n<p>Trump’s “openness” on this particular “issue” has been to <a href=\"https://www.theatlantic.com/politics/2026/01/greg-bovino-demoted-minneapolis-border-patrol/685770/\">replace Greg Bovino</a> — the <a href=\"https://www.thetimes.com/us/american-politics/article/gregory-bovino-coat-border-patrol-j29xxmzmj\">diminutive Himmler-cosplaying</a> “commander at large” of Border Control, who insisted, adamantly, <a href=\"https://www.politico.com/news/2026/01/25/bovino-border-patrol-agents-minneapolis-victims-00745702\">that the real victims in Alex Pretti’s murder were the Border Patrol agents</a> who shot him — <a href=\"https://www.bbc.com/news/articles/cjw1pn4lwjqo\">with “border czar” Tom Homan</a>, a man who took a <a href=\"https://www.ms.now/news/tom-homan-cash-contracts-trump-doj-investigation-rcna232568\">$50,000 cash bribe from undercover FBI agents</a> in exchange for a promise to award them government contracts if Trump were reelected.</p>\n\n<p><a href=\"https://x.com/apollozac/status/2016346258772770826\">Zac Hall, on Twitter/X</a>:</p>\n\n<blockquote>\n  <p>Cook took three days to not name Alex Pretti in his not public\nstatement and 20 days to not name Renée Good in his not public\nstatement. [...]</p>\n\n<p><a href=\"https://www.apple.com/speaking-up-on-racism/\">2020 Tim Cook on Apple’s homepage</a>: “Right now, there is a\npain deeply etched in the soul of our nation and in the hearts of\nmillions. To stand together, we must stand up for one another, and\nrecognize the fear, hurt, and outrage rightly provoked by the\nsenseless killing of George Floyd and a much longer history of\nracism.”</p>\n</blockquote>\n\n<p>Quite the different message (and medium — this time with nothing on Apple’s website, let alone their homepage) from 2020, for what I consider far more outrageous and alarming killings.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/28/tim-cook-memo\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4a863d8d7e5b8122850c564b7ca5b52fdd76e569296d5d3cf54953a95f0570f7","category":"Tech"}