{"title":"Federico Viticci on Clawdbot","link":"https://www.macstories.net/stories/clawdbot-showed-me-what-the-future-of-personal-ai-assistants-looks-like/","date":1769450317000,"content":"\n<p>Federico Viticci, writing at MacStories:</p>\n\n<blockquote>\n  <p>If this intro just gave you whiplash, imagine my reaction when I\nfirst started playing around with <a href=\"https://clawd.bot/\">Clawdbot</a>, the incredible\n<a href=\"https://github.com/clawdbot/clawdbot\">open-source project</a> by <a href=\"https://steipete.me/\">Peter Steinberger</a> (a name\nthat should be <a href=\"https://www.macstories.net/linked/ios-10-3-beta-re-introduces-warning-for-old-32-bit-apps-suggests-future-incompatibility/\">familiar to longtime MacStories readers</a>)\nthat’s become <em>very</em> popular in certain AI communities over the\npast few weeks. I kept seeing Clawdbot being mentioned by people I\nfollow; eventually, I gave in to peer pressure, followed the\ninstructions provided by the funny crustacean mascot on the app’s\n<a href=\"https://docs.clawd.bot/start/getting-started\">website</a>, installed Clawdbot on my new M4 Mac mini (which\nis not my main production machine), and <a href=\"https://docs.clawd.bot/channels/telegram\">connected it to\nTelegram</a>.</p>\n\n<p>To say that Clawdbot has fundamentally altered my perspective of\nwhat it means to have an intelligent, personal AI assistant in\n2026 would be an understatement. I’ve been playing around with\nClawdbot so much, I’ve burned through 180 million tokens on the\nAnthropic API ( <em>yikes</em> ), and I’ve had fewer and fewer\nconversations with the “regular” Claude and ChatGPT apps in the\nprocess. Don’t get me wrong: Clawdbot is a nerdy project, a\ntinkerer’s laboratory that is not poised to overtake the\npopularity of consumer LLMs any time soon. Still, Clawdbot points\nat a fascinating future for digital assistants, and it’s exactly\nthe kind of bleeding-edge project that MacStories readers will\nappreciate.</p>\n\n<p>Clawdbot can be overwhelming at first, so I’ll try my best to\nexplain what it is and why it’s so exciting and fun to play\naround with.</p>\n</blockquote>\n\n<p>Overwhelming indeed. Clawdbot is undeniably impressive, and <a href=\"https://x.com/steipete/status/2015828441342292139\">interest in it is skyrocketing</a>. But because of its complexity and scope, it’s one of those things where all the excitement is being registered by people who already understand it. This essay from Viticci is the first thing I’ve seen that really helped me <em>start</em> to understand it.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/26/viticci-on-clawdbot\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"4abf54e0b75283fe65bc6f3ca42c0c11288667d1cd5171fc95e89938626c6cc6","category":"Tech"}