{"title":"‘The climbs are always a shock’ - Early season summit finishes and the changing landscape of the cycling calendar","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-climbs-are-always-a-shock-early-season-summit-finishes-and-the-changing-landscape-of-the-cycling-calendar","date":1769779876000,"content":"\n      <p><span>The cycling season follows a familiar routine — the early stage races in Australia, southern Europe and the Middle East kick things off, before the Classics, the transition to the summer of Grand Tours and culminating in the Italian one-days and the World Championships, with a sprinkling of other stage races here and there. But the </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/reform-versus-tradition-should-cycling-s-grand-tour-calendar-be-changed?tag=member\"><span>racing calendar has evolved and continues to do so</span></a><span>. One of the more notable changes of the last decade is the rise in the number of summit finishes in January and February. In the past, when the sport almost exclusively took place in Europe, we had to wait until March for some serious climbing at the races like </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice\"><span>Paris-Nice</span></a><span> and </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\"><span>Tirreno-Adriatico</span></a><span> — partly enforced by climate and the inaccessibility of the alpine passes so early in the year, and also the tradition of the cycling calendar.</span></p>\n<p><span>Nowadays, the stage races in Algarve, Andalusia and Valencia all feature tough early-season ascents, and these Iberian climbing tests are interspersed by summit finishes in the deserts of the Middle East in Saudi Arabia, Oman and the United Arab Emirates. </span></p>\n<p><span>“I think these climbs are always a shock,” the American, Kevin Vermaerke (UAE Team Emirates-XRG) told </span><span><em>Rouleur</em> </span><span>at the AlUla Tour, which featured its first summit finish on stage three’s 6% slopes to Bir Jaydah Mountain Wirkah, won by Yannis Voisard (Tudor Pro Cycling).</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20260129ALT1065_A_S_O_-Tony_Esnault_jpg_1024x1024.jpg?v=1769779377\" alt=\"\" /></div>\n<p><span></span><em>Yannis Voisard (Tudor Pro Cycling) wins stage three of the 2026 AlUla Tour to Bir Jaydah Mountain Wirkah (Image: ASO / Tony Esnault)</em></p>\n<p><span>Vermaerke explained: “I think these Middle Eastern races are very unique because all the training we do over the winter is kind of targeted for the European races. It's a completely different atmosphere here — on stage three I literally had burned around 800 calories by the bottom of the last climb, and had averaged about 120 watts. It was like a recovery ride, and then suddenly it's a 10 minute explosive effort.”</span></p>\n<p><span>For the 25-year-old this style of racing is where the desert races differ from the other early season races.</span></p>\n<p><span>“When you go back to Europe, for example, at Algarve or Andalusia, it’s 300 watt average all day and it’s more of a fatigue resistance effort. It's really different styles of effort and I think that's why sometimes you see the results look a little bit different when you get back to Europe.</span></p>\n<p><span>“It's a good race to kind of open the season at. Those explosive efforts, they help you later on. So, it's good to get them in the legs.” </span></p>\n<p><span>Vermaerke was a little disappointed with how he performed on the Wirkah climb, but Saturday’s final stage to the Skyviews of Harrat Uwayrid might play out differently, with gradients consistently above 9% and a pitch at over 20%.</span></p>\n<p><span>The winner of stage three and current GC leader, Voisard believes so, telling </span><span>Rouleur</span><span>: “It will be totally different to stage three. It's much steeper. On Wirkah it was quite tactical and the last stage might also be the same because after the steep climb, there is 8 km which is totally flat.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_12_1024x1024.png?v=1769779750\" alt=\"\" /></div>\n<p><span></span><em>The peloton rolls past the local wildlife at the AlUla Tour (Image: ASO / Charly Lopez)</em></p>\n<p><span>The introduction of the Wirkah and Skyviews climbs have changed the personnel who take on the race in Saudi Arabia.</span></p>\n<p><span>“I think it's a completely different race than it was when I won it. It's my only GC result, it was maybe like a once in a lifetime thing to win a GC for me as a sprinter,” said the winner of 2020 edition, Phil Bauhaus (Bahrain-Victorious), who despite being versatile, is definitely more of a sprinter than climber. </span></p>\n<p><span>Other sprinters like </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/excited-motivated-calm-and-on-the-scoreboard-jonathan-milan-and-the-sprinter-s-need-for-an-early-win?tag=member\"><span>Jonathan Milan (Lidl-Trek) can enjoy some early season success at the race</span></a><span> and while the introduction of summit finishes have ended his and Bauhaus’s chances of GC victory, they have opened the doors for others.</span></p>\n<p><span>“It's more opportunities for a rider like me. The climbs are the only place I can get a result,” said Paul Double (Jayco-AlUla), </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/it-all-feels-a-bit-surreal-paul-double-s-extraordinary-rags-to-riches-journey-to-the-worldtour?srsltid=AfmBOor2qJ_7gjEQwoW0RQDDQLnC-q6Qj1E9ToD-HLtuTWcEV-gotyNh\"><span>the strong climber from Winchester, competing in the WorldTour for his second season</span></a><span>. </span></p>\n<p><span>The AlUla Tour is not alone in introducing harder finishes — The UAE Tour in a few weeks’ time will unveil the Jebel Mobrah summit finish, which is around 15km long, the first part averaging 7%, followed by 6 km at an average gradient of 12% and maxing out at 17%. The stage three </span><span>parcours</span><span> will be the hardest summit finish in a WorldTour race before the </span><a href=\"https://www.rouleur.cc/pages/giro-ditalia\"><span>Giro d’Italia</span></a><span> reaches the climbs of Blockhaus and the Passo Giau.</span></p>\n<p><span>January and February used to be the time where climbers focused on training and even remained in a form of hibernation before their big Grand Tour goals, but more and more these months can offer the chance for early success and to get the ball rolling for the season ahead. </span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4ad45c99a1da4dfe3e6aedf5772b45d2b0c843ce23bf4789111a06117e02babd","category":"Cycling"}