{"title":"MEET THE MAKER: ERIC HINDES","link":"https://moots.com/blogs/news/meet-the-maker-eric-hindes","date":1765833513000,"content":"\n      <p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-12-15_at_1.54.37_PM.jpg?v=1765833235\" alt=\"\" width=\"524\" height=\"627\" /></p>\n<p><strong>25 Years of Craft, Curiosity, and Getting It Right</strong></p>\n<p>Some people find their way to bike building through formal paths. Others through obsession. For Eric Hindes, it started at home and it stuck.</p>\n<p>Eric has been part of the Moots team for 25 years. Today, he programs and runs multiple CNC machines, helps shape how we manufacture frames and components in-house, and carries decades of institutional knowledge across the production floor. But like many great bike builders, his story starts long before his first day at Moots.</p>\n<h3>A Family Affair and a Pile of Magazines</h3>\n<p>Eric’s entry into bikes came courtesy of his dad. Mountain biking was new, exciting, and everywhere in the pages of <em>Fat Tire Flyer</em>, <em>Mountain Bike</em>, <em>Dirt Rag</em>, and <em>Bike</em>. Those magazines introduced Eric (and his family) to the early pioneers of the sport: Charlie Cunningham, Joe Breeze, Kent Eriksen and sparked something deeper than riding.</p>\n<p>That curiosity led to building bikes. Building bikes led to becoming an “annoying shop rat.” And that, eventually, led to working in bike shops and for a local frame builder. Moots came next and the rest is a quarter-century of titanium history.</p>\n<h3>What Riders Might Not Realize</h3>\n<p>There’s a perception that building bikes, especially titanium bikes, is all sparks and welds. Eric is quick to point out that the real work often happens quietly, methodically, and obsessively.</p>\n<p>Titanium demands cleanliness and precision. Once a Moots frame has gone through reaming, facing, and hand finishing, it’s essentially done. No paint. No heat treatment. No residue to clean out. No mold artifacts. What you see is the structure itself: pure, honest, ride-ready titanium.</p>\n<h3>The Challenge and the Reward</h3>\n<p>Like any craft, framebuilding has its hard moments. But the most satisfying part? Knowing the job was done right.</p>\n<p>Eric came up during a time when the Finish Department was just him and Caleb. They forced themselves to slow down when needed, to redo work when it wasn’t perfect, and to always think about the rider on the other end someone who had invested serious time, money, and trust into choosing a Moots.</p>\n<p>“Don’t let them down,” he says. That mindset hasn’t changed.</p>\n<h3>How the Craft Has Evolved</h3>\n<p>When Eric started, much of his week was spent bead blasting frames. At the time, Moots had a single CNC machine and it wasn’t even set up.</p>\n<p>Today, the shop runs four CNCs that Eric programs and operates, producing everything from frame parts to stems, seatposts, and fixtures. Nearly everything you see on the production floor is made in-house. (And yes, he admits he occasionally bribes Bryce and Richard to help with bead blasting.)</p>\n<p>The tools have evolved. The standards have gone up. The expectation to do it right has remained exactly the same.</p>\n<h3>“No Compromises,” Minus the Bumper Sticker</h3>\n<p>Ask Eric what “No Compromises” means, and you’ll get a laugh before a real answer.</p>\n<p>It’s not about slogans. It’s about doing things the right way even when it’s slower, harder, or less convenient. It’s about respecting the rider who chose a Moots and making sure every decision honors that commitment.</p>\n<h3>The Bikes and the Moments That Matter</h3>\n<p>Eric currently rides a Womble, a Routt 45, and a Forager. He’s helped build bikes for legendary cyclists like Andy Hampsten and Ruthie Matthes, and even athletes outside the sport, like Reggie Miller.</p>\n<p>But the moments that stick most don’t involve famous names.</p>\n<p>They happen at Ranch Rally. On group rides. In conversations with riders who are genuinely stoked about their bikes: how they ride, how they feel, and where they’ve taken them.</p>\n<p>That’s the payoff.</p>\n<h3>Life Beyond the Shop</h3>\n<p>After work, Eric’s ideal recovery involves standing in a cold river with a fly rod. Reality often looks like picking up his kid, running errands, or making sure the “crazy dog” gets some exercise.</p>\n<p>His coffee routine is simple: Moccamaster in the morning, and he’s set. Though when the mood strikes, he won’t say no to a vanilla oat-milk latte...even if it costs nine bucks.</p>\n<p>The shop soundtrack? A mix that includes Dag Nasty, Spoon, Dinosaur Jr., Wire, and Archers of Loaf.</p>\n<h3>Dream Rides</h3>\n<p>If Eric could take a Moots anywhere, the list is long: bikepacking and fly fishing in Japan, an overnighter with the family, or a “dumb” fat-bike adventure in Alaska.</p>\n<p>Wherever it is, the bike will be built the same way with intention, care, and zero compromises.</p>\n<p> </p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"4b9462f72101e31b3c4d2e4403f07620dbf9a3981a9de44dbe48be3e699f7637","category":"Cycling"}