{"title":"0256 | คำถามที่โดนถามบ่อยกับรถยนต์ไฟฟ้า","link":"https://www.icez.net/blog/167526/0256-ev-frequency-asked-question","date":1672051456000,"content":"<p>คุยกะคนโน้นคนนี้แล้วก็เจอคำถามที่ถูกถามบ่อยๆ ได้ตามนี้ครับ</p>\n<h2>ชาร์จกี่ชั่วโมงถึงเต็ม</h2>\n<ul>\n<li>ใช้ไปเท่าไหร่ก็ชาร์จเพิ่มเท่านั้น ไม่ต้องสนใจเวลาชาร์จจาก 0 – 100% ของรถ (ยกเว้นตอนขับทางไกล)</li>\n<li>เช่น ขับไป 100km เฉลี่ยกินไฟประมาณ 20kWh ก็ชาร์จเพิ่มแค่ 20kWh</li>\n<li>ถ้าใช้ wall charge 7kW ก็ประมาณ 3 ชั่วโมง (20 kWh / 7 kW = ~ 3 h) หรือถ้าใช้ travel adapter เสียบปลั๊กชาร์จมันจะได้ราวๆ 2-3kW ก็ 7-10 ชั่วโมง</li>\n<li><strong>แต่ !!!</strong> เวลาชาร์จแบบนี้ เราไม่ต้องรอ เพราะมันคือการเสียบชาร์จตอนเราเข้าบ้านไปนอน…</li>\n<li>ถ้าคุณนอนวันละ 6 ชั่วโมง รวมเวลาอาบน้ำแต่งตัวก่อนนอน กับหลังตื่นก็น่าจะมีเวลาให้ชาร์จ 7-8 ชั่วโมง ก็น่าจะพอให้ชาร์จได้เต็มอยู่แล้ว</li>\n</ul>\n<h2>อยู่คอนโดทำไง</h2>\n<ul>\n<li>ระหว่างนี้หาที่ชาร์จใกล้ๆ คอนโดก่อนครับ</li>\n<li>ผลักดันให้คอนโดติดที่ชาร์จ แนะนำให้ติด AC charge เยอะๆ ดีกว่า เพราะค่าที่ชาร์จ DC จุดเดียว อาจจะแพงมากจนติด AC ได้เป็นสิบๆ จุด</li>\n<li>ถ้าเป็น AC คนก็จอดชาร์จเหมือนอยู่บ้านตามปกติได้เลย ไม่ต้องมาขยับรถ</li>\n</ul>\n<h2>หาที่ชาร์จยังไง</h2>\n<ul>\n<li><a href=\"https://www.plugshare.com\">https://www.plugshare.com</a> เว็บเดียวจบครับ</li>\n<li>มีเว็บ <a href=\"https://www.chargeloma.com\">https://www.chargeloma.com</a> อีกอัน แต่ในมือถือ (ipad) แอพมันรวนๆ</li>\n<li>แต่พอไปใช้จริง ก็ต้องโหลดแอพของผู้ให้บริการชาร์จแต่ละเจ้ามาอยู่ดี หลักๆ ก็ ptt ev station pluz, elexa, pea volta, evolt, sharge, altervim, ea anywhere (7 ราย) — as of 2022</li>\n</ul>\n<h2>ขับได้ไกลแค่ไหน</h2>\n<ul>\n<li>แล้วแต่รถ เส้นทาง และความเร็วที่ขับเลยครับ</li>\n<li>กรณีที่เปลืองไฟมากกว่าปกติคือ ขึ้นเขา หรือขับต้านลม หรือขับเร็วมากๆ ซึ่งก็เหมือนกับรถน้ำมันแหละ</li>\n<li>แต่ขับลงเขา เราได้ไฟเข้ารถเพิ่มนะ …. ตอนขึ้นดอยสุเทพ ใช้ไฟไป 8% แต่ขาลงได้แบตเพิ่มมา 3% เท่ากับขึ้นแล้วลงใช้แบตไป 5% อะไรงี้ ซึ่งรถน้ำมันทำไม่ได้</li>\n</ul>\n<h2>แบตเสื่อมมั้ย?</h2>\n<ul>\n<li>เสื่อมครับ</li>\n<li>ดูกราฟด้านล่าง ขับมาประมาณ 6,000 กิโล “ค่าประมาณการระยะทางที่ขับได้” ลดลงไปหน่อยนึง ประมาณ 5km (เฉียดๆ 1%)</li>\n</ul>\n<p><img src=\"https://www.icez.net/blog/wp-content/uploads/2022/12/c-20221226-173137-1024x463.png\" alt=\"\" /></p>\n<h2>มีผู้โดยสารเพิ่ม กินไฟเพิ่มมั้ย</h2>\n<ul>\n<li>เทียบระหว่างขับคนเดียว กับผู้โดยสารเต็มคัน (5 คนรวมคนขับ) แทบกินไฟไม่ต่างกันครับ</li>\n</ul>\n<h2>ค่าซ่อมบำรุง</h2>\n<ul>\n<li>Tesla มีแค่สลับล้อ เปลี่ยนกรองแอร์ เปลี่ยนยางตามสภาพยาง เช็คสภาพเบรก (ที่ไม่ค่อยได้ใช้) และเปลี่ยนถ้าจำเป็น</li>\n</ul>\n<h2>กราฟด้านบนเอามาจากไหน</h2>\n<ul>\n<li><a href=\"https://github.com/adriankumpf/teslamate\">Teslamate</a> ครับ โหลดมาติดตั้งเองในเครื่อง server</li>\n<li>ข้อมูลมาจาก api ของเทสลา ที่รถจะส่ง telemetry ไปให้ทางเทสลา “ตลอดเวลา”</li>\n<li>ถ้าไม่มี server เอง แนะนำให้ใช้ <a href=\"https://teslafi.com/\">Teslafi</a> ดีกว่าครับ</li>\n</ul>","author":"icez","siteTitle":"icez network","siteHash":"88787adba55f9deb5660f47c4b8baf580eb765815e4a6d536737656e8ab8bde4","entryHash":"4bbbe1e37b0ac5e623c898f49d8eaa2ca73d8f5ed3ef33253aecbfc8d9d289bd","category":"Thai"}