{"title":"Carb ratios, heat training and sprinting: how UAE Team Emirates-XRG plan on getting Tadej Pogačar 'towards perfection'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/carb-ratios-heat-training-and-sprinting-how-uae-team-emirates-xrg-plan-on-getting-tadej-pogacar-towards-perfection","date":1770630897000,"content":"\n      <p><span>How do you make the world’s best (ever?) cyclist even better? First, you check that he’s not already at his peak. “He still has indication that he could improve a little bit,” Jeroen Swart, UAE Team Emirates-XRG’s head of performance, says of Tadej Pogačar. Second, you determine if he still has the desire to keep on progressing. “It’s really a matter of maintaining motivation and drive.” And third, once you’re satisfied that he does indeed strive to ensure GOAT status, you geek out on research papers and studies, looking for that half-a-percent extra to elevate performance levels even more. “We keep seeing the science evolving and we share any papers that we come across that are relevant and discuss implementing new strategies based on that science.”</span><b></b></p>\n<p><span>Sounds easy, right? Three simple steps to make a sure candidate for the greatest of all time even greater. Whether it’s possible or not, that’s the job that Swart and his team of sports scientists set for themselves each and every season. And so far it’s been a task that they’ve fulfilled. A Grand Tour podium finisher aged 20, a first of four <a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a> titles a day before he turned 22, and a domineering 2025 season that came immediately after a remarkable <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/was-tadej-pogacars-2024-racing-season-the-greatest-in-cyclings-history?srsltid=AfmBOorYLvZzWUeJ0PQF-phJ0d7Mc9Gh_BI72LC8woNFtQKJkWSoqrLM&amp;tag=member\">Triple Crown campaign</a>. Just when you think Pogačar can’t possibly surpass his lofty standards, he does exactly that. “The margin for improvement gets smaller and smaller each year,” Swart says, “but we also thought that two years ago. We had no idea how much more he could improve, and he improved dramatically. But I think the changes now will be much smaller – it’s more about being able to sustain that level.”</span><b></b></p>\n<p><span>Swart is a self-confessed sports science nerd. Check out his social media and it’s full of him sharing new research papers and discussing various findings with others in his community. He's obsessed with making elite athletes even better. And his recent reading has given him new ideas that he is set to or is thinking about introducing at UAE.</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/image00001_d9853b08-0a63-4237-8f40-57480a206259.jpg?v=1769540412\" alt=\"\" /><br /><em>Jeroen Swart, seen here talking with Isaac del Toro, is the guru behind UAE's record-breaking performances. Image: UAE Team Emirates-XRG</em></span></p>\n<p><span>“I think there are a couple of trends,” he says. “One is heat training and just recently we refined our protocol because we could see areas where it wasn't optimal and maybe we will get additional gains from that. With nutrition, up until now most of the carbohydrate products have been two-thirds maltodextrin and one-third fructose, but latest studies show that 1:0.8 maltodextrin-fructose is now a more optimal formulation. Enervit, our nutrition partner, has redeveloped the entire range to incorporate the new 1:0.8 ratio which will allow us to do 120g of exogenous carbohydrates per hour.” It doesn’t end there. “With regards to sprint training, both at altitude and in general, we’re seeing more research now that is showing that sprint training has a differential effect on mitochondrial changes compared to steady state endurance training, so we’ll be incorporating both of those.”</span></p>\n<p><span>Deciding what new methods or techniques to use takes time and requires a lot of internal debate. It’s also a risk to upend an athlete’s habits and schedules if, like in the case of Pogačar, everything is going swimmingly. “We have a really well-functioning, cohesive team, and we don’t want to do anything that disrupts that because it works, so it’s important not to do massive changes from one season to the next, or implement anything extreme,” Swart says. </span></p>\n<p><span>But, the South African insists, evolution and regular refinement is necessary. “It’s not just for Tadej but for the entire team. We look at what we’ve done – of course it was successful – but we internally also spot little mistakes and suboptimal aspects that we made along the course of the season that we can improve on. We then change the protocol that we have to try and adjust to that and hopefully get towards perfection, although you will never hit perfection. We try to take small steps forward progressively throughout the year, and from one season to the next, without disrupting what we do well.”</span><b></b></p>\n<p><span>One area of particular interest to Swart is altitude training. In the past decade, spending months a year above 2,000m has become ubiquitous among elite cyclists. It has been a necessary part of the job. But Swart and his team have learned that there is a risk of too much. “We do a little bit less than we did in the past years,” Swart says, pointing out both the potential effects on a rider's mental health of sustained time away from home, and the physiological impact. “We have measured the response to altitude over a two year period, and we now have that data which we will publish in the next three to six months once we’re done writing it up. Our experience shows that after two weeks at altitude the gains are diminishing so we tend to do about a three week altitude camp.”</span></p>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_56_1_8190ea88-4729-4d20-b8dd-e7df15c55865.png?v=1769520296\" alt=\"\" /></b><em>Pogačar has now won back-to-back world titles on the road. Image: Alex Whitehead/SWpix.com</em></p>\n<p><span><br />Pogačar won 20 races last season, while his all-domineering team claimed a record-breaking 97 victories. Backed by the sport’s richest budget and able to convince the next supertalents to join their setup, the likelihood is UAE and Pogačar will continue to win and win big this season. But the key to their success, Swart says, is not just money – it’s simply people doing their job correctly.</span></p>\n<p><span>“Javier [Sola, Pogačar’s coach] and I often sit and marvel at how much we’ve achieved by not doing anything extraordinary. All of what we do is already in the literature – it’s been published in science. I think what we do really well is doing the basics exceptionally well, and I think most of our performance is in that. If we look at other teams launching aeroplanes and chasing all kinds of things, we just do the basics really, really well. There are some extras but we don’t do anything crazy, and I think that’s really the secret source – doing things well.”</span><b></b></p>\n<p><span>Yet even Swart has to admit that he is working with the crème de la crème, and in Pogačar’s case probably the greatest there has ever been. “Every year we think we’re getting close to the limit, but we still find ways to take it a little bit further and further,” he says. “It’s incredible and it’s hard for someone to actually conceptualise how good these guys are. In Tadej we have seen someone who appears once every few generations. People are asking if he is the greatest in history and that’s a debate that is going on. Being someone who is potentially the greatest in history you are obviously looking at something unique and a big part of that is genetics but also everything else that has gone into his performance today.” The signs all point to yet more UAE Team Emirates-XRG and Tadej Pogačar dominance.</span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"4d0fe710b62f972af00ab03bdd2bedca338a8bbc8a3bba021c6326c08d4f8645","category":"Cycling"}