{"title":"How to Sell UX Research with Two Simple Questions","link":"https://alistapart.com/article/how-to-sell-ux-research/","date":1634824800000,"content":"\n<p>Do you find yourself designing screens with only a vague idea of how the things on the screen relate to the things elsewhere in the system? Do you leave stakeholder meetings with unclear directives that often seem to contradict previous conversations? You <em>know</em> a better understanding of user needs would help the team get clear on what you are actually trying to accomplish, but time and budget for research is tight. When it comes to asking for more direct contact with your users, you might feel like poor Oliver Twist, timidly asking, “Please, sir, I want some more.” </p>\n\n\n\n<p>Here’s the trick. You need to get stakeholders <em>themselves</em> to identify high-risk assumptions and hidden complexity, so that they become just as motivated as you to get answers from users. Basically, you need to make them think it’s their idea. </p>\n\n\n\n<p>In this article, I’ll show you how to collaboratively expose misalignment and gaps in the team’s shared understanding by bringing the team together around two simple questions:</p>\n\n\n\n<ol><li>What are the objects?</li><li>What are the relationships between those objects?</li></ol>\n\n\n\n<h2>A gauntlet between research and screen design</h2>\n\n\n\n<p>These two questions align to the first two steps of the ORCA process, which might become your new best friend when it comes to reducing guesswork. Wait, what’s ORCA?! Glad you asked.</p>\n\n\n\n<p>ORCA stands for Objects, Relationships, CTAs, and Attributes, and it outlines a process for creating solid object-oriented user experiences. <a href=\"https://alistapart.com/article/object-oriented-ux/\">Object-oriented UX</a> is my design philosophy. ORCA is an iterative methodology for synthesizing user research into an elegant structural foundation to support screen and interaction design. <a href=\"https://alistapart.com/article/ooux-a-foundation-for-interaction-design/\">OOUX</a> and ORCA have made my work as a UX designer more collaborative, effective, efficient, fun, strategic, and meaningful.</p>\n\n\n\n<p>The ORCA process has four iterative rounds and a whopping fifteen steps. In each round we get more clarity on our Os, Rs, Cs, and As.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image1-1.jpg?resize=1024,576\" alt=\"\" /><figcaption><em>The four rounds and fifteen steps of the ORCA process. In the OOUX world, we love color-coding. Blue is reserved for objects! (Yellow is for core content, pink is for metadata, and green is for calls-to-action. Learn more about the </em><a href=\"https://alistapart.com/article/object-oriented-ux/\"><em>color-coded object map</em></a><em> and </em><a href=\"https://alistapart.com/article/ooux-a-foundation-for-interaction-design/\"><em>connecting CTAs to objects</em></a><em>.)</em></figcaption></figure>\n\n\n\n<p>I sometimes say that ORCA is a “garbage in, garbage out” process. To ensure that the testable prototype produced in the final round actually tests <em>well</em>, the process needs to be fed by <em>good</em> research. But if you don’t have a ton of research, the beginning of the ORCA process serves another purpose: it helps you sell the <em>need</em> for research.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image2-1.jpg?resize=1024,639\" alt=\"\" /><figcaption><em>ORCA strengthens the weak spot between research and design by helping distill research into solid information architecture—scaffolding for the screen design and interaction design to hang on.</em></figcaption></figure>\n\n\n\n<p>In other words, the ORCA process serves as a gauntlet between research and design. With good research, you can gracefully ride the killer whale from research into design. But without good research, the process effectively spits you back into research and with a cache of <em>specific</em> open questions.</p>\n\n\n\n<h2>Getting in the same curiosity-boat</h2>\n\n\n\n<blockquote><p>What gets us into trouble is not what we don’t know. It’s what we know for sure that just ain’t so.</p><cite>Mark Twain</cite></blockquote>\n\n\n\n<p>The first two steps of the ORCA process—Object Discovery and Relationship Discovery—shine a spotlight on the dark, dusty corners of your team’s misalignments and any inherent complexity that’s been swept under the rug. It begins to expose what this classic comic so beautifully illustrates:</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image3-2.jpg\" alt=\"\" /><figcaption><em>The original “Tree Swing Project Management” cartoon dates back to the 1960s or 1970s and has no artist attribution we could find.</em></figcaption></figure>\n\n\n\n<p>This is one reason why so many UX designers are frustrated in their job and why many projects fail. And this is also why we often can’t sell research: every decision-maker is confident in their own mental picture. </p>\n\n\n\n<p>Once we expose hidden fuzzy patches in each picture and the differences between them all, the case for user research makes itself.</p>\n\n\n\n<p>But how we do this is important. However much we might want to, we can’t just tell everyone, “YOU ARE WRONG!” Instead, we need to facilitate and guide our team members to self-identify holes in their picture. When stakeholders take ownership of assumptions and gaps in understanding, BAM! Suddenly, UX research is not such a hard sell, and everyone is aboard the same curiosity-boat.</p>\n\n\n\n<p>Say your users are doctors. And you have no idea how doctors use the system you are tasked with redesigning.</p>\n\n\n\n<p>You might try to sell research by honestly saying: “We need to understand doctors better! What are their pain points? How do they use the current app?” But here’s the problem with that. Those questions are vague, and the answers to them don’t feel acutely actionable.</p>\n\n\n\n<p>Instead, you want your stakeholders themselves to ask super-specific questions. This is more like the kind of conversation you need to facilitate. Let’s listen in:</p>\n\n\n\n<p><em>“Wait a sec, how often do doctors share patients? Does a patient in this system have primary and secondary doctors?”</em></p>\n\n\n\n<p><em>“Can a patient even have more than one primary doctor?”</em></p>\n\n\n\n<p><em>“Is it a ‘primary doctor’ or just a ‘primary caregiver’… Can’t that role be a nurse practitioner?”</em></p>\n\n\n\n<p><em>“No, caregivers are something else… That’s the patient’s family contacts, right?”</em></p>\n\n\n\n<p><em>“So are caregivers in scope for this redesign?”</em></p>\n\n\n\n<p><em>“Yeah, because if a caregiver is present at an appointment, the doctor needs to note that. Like, tag the caregiver on the note… Or on the appointment?”</em></p>\n\n\n\n<p>Now we are getting somewhere. Do you see how powerful it can be getting stakeholders to debate these questions themselves? The diabolical goal here is to shake their confidence—gently and diplomatically.</p>\n\n\n\n<p>When these kinds of questions bubble up collaboratively and come directly from the mouths of your stakeholders and decision-makers, suddenly, designing screens <em>without</em> knowing the answers to these questions seems incredibly risky, even silly.</p>\n\n\n\n<p>If we create software without understanding the real-world information environment of our users, we will likely create software that does not <em>align</em> to the real-world information environment of our users. And this will, hands down, result in a more confusing, more complex, and less intuitive software product.</p>\n\n\n\n<h2>The two questions</h2>\n\n\n\n<p>But how do we get to these kinds of meaty questions diplomatically, efficiently, collaboratively, and <em>reliably</em>? </p>\n\n\n\n<p>We can do this by starting with those two big questions that align to the first two steps of the ORCA process:</p>\n\n\n\n<ol><li>What are the objects?</li><li>What are the relationships between those objects?</li></ol>\n\n\n\n<p>In practice, getting to these answers is easier said than done. I’m going to show you how these two simple questions can provide the outline for an Object Definition Workshop. During this workshop, these “seed” questions will blossom into dozens of specific questions and shine a spotlight on the need for more user research.</p>\n\n\n\n<h2>Prep work: Noun foraging</h2>\n\n\n\n<p>In the next section, I’ll show you how to run an Object Definition Workshop with your stakeholders (and entire cross-functional team, hopefully). But first, you need to do some prep work.</p>\n\n\n\n<p>Basically, look for nouns that are particular to the business or industry of your project, and do it across at least a few sources. I call this <em>noun foraging</em>.</p>\n\n\n\n<p>Here are just a few great noun foraging sources:</p>\n\n\n\n<ul><li>the product’s marketing site</li><li>the product’s competitors’ marketing sites (competitive analysis, anyone?)</li><li>the existing product (look at labels!)</li><li>user interview transcripts</li><li>notes from stakeholder interviews or vision docs from stakeholders</li></ul>\n\n\n\n<p>Put your detective hat on, my dear Watson. Get resourceful and leverage what you have. If all you have is a marketing website, some screenshots of the existing legacy system, and access to customer service chat logs, then use those.</p>\n\n\n\n<p>As you peruse these sources, watch for the nouns that are used over and over again, and start listing them (preferably on blue sticky notes if you’ll be creating an object map later!).</p>\n\n\n\n<p>You’ll want to focus on nouns that <em>might</em> represent objects in your system. If you are having trouble determining if a noun might be object-worthy, remember the acronym SIP and test for:</p>\n\n\n\n<ol><li>Structure</li><li>Instances</li><li>Purpose</li></ol>\n\n\n\n<p>Think of a library app, for example. Is “book” an object?</p>\n\n\n\n<p>Structure: can you think of a few attributes for this potential object? <em>Title, author, publish date…</em> Yep, it has structure. Check!</p>\n\n\n\n<p>Instance: what are some examples of this potential “book” object? Can you name a few? <em>The Alchemist,</em> <em>Ready Player One</em>, <em>Everybody Poops</em>… OK, check!</p>\n\n\n\n<p>Purpose: why is this object important to the users and business? <em>Well, “book” is what our library client is providing to people and books are why people come to the library</em>… Check, check, check!</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image4-1.jpg?resize=1024,678\" alt=\"\" /><figcaption><em>SIP: Structure, Instances, and Purpose! (Here’s a </em><a href=\"https://whimsical.com/is-it-a-object-in-the-ooux-world-PubTHzL4Hs1Kr6Xs6b8y2J\"><em>flowchart</em></a><em> where I elaborate even more on SIP.)</em></figcaption></figure>\n\n\n\n<p>As you are noun foraging, focus on capturing the nouns that have SIP. Avoid capturing <em>components</em> like dropdowns, checkboxes, and calendar pickers—<a href=\"https://alistapart.com/article/a-content-model-is-not-a-design-system/\">your UX system is not your design system</a>! Components are just the packaging for objects—they are a means to an end. No one is coming to your digital place to play with your dropdown! They are coming for the VALUABLE THINGS and what they can do with them. Those things, or objects, are what we are trying to identify.</p>\n\n\n\n<p>Let’s say we work for a startup disrupting the email experience. This is how I’d start my noun foraging.</p>\n\n\n\n<p>First I’d look at my own email client, which happens to be Gmail. I’d then look at Outlook and the new HEY email. I’d look at Yahoo, Hotmail…I’d even look at Slack and Basecamp and other so-called “email replacers.” I’d read some articles, reviews, and forum threads where people are complaining about email. While doing all this, I would look for and write down the nouns.</p>\n\n\n\n<p>(Before moving on, feel free to go noun foraging for this hypothetical product, too, and then scroll down to see how much our lists match up. Just don’t get lost in your own emails! Come back to me!)</p>\n\n\n\n<p>Drumroll, please…</p>\n\n\n\n<p>Here are a few nouns I came up with during my noun foraging:</p>\n\n\n\n<ul><li>email message</li><li>thread</li><li>contact</li><li>client</li><li>rule/automation</li><li>email address that is not a contact?</li><li>contact groups</li><li>attachment</li><li>Google doc file / other integrated file</li><li>newsletter? (HEY treats this differently)</li><li>saved responses and templates</li></ul>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image5-1.jpg?resize=1024,683\" alt=\"\" /><figcaption><em>In the OOUX world, we love color-coding. Blue is reserved for objects! (Yellow is for core content, pink is for metadata, and green is for calls-to-action. Learn more about the </em><a href=\"https://alistapart.com/article/object-oriented-ux/\"><em>color coded object map</em></a><em> and </em><a href=\"https://alistapart.com/article/ooux-a-foundation-for-interaction-design/\"><em>connecting CTAs to objects</em></a><em>.)</em></figcaption></figure>\n\n\n\n<p>Scan your list of nouns and pick out words that you are completely clueless about. In our email example, it might be <em>client</em> or <em>automation</em>. Do as much homework as you can before your session with stakeholders: google what’s googleable. But other terms might be so specific to the product or domain that you need to have a conversation about them.</p>\n\n\n\n<p><em>Aside: here are some real nouns foraged during my own past project work that I needed my stakeholders to help me understand:</em></p>\n\n\n\n<ul><li><em>Record Locator</em></li><li><em>Incentive Home</em></li><li><em>Augmented Line Item</em></li><li><em>Curriculum-Based Measurement Probe</em></li></ul>\n\n\n\n<p>This is really all you need to prepare for the workshop session: a list of nouns that represent potential objects and a short list of nouns that need to be defined further.</p>\n\n\n\n<h2>Facilitate an Object Definition Workshop</h2>\n\n\n\n<p>You could actually start your workshop with noun foraging—this activity <em>can</em> be done collaboratively. If you have five people in the room, pick five sources, assign one to every person, and give everyone ten minutes to find the objects within their source. When the time’s up, come together and find the overlap. Affinity mapping is your friend here!</p>\n\n\n\n<p>If your team is short on time and might be reluctant to do this kind of grunt work (which is usually the case) do your own noun foraging beforehand, but be prepared to show your work. I love presenting screenshots of documents and screens with all the nouns already highlighted. Bring the artifacts of your process, and start the workshop with a five-minute overview of your noun foraging journey.</p>\n\n\n\n<p>HOT TIP: before jumping into the workshop, frame the conversation as a requirements-gathering session to help <em>you</em> better understand the scope and details of the system. You don’t need to let them know that you’re looking for gaps in the team’s understanding so that you can prove the need for more user research—that will be our little secret. Instead, go into the session optimistically, as if your knowledgeable stakeholders and PMs and biz folks already have all the answers. </p>\n\n\n\n<p>Then, let the question whack-a-mole commence.</p>\n\n\n\n<h3>1. What is this thing?</h3>\n\n\n\n<p>Want to have some <em>real</em> fun? At the beginning of your session, ask stakeholders to privately write definitions for the handful of obscure nouns you might be uncertain about. Then, have everyone show their cards at the same time and see if you get different definitions (you will). This is <em>gold</em> for exposing misalignment and starting great conversations.</p>\n\n\n\n<p>As your discussion unfolds, capture any agreed-upon definitions. And when uncertainty emerges, quietly (but visibly) start an “open questions” parking lot. 😉</p>\n\n\n\n<p>After definitions solidify, here’s a great follow-up:</p>\n\n\n\n<h3>2. Do our users know what these things are? What do users call this thing?</h3>\n\n\n\n<p><span>Stakeholder 1:</span> They probably call email clients “apps.” But I’m not sure.</p>\n\n\n\n<p><span>Stakeholder 2:</span> Automations are often called “workflows,” I think. Or, maybe users think workflows are something different.</p>\n\n\n\n<p>If a more user-friendly term emerges, ask the group if they can agree to use only that term moving forward. This way, the team can better align to the users’ language and mindset.</p>\n\n\n\n<p>OK, moving on. </p>\n\n\n\n<p>If you have two or more objects that seem to overlap in purpose, ask one of these questions:</p>\n\n\n\n<h3>3. Are these the same thing? Or are these different? If they are not the same, how are they different?</h3>\n\n\n\n<p><span>You:</span> Is a saved response the same as a template?</p>\n\n\n\n<p><span>Stakeholder 1:</span> Yes! Definitely.</p>\n\n\n\n<p><span>Stakeholder 2:</span> I don’t think so… A saved response is text with links and variables, but a template is more about the look and feel, like default fonts, colors, and placeholder images. </p>\n\n\n\n<p>Continue to build out your growing glossary of objects. And continue to capture areas of uncertainty in your “open questions” parking lot.</p>\n\n\n\n<p>If you successfully determine that two similar things are, in fact, different, here’s your next follow-up question:</p>\n\n\n\n<h3>4. What’s the relationship between these objects?</h3>\n\n\n\n<p><span>You:</span> Are saved responses and templates related in any way?</p>\n\n\n\n<p><span>Stakeholder 3:</span>  Yeah, a template can be applied to a saved response.</p>\n\n\n\n<p><span>You, always with the follow-ups:</span> When is the template applied to a saved response? Does that happen when the user is constructing the saved response? Or when they apply the saved response to an email? How does that actually work?</p>\n\n\n\n<p>Listen. Capture uncertainty. Once the list of “open questions” grows to a critical mass, pause to start assigning questions to groups or individuals. Some questions might be for the dev team (hopefully at least one developer is in the room with you). One question might be specifically for someone who couldn’t make it to the workshop. And many questions will need to be labeled “user.” </p>\n\n\n\n<p>Do you see how we are building up to our UXR sales pitch?</p>\n\n\n\n<h3><strong>5. Is this object in scope?</strong></h3>\n\n\n\n<p>Your next question narrows the team’s focus toward what’s most important to your users. You can simply ask, “Are saved responses in scope for our first release?,” but I’ve got a better, more devious strategy.</p>\n\n\n\n<p>By now, you should have a list of clearly defined objects. Ask participants to sort these objects from most to least important, either in small breakout groups or individually. Then, like you did with the definitions, have everyone reveal their sort order at once. Surprisingly—or not so surprisingly—it’s not unusual for the VP to rank something like “saved responses” as #2 while everyone else puts it at the bottom of the list. Try not to look too smug as you inevitably expose more misalignment.</p>\n\n\n\n<p>I did this for a startup a few years ago. We posted the three groups’ wildly different sort orders on the whiteboard.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image6-1.jpg?resize=1024,831\" alt=\"\" /><figcaption><em>Here’s a snippet of the very messy middle from this session: three columns of object cards, showing the same cards prioritized completely differently by three different groups.</em></figcaption></figure>\n\n\n\n<p>The CEO stood back, looked at it, and said, “This is why we haven’t been able to move forward in two years.”</p>\n\n\n\n<p>Admittedly, it’s tragic to hear that, but as a professional, it feels pretty awesome to be the one who facilitated a watershed realization.</p>\n\n\n\n<p>Once you have a good idea of in-scope, clearly defined things, this is when you move on to doing more relationship mapping.</p>\n\n\n\n<h3>6. Create a visual representation of the objects’ relationships</h3>\n\n\n\n<p>We’ve already done a bit of this while trying to determine if two things are different, but this time, ask the team about <em>every</em> potential relationship. For each object, ask how it relates to all the other objects. In what ways are the objects connected? To visualize all the connections, pull out your trusty boxes-and-arrows technique. Here, we are connecting our objects with verbs. I like to keep my verbs to simple “has a” and “has many” statements.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/10/selling-ux-image7-1.jpg?resize=1024,700\" alt=\"\" /><figcaption><em>A work-in-progress system model of our new email solution.</em></figcaption></figure>\n\n\n\n<p>This system modeling activity brings up all sorts of new questions:</p>\n\n\n\n<ul><li>Can a saved response have attachments?</li><li>Can a saved response use a template? If so, if an email uses a saved response with a template, can the user override that template?</li><li>Do users want to see all the emails they sent that included a particular attachment? For example, “show me all the emails I sent with <strong>ProfessionalImage.jpg</strong> attached. I’ve changed my professional photo and I want to alert everyone to update it.” </li></ul>\n\n\n\n<p>Solid answers might emerge directly from the workshop participants. Great! Capture that new shared understanding. But when uncertainty surfaces, continue to add questions to your growing parking lot.</p>\n\n\n\n<h2>Light the fuse</h2>\n\n\n\n<p>You’ve positioned the explosives all along the floodgates. Now you simply have to light the fuse and BOOM. Watch the buy-in for user research flooooow.</p>\n\n\n\n<p>Before your workshop wraps up, have the group reflect on the list of open questions. Make plans for getting answers internally, then focus on the questions that need to be brought before users.</p>\n\n\n\n<p>Here’s your final step. Take those questions you’ve compiled for user research and discuss the level of risk associated with NOT answering them. Ask, “if we design without an answer to this question, if we make up our own answer and we are wrong, how bad might that turn out?” </p>\n\n\n\n<p>With this methodology, we are cornering our decision-makers into advocating for user research as they themselves label questions as high-risk. Sorry, not sorry. </p>\n\n\n\n<p><em>Now</em> is your moment of truth. With everyone in the room, ask for a reasonable budget of time and money to conduct 6–8 user interviews focused <em>specifically</em> on these questions. </p>\n\n\n\n<p>HOT TIP: if you are new to UX research, please note that you’ll likely need to rephrase the questions that came up during the workshop before you present them to users. Make sure your questions are open-ended and don’t lead the user into any default answers.</p>\n\n\n\n<h2>Final words: Hold the screen design!</h2>\n\n\n\n<p>Seriously, if at all possible, do not ever design screens again without first answering these fundamental questions: what are the objects and how do they relate?</p>\n\n\n\n<p>I promise you this: if you can secure a shared understanding between the business, design, and development teams <em>before</em> you start designing screens, you will have less heartache and save more time and money, and (it almost feels like a bonus at this point!) users will be more receptive to what you put out into the world. </p>\n\n\n\n<p>I sincerely hope this helps you win time and budget to go talk to your users and gain clarity on what you are designing before you start building screens. If you find success using noun foraging and the Object Definition Workshop, there’s more where that came from in the rest of the ORCA process, which will help prevent even more late-in-the-game scope tugs-of-war and strategy pivots. </p>\n\n\n\n<p>All the best of luck! Now go sell research!</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"4d24d2dfdb8413eeb4d19411f42bbf0cd7bcfc4c3db5f346b442bac0ffe04c69","category":"Tech"}