{"title":"Sandstone and the Scrambler","link":"https://moots.com/blogs/news/sandstone-and-the-scrambler","date":1763173227000,"content":"\n      <p><i>Reflections on an adventure through Bears Ears National Monument by Kyle Richardson</i></p>\n<p>———</p>\n<p>Dropping down the backside of Elephant Hill into the Needles District, Canyonlands National Park feels meaningful and distinct. It feels remote. There is something gratifying about loading your bike with food for a couple of days and 7 liters of water, and then pointing towards remote and quiet country. This feeling only arises when you know you are about to be in the good stuff. Confidence is there because you have everything you need on your bike, even some comfort items, plus the knowledge of managing and repairing your bike. The excitement for adventure is brewing.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_0153_VSCO.jpg?v=1763173078\" alt=\"\" /></p>\n<p>It was fitting for this adventure to be riding the new Moots adventure bike, the Scrambler. Firstly, I cut my teeth and made some notoriety for myself scrambling around in the Flatirons and peaks above Boulder, CO. For me, scrambling is one of the peak forms of movement. It's the blurry line between running and climbing. It's an all-engaging and encompassing way to move in the mountains. In the world of bikes, scrambling encompasses taking your bike to those remote and unique places. Seeking out mixed terrain rides that demand all of your attention and skills. Secondly, it was a bit of a scramble to pull off this adventure. From the side quest to acquire the bike in Steamboat Springs, to squeezing this midweek adventure into a few days and hectic schedules, to riding a brand new bike without any prior knowledge or time to really dial in the bags or setup. I think spontaneity and adventure embody the spirit of the Scrambler. A true adventure bike that you can rely on, but also a bike that will push you out of your comfort zone. Okay, back to the adventure.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_0183_VSCO.jpg?v=1763173174\" alt=\"\" /></p>\n<p><img />Bears Ears is a culturally significant and delicate zone. You feel the importance and beauty while riding through these amazing landscapes. Bears Ears is massive, over 1.36 million acres. For this loop, we focus on the interior of the national monument. Over the course of 2.5 days and 153 miles, we rode through 3 distinct zones. The Needles, Elk Ridge, and the Abajo Mountains. One of the most incredible aspects of this route is the change of elevation. From 6,000ft up to 10,000ft and back, each tier of the route is unique and distinct. Each time you climb or descend to a new level, you are rewarded with a brand new landscape with new flora and fauna. From the sagebrush and cottonwoods of Indian Creek, up to the aspen and ponderosa forest of Elk Ridge. This constant changing of environments makes this route intoxicating and exciting.</p>\n<p><br /></p>\n<p>The roads and terrain around Bears Ears are rugged to say the least. Rocky, sandy, and bumpy.  The Scrambler was equipped with a 100 mm Sid fork. In previous years on this route, I have always ridden a fully rigid bike. To no surprise, this iteration with some squish was a delight. Previous sections that were trying and tough, now became rideable and actually enjoyable. The bike's geometry was designed to carry weight well and was a dream on this route. All Moots bikes are beautiful, but I will let the photos speak for themselves. This bike was blinged out and shining among the desert sandstone.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_0182_VSCO_2.jpg?v=1763173211\" alt=\"\" /></p>\n<p>The stars shine brighter when you are in a remote country, tired after a long day of biking. Food and water taste better after hauling them around rugged roads. Climbing from Ruin Park up to Elk Ridge is a fascinating and magnificent climb, one of my favorite climbs in the whole world. This route has many secrets and side quests. Malt shakes and burgers in Blanding are things worth pedaling far for. Circumnavigating beautiful country and sleeping out, it all makes for a memorable adventure. From the desert floor to the high alpine, you see it all in a condensed period of time. This adventure was a good reminder to always seize the opportunity to get outside and ride. It’s always worth it. If you want to see the route, send me an email at <a href=\"mailto:kylerichardson.atx@gmail.com\" target=\"_blank\">kylerichardson.atx@gmail.com</a> or a DM on Instagram <a href=\"https://www.instagram.com/kylerichardson/?hl=en\">@kylerichardson.</a></p>\n<p> </p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"50a72773386827dc18cb2d867eaf4bc3a3cc01adc817d1567f5c4a26e8c1f816","category":"Cycling"}