{"title":"Inside Our Traka Adventure with Artu and the Routt CRD","link":"https://moots.com/blogs/news/inside-our-traka-adventure-with-artu-and-the-routt-crd","date":1762459569000,"content":"\n      <p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_1917-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p> </p>\n<p>We’ve had a longstanding relationship now with <a href=\"https://www.artuclub.cc/\">Artu Adventure Club</a>, a truly special place outside of Girona nestled in the hills.  You couldn’t find a more perfect escape for your cycling adventures in this part of Europe, so when Artu rang and asked if Moots wanted to come be part of the <a href=\"https://www.thetraka.com/the-traka-360k/\">Traka</a> experience, well, it didn’t take long to change plans and make the bookings.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_1966-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p>The Traka has built quite the reputation as the premier gravel race in Europe and having participated in gravel events all over the US, I figured it was prime time to give it a go in the heart of Girona which has been all the buzz for gravel riding. With almost 4,000 riders participating and distances ranging from 100K to 560K, this event has something for everyone. Despite it being early season, I chose the 200K as I like long distances and because the team had built up a special Routt CRD for the season I was dying to show off to my mates at Artu.  With Zipp 303 wheels and the new SRAM Red Drivetrain, this bike is truly amazing.  Add to that the new California Dreamin finish, and the bike is a stunning beauty to say the least.  Without question it was a head turner throughout the day.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_1919-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p>As you get older you know what you like and roughing it isn’t exactly in the cards most days.  That’s where Artu comes in as they take amazing care of you every part of the day.  From meals curated to the needs of a cyclist, guides who tee up the best routes and the serenity and beauty of the surroundings, you can get away from the busyness of a city and simply relax and ride your bike.  Having visited here a few times before, I find the best way to enjoy Artu is to just be there with no agenda that doesn’t involve the bike.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_1945-1024x768.jpg\" alt=\"\" width=\"800\" height=\"600\" /></p>\n<p>The event itself was a load of fun and the experience didn’t disappoint.  We had perfect weather on the day of the 200K with a cool start and warmer temps throughout with plenty of sunshine.  With almost 9K feet of climbing on primarily gravel surfaces, it isn’t easy either, but seems the organizers worked hard to find the best tracks in the region offering challenging climbs yet amazing views.  There were lots of twists/turns and singletrack sections that allowed you to avoid any traffic on these open roads and the crew supporting racers were everywhere to make sure you didn’t get off course as even the Wahoo can be tricky at times.  The aid stations were perfect and you really could roll this course without much needed on your own beyond the requirements to get to that first aid station.  Nothing was too technical and overall, just a phenomenal ride.  It was clear the race organizers had a little fun on the participants behalf though, as near the finish when you could see town and knew you were close, they took you up a nasty little hill that was best served on a mountain bike.  I’m sure that was solely to crush some spirits and to get the beautiful shots of riders pushing their bike, but they weren’t getting that from me on this day as I had heard to leave some gas in the tank for that part and was able to clean the climb.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_1956-1024x768.jpg\" alt=\"\" width=\"800\" height=\"600\" /></p>\n<p>It felt great to finish and then even better to be whisked away shortly thereafter by Aga, our lovely host at Artu, where I could then get a shower and celebrate with friends.  They dialed up the perfect finish for the day as well with a lovely meal that evening and lots of stories from the guests.  My favorite one was from my new friend Omid, from Cambridge, who had no plans whatsoever to participate in the event but wound up getting so excited and joining for the 200K with no training, no prep, etc.  A strong guy from rowing yeah, but no cyclist, yet he rocked up to the start gate and had a great ride and was all smiles in the evening when it was over.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_1927-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p>If you want to do the Traka in 2026, better reach out to Artu or our crew at Moots as I can guarantee you won’t find a better way to experience Girona gravel in style.  Big thanks to the entire team at Artu for hosting such a wonderful experience!</p>\n<p> </p>\n<p>Brent Whittington</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"52ed6d0179caa1211c76ff32e0bb31bbdf8904062882867a8a1ce767277ffdc1","category":"Cycling"}