{"title":"Remco Evenepoel wants to break the Hour Record 'at some point': will he smash Filippo Ganna's time?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/remco-evenepoel-wants-to-break-the-hour-record-at-some-point-will-he-smash-filippo-gannas-time","date":1769688668000,"content":"\n      <p><span>“Remco,” began the question. “Do you want to attempt the Hour Record?” A pause, a smile. “Of course, yeah,” he replied. “At some point.” Music to the ears of Dan Bigham, the sport’s foremost aerodynamic expert, a self-confessed Hour Record obsessive (and former holder), and now head of engineering at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-really-impressive-its-what-i-looking-for-remco-evenepoel-already-thriving-at-red-bull-bora-hansgrohe?srsltid=AfmBOoqy0pT2qOXApJAwNzZp6NQhYzRGia_LpNxWGQUxfLGzwANeHhl9&amp;tag=member\">same team as Remco Evenepoel, Red Bull-Bora-hansgrohe</a>. “I’m motivated, I’m keen. Whenever Remco wants to do it, I’ll be totally waiting,” Bigham says. So will Evenepoel target Filippo Ganna’s record of 56.792km that has stood since 2022, and if he does will he beat the Italian’s mark?</span><b></b></p>\n<p><span>The answer to the first question is: unlikely in the short-term. Evenepoel, 26, is beginning a new chapter in his career with Red Bull, the first time he has represented a team that isn’t Soudal Quick-Step. Above the Hour Record in his list of priorities is closing a still sizeable gap to Tadej </span><span>Pogačar</span><span> and winning the Tour de France. And then after that there’s a bunch of Monuments he wants to win, while he’d quite like to cement his status as this generation’s best time triallist by adding a couple more rainbow jerseys to his collection. Oh, and a Giro d’Italia title sounds pretty nice, too.</span><b></b></p>\n<p><span>But once those targets have been accomplished – or he’s worn out chasing them down – then the Hour Record can come into focus. Sixty minutes, round and round a velodrome, in pursuit of being able to say he’s ridden further than any other cyclist in one single hour. It’s a mammoth task, said to be the hardest physical effort a cyclist can undertake, but it’s well within Evenepoel’s reach. Bigham’s crunched the numbers, he’s certain of it. “He’s able. You don’t win three Time Trial World Championships and Olympic time trial gold without being capable of doing what is a glorified long time trial,” Bigham says.</span><b></b></p>\n<p><span>Bigham’s role in any future attempt will be key. He <a href=\"https://www.rouleur.cc/en-us/blogs/the-rouleur-journal/behind-the-scenes-of-dan-bighams-hour-record-part-one?srsltid=AfmBOorpdK0GynrZmSTUA6Fpz_YRHqgzikNRiJZKl6FRxbJ8owI77HfR\">reset the Hour Record distance in August 2022</a>, just a few months before Ganna added more than a kilometre to the Briton’s mark. Bigham, in his role as performance engineer at Ineos Grenadiers, then  helped Ganna beat his own record. He’s looked back at the data from Ganna’s 2022 effort and sees a lot of margin for improvement.</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/eltoromediadotcom_-_HOUR_X_BIGHAM_19-8-22-46.jpg?v=1663674537\" alt=\"\" /><em>For a few months in 2022 before Ganna's ride Bigham had ridden further than any other cyclist over one hour. Image: Ineos Grenadiers.</em></span></p>\n<p>“I wrote a report after Filippo’s record, breaking down where we left performance on the table, and it wasn’t insignificant,” Bigham reveals. “There’s probably a bit of hesitation in the sport but I know it’s absolutely possible to be broken. The gap to my distance was 1.2km – about 25 watts – and Remco is definitely in a position where he can break it. The key thing is if we’re going to do it, we do it fucking well. Not well, the best ever. And we bring to bear everything the team has to offer to do it in the most perfect way possible.\"</p>\n<p><span>Should Evenepoel announce an attempt, the one doubt observers will have is Evenepoel’s lack of experience on the track. Let’s not forget: he was a footballer, a very good one, until he was 17. Unlike Ganna who was raised in the velodrome, Evenepoel has never been a track cyclist. Yes, he’s done testing in a velodrome, but that’s an entirely different proposition to completing a successful Hour Record attempt that requires the rider to hold the same line for 60 minutes without deviating from it. That takes skill – skill that is honed over years.</span><b></b></p>\n<p><span>Bigham acknowledges that, but believes Evenepoel can overcome that and make gains on Ganna in other areas. “There were some things I wanted to do in Filippo’s Hour that neither he nor his coach were keen to do, and therefore there is performance left on the table,” Bigham says, without identifying what exactly. “Remco is very keen, very open minded. Nothing is out of bounds in relation to optimisation and that’s pretty cool as far as projects go. The record is achievable but if we do it, we do it right and we knock it out the park.”</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_60_1_a157e406-81ed-40fd-bae4-5988e7a8dc6b.png?v=1769541279\" alt=\"\" /><em>Evenepoel secured his third time trial rainbow jersey in Kigali, Rwanda last September. Image: Zac Williams/SWpix.com.</em></span></p>\n<p>Analysing Evenepoel’s and Ganna’s head-to-head record in time trials since the 2024 Olympics, Evenepoel tends to finish between 0.3kph and 1.3kph faster than Ganna. It’s incomplete science and doesn’t take into account the many variables and nuances of a Hour Record, but if those results were replicated in an Hour attempt, Evenepoel could expect to record a distance of between 57 and 58km. Ganna has already promised that he’d come back for more, but a distance in excess of 58km would probably be insurmountable, at least in the short-term.</p>\n<p><span>Could he go and achieve the unthinkable? “I did a </span><a href=\"https://www.youtube.com/watch?v=ZI7HgMvzUCc\"><span>GCN video</span></a><span> before to see if<a href=\"https://www.rouleur.cc/blogs/rouleur-performance/breaking-60-mission-possible?srsltid=AfmBOoo_eFxbjN_okYdWaceSVWDFUc0oBsoCLrsAqp3t3bbNHF9ZoZe8\"> 60km in 60 minutes</a> was possible and the interesting thing was people compare it to going sub-four minutes in the individual pursuit,” Bigham says. “From a speed perspective it’s the same: 4k in the IP is 60kph. However, the acceleration power is much harder. You need higher power in a 4k IP than doing 60k in an hour. But we’re closing in on that. The record now in the IP is 3:59.153, and Jonathan Milan is the new record holder. I’d say Remco is a better time triallist than Milan, and I think we’re heading that way. It’s a long stretch, I’m not going to say 60k is possible as I think it probably isn’t, but it’s nice to think about.”</span><b></b></p>\n<p><span>Very little is certain about a prospective attempt, and until Evenepoel and Red Bull start to discuss a bid more seriously, it’s just a fun, hypothetical conversation. But Evenepoel knows from just the last few months that in Bigham he can count on an Hour Record geek to take him towards greatness, and have his name alongside legends such as Francesco Moser, Fausto Coppi and Eddy Merckx. “I of course knew who [Bigham] was briefly, and now we’ve been in the US together for four or five days at the Specialized wind tunnel, and it’s actually just very impressive to see how organised these guys are,” Evenepoel said back in December. “To give an example, I did about 50 runs in the tunnel a few months ago and they had everything prepared for me. I went in, came out, something new, in, out. For me it’s really easy to have such structured planning with them. I’m very curious how we will keep developing.”</span><b></b></p>\n<p><span>First success on the road, then an attempt at beating Ganna’s mark. “I think it's quite obvious from my background and general interest in the Hour Record that it’s something I absolutely love,” Bigham chuckled. “I think it’s the purest time trial that there is and the fact it transcends eras and can compare different riders, it’s such a unique thing about the sport. I think among this latest generation it’s maybe underhyped and underappreciated, but in decades gone by it was something that was historic and we shouldn’t forget that. As soon as Remco’s ready I’m willing, I’m available, and he’s capable.” </span></p>\n<p><em>Cover image: Red Bull-Bora-hansgrohe/Maximilliam Friers</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"56c10e58a71a44b34fb3f57adf90b0122ca66473decc743553bd6b9bfa328864","category":"Cycling"}