{"title":"AWS IAM Identity Center now supports multi-Region replication for AWS account access and application use","link":"https://aws.amazon.com/blogs/aws/aws-iam-identity-center-now-supports-multi-region-replication-for-aws-account-access-and-application-use/","date":1770146014000,"content":"<p>Today, we’re announcing the general availability of <a href=\"https://aws.amazon.com/iam/identity-center/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS IAM Identity Center</a> multi-Region support to enable <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/manage-your-accounts.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS account access</a> and <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/awsapps.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">managed application use</a> in additional <a href=\"https://docs.aws.amazon.com/glossary/latest/reference/glos-chap.html#region?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS Regions</a>.</p> \n<p>With this feature, you can replicate your workforce identities, permission sets, and other metadata in your organization instance of IAM Identity Center connected to an external identity provider (IdP), such as Microsoft Entra ID and Okta, from its current primary Region to additional Regions for improved resiliency of AWS account access.</p> \n<p>You can also deploy AWS managed applications in your preferred Regions, close to application users and datasets for improved user experience or to meet data residency requirements. Your applications deployed in additional Regions access replicated workforce identities locally for optimal performance and reliability.</p> \n<p>When you replicate your workforce identities to an additional Region, your workforce gets an active AWS access portal endpoint in that Region. This means that in the unlikely event of an IAM Identity Center service disruption in its primary Region, your workforce can still access their AWS accounts through the AWS access portal in an additional Region using already provisioned permissions. You can continue to manage IAM Identity Center configurations from the primary Region, maintaining centralized control.</p> \n<p><strong><u>Enable IAM Identity Center in multiple Regions</u></strong><br /> To get started, you should confirm that the AWS managed applications you’re currently using support <a href=\"https://docs.aws.amazon.com/kms/latest/cryptographic-details/basic-concepts.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">customer managed AWS Key Management Service (AWS KMS) key</a> enabled in AWS Identity Center. When we introduced <a href=\"https://aws.amazon.com/blogs/aws/aws-iam-identity-center-now-supports-customer-managed-kms-keys-for-encryption-at-rest/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">this feature</a> in October 2025, Seb recommended using multi-Region AWS KMS keys unless your company policies restrict you to single-Region keys. Multi-Region keys provide consistent key material across Regions while maintaining independent key infrastructure in each Region.</p> \n<p>Before replicating IAM Identity Center to an additional Region, you must first replicate the customer managed AWS KMS key to that Region and configure the replica key with the permissions required for IAM Identity Center operations. For instructions on creating multi-Region replica keys, refer to <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/identity-center-customer-managed-keys.html#replicate-kms-key?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">Create multi-Region replica keys</a> in the AWS KMS Developer Guide.</p> \n<p>Go to the <a href=\"https://console.aws.amazon.com/singlesignon/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">IAM Identity Center console</a> in the primary Region, for example, US East (N. Virginia), choose <strong>Settings</strong> in the left-navigation pane, and select the <strong>Management</strong> tab. Confirm that your configured encryption key is a multi-Region customer managed AWS KMS key. To add more Regions, choose <strong>Add Region</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/29/2026-idc-multiRegion-1.png\" alt=\"\" width=\"1382\" height=\"628\" /></p> \n<p>You can choose additional Regions to replicate the IAM Identity Center in a list of the available Regions. When choosing an additional Region, consider your intended use cases, for example, data compliance or user experience.</p> \n<p>If you want to run AWS managed applications that access datasets limited to a specific Region for compliance reasons, choose the Region where the datasets reside. If you plan to use the additional Region to deploy AWS applications, verify that the required <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/awsapps-that-work-with-identity-center.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">applications support</a> your chosen Region and deployment in additional Regions.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/16/2026-idc-multiRegion-2.png\" alt=\"\" width=\"1350\" height=\"742\" /></p> \n<p>Choose <strong>Add Region</strong>. This starts the initial replication whose duration depends on the size of your Identity Center instance.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/29/2026-idc-multiRegion-3.png\" alt=\"\" width=\"1140\" height=\"271\" /></p> \n<p>After the replication is completed, your users can access their AWS accounts and applications in this new Region. When you choose <strong>View ACS URLs</strong>, you can view <a href=\"https://docs.oasis-open.org/security/saml/Post2.0/sstc-saml-tech-overview-2.0.html\">SAML</a> information, such as an Assertion Consumer Service (ACS) URL, about the primary and additional Regions.</p> \n<p><strong><u>How your workforce can use an additional Region</u></strong><br /> AWS Identity Center supports SAML single sign-on with external IdPs, such as Microsoft Entra ID and Okta. Upon authentication in the IdP, the user is redirected to the AWS access portal. To enable the user to be redirected to the AWS access portal in the newly added Region, you need to add the additional Region’s ACS URL to the IdP configuration.</p> \n<p>The following screenshots show you how to do this in the Okta admin console:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/02/05/2026-idc-multiRegion-4-1.png\" alt=\"\" width=\"2132\" height=\"1406\" /></p> \n<p>Then, you can create a bookmark application in your identity provider for users to discover the additional Region. This bookmark app functions like a browser bookmark and contains only the URL to the AWS access portal in the additional Region.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/22/2026-idc-multiRegion-4-1-1.png\" alt=\"\" width=\"1970\" height=\"888\" /></p> \n<p>You can also deploy AWS managed applications in additional Regions using your existing deployment workflows. Your users can access applications or accounts using the existing access methods, such as the <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/multi-region-workforce-access.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS access portal</a>, an application link, or through the <a href=\"https://aws.amazon.com/cli/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS Command Line Interface (AWS CLI)</a>.</p> \n<p>To learn more about which AWS managed applications support deployment in additional Regions, visit the <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/awsapps-that-work-with-identity-center.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">IAM Identity Center User Guide</a>.</p> \n<p><strong><u>Things to know</u></strong><br /> Here are key considerations to know about this feature:</p> \n<ul> \n <li><strong>Consideration</strong> – To take advantage of this feature at launch, you must be using an organization instance of IAM Identity Center connected to an external IdP. Also, the primary and additional Regions must be enabled by default in an AWS account. Account instances of IAM Identity Center, and the other two identity sources (Microsoft Active Directory and IAM Identity Center directory) are presently not supported.</li> \n <li><strong>Operation</strong> – The primary Region remains the central place for managing workforce identities, account access permissions, external IdP, and other configurations. You can use the IAM Identity Center console in additional Regions with a limited feature set. Most operations are read-only, except for application management and user session revocation.</li> \n <li><strong>Monitoring</strong> – All workforce actions are emitted in <a href=\"https://aws.amazon.com/cloudtrail/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS CloudTrail</a> in the Region where the action was performed. This feature enhances account access continuity. You can set up <a href=\"https://docs.aws.amazon.com/whitepapers/latest/organizing-your-aws-environment/break-glass-access.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">break-glass access</a> for privileged users to access AWS if the external IdP has a service disruption.</li> \n</ul> \n<p><strong><u>Now available<br /> </u></strong>AWS IAM Identity Center multi-Region support is now available in the <a href=\"https://docs.aws.amazon.com/accounts/latest/reference/manage-acct-regions.html#manage-acct-regions-regional-availability?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">17 enabled-by-default commercial AWS Regions</a>. For Regional availability and a future roadmap, visit the <a href=\"https://builder.aws.com/build/capabilities/explore?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\" target=\"_blank\">AWS Capabilities by Region</a>. You can use this feature at no additional cost. Standard <a href=\"https://aws.amazon.com/kms/pricing/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS KMS charges</a> apply for storing and using customer managed keys.</p> \n<p>Give it a try in the <a href=\"https://console.aws.amazon.com/singlesignon/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS Identity Center console</a>. To learn more, visit the <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/multi-region-iam-identity-center.html?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">IAM Identity Center User Guide</a> and send feedback to <a href=\"https://repost.aws/tags/TAJNFEvp8UQUaLplKZtOsAaw/aws-iam-identity-center?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">AWS re:Post for Identity Center</a> or through your usual AWS Support contacts.</p> \n<p>— <a href=\"https://linkedin.com/in/channy/\">Channy</a></p> \n<p><strong>Updated on February 5th</strong> — Fixed the Okta admin console screenshot.</p>","author":"Channy Yun (윤석찬)","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"570ef5316f8d1cd762629c5576b8fffcd32cf6eb1d83b0cef750f3b97b95c38d","category":"Tech"}