{"title":"'It's changed me as a man': Lenny Martinez – France’s Tour hope doing things his own non-French way","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-want-to-discover-everything-lenny-martinez-france-s-tour-de-france-hope-doing-things-his-own-non-french-way","date":1770123232000,"content":"\n      <p><span>Being a French climber is a notoriously thankless task. A country starved of success in its own Grand Tour demands, expects and begs for riders with the ability to tame the mountains to finally banish the demons of a <a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a> winning drought that now stretches beyond 40 years. So many have promised since <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/bernard-hinault-interview-part-1-hunting-for-the-badger?srsltid=AfmBOooY_ovsrNHevfVDDdaYy3CH_e4fNI1-_Mu78sE76T0FCD6LHwT7\" target=\"_blank\">Bernard Hinault claimed France’s last yellow jersey i</a>n 1985, and many have succeeded in their own particular way, but all have failed to replicate Hinault and the other 20 Frenchman to win the biggest race of all.</span><b></b></p>\n<p><span>So Lenny Martinez, part of the latest generation to shoulder the burden, decided to be distinctly different. Quite aside from his Spanish surname, inherited from his Spain-born grandfather Mariano, Martinez left a French team last year, Groupama-FDJ, and signed for Bahrain-Victorious. And then upon signing for his new team, the 22-year-old opted against following a career as a GC rider and reasoned that stage hunting and mountain classifications would be his priority. He doesn’t need the additional stress of carrying an entire country’s GC hopes; that can fall to Paul Seixas, Decathlon CMA CGM’s prodigious 19-year-old.</span><b></b></p>\n<p><span>“I said to FDJ one year before I left that one day I wanted to change and that I didn’t want to stay in France as I wanted to discover everything. I didn’t want to be in a French team,” Martinez tells <em>Rouleur</em> on the eve of the 2026 season, his second year as a Bahrain-Victorious rider. “A lot of people say it’s different when you go to a non-French team but I said maybe I will change. It was a big shock with everything in English and I think this changed me as a man as well.”</span><b></b></p>\n<p><span>Diminutive, standing at 168cm [5ft 5in], and a lightweight whippet at 52kg, Martinez projects a maturity that belies his age and his young face. “I always try to do my best, but when I cannot, I cannot, and when I can, I can. It’s normal to have pressure from France and from the team – it’s good pressure also – but I just try to be myself,” he says. “Honestly, I enjoy winning stages more than going for the GC. GC is good but it’s more at the end [of the race] when you realise if you did good things. To win [a stage] is completely different. Last year I tried GC [in one-week races]. Sometimes it went OK like in Romandie [2nd] and Catalunya [5th] but sometimes it didn’t go so well, so I went instead for stages and I enjoyed that more.”</span><b></b></p>\n<p><span><img alt=\"\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_47_1_663ab72b-8d31-4fdc-8ca0-f0e59fc248a2.png?v=1769441068\" /><em>Martinez put up a valiant fight for the Tour de France's polka dot jersey in 2025, but lost out to overall winner Tadej Pogačar.</em></span></p>\n<p><span>Martinez is not the first in his family to represent his country on two wheels. In fact, he comes from quite the dynasty. His grandfather Mariano was the winner of the King of the Mountains jersey at the 1978 Tour de France; his father Miguel was for many years the finest mountain biker of his generation, winner of the gold medal at the 2000 Sydney Olympics and 10 World Cup races; and he also has a great uncle, an uncle (more below) and a cousin who also raced professionally. While Lenny – the eldest of two brothers – dabbled in running, golf, horse riding and hiking, he was mainly brought up on a diet of bikes and bike racing.</span><b></b></p>\n<p><span>“As a child we talked every day about cycling,” Martinez remembers. “At the start of my life I remember seeing my father racing in the summers at the MTB World Cups and I remember it was impressive, like wow moments. At the beginning I wasn't thinking that I’d be a cyclist, but when I was 14 I had a race and my Dad said, ‘You can win this one’. I started talking to him more about it and realised if I trained more I could win the week after, too. And then if I trained more again, I could win the second race. Bam, bam, bam, like this is how I started.”</span><b></b></p>\n<p><span>A few years later his uncle Yannick – a pro in the 2010s – also spotted that Martinez was naturally predisposed to excelling at bike racing. “My father’s brother loved training and analysing data and he told me to do a five and 20 minute test,” Martinez recalls. “He saw the results and said, ‘Oh, fuck, this is like WorldTour data’. I was only a junior. So I started thinking that maybe I could be a good climber.”</span><b></b></p>\n<p><span>Martinez turned pro with Groupama-FDJ in 2023 aged 19, and wasted no time in alerting others to his talents, including an increasingly captive home audience. A win on Mont Ventoux – a bucket list dream for any French rider – at the one-day race held in June was followed by a stint of two days in the lead of the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\" target=\"_blank\">Vuelta a España</a>. He went on to finish 24th in the Spanish Grand Tour, but for a few fleeting days the then-20-year-old was the darling of France, a country desperate for a new Hinault daring to believe that a new GC hope had been born. “Before I went to the Vuelta I wasn’t good in training and I said to my Mum, ‘Expect nothing from me this Vuelta’,” Martinez says. “She told me that every time I say that it never ends how I predicted and it didn’t this time; I almost won a stage and took the jersey. It was impressive.”</span><b></b></p>\n<p><span>Yet despite five wins in 2024 Martinez wanted to change his environment. He didn’t want to be a Frenchman trapped in a French world. Bahrain came calling – with a reported annual salary of €2.5m. “They explained to me the project they had with me and they wanted me so much. I said, ‘Fuck, this is nice’. They explained training, nutrition, things I did by myself with my last team but not with them, and now the team here do it for me. I have a place as a leader, good teammates, all the team around me, and it was a good decision.\"</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_48_1_18bbce67-335c-44d1-b6bc-91d9b33f35a2.png?v=1769441068\" alt=\"\" /><em>The latest Martinez to become a pro is an entertainer. </em></span></p>\n<p><span></span><span>His first season with his new employers saw him take stages in Paris-Nice, Critérium du Dauphiné and Tour de Romandie, while he also fought for the Tour de France’s King of the Mountains jersey, leading the competition for four days and ultimately finishing third. Again, at the Dauphiné, he surprised himself. “The morning of the stage I was sick, super shit, and was thinking I was not going to finish the stage,” he recalls. “But we started, I started to feel a little better and I won the stage. Compared to the morning it was amazing how the body could change. Maybe now I know it’s good if I don't listen to myself!” </span></p>\n<p><span>A bad forecaster of his own success maybe, but a young man taking control of his own future, a future that promises more swashbuckling performances in the mountains, the Martinez way. “After last year I’ve realised I can win in climbs from four minutes to one hour,” he says. That’s an enormous range – the mark of an accomplished and capable all-round climber. “I want to feel like each year I’m better than the last. I won three WorldTour races last year and maybe it’s possible to win one bigger race this year. But to do a super good GC will be difficult I think.” It works best when the latest pro from the Martinez lineage follows his own path, not the one France wants for him. </span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"578cdedd95a3f343dfeb71a5283103cabf712404acd7b19f23687b233d0f477e","category":"Cycling"}