{"title":"When will CSS Grid Lanes arrive? How long until we can use it?","link":"https://webkit.org/blog/17758/when-will-css-grid-lanes-arrive-how-long-until-we-can-use-it/","date":1769076030000,"content":"<p>Anytime an exciting new web technology starts to land in browsers, developers want to know “when in the world am I going to be able to use this?”</p>\n<p>Currently, the finalized syntax for Grid Lanes is available in <a href=\"https://developer.apple.com/safari/resources/\">Safari Technology Preview</a>. Edge, Chrome and Firefox have all made significant progress on their implementations, so it’s going to arrive sooner than you think.</p>\n<p>Plus, you can start using it as soon as you want with progressive enhancement. This article will show you how.</p>\n<figure><img loading=\"lazy\" src=\"https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-scaled.webp\" alt=\"Web page of content items — each item is a group with an image, headline and text inside a card with rounded corners. The page is in a browser window on the left, with a layout created with Grid Lanes. The items have different aspect ratios, and nestle together into columns, where all of the content for each item can be seen. On the right, is another browser window with the same content — this time laid out in columns again, but also rows. In order for the items to fit into the rows, the photos have all been cropped into squares, the headlines are truncated to fit onto one line, and the teaser descriptions are all chopped to only be three paragraphs long. All the rest of the content is simply missing, not shown in order to force each item to be the same shape and size as the others. And fit on the grid. \" width=\"2560\" height=\"1436\" srcset=\"https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-scaled.webp 2560w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-300x168.webp 300w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-1024x574.webp 1024w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-768x431.webp 768w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-1536x862.webp 1536w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-2048x1149.webp 2048w\" /><figcaption>Deliver the layout on the left using Grid Lanes to browsers with support, while providing a fallback for other browsers.</figcaption></figure>\n<p>(If you haven’t heard of Grid Lanes yet, it’s a new tool for layout that makes it easy to create masonry-style layouts in CSS alone. Read <a href=\"https://webkit.org/blog/17660/introducing-css-grid-lanes/\">Introducing CSS Grid Lanes</a> to learn all about it. And read <a href=\"https://webkit.org/blog/17746/new-safari-developer-tools-provide-insight-into-css-grid-lanes/\">New Safari developer tools provide insight into CSS Grid Lanes</a> to learn about our new developer tooling that makes using Grid Lanes it even easier.)</p>\n<h2>Current status of implementations</h2>\n<p>Where are browsers in the process of getting ready to ship support for Grid Lanes? Let’s look at the progress that’s been made over the last seven years.</p>\n<h3>Firefox was first</h3>\n<p>It’s the team that was at Mozilla in 2019-2020 who wrote the original CSS Working Group Editor’s Draft for Grid level 3, proposing concrete ideas for how masonry-style layouts would work in CSS. The feature shipped in Firefox Nightly in very early 2020. Some of the syntax has since changed, but under the hood, the way this new layout feature relies on and expands CSS Grid is basically the same, which means much of the heavy lifting for implementing it in the Gecko layout engine is underway.</p>\n<p>Firefox does need to update their implementation (including updating to the new syntax and adding the new <code>flow-tolerance</code> property, among other things) but if you want to try it out in Firefox today, you can enter <code>about:config</code> in the URL bar, search for “masonry” and set the flag to true — or use Firefox Nightly where it’s already on by default. (At the moment, remember to use the original <code>grid-template-*: masonry</code> syntax to trigger this layout, instead of <code>display: grid-lanes</code>.)</p>\n<h3>Safari picked up the pace</h3>\n<p>In 2022, Safari’s WebKit team picked up where Mozilla left off in 2020, and started implementing the same original proposal for CSS Grid Layout Level 3. We also restarted the discussion inside the CSS Working Group, hoping to advance the original Editor’s Draft to a point where it was mature enough that browsers could feel confident shipping.</p>\n<p>The WebKit implementation was enabled on-by-default in Safari Technology Preview 163 in February 2023. It’s been updated continuously as the CSS specification has changed.</p>\n<p>You can use Safari Technology Preview today to try out <a href=\"https://www.w3.org/TR/css-grid-3/\">the official web standard</a>, make demos using <code>display: grid-lanes</code>, and learn how it works. Keep an eye on the <a href=\"https://developer.apple.com/documentation/safari-release-notes\">Safari Release notes</a> to see when it ships in Safari beta.</p>\n<figure><img loading=\"lazy\" src=\"https://webkit.org/wp-content/uploads/Grid-3-spec-light-scaled.webp\" alt=\"Screenshot of webpage for CSS Grid Layout Module level 3 specification.\" width=\"2560\" height=\"1811\" srcset=\"https://webkit.org/wp-content/uploads/Grid-3-spec-light-scaled.webp 2560w, https://webkit.org/wp-content/uploads/Grid-3-spec-light-300x212.webp 300w, https://webkit.org/wp-content/uploads/Grid-3-spec-light-1024x724.webp 1024w, https://webkit.org/wp-content/uploads/Grid-3-spec-light-768x543.webp 768w, https://webkit.org/wp-content/uploads/Grid-3-spec-light-1536x1086.webp 1536w, https://webkit.org/wp-content/uploads/Grid-3-spec-light-2048x1449.webp 2048w\" /><figcaption>Grid Lanes is defined in <a href=\"https://www.w3.org/TR/css-grid-3/\">CSS Grid Layout Module Level 3</a>.</figcaption></figure>\n<h3>Chrome &amp; Edge are on board, too</h3>\n<p>A variation for how masonry layouts could work in CSS <a href=\"https://developer.chrome.com/blog/masonry-update\">landed in Chrome and Edge 140</a> behind a flag in July 2025. Rather than implementing the same syntax as Safari and Firefox, Chromium experimented with an alternative proposal. This drove debates in the CSSWG about how exactly this feature should work and what its syntax should be. With key syntax decisions now finalized, Chromium engineers at Edge are updating their implementation. Keep an eye <a href=\"https://chromestatus.com/feature/5149560434589696\">on the Chrome Status issue</a> for the latest news.</p>\n<p>Bottom line — all the major browser engines are making progress. Now is a great time to learn <a href=\"https://webkit.org/blog/17660/introducing-css-grid-lanes/\">how Grid Lanes works</a>. And consider if, when and how you could start using it.</p>\n<h2>Yes, you can start using it kinda soon-ish</h2>\n<p>Great developers are always mindful of users whose browsers don’t have support. Not only does it take time for all browsers to ship new features, it takes time for all users to update. But this does not mean you have to wait multiple years before using new technologies. It just means you just have to be savvy.</p>\n<p>You can progressively enhance your code to create masonry-style layouts, and support older browsers, both at the same time. How? As always, there are multiple options. Which choice is best for you depends on your use case, your team, and your code base. Let’s go through three different approaches you could use:</p>\n<h3>Option 1: Polyfill — use a JavaScript library as a backup for Grid Lanes</h3>\n<p>One common trick for using a new CSS feature when it’s still not available in all browsers is to use a <a href=\"https://en.wikipedia.org/wiki/Polyfill_(programming)\">polyfill</a> — i.e.: use JavaScript to fill in the missing functionality.</p>\n<p>Lucky for you, there are already tried and true JS libraries out in the world for creating masonry layouts. <a href=\"https://masonry.desandro.com/\">Masonry.js</a> is a popular one. Perhaps you are using it now. You can keep using it by itself, and ignore Grid Lanes. Or you can switch to using the JS library as a polyfill.</p>\n<p>The approach here is to go ahead and use CSS Grid Lanes to handle the layout in CSS alone — in browsers with support for Grid Lanes, even if that’s still only preview browsers. At the same time, architect your code to also work with a JavaScript library. Test in a browser <a href=\"https://caniuse.com/css-grid-lanes\">without support</a> for Grid Lanes to make sure the JS layout works.</p>\n<p>The key is to structure your code with conditionals, so browsers with Grid Lanes support use CSS, while those without use JS. In your CSS, use <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/Guides/Conditional_rules/Using_feature_queries\">Feature Queries</a> to ensure the right CSS is used under the right conditions. In JavaScript, use <code>if</code> statements.</p>\n<p>For example, you can structure your CSS like this:</p>\n<pre><code><span>/* Native Grid Lanes for supporting browsers */</span>\n<span>@supports</span> (<span>display</span>: <span>grid-lanes</span>) {\n  .<span>grid</span> {\n    <span>display</span>: <span>grid-lanes</span>;\n    <span>grid-template-columns</span>: <span>repeat</span>(<span>auto-fill</span>, <span>minmax</span>(<span>200px</span>, <span>1</span><span>fr</span>));\n    <span>gap</span>: <span>1</span><span>lh</span>;\n  }\n}\n\n<span>/* Additional CSS needed only for browsers without Grid Lanes */</span>\n<span>@supports</span> <span>not</span> (<span>display</span>: <span>grid-lanes</span>) {\n  .<span>grid-item</span> {\n    <span>margin</span>: <span>1</span><span>lh</span>;\n  }\n  <span>/* Perhaps also include a fallback layout in case JS doesn't run */</span>\n}\n</code></pre>\n<p>Then in JavaScript, you can check to see whether or not Grid Lanes is supported. If not, load the file. And then start using Masonry JS (or another library), according to its documentation.</p>\n<pre><code><span>// Check if CSS Grid Lanes is NOT supported\n</span><span>if</span> (<span>!</span><span>CSS</span>.<span>supports</span>(<span>'display'</span>, <span>'grid-lanes'</span>)) {\n\n    <span>// Dynamically load masonry.js\n</span>    <span>const</span> <span>script</span> <span>=</span> <span>document</span>.<span>createElement</span>(<span>'script'</span>);\n    <span>script</span>.<span>src</span> <span>=</span> <span>'https://unpkg.com/masonry-layout@4/dist/masonry.pkgd.min.js'</span>;\n    <span>script</span>.<span>onload</span> <span>=</span> <span>function</span>() {\n\n    <span>// Use Masonry.js after the script loads\n</span>    <span>new</span> <span>Masonry</span>(<span>'.grid'</span>, {\n        <span>itemSelector</span><span>:</span> <span>'.grid-item'</span>,\n        <span>columnWidth</span><span>:</span> <span>200</span>,\n    });\n    };\n    <span>document</span>.<span>head</span>.<span>appendChild</span>(<span>script</span>);\n}\n</code></pre>\n<p>It’s important to conditionally load the JS library only if the browser doesn’t support Grid Lanes. There’s no reason to have all users download and run the JS file when some percent don’t need it. That percentage might be small today (even zero), but over time it will grow to 100%.</p>\n<p>Save future you the task of having to change your code later. Structure it today so in a future when all users have Grid Lanes, no one has to do anything. Users get the best experience, even if no one on your team ever cleans out the old code.</p>\n<p>With this technique, browsers with Grid Lanes support use pure CSS, while older browsers load and use JavaScript. By switching to using the JavaScript library a polyfill, not as the primary layout mechanism, increasing numbers of users will get the benefit of a faster and more robust layout sooner.</p>\n<p>Of course, maybe this won’t work for your project. Maybe it’s too complicated to architect your HTML and surrounding layout to work for both Grid Lanes and a masonry library at the same time. So what are the other options?</p>\n<h3>Option 2: Don’t use Grid Lanes — use another layout in CSS instead</h3>\n<p>Of course, you might be screaming “it’s too early to use Grid Lanes!” There is always the option of simply waiting to use a new technology. Perhaps another layout mode in CSS like Grid level 1, Flexbox or Multicolumn are good enough for your needs. And you can hold off using any tool for accomplishing a masonry-style layout until you feel more confident about Grid Lanes.</p>\n<p>CSS Multicolumn is an interesting option that you might not be familiar with. It shipped in browsers decades ago (before Can I Use kept track). With <a href=\"https://www.w3.org/1999/06/WD-css3-multicol-19990623\">origins</a> that date back to the 1990s, Multicolumn suffered from the fate of most early CSS — the specification was not detailed enough, and that resulted in a lot of differences between browser implementations. This frustrated developers, resulting in Multicolumn falling out of favor.</p>\n<p>In more recent years, <a href=\"https://drafts.csswg.org/css-multicol-1/\">Multicolumn level 1</a> has gotten a lot of love, and the specification now contains far more detail. This has helped browsers squash interop bugs. There’s even a <a href=\"https://drafts.csswg.org/css-multicol-2/\">Multicolumn level 2</a> specification bringing new features in the future. There’s still more work to do to create true interoperability, but it’s worth <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/Guides/Multicol_layout\">reconsidering Multicolumn</a> to see if can solve your use case today.</p>\n<p>Multicolumn and Grid Lanes can result in very similar-looking layouts. They are fundamentally different, however, in the way content flows. These differences impact the order of what comes into focus when tabbing through content, readability / scanability, and user experience. So consider carefully.</p>\n<figure><img loading=\"lazy\" src=\"https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-scaled.webp\" alt=\"graphic comparing Grid Lanes layout vs Multicolumn. Two browser windows side by side. The layouts are basically the same visually, but Grid Lanes flows the content across the page, keeping 20 items above the bottom edge of the viewport. Multicolumn pours the items 1 to 5 down the first column, then starts the next column with the 16th item, showing 16-19... etc. Where is item 6-15? Not on screen. \" width=\"2560\" height=\"1434\" srcset=\"https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-scaled.webp 2560w, https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-300x168.webp 300w, https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-1024x574.webp 1024w, https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-768x430.webp 768w, https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-1536x860.webp 1536w, https://webkit.org/wp-content/uploads/Grid-vs-Multicolumn-light-2048x1147.webp 2048w\" /></figure>\n<p>Try out the <a href=\"https://webkit.org/demos/grid3/\">demos we created</a> to compare how Multicolumn and Grid Lanes work. Select different layouts from the dropdown menus, and turn on item numbers to emphasize the difference.</p>\n<h3>Option 3: Use Grid Lanes — along with a fallback layout in CSS</h3>\n<p>While “don’t use Grid Lanes” is always an option, perhaps the best approach is to write your code so that Grid Lanes is used when supported, and another layout mode in CSS is used as the fallback. This avoids using JavaScript for layout, while still delivering the newer layout to the users who do have support.</p>\n<p>For example, let’s imagine we want to use Grid Lanes, and leverage CSS Grid (level 1) when Grid Lanes isn’t supported. To make the original Grid layout work, can use CSS to force all the items be the same aspect ratio by cropping images and truncating text.</p>\n<p>To do this, we can apply layout to the container using the <code>display</code> property — twice. First we’ll declare <code>display: grid</code>, then we’ll immediately declare <code>display: grid-lanes</code>.</p>\n<pre><code><span>.grid-container</span> {\n  <span>display</span>: <span>grid</span>;\n  <span>display</span>: <span>grid-lanes</span>; <span>/* will override grid in browsers that support */</span>\n  <span>grid-template-columns</span>: <span>repeat</span>(<span>auto-fill</span>, <span>minmax</span>(<span>200px</span>, <span>1</span><span>fr</span>));\n  <span>gap</span>: <span>1</span><span>lh</span>;\n}\n</code></pre>\n<p>In browsers that support Grid Lanes, the second declaration will override the first. The <code>display: grid</code> rule will be ignored. And the layout will use Grid Lanes, resulting in a layout that packs content of different aspect ratios into a set of columns.</p>\n<p>In browsers that do not support Grid Lanes, the browser will ignore the second declaration. It sees <code>display: grid-lanes</code> and goes “what? That’s not a thing. You must have misspelled something. Ignore!” This leaves <code>grid</code> as the layout that’s applied. The content will be laid out into clear rows as well as columns.</p>\n<p>This is a tried and true technique that’s been used by developers for over two decades — relying on the fact that CSS just ignores anything it doesn’t understand. It does not throw an error message. It does not stop parsing. It just ignores that line of code and moves along.</p>\n<p>We can also use a <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/Guides/Conditional_rules/Using_feature_queries\">Feature Query</a> to write code that only gets applied in browsers without support for Grid Lanes. Let’s use the <code>aspect-ratio</code> property to force all images into the same aspect ratio. And use <code>object-fit: cover</code> to crop those images to fit in the box, instead of letting them be squished.</p>\n<pre><code><span>/* Additional CSS for browsers without Grid Lanes support */</span>\n<span>@supports</span> <span>not</span> (<span>display</span>: <span>grid-lanes</span>) {\n  .<span>grid-item</span> {\n    <span>img</span> {\n      <span>aspect-ratio</span>: <span>1</span>; <span>/* resize every image into a square */</span>\n      <span>object-fit</span>: <span>cover</span>; <span>/* crop, don't squish the image */</span>\n    }\n    <span>h3</span> {\n      <span>white-space</span>: <span>nowrap</span>; <span>/* don't wrap the headline */</span>\n      <span>overflow</span>: <span>hidden</span>; <span>/* crop the extra */</span>\n      <span>text-overflow</span>: <span>ellipsis</span>; <span>/* add an ellipsis if it overflows */</span>\n    }\n    <span>p</span> {\n      <span>display</span>: <span>-webkit-box</span>; <span>/* current practice in all browsers */</span>\n      <span>-webkit-box-orient</span>: <span>vertical</span>;\n      <span>-webkit-line-clamp</span>: <span>3</span>; <span>/* clamps to this many lines of text */</span>\n      <span>overflow</span>: <span>hidden</span>;\n    }\n  }\n}\n</code></pre>\n<p>We can force our headline to not wrap with <code>white-space: nowrap</code>. Once the headline is on one line, we can hide whatever doesn’t fit with <code>overflow: hidden</code>. Then, <code>text-overflow: ellipsis</code> adds “…” to the end of what’s visible.</p>\n<p>When we want to truncate multi-line text to a specific number of lines, we can use the <code>-webkit-line-clamp</code> technique. While originally invented by the WebKit team long ago when prefixes were the best practice for browsers rolling out new ideas, today <code>-webkit-box</code>, <code>-webkit-box-orient</code> and <code>-webkit-line-clamp</code> are supported by all browsers. (No browser has shipped a replacement yet because a complete web standard for defining such a tool is still under debate.)</p>\n<figure><img loading=\"lazy\" src=\"https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-scaled.webp\" alt=\"This is the exact same image from the opening of the article. Web page of content items — each item is a group with an image, headline and text inside a card with rounded corners. The page is in a browser window on the left, with a layout created with Grid Lanes. The items have different aspect ratios, and nestle together into columns, where all of the content for each item can be seen. On the right, is another browser window with the same content — this time laid out in columns again, but also rows. In order for the items to fit into the rows, the photos have all been cropped into squares, the headlines are truncated to fit onto one line, and the teaser descriptions are all chopped to only be three paragraphs long. All the rest of the content is simply missing, not shown in order to force each item to be the same shape and size as the others. And fit on the grid. \" width=\"2560\" height=\"1436\" srcset=\"https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-scaled.webp 2560w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-300x168.webp 300w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-1024x574.webp 1024w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-768x431.webp 768w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-1536x862.webp 1536w, https://webkit.org/wp-content/uploads/Grid-Lanes-with-Grid-fallback-2048x1149.webp 2048w\" /></figure>\n<p>This approach results in a masonry-style waterfall layout being delivered to the browsers that support Grid Lanes, while a more traditional layout of equal-sized boxes are delivered using CSS Grid level 1 to browsers that don’t yet support Grid Lanes.</p>\n<h3>It’s up to you</h3>\n<p>It’s totally up to you how you want to handle the fallback for a lack of support for Grid Lanes, but you definitely have options. This is one of the benefits of writing CSS, and not just using a 3rd-party utility framework that abstracts all the flexibility away. Progressive enhancement techniques bring the future into the present, and let you start using Grid Lanes far sooner!</p>\n<h2>Learn more about Grid Lanes</h2>\n<p>This is our third article in a series about Grid Lanes. The first introduces CSS Grid Lanes, explaining what it is and how to use it (and yes, it can be used “in the other direction”). The second article shows off our new developer tools and explains why they are particularly helpful for setting flow tolerance. Also, check out our demos in Safari Technology Preview. And be sure to come back to <a href=\"http://webkit.org/\">webkit.org</a> soon for more articles about Grid Lanes.</p>\n<ol>\n<li><a href=\"https://webkit.org/blog/17660/introducing-css-grid-lanes/\">Introducing CSS Grid Lanes</a> </li>\n<li><a href=\"https://webkit.org/blog/17746/new-safari-developer-tools-provide-insight-into-css-grid-lanes/\">New Safari developer tools provide insight into CSS Grid Lanes</a></li>\n<li><a href=\"https://webkit.org/demos/grid3/\">Demos of Grid Lanes</a></li>\n</ol>","author":"","siteTitle":"Blog – WebKit","siteHash":"7f8dbea0b8f53db2e11a2faa08c6dca9954c01638d09a2ce585b77a60d10f7a1","entryHash":"584d6db422f9f4ecd3bf0cbde25c7fff00472cdb0e98415adb291697a50a09f9","category":"Tech"}