{"title":"Vault Radar 2025 recap: Expanding visibility, deepening integration, and simplifying security","link":"https://www.hashicorp.com/blog/vault-radar-2025-recap-expanding-visibility-deepening-integration-simplifying-security","date":1771257600000,"content":"<p>As organizations face growing complexity across their development and security workflows, HCP Vault Radar helps simplify one of the hardest challenges in modern DevSecOps: finding, fixing, and preventing <a href=\"https://www.hashicorp.com/en/resources/what-is-secret-sprawl-why-is-it-harmful\">secret sprawl</a>.</p>\n\n<h2>Launching Vault Radar</h2>\n\n<p>Our mission from day one was clear: make secrets discovery and remediation simple, accurate, and deeply integrated into the workflows teams already use.</p>\n\n<p>Vault Radar introduces a modern approach to secrets discovery and remediation by empowering security and platform teams to continuously detect unmanaged secrets across their ecosystem and bring them under centralized management with HashiCorp Vault.</p>\n\n<p>Together, Vault and Vault Radar help teams close the loop between visibility and control, uncovering where secrets exist, preventing new exposures from entering developer tools, and enforcing secure management practices without slowing down development.</p>\n\n<p>Since launching Vault Radar, we’ve integrated capabilities across all core components — detection, remediation, and governance — helping organizations strengthen their security posture without sacrificing developer speed.</p>\n\n<p><strong>Below are the key milestones that showcase Vault Radar’s evolution since launch:</strong></p>\n\n<h3>Expanding visibility across the ecosystem</h3>\n\n<p>Throughout 2025, we expanded Radar’s visibility to follow where secrets actually are. Development environments are complex. Secrets no longer just live in one place. They surface in code repositories, collaboration tools, across production infrastructure.</p>\n\n<p>Since the GA of Vault Radar, we’ve introduced key integrations that extend coverage, including:</p>\n\n<ul>\n<li><strong>Jira scanning</strong> to detect credentials shared in collaboration spaces</li>\n<li><strong>VS Code integration</strong> to surface risks and guide remediation directly within the developer workflow</li>\n<li><strong>Amazon S3 scanning</strong> to detect exposed secrets within S3 buckets, logs, and configuration archives to close critical cloud visibility gaps.</li>\n<li><strong>Slack scanning</strong> to identify credentials shared across channels, messages, or attachments.</li>\n<li><strong>AWS Secrets Manager correlation</strong> to automatically detect when secrets stored in AWS Secrets Manager are duplicated or exposed inside or outside AWS-native services.</li>\n</ul>\n\n<p>These capabilities make it easier for teams to detect exposures in real time, streamline remediation, and prevent leaks before they reach production.</p>\n\n<p><strong>The result: Unified coverage across the tools developers use every day, faster detection at the source, and stronger alignment between security and engineering workflows.</strong></p>\n<img src=\"https://www.datocms-assets.com/2885/1771256655-scan-new-data-source-radar.png\" alt=\"Choosing\" /><h2>Shifting security left: Empowering developers in VS Code</h2>\n\n<p>Vault Radar’s VS Code extension extends the detect-and-remediate-early philosophy by directly identifying risks where they originate - the developer’s workspace. Instead of waiting for a post-commit scan, engineers now see secret exposure in real time as they write code.</p>\n\n<p>This change embodies a simple but powerful principle: the fastest fix is the one made before a vulnerability ever leaves the editor. By embedding secret detection into daily development, Vault Radar helps teams eliminate leaks at the source, reduce downstream incidents, and build a stronger security culture without disrupting delivery speed.</p>\n\n<p><em>You can install the HCP Vault Radar extension for Visual Studio Code from the <a href=\"https://marketplace.visualstudio.com/items?itemName=hashicorp.vault-radar\">Visual Studio Code Marketplace</a>.</em></p>\n\n<p><strong>The result: Holistic visibility across code, collaboration, and cloud platforms, reducing blind spots early on.</strong></p>\n\n<h2>Strengthening cloud control: Correlating secrets across AWS</h2>\n\n<p>Vault Radar’s AWS Secrets Manager correlation feature extends the principle of “detect early, remediate intelligently” into the cloud layer. As organizations scale their AWS footprint, secrets often move between applications, services, and automation pipelines.</p>\n\n<p>With AWS Secret Manager correlation, Vault Radar automatically detects when secrets are securely stored in AWS Secrets Manager but have been mishandled. It gives security teams clear, actionable insight into where AWS-managed secrets appear across their environment, making it easier to verify proper usage and contain exposure quickly.</p>\n\n<p><strong>The result: Faster remediation, and complete visibility into how managed secrets move across distributed AWS environments, without adding operational complexity.</strong></p>\n<img src=\"https://www.datocms-assets.com/2885/1771256731-radar-event-summary.png\" alt=\"Vault\" /><h2>From discovery to action: Closing the loop with Vault</h2>\n\n<p>The year’s biggest advancement came from deep integration with Vault, enabling <a href=\"https://developer.hashicorp.com/hcp/docs/vault-radar/remediate-secrets\">direct remediation</a> of detected secrets. Teams can correlate discovered secrets with managed secrets in Vault and automatically import them for rotation or revocation. This allows security teams to move directly from detection to secure management.</p>\n\n<p>This turns Vault Radar into more than a scanning tool. It’s now a control point in the secret lifecycle, bridging the gap between finding exposed credentials and ensuring they are properly managed, revoked, and replaced.</p>\n\n<p><strong>The result: Fewer unmanaged secrets, shorter exposure windows, and a direct path from detection to remediation.</strong></p>\n\n<h2>Seamless orchestration: Responding faster with webhooks</h2>\n<img src=\"https://www.datocms-assets.com/2885/1771256794-vault-radar-integration.png\" alt=\"Vault\" /><p>Security works best when it fits the way teams operate. The introduction of <a href=\"https://developer.hashicorp.com/hcp/docs/vault-radar/get-started/set-up-alerting/webhooks/set-up\">webhooks</a> allowed Vault Radar to stream real-time alerts into any external system, from incident-response/monitoring dashboards, messaging platforms, ticketing systems, and other custom integrations like Datadog or bespoke alerting tools.</p>\n\n<p>This flexibility enables teams to automate workflows, synchronize responses, and align detection with their operational context. Instead of forcing teams to adapt to Vault Radar, Radar now adapts to them, embedding security directly into their existing processes.</p>\n\n<p><strong>The result: Faster incident response, fewer manual handoffs, and fully integrated security workflows.</strong></p>\n\n<h2>AI readiness: Enabling agentic workflows with the MCP Server</h2>\n\n<p>As AI becomes embedded in operations, visibility must evolve with it. Vault Radar’s new MCP Server opened Radar data to agentic AI workflows, allowing intelligent systems to query, reason, and act on live security context.</p>\n\n<p>Through the MCP interface, AI agents can access structured data about detected risks, severity, and remediation, enabling use cases like automated triage, risk scoring, and prioritization. </p>\n\n<p><em>The Vault Radar MCP server supports all MCP clients.</em></p>\n\n<p>This shift marks Vault Radar’s first step into AI-augmented security, not just detecting risks but empowering intelligent systems to triage risks autonomously and at scale.</p>\n\n<p><strong>The result: smarter analysis, faster decision-making, and a foundation for AI-driven security operations.</strong></p>\n\n<h2>Built for scale: A platform ready for enterprise depth</h2>\n\n<p>Every feature in 2025 shared a single design principle: enterprise scalability without complexity. Vault Radar now supports  hundreds of thousands of active repositories, stronger hybrid deployments, and more consistent performance across large data sets.</p>\n\n<p>These improvements make Vault Radar ready for any environment: global, distributed, and fast-moving. With integrations that span the developer lifecycle and an architecture built for scale, Vault Radar delivers resilience that meets enterprise expectations.</p>\n\n<h2>Looking ahead to 2026</h2>\n\n<p>Vault Radar’s first full year was shaped by collaboration and feedback from our customers. We focused on connection between systems, teams, and moments in the development lifecycle, and built Vault Radar to be an intelligent, integrated layer of the HashiCorp Security Lifecycle Management platform. By unifying remediation with Vault, embedding prevention in the IDE, expanding coverage to new data sources, and integrating with AI and automation frameworks, Vault Radar meets teams exactly where they work.</p>\n\n<p>Looking ahead, our work continues around three core priorities that reflect where customers need us most:</p>\n\n<ul>\n<li><strong>Automation and remediation:</strong> Seamless integration with Vault for end-to-end remediation, reporting, and continuous protection.</li>\n<li><strong>Ecosystem expansion:</strong> Broader coverage across enterprise platforms and AI-driven detection to stay ahead of emerging risk areas like non-human identities.</li>\n<li><strong>Enterprise readiness:</strong> Greater scalability, regional disaster recovery compliance, and a streamlined experience for distributed organizations.</li>\n</ul>\n\n<p><strong>Vault Radar detects. Vault governs. Together, they secure the lifecycle of every secret.</strong></p>\n\n<p>Start your <a href=\"https://portal.cloud.hashicorp.com/sign-up?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_MULTI_radar-2025-roundupl-blog&amp;utm_content=end-blog-cta&amp;utm_offer=signup\">free trial</a> of Vault Radar to explore the latest capabilities.</p>\n\n<p>You can also request a free <a href=\"https://www.hashicorp.com/en/lp/vault-radar-discovery-session?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_vault-radar-2025-roundup-blog_RADAR-DISCOVERY-SESSION&amp;utm_content=end-blog-cta&amp;utm_offer=radar-discovery-session\">Vault Radar discovery session</a> to talk with one of our experts. Together, we'll evaluate your approach and discover how Vault Radar can help your teams.</p>\n","author":"Chandni Patel","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"58ce1534b8c67c4258768f51040b6e8db7c37688d4a13be497348a6517593b4c","category":"Tech"}