{"title":"How To Design For (And With) Deaf People","link":"https://smashingmagazine.com/2025/12/how-design-for-with-deaf-people/","date":1767088800000,"content":"<p>When we think about people who are deaf, we often assume stereotypes, such as “disabled” older adults with <strong>hearing aids</strong>. However, this perception is far from the truth and often leads to poor decisions and broken products.</p>\n<p>Let’s look at when and how deafness emerges, and how to design better experiences <strong>for people with hearing loss</strong>.</p>\n<p><img src=\"https://files.smashing.media/articles/how-design-for-with-deaf-people/1-sign-language.jpg\" /></p>\nDeafness Is A Spectrum\n<p>Deafness spans a <strong>broad continuum</strong>, from minor to profound hearing loss. Around 90–95% of deaf people <a href=\"https://scholarworks.wmich.edu/jssw/vol51/iss1/11/\">come from hearing families</a>, and deafness often isn’t merely a condition that people are born with. It frequently occurs due to <strong>exposure to loud noises</strong>, and it also emerges with age, disease, and accidents.</p>\n<p><img src=\"https://files.smashing.media/articles/how-design-for-with-deaf-people/2-chart-sound-frequencies-decibel-levels.jpg\" /></p>\n<p>The loudness of sound is measured in units called <strong>decibels (dB)</strong>. Everybody is on the <a href=\"https://www.didyousaydeaf.com/hearing-loss-and-how-hearing-loss-works\">spectrum of deafness</a>, from normal hearing (up to 15 dB) to profound hearing loss (91+ dB):</p>\n<ul>\n<li><strong>Slight Hearing Loss</strong>, 16–25 dB<br />At 16 dB hearing loss, a person can miss up to 10% of speech when a speaker is at a distance greater than 3 feet. </li>\n<li><strong>Mild hearing loss</strong>, 26–40 dB<br />Soft sounds are hard to hear, including whispering, which is around 40 dB in volume. It’s more difficult to hear soft speech sounds spoken at a normal volume. At 40dB hearing loss, a person may miss 50% of meeting discussions. </li>\n<li><strong>Moderate hearing loss</strong>, 41–55 dB<br />A person may hear almost no speech when another person is talking at normal volume. At a 50dB hearing loss, a person may not pick up to 80% of speech. </li>\n<li><strong>Moderately Severe Hearing Loss</strong>, 56–70 dB<br />A person may have problems hearing the sounds of a dishwasher (60dB). At 70 dB, they might miss almost all speech. </li>\n<li><strong>Severe Hearing Loss</strong>, 71–90 dB<br />A person will hear no speech when a person is talking at a normal level. They may hear only some very loud noises: vacuum (70 dB), blender (78 dB), hair dryer (90 dB).</li>\n<li><strong>Profound Hearing Loss</strong>, 91+ dB<br />Hear no speech and at most very loud sounds such as a music player at full volume (100 dB), which would be damaging for people with normal hearing, or a car horn (110 dB). </li>\n</ul>\n<p>It’s worth mentioning that loss of hearing can also be situational and temporary, as people with “normal” hearing (0 to 25 dB hearing loss) will always encounter situations where they can’t hear, e.g., due to <strong>noisy environments</strong>.</p>\nUseful Things To Know About Deafness\n<p>Assumptions are always dangerous, and in the case of deafness, there are quite a few that aren’t accurate. For example, most deaf people actually do not know a sign language — it’s only around <a href=\"https://www.accessibility.com/blog/do-all-deaf-people-use-sign-language\">1% in the US</a>.</p>\n<p>Also, despite our expectations, there is actually <strong>no universal sign language</strong> that everybody uses. For example, British signers often cannot understand American signers. There are globally around <a href=\"https://education.nationalgeographic.org/resource/sign-language/\">300 different sign languages</a> actively used.</p>\n<blockquote>“We never question making content available in different written or spoken languages, and the same should apply to signed languages.”<br /><br />— <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7178702360649547778?commentUrn=urn%3Ali%3Acomment%3A%28activity%3A7178702360649547778%2C7178776416979718144%29&amp;dashCommentUrn=urn%3Ali%3Afsd_comment%3A%287178776416979718144%2Curn%3Ali%3Aactivity%3A7178702360649547778%29\">Johanna Steiner</a></blockquote>\n\n<p><img src=\"https://files.smashing.media/articles/how-design-for-with-deaf-people/3-heardio.jpg\" /></p>\n<p>Sign languages are <a href=\"https://www.youtube.com/watch?v=M0cR_HTeWUo&amp;t=188\">not just gestures or pantomime</a>. They are <strong>4D spatial languages</strong> with their own grammar and syntax, separate from spoken languages, and they don’t have a written form. They rely heavily on facial expression to convey meaning and emphasis. And they are also not universal — every country has its own sign language and dialects.</p>\n<ul>\n<li>You can only understand <strong>30% of words</strong> via lip-reading.</li>\n<li>Most deaf people do not know any <strong>sign language</strong>.</li>\n<li>Many sign languages have local dialects that can be hard to interpret.</li>\n<li>Not all deaf people are fluent signers and often rely on <strong>visual clues</strong>.</li>\n<li>For many deaf people, a spoken language is their <strong>second language</strong>.</li>\n<li><a href=\"https://www.youtube.com/watch?v=M0cR_HTeWUo\"><strong>Sign language is 4-dimensional</strong></a>, incorporating 3D space, time and also facial expressions.</li>\n</ul>\nHow To Communicate Respectfully\n<p>Keep in mind that many deaf people use the spoken language of their country as <strong>their second language</strong>. So to communicate with a deaf person, it’s best to ask in writing. Don’t ask how much a person can understand, or if they can lip-read you.</p>\n<p>However, as Rachel Edwards <a href=\"https://www.linkedin.com/posts/rachel-edwards-scotland_excellent-overview-on-designing-for-ddeaf-activity-7409172866983804928-489h?utm_source=share&amp;utm_medium=member_desktop&amp;rcm=ACoAAACDcgQBa_vsk5breYKwZAgyIhsHtJaFbL8\">noted</a>, don’t assume someone is comfortable with written language because they are deaf. Sometimes their literacy may be low, and so providing information as text and assuming that covers your deaf users might not be the answer.</p>\n<p>Also, don’t assume that every deaf person can lip-read. You can see only about 30% of words on someone’s mouth. That’s why many deaf people need <strong>additional visual cues</strong>, like text or cued speech.</p>\n<p><img src=\"https://files.smashing.media/articles/how-design-for-with-deaf-people/4-accessibility-symbols.png\" /></p>\n<p>It’s also crucial to use <strong>respectful language</strong>. Deaf people do not always see themselves as <em>disabled</em>, but rather as a cultural linguistic minority with a unique identity. Others, as Meryl Evan has <a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7178702360649547778?commentUrn=urn%3Ali%3Acomment%3A%28activity%3A7178702360649547778%2C7178721132345270272%29&amp;dashCommentUrn=urn%3Ali%3Afsd_comment%3A%287178721132345270272%2Curn%3Ali%3Aactivity%3A7178702360649547778%29\">noted</a>, don’t identify as <em>deaf</em> or <em>hard of hearing</em>, but rather as “hearing impaired”. So, it’s mostly up to an individual how they want to identify.</p>\n<ul>\n<li><strong>Deaf</strong> (Capital ‘D’)<br />Culturally Deaf people who have been deaf since birth or before learning to speak. Sign language is often the first language, and written language is the second.</li>\n<li><strong>deaf</strong> (Lowercase ‘d’)<br />People who developed hearing loss later in life. Used by people who feel closer to the hearing/hard-of-hearing world and prefer to communicate written and/or oral.</li>\n<li><strong>Hard of Hearing</strong><br />People with mild to moderate hearing loss who typically communicate orally and use hearing aids.</li>\n</ul>\n<p>In general, <strong>avoid hearing impairment</strong> if you can, and use <em>Deaf</em> (for those deaf for most of their lives), <em>deaf</em> (for those who became deaf later), or <em>hard of hearing</em> (HoH) for partial hearing loss. But either way, ask politely first and then respect the person’s preferences.</p>\nPractical UX Guidelines\n<p>When designing UIs and content, consider these key accessibility guidelines for deaf and hard-of-hearing users:</p>\n<p><img src=\"https://files.smashing.media/articles/how-design-for-with-deaf-people/5-designing-deaf-users.jpg\" /></p>\n<ol>\n<li><strong>Don’t make the phone required</strong> or the only method of contact.</li>\n<li><strong>Provide text alternatives</strong> for all audible alerts or notices.</li>\n<li><strong>Add haptic feedback</strong> on mobile (e.g., vibration patterns).</li>\n<li><strong>Ensure good lighting</strong> to help people see facial expressions.</li>\n<li><strong>Circular seating</strong> usually works better, so everyone can see each other’s faces.</li>\n<li><strong>Always include descriptions of non-spoken sounds</strong> (e.g., rain, laughter) in your content.</li>\n<li><strong>Add a transcript and closed captions</strong> for audio and video.</li>\n<li><strong>Clearly identify each speaker</strong> in all audio and video content.</li>\n<li><strong>Design multiple ways to communicate</strong> in every instance (online + in-person).</li>\n<li><strong>Invite video participants to keep the camera on</strong> to facilitate lip-reading and the viewing of facial expressions, which convey tone.</li>\n<li><strong>Always test products with the actual community</strong>, instead of making assumptions for them.</li>\n</ol>\nWrapping Up\n<p>I keep repeating myself like a broken record, but better accessibility <strong>always benefits everyone</strong>. When we improve experiences for some groups of people, it often improves experiences for entirely different groups as well.</p>\n<p>As Marie Van Driessche rightfully noted, to design a great experience for accessibility, we must design <strong>with</strong> people, rather than <em>for</em> them. And that means always include people with <strong>lived experience of exclusion</strong> into the design process — as they are the true experts.</p>\n<p>Accessibility never happens by accident — it’s a deliberate decision and a commitment.</p>\n<p>No digital product is neutral. There must be a deliberate effort to make products and services more accessible. Not only does it benefit everyone, but it also shows what a company stands for and values.</p>\n<p>And once you do have a commitment, it will be so much easier to <strong>retain accessibility</strong> rather than adding it last minute as a crutch — when it’s already too late to do it right and way too expensive to do it well.</p>\nMeet “Smart Interface Design Patterns”\n<p>You can find more details on <strong>design patterns and UX</strong> in <a href=\"https://smart-interface-design-patterns.com/\"><strong>Smart Interface Design Patterns</strong></a>, our <strong>15h-video course</strong> with 100s of practical examples from real-life projects — with a live UX training later this year. Everything from mega-dropdowns to complex enterprise tables — with 5 new segments added every year. <a href=\"https://www.youtube.com/watch?v=jhZ3el3n-u0\">Jump to a free preview</a>. Use code <a href=\"https://smart-interface-design-patterns.com\"><strong>BIRDIE</strong></a> to <strong>save 15%</strong> off.</p>\n<a href=\"https://smart-interface-design-patterns.com/\"><img src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7cc4e1de-6921-474e-a3fb-db4789fc13dd/b4024b60-e627-177d-8bff-28441f810462.jpeg\" /></a>Meet <a href=\"https://smart-interface-design-patterns.com/\">Smart Interface Design Patterns</a>, our video course on interface design &amp; UX.\n\n<div><div><ul><li><a href=\"#\">\nVideo + UX Training</a></li><li><a href=\"#\">Video only</a></li></ul><div><h3>Video + UX Training</h3>$ 495.00 $ 699.00\n<a href=\"https://smart-interface-design-patterns.thinkific.com/enroll/3081832?price_id=3951439\">\nGet Video + UX Training<div></div></a><p>25 video lessons (15h) + <a href=\"https://smashingconf.com/online-workshops/workshops/vitaly-friedman-impact-design/\">Live UX Training</a>.<br />100 days money-back-guarantee.</p></div><div><h3>Video only</h3><div>$ 300.00$ 395.00</div>\n<a href=\"https://smart-interface-design-patterns.thinkific.com/enroll/3081832?price_id=3950630\">\nGet the video course<div></div></a><p>40 video lessons (15h). Updated yearly.<br />Also available as a <a href=\"https://smart-interface-design-patterns.thinkific.com/enroll/3082557?price_id=3951421\">UX Bundle with 2 video courses.</a></p></div></div></div>\n\nUseful Resources\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=M0cR_HTeWUo\">Designing For Deaf People Helps Everyone</a>, by Marie Van Driessche</li>\n<li>“<a href=\"https://medium.com/@paulrobwest/ux-ui-design-considerations-for-the-deaf-deaf-and-hard-of-hearing-dbfe28850fbe\">Design considerations for the Deaf, deaf, and hard of hearing</a>”, by Paul Roberts </li>\n<li><a href=\"https://www.youtube.com/watch?v=AEXKOASrTVM\">Beyond Video Captions and Sign Language</a>, by Svetlana Kouznetsova</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/01/closed-captions-subtitles-ux/\">Best Practices For CC and Subtitles UX</a>”, by Vitaly Friedman</li>\n<li><a href=\"https://www.accessi.org/blog/web-accessibility-for-deaf-users/\">Web Accessibility for Deaf Users</a></li>\n<li><a href=\"https://www.inclusivedesigntoolkit.com/UChearing/hearing.html\">Inclusive Design Toolkit: Hearing</a></li>\n<li>“<a href=\"https://funkybrownchick.substack.com/p/i-hear-you-really-i-do-\">What It's Like To Be Born Hard of Hearing</a>”, by Twanna A. Hines, M.S.</li>\n<li>“<a href=\"https://uxplanet.org/podcasts-for-the-deaf-d4d9b5f3ce99\">Accessibility: Podcasts for the deaf</a>”, by Mubarak Alabidun</li>\n</ul>\n<h3>Useful Books</h3>\n<ul>\n<li><a href=\"https://audio-accessibility.com/book/\"><em>Sound Is Not Enough</em></a>, by Svetlana Kouznetsova</li>\n<li><em>Mismatch: How Inclusion Shapes Design</em>, by Kat Holmes</li>\n<li><em>Building for Everyone: Extend Your Product's Reach Through Inclusive Design</em> (+ <a href=\"https://design.google/library/building-for-everyone\">free excerpt</a>), by Annie Jean-Baptiste</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"5907a4b721188c59fce96f796771f7c68de3d4a0dccbe0e972d1582e2c9be9f7","category":"Tech"}