{"title":"AWS Weekly Roundup: Kiro CLI latest features, AWS European Sovereign Cloud, EC2 X8i instances, and more (January 19, 2026)","link":"https://aws.amazon.com/blogs/aws/aws-weekly-roundup-kiro-cli-latest-features-aws-european-sovereign-cloud-ec2-x8i-instances-and-more-january-19-2026/","date":1768868678000,"content":"<p>At the end of 2025 I was happy to take a long break to enjoy the incredible summers that the southern hemisphere provides. I’m back and writing my first post in 2026 which also happens to be my last post for the AWS News Blog (more on this later).</p> \n<p>The AWS community is starting the year strong with various AWS re:invent re:Caps being hosted around the globe, with some communities already hosting their <a href=\"https://aws.amazon.com/events/community-day/?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">AWS Community Day events</a>, the <a href=\"https://luma.com/gr8eck5u\">AWS Community Day Tel Aviv 2026</a> was hosted last week.</p> \n<table> \n <tbody> \n  <tr> \n   <td><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/19/IMG-20260116-WA0007-1024x682.jpg\" alt=\"\" width=\"1024\" height=\"682\" /></td> \n   <td><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/19/IMG-20260116-WA0006-1024x682.jpg\" alt=\"\" width=\"1024\" height=\"682\" /></td> \n  </tr> \n </tbody> \n</table> \n<p><span><strong>Last week’s launches</strong></span><br /> Here are last week’s launches that caught my attention:</p> \n<ul> \n <li><a href=\"https://kiro.dev/changelog/cli/1-24/?sc_channel=sm&amp;sc_publisher=LINKEDIN&amp;sc_country=global&amp;sc_geo=GLOBAL&amp;sc_outcome=awareness\">Kiro CLI latest features</a> – Kiro CLI now has granular controls for web fetch URLs, keyboard shortcuts for your custom agents, enhanced diff views, and much more. With these enhancements, you can now use allowlists or blocklists to restrict which URLs the agent can access, ensure a frictionless experience when working with multiple specialized agents in a single session, to name a few.</li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/opening-the-aws-european-sovereign-cloud/\">AWS European Sovereign Cloud</a> – Following <a href=\"https://aws.amazon.com/blogs/aws/in-the-works-aws-european-sovereign-cloud/\">an announcement in 2023 of plans to build a new, independent cloud infrastructure</a>, last week we announced the general availability of the AWS European Sovereign Cloud to all customers. The cloud is ready to meet the most stringent sovereignty requirements of European customers with a comprehensive set of AWS services.</li> \n <li><a href=\"https://aws.amazon.com/blogs/aws/amazon-ec2-x8i-instances-powered-by-custom-intel-xeon-6-processors-are-generally-available-for-memory-intensive-workloads/\">Amazon EC2 X8i instances</a> – <a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-x8i-instances-preview/?trk=d8ec3b19-0f37-4f8c-8c12-189f913e205c&amp;sc_channel=el\">Previously launched in preview at AWS re:Invent 2025</a>, last week we announced the general availability of new memory-optimized Amazon Elastic Compute Cloud (Amazon EC2) X8i instances. These instances are powered by custom Intel Xeon 6 processors with a sustained all-core turbo frequency of 3.9 GHz, available only on AWS. These SAP certified instances deliver the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud.</li> \n</ul> \n<p>For a full list of AWS announcements, be sure to keep an eye on the <a href=\"https://aws.amazon.com/new/?trk=769a1a2b-8c19-4976-9c45-b6b1226c7d20&amp;sc_channel=el\">What’s New with AWS?</a> page.</p> \n<p><span><strong>Additional updates</strong></span><br /> These projects, blog posts, and news articles also caught my attention:</p> \n<ul> \n <li><a href=\"https://www.linkedin.com/feed/update/urn:li:activity:7416901230293102592/\">5 core features in Amazon Quick Suite</a> – AWS VP Agentic AI Swami Sivasubramanian talks about how he uses Amazon Quick Suite for just about everything. In October 2025 we <a href=\"https://aws.amazon.com/blogs/aws/reimagine-the-way-you-work-with-ai-agents-in-amazon-quick-suite/\">announced Amazon Quick Suite</a>, a new agentic teammate that quickly answers your questions at work and turns insights into actions for you. Amazon Quick Suite has become one of my favorite productivity tools, helping me with my research on various topics in addition to providing me with multiple perspectives on a topic.</li> \n <li><a href=\"https://aws.amazon.com/blogs/machine-learning/deploy-ai-agents-on-amazon-bedrock-agentcore-using-github-actions/\">Deploy AI agents on Amazon Bedrock AgentCore using GitHub Actions</a> – Last year we announced Amazon Bedrock AgentCore, a flexible service that helps you seamlessly create and manage AI agents across different frameworks and models, whether hosted on Amazon Bedrock or other environments. Learn how to use a GitHub Actions workflow to automate the deployment of AI agents on AgentCore Runtime. This approach delivers a scalable solution with enterprise-level security controls, providing complete continuous integration and delivery (CI/CD) automation.</li> \n</ul> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/19/ml-19418-image-1-1.png\" alt=\"\" width=\"730\" height=\"403\" /></p> \n<p><span><strong>Upcoming AWS events</strong></span><br /> Join us January 28 or 29 (depending on your time zone) for <a href=\"https://aws.amazon.com/best-of-reinvent/\">Best of AWS re:Invent</a>, a free virtual event where we bring you the most impactful announcements and top sessions from AWS re:Invent. Jeff Barr, AWS VP and Chief Evangelist, will share his highlights during the opening session.</p> \n<p>There is still time until January 21 to compete for $250,000 in prizes and AWS credits in the <a href=\"https://builder.aws.com/connect/events/10000aideas?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">Global 10,000 AIdeas Competition</a> (yes, the second letter is an I as in Idea, not an L as in like). No code required yet: simply submit your idea, and if you’re selected as a semifinalist, you’ll build your app using <a href=\"https://kiro.dev/?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">Kiro</a> within <a href=\"https://aws.amazon.com/free?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">AWS Free Tier</a> limits. Beyond the cash prizes and potential featured placement at <a href=\"https://reinvent.awsevents.com/?trk=39d9c26c-b157-46ae-bde6-9cf598f5c9e0&amp;sc_channel=el\">AWS re:Invent 2026</a>, you’ll gain hands-on experience with next-generation AI tools and connect with innovators globally.</p> \n<p>Earlier this month, <a href=\"https://builder.aws.com/community/community-builders/?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">the 2026 application for the Community Builders program launched</a>. The application is open until January 21st, midnight PST so here’s your last chance to ensure that you don’t miss out.</p> \n<p>If you’re interested in these opportunities, join the <a href=\"https://builder.aws.com/?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">AWS Builder Center</a> to learn with builders in the AWS community.</p> \n<p>With that, I close one of my most meaningful chapters here at AWS. It’s been an absolute pleasure to write for you and I thank you for taking the time to read the work that my team and I pour our absolute hearts into. I’ve grown from the close collaborations with the launch teams and the feedback from all of you. The Sub-Sahara Africa (SSA) community has grown significantly, and I want to dedicate more time focused on this community, I’m still at AWS and I look forward to meeting at an event near you!</p> \n<p>Check back next Monday for another <a href=\"https://aws.amazon.com/blogs/aws/tag/week-in-review/?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">Weekly Roundup</a>!</p> \n<p>– <a href=\"https://linkedin.com/in/veliswa-boya\">Veliswa Boya</a></p>","author":"Veliswa Boya","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"59b05b60b152b1261391e247c8b2897594dac5f301922b5e9e844fdd17911cb9","category":"Tech"}