{"title":"My answers to the questions I posed about porting open source code with LLMs","link":"https://simonwillison.net/2026/Jan/11/answers/#atom-entries","date":1768172363000,"content":"<p>Last month I <a href=\"https://simonwillison.net/2025/Dec/15/porting-justhtml/\">wrote about porting JustHTML from Python to JavaScript</a> using Codex CLI and GPT-5.2 in a few hours while also buying a Christmas tree and watching Knives Out 3. I ended that post with a series of open questions about the ethics and legality of this style of work. Alexander Petros on <a href=\"https://lobste.rs/\">lobste.rs</a> just <a href=\"https://lobste.rs/s/cmsfbu/don_t_fall_into_anti_ai_hype#c_cqkdve\">challenged me to answer them</a>, which is fair enough! Here's my attempt at that.</p>\r\n<p>You can read <a href=\"https://simonwillison.net/2025/Dec/15/porting-justhtml/\">the original post</a> for background, but the short version is that it's now possible to point a coding agent at some other open source project and effectively tell it \"port this to language X and make sure the tests still pass\" and have it do exactly that.</p>\r\n<p>Here are the questions I posed along with my answers based on my current thinking. Extra context is that I've since tried variations on a similar theme a few more times using Claude Code and Opus 4.5 and found it to be <em>astonishingly</em> effective.</p>\r\n<h4>Does this library represent a legal violation of copyright of either the Rust library or the Python one?</h4>\r\n<p>I decided that the right thing to do here was to <a href=\"https://github.com/simonw/justjshtml/commit/a415d0af40c34bf9a856e956d841513f482867e3\">keep the open source license and copyright statement</a> from the Python library author and treat what I had built as a derivative work, which is the entire <em>point</em> of open source.</p>\r\n<h4>Even if this is legal, is it ethical to build a library in this way?</h4>\r\n<p>After sitting on this for a while I've come down on yes, provided full credit is given and the license is carefully considered. Open source allows and encourages further derivative works! I never got upset at some university student forking one of my projects on GitHub and hacking in a new feature that they used. I don't think this is materially different, although a port to another language entirely does feel like a slightly different shape.</p>\r\n<h4>Does this format of development hurt the open source ecosystem?</h4>\r\n<p>Now this one is complicated!</p>\r\n<p>It definitely hurts some projects because there are open source maintainers out there who say things like \"I'm not going to release any open source code any more because I don't want it used for training\" - I expect some of those would be equally angered by LLM-driven derived works as well.</p>\r\n<p>I don't know how serious this problem is - I've seen angry comments from anonymous usernames, but do they represent genuine open source contributions or are they just angry anonymous usernames?</p>\r\n<p>If we assume this is real, does the loss of those individuals get balanced out by the increase in individuals who CAN contribute to open source because they can now get work done in a few hours that might previously have taken them a few days that they didn't have to spare?</p>\r\n<p>I'll be brutally honest about that question: I think that if \"they might train on my code / build a derived version with an LLM\" is enough to drive you away from open source, your open source values are distinct enough from mine that I'm not ready to invest significantly in keeping you. I'll put that effort into welcoming the newcomers instead.</p>\r\n<p>The much bigger concern for me is the impact of generative AI on <em>demand</em> for open source. The recent <a href=\"https://simonwillison.net/2026/Jan/7/adam-wathan/\">Tailwind story</a> is a visible example of this - while Tailwind blamed LLMs for reduced traffic to their documentation resulting in fewer conversions to their paid component library, I'm suspicious that the reduced demand there is because LLMs make building good-enough versions of those components for free easy enough that people do that instead.</p>\r\n<p>I've found myself affected by this for open source dependencies too. The other day I wanted to parse a cron expression in some Go code. Usually I'd go looking for an existing library for cron expression parsing - but this time I hardly thought about that for a second before prompting one (complete with extensive tests) into existence instead.</p>\r\n<p>I expect that this is going to quite radically impact the shape of the open source library world over the next few years. Is that \"harmful to open source\"? It may well be. I'm hoping that whatever new shape comes out of this has its own merits, but I don't know what those would be.</p>\r\n<h4>Can I even assert copyright over this, given how much of the work was produced by the LLM?</h4>\r\n<p>I'm not a lawyer so I don't feel credible to comment on this one. My loose hunch is that I'm still putting enough creative control in through the way I direct the models for that to count as enough human intervention, at least under US law, but I have no idea.</p>\r\n<h4>Is it responsible to publish software libraries built in this way?</h4>\r\n<p>I've come down on \"yes\" here, again because I never thought it was irresponsible for some random university student to slap an Apache license on some bad code they just coughed up on GitHub.</p>\r\n<p>What's important here is making it very clear to potential users what they should expect from that software. I've started publishing my AI-generated and not 100% reviewed libraries as alphas, which I'm tentatively thinking of as <strong>\"alpha slop\"</strong>. I'll take the alpha label off once I've used them in production to the point that I'm willing to stake my reputation on them being decent implementations, and I'll ship a 1.0 version when I'm confident that they are a solid bet for other people to depend on. I think that's the responsible way to handle this.</p>\r\n<h4>How much better would this library be if an expert team hand crafted it over the course of several months?</h4>\r\n<p>That one was a deliberately provocative question, because for a new HTML5 parsing library that passes 9,200 tests you would need a <em>very</em> good reason to hire an expert team for two months (at a cost of hundreds of thousands of dollars) to write such a thing. And honestly, thanks to the existing conformance suites this kind of library is simple enough that you may find their results weren't notably better than the one written by the coding agent.</p><p><em>You are only seeing the long-form articles from my blog. Subscribe to <a href=\"https://simonwillison.net/atom/everything/\">/atom/everything/</a> to get all of my posts, or take a look at my <a href=\"https://simonwillison.net/about/#subscribe\">other subscription options</a>.</em></p>","author":"Simon Willison","siteTitle":"Simon Willison’s Weblog","siteHash":"1b599216bd27a00f15d67a3ed9719c64148630c70244b6dd8e743f17cb45527e","entryHash":"5b1db6ee0844105b80c26b0f0721953ebcecfced01c49c579b1fbd86ed162471","category":"Tech"}