{"title":"ChatGPT is your iPhone’s secret superpower","link":"https://www.macworld.com/article/3026151/chatgpt-is-your-iphones-secret-superpower.html","date":1771503300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>AI is rapidly being integrated into the hardware and services we depend on, including iPhones, iPads, and Macs. While Apple’s in-house AI models remain <a href=\"https://www.macworld.com/article/3008896/this-test-shows-how-bad-apple-intelligence-is-and-how-much-better-its-going-to-get.html\">relatively limited</a> for now, Apple users have other options: most appealingly, the company has natively baked OpenAI’s popular ChatGPT into its systems. This enables you to easily fetch up-to-date information, polish text, generate images, and much more.</p>\n\n\n\n<p>If you’re not already using AI to accelerate your everyday workflows, it’s time to get with the program. Try these 10 ChatGPT features on your Apple devices of choice, and watch your productivity skyrocket.</p>\n\n\n\n<h2>Applets</h2>\n\n\n\n<p>OpenAI recently launched <a href=\"https://openai.com/index/developers-can-now-submit-apps-to-chatgpt/\">ChatGPT apps</a> as a way to access your favorite services using text prompts. The feature is available in the latest ChatGPT app across iOS, iPadOS, macOS, and the web. To get started, you can visit the Apps section in ChatGPT settings and connect the accounts you’re interested in.</p>\n\n\n\n<p>For example, the Apple Music applet lets you find songs, generate playlists, and add them to your library right from ChatGPT. Similarly, the Adobe Acrobat offering enables you to upload a PDF document and make certain tweaks using the chatbot’s interface.</p>\n\n\n\n<p>As you’d probably expect, the functionality of these apps is somewhat limited. They’re cut-down versions of the full app, a little like Apple’s App Clips, and more advanced workflows will still require the use of the real thing. But they’re solid for performing specific, quick tasks using natural language.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/01/Apple-Music-app-in-ChatGPT.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Music app in ChatGPT\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption>There wasn’t much AI in the 90s, but we made up for it with our indie music. </figcaption></figure><p>Mahmoud Itani / Foundry</p></div>\n\n\n\n<h2>macOS assistance</h2>\n\n\n\n<p>ChatGPT’s integration with apps isn’t confined to the limited range of applets available on the platform itself. If you’ve installed the official client on your Mac, you’ll be able to link it to active macOS app sessions and ask relevant questions.</p>\n\n\n\n<p>Simply tap on the App Store icon in the ChatGPT app’s text box to view a list of compatible, installed apps. If you pick Terminal, for instance, it will read the commands you’re entering and help you type the correct ones to achieve a certain aim. Likewise, it can view the notes you’re typing and suggest edits based on your prompt.</p>\n\n\n\n<h2>Quick access</h2>\n\n\n\n<p>Locate the ChatGPT app on your Home Screen can be inefficient when performing time-sensitive tasks. Fortunately, ChatGPT offers a ton of shortcuts to quickly summon it on iOS, iPadOS, and macOS.</p>\n\n\n\n<p>On iOS and iPadOS, you can add ChatGPT controls to the Control Center and Lock Screen, letting you quickly initiate a new session from different parts of the system; on newer iPhones, you can also have the <a href=\"https://www.macworld.com/article/2641550/your-iphones-action-button-is-surprisingly-powerful-heres-everything-it-can-do.html\">Action button</a> launch a ChatGPT instance. On the Mac, you can hit Option and Space to reveal a miniature ChatGPT text box to enter your prompts, connect apps, upload files, and so on. You can also add ChatGPT to shortcuts you create in the Apple Shortcuts app and have it analyze input or fetch requested data.</p>\n\n\n\n<h2>Siri fallback</h2>\n\n\n\n<p>Siri often fails to answer basic questions and instead redirects users to web results. If you’ve enabled Apple Intelligence, however, the voice assistant can now tap into ChatGPT’s intellect instead. </p>\n\n\n\n<p>To turn this on, open the Settings app, go to <em>Apple Intelligence and Siri</em> &gt; <em>ChatGPT</em>, and enable the <em>Use ChatGPT</em> toggle. (You can also turn off the <em>Confirm Requests</em> option if you’d rather not have Siri ask for your permission every time it needs to share a text prompt with ChatGPT’s servers.) Now, you can command Siri to ask ChatGPT any question, and it’ll read aloud the response it receives.</p>\n\n\n\n<h2>Writing Tools</h2>\n\n\n\n<p>This neat text editing suite allows you to natively proofread, rewrite, summarize, and change the tone of selected text. Thanks to ChatGPT, the feature also lets you apply custom edits or generate text from scratch. Just select the text you’d like to edit, then hit <em>Writing Tools</em>, followed by <em>Compose</em>. You can then describe the changes you’d like to make and ChatGPT will handle the rest.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/01/Image-Playground-working-with-ChatGPT-on-iPadOS.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Image Playground working with ChatGPT on iPadOS\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption>ChatGPT offers a range of preset styles when generating images.</figcaption></figure><p>Mahmoud Itani / Foundry</p></div>\n\n\n\n<h2>Image Playground</h2>\n\n\n\n<p>Image Playground is Apple’s own AI image generator, featuring multiple illustration styles, doodle polishing support, offline access, and more. To elevate the quality of outputted images, you can rely on ChatGPT’s superior image generation models without leaving the app. </p>\n\n\n\n<p>Click the <em>Styles</em> dropdown menu in the Playground app on iOS, iPadOS, or macOS, then select <em>ChatGPT</em>. You can then pick a more specific style, such as <em>Anime</em>, <em>Vector</em>, or <em>Oil Painting</em>. Now you can type your prompt or add some of the suggested ones and wait for the result to appear.</p>\n\n\n\n<h2>Paid perks and data sync</h2>\n\n\n\n<p>Using ChatGPT integration on your Apple devices comes with daily limits that, when exceeded, prevent you from uploading files, generating images, and accessing advanced models. If you’re subscribed to ChatGPT Go, Plus, or Pro, you can link your paid account to extend or remove said limits. In Settings, go to <em>Apple Intelligence &amp; Siri</em> &gt; <em>ChatGPT</em>, and sign in with your OpenAI account. This will also sync the conversations you have with ChatGPT via Siri and show them in your chat history.</p>\n\n\n\n<h2>Group chats</h2>\n\n\n\n<p>Lastly, if you’re planning an event or working on a project with others, you can create a group chat in the ChatGPT app. To get started, tap on the dedicated button in the top-right corner of a ChatGPT conversation and share the link with your friends or coworkers. This lets you all brainstorm together and have ChatGPT share its knowledge whenever needed.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/01/ChatGPT-group-chats.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"ChatGPT group chats\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption>ChatGPT can contribute to group chats.</figcaption></figure><p>Mahmoud Itani / Foundry</p></div>\n\n\n\n<h2>Shopping advice</h2>\n\n\n\n<p>Picking the right model when upgrading your Apple device can be confusing for tech newbies. Obviously, Macworld should be your first stop when seeking <a href=\"https://www.macworld.com/article/670458/iphone-buying-guide.html\">iPhone</a>, <a href=\"https://www.macworld.com/article/670670/which-ipad-best.html\">iPad</a>, or <a href=\"https://www.macworld.com/article/219909/best-mac.html\">Mac buying advice</a>, but ChatGPT is keen to join the party with its Shopping Research feature.</p>\n\n\n\n<p>Select the relevant mode in the ChatGPT app and describe the product you’re looking to buy. ChatGPT will ask follow-up questions related to budget and performance expectations to narrow down your options, then display results comparing the prices, specs, images, and other relevant aspects of the matching devices. You can then choose one of them and buy it through your favorite online retailer.</p>\n\n\n\n<h2>Understanding your iDevices</h2>\n\n\n\n<p>ChatGPT can also help tech newbies learn more about their Apple devices and the latest OS features. Again, Macworld has long been happy to <a href=\"https://www.macworld.com/article/3004106/ios-26-2-small-tweaks-liquid-glass-measure-sleep-score-podcasts-airdrop-pin.html\">help in this regard</a>, but who are we to stand in the way of progress? It’s far better, clearly, to ask a chatbot.</p>\n\n\n\n<p>ChatGPT can, for example, check the latest available OS version for your device and briefly list the top features it introduces using simple language. This helps you familiarize yourself with what’s new, without having to read complex changelogs. Similarly, if you encounter errors when using your Apple devices, you can upload screenshots to ChatGPT or use the video calling mode to show it what’s going on in real time. The chatbot will then suggest solutions or workarounds based on similar issues discussed on online forums. Or beloved Apple-focused websites.</p>\n\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"5b66b3c6fb91aaab418dd4ebc1664ab6b40068cb1c319023bdb7b7007c0d18b4","category":"Apple"}