{"title":"Meta’s Response to Reuters Report on ‘Romance AI Chatbots’ for Teenagers","link":"https://x.com/andymstone/status/2016242174447223049","date":1769616145000,"content":"\n<p>Andy Stone, VP of communications at Meta, responding, in a series of tweets on Twitter/X, to <a href=\"https://www.reuters.com/legal/government/meta-ceo-zuckerberg-blocked-curbs-sex-talking-chatbots-minors-court-filing-2026-01-27/\">Jeff Horwitz’s report at Reuters</a> yesterday, <a href=\"https://daringfireball.net/linked/2026/01/27/horwitz-zuck-meta-teen-sexbots\">linked here</a> last night, which claimed that “Zuckerberg blocked curbs on sex-talking chatbots for minors”:</p>\n\n<blockquote>\n  <p>Never let the facts get in the way of a good story, eh,\n<a href=\"https://x.com/Reuters\">@Reuters</a>, <a href=\"https://x.com/JeffHorwitz\">@JeffHorwitz</a>!</p>\n\n<p>The documents you cite in the story itself contradict this\nheadline.</p>\n\n<p>The headline says “Zuckerberg blocked curbs on sex-talking\nchatbots for minors”</p>\n\n<p>But the story cites a document that says “Zuckerberg believed that\nAI companions should be blocked from engaging in sexually\n‘explicit’ conversations” w young people.</p>\n\n<p>Huh?!</p>\n</blockquote>\n\n<p>After my post last night, a friend of mine, with a career of experience working in a large company, sent me this:</p>\n\n<blockquote>\n  <p>A word of caution. “Scumbag middle manager says CEO said” is not\nthe same as “CEO said.”</p>\n\n<p>I could believe Zuck shitcanned parental controls, but I am\ncertain there are thousands of snakes inside that company who\nwould lie about it to get what they want.</p>\n</blockquote>\n\n<p>That’s a good and fair point, and I think it’s what Stone is trying to emphasize above. The New Mexico lawsuit filing doesn’t contain evidence that Zuckerberg nixed parental controls for teens engaging in chats with AI bots; it contains evidence that other (unnamed employees) claimed in internal discussions that Zuckerberg had nixed them. That is different.</p>\n\n<p>But so let’s take Zuckerberg out of it personally. It’s still the case that Meta shipped these chatbots for teens to use. And the buck, presumably, stops at Zuck’s desk. <a href=\"https://www.reuters.com/investigates/special-report/meta-ai-chatbot-guidelines/\">Read Horwitz’s report from back in August</a>, detailing a leaked internal document listing Meta’s content guidelines for generative AI chat.</p>\n\n<p><strong>Sidenote:</strong> Why in the world is Meta’s VP of comms doing this on Twitter/X, not Threads, which <a href=\"https://techcrunch.com/2026/01/18/threads-edges-out-x-in-daily-mobile-users-new-data-shows/\">continues to grow</a>?</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/28/metas-response-to-reuters-report\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"5dc54984d17cd1201391042fa36e4ca61b744f7677b4a1ff0ad28560e60c57a7","category":"Tech"}