{"title":"Finding My Way Back: A Journey of Resilience and Discovery of Moots Express","link":"https://moots.com/blogs/news/finding-my-way-back-a-journey-of-resilience-and-discovery-of-moots-express","date":1740536711000,"content":"\n      <p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/ORNT1599-683x1024.jpg?v=1762206466\" alt=\"\" /></p>\n<p>Twenty-two years ago, my life changed forever during a national level mountain bike race in Big Bear, California. As an aspiring mountain biker pushing my limits during a practice run, I suffered a devastating crash that left me with a spinal cord injury. The prognosis was stark: a single-digit chance of walking again.</p>\n<p>In the ICU, heavily sedated, I stared at the ceiling as my mind spiraled through an endless loop of regret. The pain was unlike anything I’d ever experienced—deep, relentless. But the physical agony was matched by the mental anguish of uncertainty about my future. The doctors' words echoed like a death sentence: \"Mr. Takaki, you won't be able to walk again and you need to adapt to a new life.\" With my spine fused with rods and almost no chance of walking again, I felt my sense of control over my body and future slipping away. My self-esteem plummeted to the darkest corner I'd ever known, and initially, I gave up on my life entirely.</p>\n<p>But from that moment on, my journey became one of continuous small victories, each building on the last. From the first flicker of movement in my right toe two weeks after the accident to learning to stand, walk, and cross a busy street on my own—each milestone wasn’t just physical progress, but a reclaiming of independence.</p>\n<p>Yet the emotional terrain I had to navigate was even gnarlier than any mountain bike trail I’d ever encountered. At first, I did my best to hide it,masking my insecurities with the determination to overcome this life altering event. For two years, confined to a wheelchair, I wrestled with a storm of denial, anger, and crushing hopelessness. The contrast was staggering—one day, I was racing down an adrenaline-fueled downhill course, pushing my limits; the next, I was paralyzed from the waist down, struggling to roll over a simple five-inch curb. Basic tasks that had once been second nature—walking, showering, getting dressed—became distant memories rather than the routine actions I had once taken for granted.</p>\n<p>But even in the darkest moments, something familiar emerged. As I wheeled myself a little further each day, testing and pushing my boundaries, I recognized the same spirit that had drawn me to cycling as a child—the instinct to explore, to see what lay beyond my current limits. The first time I ventured outside the hospital on my own in a wheelchair, it felt like seeing an ocean for the first time—vast, unknown, and exhilarating. In reality, I had only wheeled 20 feet from the door, but in my mind, I had crossed into something far greater: a new challenge, a new thrill, a new kind of freedom. This wasn’t just recovery; it was the ultimate test of my willingness to face a challenge head-on, to embrace the struggle rather than retreat from it. I was fortunate to regain movement early on, and that gave me enormous hope and motivation—something that became the foundation of my mental strength. When there is light, it can always get brighter. That realization fueled my determination, helping me push past my insecurities and build the resilience I needed.</p>\n<p>And I wasn’t alone on this journey. Friends and family anchored me through the storm, offering unwavering support as I processed my new reality. I’ll never forget the day my closest riding buddy showed up at rehab, bringing with him a super burrito—it was spicy, and to my dismay, packed with beans (I hate beans). But somehow, that burrito instantly transported me back to better days. We sat there for hours, not with pity, but with patience, swapping stories of recent rides and future adventures. Their presence became the foundation that helped me push through the mental fog of depression and loss of identity.</p>\n<p>Later, my cycling community reinforced that support in ways only they could—riding alongside me on the climbs, never making me feel like a burden, and reminding me that the ride isn’t just about speed but about showing up, pushing through, and sharing the journey together. Their quiet patience and encouragement kept me moving forward, proving that I was never truly riding alone.</p>\n<p>The path back to cycling wasn’t immediate or straightforward. Every small victory in physical therapy felt monumental—sitting up independently, taking those first assisted steps while strapped into what felt like an exoskeleton, balancing long enough to dress myself. With every session, my body slowly responded, and my relationship with movement evolved from struggle to possibility.</p>\n<p>My return to cycling began modestly. From a wheelchair to an e-scooter, then finally to a pedal bike—at first, just 5 miles at a time. I found a new rhythm in simple routines: daily swims recommended by my doctor, short bike rides to the pool and grocery store. These small journeys might have seemed insignificant to others, but to me—remembering those dark days in the ICU—they were nothing short of miraculous.</p>\n<p>The first time I pedaled across the Golden Gate Bridge toward the top of Hawk Hill, I knew it would be a test—not just of my strength, but of my mindset. I had mentally prepared for this ride, but the moment I hit the first steep section, exhilaration quickly gave way to exhaustion. I was pushing my limit, and yet, I was barely moving. Riders of all kinds—weekend warriors, tourists, even a little kid—passed me effortlessly. My ego took a hit, but in that moment, I told myself: It doesn’t matter how others see me. My happiness is what matters most.</p>\n<p>Reaching the top, breathless and spent, I was met with a view that made every struggle worth it—the vast expanse of San Francisco Bay stretching beyond the bridge, blue sky reflecting off the water. It was one of my happiest moments, a reminder that effort, not speed, is what truly defines the ride. What started as a single test of willpower became the foundation for something bigger. Little by little, I kept expanding my horizons—short trips to the pool, then to the store, then beyond. What began as a means of recovery gradually evolved into something more—a return not just to cycling, but to regaining my independence.</p>\n<p>From then on, I shifted my focus. I set incremental, realistic goals so that even when I fell short, progress always felt within reach. And as I kept pushing, those small wins added up. There was a profound beauty in this simplicity. Each pedal stroke carried me further from who I had been in that hospital bed and closer to who I could become. I took my time, expanding my horizons with each ride, finding freedom in those small adventures. In the end, it all came down to living life on my own terms.</p>\n<p>Then COVID hit, disrupting the careful routine I’d built. The pool where I’d spent countless hours strengthening my body shut down indefinitely. What could have been a setback became an unexpected catalyst. Searching for a new way to stay active, I discovered lightweight e-gravel bikes—a revelation. Suddenly, the boundaries I’d grown accustomed to began to dissolve. My limited range stretched to 40-50 miles. The Golden Gate Bridge, the Marin Headlands where I first fell in love with cycling after moving from Japan in 1996—all were within reach again. Even Mount Tamalpais, the birthplace of mountain biking, felt challenging again.</p>\n<p>The bike transformed from just a mode of transportation into something much deeper—it became my gateway to freedom and connection. Each component spoke to me of adaptation and possibility: the battery fueling my adventures, the dropper post enabling me to mount, and the suspension fork and tire inserts giving me the confidence to tackle challenging terrain again. These weren’t just bike parts; they were the foundation of my independence.</p>\n<p>Though I still walk with a cane, something magical happens when I swing my leg over the saddle. On the bike, the limitations I face on foot seem to melt into the wind. Especially on descents, when gravity takes over and the trail opens up—those are the moments when everything else fades away. The familiar rush of speed returns, the bike responds intuitively, and I’m no longer the guy with the cane. I’m just another rider, carving through the trail, chasing that perfect line. My happiness was stripped away in an instant the day of the accident, but through years of rehab, my joy for the sport has returned.</p>\n<p>As these moments of freedom grew, so did my ambitions. The more I rode, the more I dreamed of pushing beyond my limits—exploring trails I once thought were out of reach. Each ride hinted at new adventures, calling me toward possibilities I hadn’t even imagined.</p>\n<p>As my confidence grew, so did my desire to explore further. Along the way, I found myself surrounded by a growing circle of riding friends, each one encouraging me to push a little more, try a new trail, or join a longer adventure. Yet my reality was different. Because I needed more power assist to compensate for my weaker legs, my battery drained faster, limiting my range no matter how much I wanted to keep going. The combination of battery range and my physical strength often meant having to decline invitations or turn back while others rode on. Those 50-mile adventures left me wondering—what else might be possible? Familiar routes began to feel less like destinations and more like boundaries. I found myself dreaming of longer rides, more challenging terrain, and the opportunity to experience new horizons alongside my friends. What once was a pessimistic outlook on the constrictions I had with limited movement has now transformed into optimism through exceeding previous plateaus and reaching new heights.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/ORNT1494-683x1024.jpg?v=1762206465\" alt=\"\" /></p>\n<p>By the time I entered my third year of riding a lightweight e-gravel bike, I started to have a clearer sense of what I truly needed from my setup. I realized I needed more range for longer rides, the capacity for larger tires to increase comfort and traction, and although not absolutely necessary, a bit more motor power to help me tackle steep sections with greater ease and safety. Reflecting on these needs, it became clear that I was searching for something more tailored to my evolving journey—something that could push the boundaries of what I thought was beyond my reach.</p>\n<p>Sometimes, discoveries find you in unexpected ways. My discovery path to the Moots Express began at the Sea Otter Classic, where a few unexpected conversations set everything in motion. A friend from Ornot, the San Francisco-based cycling apparel brand, spoke with the president of Moots and later sent me an excited message about the bike. Around the same time, someone at Shimano who I’d met the previous year through my connections had already mentioned my name to Moots, encouraging them to keep an eye on me.</p>\n<p>Moots didn’t just check off the boxes—they built the Express for big adventures from the start. More than just specs on paper, every design choice translated into real benefits on the trail. The suspension-ready frame and larger tires didn’t just improve comfort; they gave me the confidence to push my limits, knowing my bike could handle whatever lay ahead. In the Express, I saw more than just a bike. I saw the perfect tool to unlock the next chapter of my riding journey.</p>\n<h3>What really sealed my decision to get the Moots Express was the complete Shimano integration. The responsive EP801 motor and the Linkglide drivetrain with its Freeshift technology allowed me to tackle tough descents and punchy climbs with ease, letting me conserve energy and stay engaged. After years of riding a modified bike, I found the Moots Express to be purpose-built for durability and long-distance adventures. The trust I have in Shimano’s reliability for parts and service gives me confidence that this bike will be a companion for many miles to come.</h3>\n<p>Before the Moots Express, I had ridden a similar bike—a carbon gravel e-bike—but the difference in ride quality and performance was striking. The Moots Express isn’t just a bike; it’s a partner in this journey of discovery, delivering the capability and excitement I was looking for.</p>\n<p>The new bike’s geometry, combined with the ability to run larger tires, allows me to pick lines with confidence and ride all day without discomfort. The higher cockpit, modern geometry, and quick battery swap feature are just a few of the thoughtful details that make the Moots Express feel like a perfect fit for my adventures ahead.</p>\n<p>For a deeper dive into the technical specs and what makes this bike truly stand out, stay tuned for the next blog where I’ll break down the detailed features of my Moots Express dream build.</p>\n<p>Through sharing my story, I've connected with new friends and communities that encourage me to expand my horizons. Their support and shared belief in growth through change continue to inspire me to reach beyond what I once thought was possible.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/ORNT1336-1024x683.jpg?v=1762206466\" alt=\"\" /></p>\n<p>Each ride now serves as a testament to what’s possible. From that hospital room, where walking seemed impossible, to today, where I’m exploring trails I never thought I’d see again—it’s no longer about distance or speed. It’s about the pure joy of being on a bike, feeling the wind rush by, and realizing that with each ride, I'm expanding what I once thought was beyond my reach.</p>\n<p>The Moots Express isn't just a bike; it’s become a partner in this journey of discovery. Looking ahead, I see countless trails and adventures, because sometimes the end of one path is just the beginning of another—and with every ride, it’s a reminder that new horizons are waiting to be explored.</p>\n<p><em>In the coming weeks Saboo will share more with our readers around his build and other inspiration - follow him on instagram: <a href=\"https://www.instagram.com/iam.fooski/\">iam.fooski </a></em></p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"5fa8eb2f7650d5a0f029e5f97972226de208432dd64c5984ed1e2b85b0e3804e","category":"Cycling"}