{"title":"Happy New Year! AWS Weekly Roundup: 10,000 AIdeas Competition, Amazon EC2, Amazon ECS Managed Instances and more (January 5, 2026)","link":"https://aws.amazon.com/blogs/aws/happy-new-year-aws-weekly-roundup-10000-aideas-competition-amazon-ec2-amazon-ecs-managed-instances-and-more-january-5-2026/","date":1767633037000,"content":"<p>Happy New Year! I hope the holidays gave you time to recharge and spend time with your loved ones.</p> \n<p>Like every year, I took a few weeks off after <a href=\"https://aws.amazon.com/reinvent/\">AWS re:Invent</a> to rest and plan ahead. I used some of that downtime to plan the next cohort for <a href=\"https://besaprogram.com/\">Become a Solutions Architect (BeSA)</a>. BeSA is a free mentoring program that I, along with a few other <a href=\"https://aws.amazon.com/\">Amazon Web Services (AWS)</a> employees, volunteer to host as a way to help people excel in their cloud and AI careers. We’re kicking off a 6-week cohort on “Agentic AI on AWS” starting February 21, 2026. Visit the <a href=\"https://besaprogram.com/\">BeSA website</a> to learn more.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/02/10k-AIdeas-1080x1080-1.jpg\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/02/10k-AIdeas-1080x1080-1-300x300.jpg\" alt=\"\" width=\"300\" height=\"300\" /></a>There is still time to submit your idea for the <a href=\"https://builder.aws.com/connect/events/10000aideas\">Global 10,000 AIdeas Competition</a> and compete for $250,000 in cash prizes, AWS credits, and recognition, including potential featured placement at AWS re:Invent 2026 and across AWS channels.</p> \n<p>You will gain hands-on experience with next-generation AI development tools, connect with innovators globally, and access technical enablement through biweekly workshops, AWS User Groups, and AWS Builder Center resources.</p> \n<p>The deadline is January 21, 2026, and no code is required yet. If you’re selected as a semifinalist, you’ll build your app then. Your finished app needs to use Kiro for at least part of development, stay within <a href=\"https://aws.amazon.com/free/\">AWS Free Tier</a> limits, and be completely original and not yet published.</p> \n<p>If you haven’t yet caught up with all the new releases and announcements from AWS re:Invent 2025, check out our <a href=\"https://aws.amazon.com/blogs/aws/top-announcements-of-aws-reinvent-2025/\">top announcements post</a> or <a href=\"https://reinvent.awsevents.com/on-demand/\">watch the keynotes, innovation talks, and breakout sessions on-demand</a>.</p> \n<p><span><strong>Launches from the last few weeks</strong></span><br /> I’d like to highlight some launches that got my attention since our last Week in Review on December 15, 2025:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/generally-available-amazon-ec2-m8gn-m8gb-instances/\">Amazon EC2 M8gn and M8gb instances</a> – New M8gn and M8gb instances are powered by AWS Graviton4 processors to deliver up to 30% better compute performance than AWS Graviton3 processors. M8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network-optimized EC2 instances. M8gb offer up to 150 Gbps of Amazon EBS bandwidth to provide higher EBS performance compared to same-sized equivalent Graviton4-based instances.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/direct-connect-resilience-testing-fault-injection-service/\">AWS Direct Connect supports resilience testing with AWS Fault Injection Service</a> – You can now use AWS Fault Injection Service to test how your applications handle Direct Connect Border Gateway Protocol (BGP) failover in a controlled environment. For example, you can validate that traffic routes to redundant virtual interfaces when a primary virtual interface’s BGP session is disrupted and your applications continue to function as expected.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/176-security-hub-controls-control-tower/\">New AWS Security Hub controls in AWS Control Tower</a> – AWS Control Tower now supports 176 additional Security Hub controls in the Control Catalog, covering use cases including security, cost, durability, and operations. With this launch, you can search, discover, enable, and manage these controls directly from AWS Control Tower to govern additional use cases across your multi-account environment.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/aws-transform-hybrid-network-migration/\">AWS Transform supports network conversion for hybrid data center migrations</a> – You can now use AWS Transform for VMware to automatically convert networks from hybrid data centers. This removes manual network mapping for environments running both VMware and other workloads. The service analyzes VLANs and IP ranges across all exported source networks and maps them to AWS constructs such as virtual private clouds (VPCs), subnets, and security groups.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/nvidia-nemotron-3-nano-amazon-bedrock/\">NVIDIA Nemotron 3 Nano available on Amazon Bedrock</a> – Amazon Bedrock now supports NVIDIA Nemotron 3 Nano 30B A3B model, NVIDIA’s latest breakthrough in efficient language modeling that delivers high reasoning performance, built-in tool calling support, and extended context processing with 256K token context window.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ec2-az-id-api-support/\">Amazon EC2 supports Availability Zone ID across its APIs</a> – You can specify the Availability Zone ID (AZ ID) parameter directly in your Amazon EC2 APIs to guarantee consistent placement of resources. AZ IDs are consistent and static identifiers that represent the same physical location across all AWS accounts, helping you optimize resource placement. Prior to this launch, you had to use an AZ name while creating a resource, but these names could map to different physical locations. This mapping made it difficult to ensure resources were always co-located, especially when operating with multiple accounts.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/12/amazon-ecs-managed-instances-ec2-spot-instances/\">Amazon ECS Managed Instances supports Amazon EC2 Spot Instances</a> – Amazon ECS Managed Instances now supports Amazon EC2 Spot Instances, extending the range of capabilities available with AWS managed infrastructure. You can use spare EC2 capacity at up to 90% discount compared to On-Demand prices for fault-tolerant workloads in Amazon ECS Managed Instances.</li> \n</ul> \n<p>See <a href=\"https://aws.amazon.com/new/?trk=769a1a2b-8c19-4976-9c45-b6b1226c7d20&amp;sc_channel=el\">AWS What’s New</a> for more launch news that I haven’t covered here. That’s all for this week. Check back next Monday for another Weekly Roundup!</p> \n<p>Here’s to a fantastic start to 2026. Happy building!</p> \n<p>– <a href=\"https://www.linkedin.com/in/kprasadrao/\">Prasad</a></p>","author":"Prasad Rao","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"60d79cac1df878bc90a1c0aadff2cc5a4bde24f79a20e30c4535bb9fb6ecde6b","category":"Tech"}