{"title":"Kickstarter for Ollie’s Arcade Expansion","link":"https://blog.iconfactory.com/2026/01/bringing-more-fun-free-retro-gaming-to-ios/","date":1769698903000,"content":"\n<p>Ged Maheux, The Iconfactory:</p>\n\n<blockquote>\n  <p>This week we <a href=\"https://www.kickstarter.com/projects/iconfactory/ollies-arcade-expansion-more-retro-games?ref=user_menu\">announced a new Kickstarter</a> that’s aimed at\nexpanding the game offerings of Ollie’s Arcade, the fun, ad-free\nretro gaming app we introduced back in 2023. <a href=\"https://apps.apple.com/us/app/ollies-arcade/id6446127619\">Ollie’s\nArcade</a> has always been a great way to escape doomscrolling,\neven if just for a little while, and now we have an opportunity to\nbring these retro games to even more people on iOS.</p>\n\n<p>The Kickstarter aims to raise enough money to make all of the\nin-app purchase games in the app completely <em>free for everyone</em> to\nenjoy. We also want to bring our beloved puzzle game,\n<a href=\"https://en.wikipedia.org/wiki/Frenzic\">Frenzic</a>, to life once again. Frenzic was one of the very\nfirst games available on iOS back in 2008, then was reborn as\n<a href=\"https://frenzic.com/\">Frenzic: Overtime</a> on Apple Arcade. Since it left, people\nhave been asking us for a new version that they can just pick up\nand play. We couldn’t agree more!</p>\n</blockquote>\n\n<p><a href=\"https://daringfireball.net/linked/2023/09/03/ollies-arcade\">I linked to</a> the Kickstarter for the original Ollie’s Arcade project back in 2023, which was a big success. And I <a href=\"https://daringfireball.net/linked/2008/11/19/frenzic\">first linked to Frenzic</a> all the way back in 2008, when the App Store was only a few months old. It’s just a great concept for a casual game on a small screen, implemented with all of The Iconfactory’s exquisite attention to detail. That’s true for all the games in Ollie’s Arcade, but Frenzic is special.</p>\n\n<p>This new Kickstarter for the Ollie’s Arcade expansion has already hit its funding goal, but it’s approaching the stretch goal for an additional game. There are a zillion games for iOS, but it’s sad how few are ad-free and don’t require a subscription. If you think well-crafted fun games that you can pay for once (for a very reasonable price) should be rewarded, you should join me (<a href=\"https://www.macstories.net/news/the-iconfactory-launches-kickstarter-to-expand-ollies-arcade-with-frenzic/\">and</a> <a href=\"https://sixcolors.com/link/2026/01/the-iconfactory-wants-to-bring-fun-back-to-your-fingers/\">others</a>) in backing this Kickstarter.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/29/kickstarter-for-ollies-arcade-expansion\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"61bd2fca16d2818c8802e9c963f7887c80a7a7825a52bf86d5cfffdf1bfca322","category":"Tech"}