{"title":"The End of Console Exclusivity","link":"https://markpeak.net/the-end-of-console-exclusivity/","date":1708776492000,"content":"<p>วงการเกมปี 2024 เปิดปีมาเพียง 2 เดือนก็มีเหตุการณ์ที่น่าสนใจมากมาย ซึ่งสะท้อนทิศทางใหม่ของอุตสาหกรรมเกมที่ console exclusivity เริ่มหมดกำลังลง</p>\n<h2>Xbox</h2>\n<p>ฝั่ง Xbox/Microsoft เป็นค่ายที่มีความเคลื่อนไหวมากที่สุด</p>\n<ul>\n<li>หลังปิดดีลใหญ่ Activision Blizzard ช่วงกลางปี 2023 ก็เข้าสู่<a href=\"https://www.blognone.com/node/137333\">กระบวนการผลัดเปลี่ยนผู้บริหารในช่วงปลายปี</a> และเดือนมกราคม 2024 ก็<a href=\"https://www.blognone.com/node/137870\">ปลดพนักงานธุรกิจเกมครั้งใหญ่เพื่อลดพนักงานที่ซ้ำซ้อนเทอะทะลง</a></li>\n<li>เมื่อเปิดเดือนกุมภาพันธ์ ก็มี<a href=\"https://www.blognone.com/node/138036\">ข่าวลือว่าไมโครซอฟท์จะนำเกมของตัวเองมาลง PlayStation และ Switch</a> ซึ่งสุดท้ายเกิดขึ้นจริงๆ โดย<a href=\"https://www.blognone.com/node/138227\">ยังมีเฉพาะเกมเก่าๆ นำมาขายวนซ้ำบนแพลตฟอร์มคนอื่น</a> เพื่อหารายได้เพิ่มเติม</li>\n</ul>\n<p>หากลองดู<a href=\"https://news.xbox.com/en-us/2024/02/15/xbox-promise-bring-more-games-to-more-players/\">ประกาศอย่างเป็นทางการของ Xbox</a> ว่ามีวิธีการอธิบายเรื่องนี้อย่างไร (ตัวหนาเน้นโดยผมเอง)</p>\n<blockquote><p>Xbox’s Promise to Bring More Games to More Players Around the World</p>\n<p>To ensure long-term success for both Xbox and the industry as a whole, <strong>we must continue to evolve. </strong></p>\n<p>Today we announced that we will expand the communities we reach: we are currently in the process of bringing four Xbox games to other platforms. These are titles which have been available to Xbox players for at least a year, including <strong>hidden gems that deserve to be experienced more widely,</strong> and <strong>live service games whose communities will benefit from welcoming even more players.</strong> We will share more details on these titles soon.</p>\n<p>By bringing these games to more players, we not only expand the reach and impact of those titles, but <strong>this will allow us to invest in either future versions of these games</strong>, or elsewhere in our first-party portfolio. There is no fundamental change to our approach on exclusivity.</p></blockquote>\n<p>คำอธิบายของไมโครซอฟท์ใช้คำว่า “evolve” คือปรับยุทธศาสตร์ของตัวเองต่อไป เพื่อนำรายได้ไป “invest” ลงทุนในการพัฒนาเกมต่อ ส่วนเกมที่นำมาลงแพลตฟอร์มอื่น ก็ด้วยเหตุผลว่า ต้องการขยายฐานผู้เล่น (more widely) ในกรณีของเกมเล็ก (hidden gems เช่น Pentiment, Hi-Fi Rush) และเพิ่มจำนวนผู้เล่นในชุมชน (more players) ในกรณีของเกม live services (เช่น Grounded และ Sea of Thieves)</p>\n<p><em>จากสิ่งนี้</em></p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap-1024x576.jpg\" width=\"700\" height=\"394\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap-1024x576.jpg 1024w, https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap-1536x864.jpg 1536w, https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap-700x394.jpg 700w, https://markpeak.net/wp-content/uploads/2024/02/Starfield_Inline_Recap.jpg 1920w\" /></p>\n<p><em>มาสู่สิ่งที่ไม่คิดว่าจะได้เห็นก็ได้เห็น วิดีโอ official ทำเอง ไม่ใช่แฟนๆ ทำกัน</em></p>\n<p></p>\n<p>ประกาศนี้เหมือนเป็นการยอมแพ้แบบกลายๆ ของไมโครซอฟท์ ว่ายุทธศาสตร์สร้าง platform exclusive (ในกรณีของไมโครซอฟท์คือ Xbox + PC) นั้นเริ่มใช้ไม่ได้ผลแล้ว จนต้องนำเกมไปขายบนแพลตฟอร์มคู่แข่ง (บ้าง) ทำให้แฟนบอย PlayStation ที่ทำสงครามน้ำลายศักดิ์สิทธิ์กันมานาน รู้สึกสะใจและออกมาเกทับแฟนบอย Xbox ขนานใหญ่ ก่อนจะพบว่า…</p>\n<h2>PlayStation</h2>\n<p>โซนี่ก็เจอปัญหาคล้ายๆ กัน (แต่รุนแรงน้อยกว่า) ใน<a href=\"https://www.blognone.com/node/138199\">งานแถลงผลประกอบการ Q4/2023</a> ในอีกไม่กี่วันถัดมา</p>\n<ul>\n<li>ปรับเป้ายอดขาย PS5 ในปี 2024 ลงมา จาก 25 ล้านเครื่องเหลือ 21 ล้านเครื่อง ด้วยเหตุผลว่าเครื่องเริ่มเก่า ยอดขายย่อมไม่ร้อนแรงเหมือนเดิม</li>\n<li>ลดจำนวนเกม 1st party ลง <a href=\"https://www.blognone.com/node/138203\">ไม่มีเกมใหญ่ๆ จาก 1st party ออกเพิ่มเติมในปี 2024 แล้ว</a> ต้องรอปี 2025 เลย (จำนวนเกม 1st party เริ่มลดน้อยลงมาตั้งแต่ปี 2023 แล้ว) โดยโซนี่หันไปใช้บริการเกม 3rd party ช่วยดึงยอดขายเครื่องแทน เช่น FF7 Rebirth</li>\n<li><a href=\"https://www.blognone.com/node/138271\">ธุรกิจเกมมีอัตรากำไร (margin) ลดลงจากแต่ก่อนมาก ทำให้หุ้นตกเยอะ</a>เพราะนักลงทุนเทขาย (นักลงทุนนี่ก็เอาใจยากเนอะ)</li>\n</ul>\n<p>ภาพรวมธุรกิจเกมของโซนี่นั้นยังดีอยู่ รายได้รวมเพิ่ม และยอดขาย PS5 ก็ยังถือว่าดีมาก (เมื่อเทียบกับ Xbox Series) แต่ถ้าเทียบกับตัวเองในอดีต มันแย่ลงเป็นปกติ เพราะอัตรากำไรลดลง และเป้าหมายขายเครื่องลดลง</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/sony-q4-2023.png\" width=\"968\" height=\"544\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/sony-q4-2023.png 968w, https://markpeak.net/wp-content/uploads/2024/02/sony-q4-2023-300x169.png 300w, https://markpeak.net/wp-content/uploads/2024/02/sony-q4-2023-768x432.png 768w, https://markpeak.net/wp-content/uploads/2024/02/sony-q4-2023-700x393.png 700w\" /></p>\n<p>เราลองไปดู <a href=\"https://www.sony.com/en/SonyInfo/IR/library/presen/er/pdf/23q3_sonyspeech.pdf\">official statement ของโซนี่</a>กันอย่างละเอียด ว่าพูดเรื่องนี้อย่างไร (ตัวเน้นโดยผมเอง)</p>\n<blockquote>\n<ul>\n<li>Regarding the PS5 hardware, which will enter its fifth year since launch, partially due to its entering the latter half of the console cycle, <strong>we aim to </strong><strong>optimize sales with a greater emphasis on the balance with profits</strong>, so we <strong>anticipate a gradual decline in unit sales</strong> from next fiscal year onwards.</li>\n<li>In network services, <strong>we expect subscribers to be on par</strong> with this fiscal year or <strong>slightly less</strong> due to the impact of <strong>price revisions</strong> we implemented in this fiscal year, but we expect sales to gradually expand due to a shift to attractive premium services.</li>\n<li>Regarding first-party software, we aim to continue to focus on producing high-quality works and developing live service games, but, while major projects are currently under development, <strong>we do not plan to release any new major existing franchise titles next fiscal year</strong> like God of War Ragnarök and Marvelʼs Spider-Man.</li>\n<li>Although <strong>the burden of acquisition-related costs</strong> will ease next fiscal year, we expect <strong>profit from first-party software to decrease slightly</strong> from this fiscal year due to the impact of the <strong>decrease in sales.</strong></li>\n<li>Based on this, operating income for next fiscal year is currently expected to increase slightly from this fiscal year. However, while this is our base-line, we are reviewing measures for further  <strong>improvement in profitability</strong> in advance of the annual financial results announcement this May.</li>\n</ul>\n</blockquote>\n<p>ภาพรวมของโซนี่นั้นชัดเจนว่า ชนะสงครามคอนโซลรอบนี้แล้ว ได้เวลาผ่อนเกียร์ ขึ้นราคาแพ็กเกจ เพิ่มอัตรากำไร ลดการลงทุนค่าพัฒนาเกมลง เพราะใช้เงินไปมากกับการพัฒนาเกม และการซื้อกิจการสตูดิโอเกมต่างๆ</p>\n<p>เหตุผลของโซนี่นั้นตรงไปตรงมา เพราะต้นทุนค่าพัฒนาเกมนั้นแพงขึ้นมาก อย่าง<a href=\"https://www.blognone.com/node/137324\">เกม Spider-Man 2 ใช้เงินถึง 315 ล้านดอลลาร์</a> แถม<a href=\"https://www.blognone.com/node/137138\">การซื้อกิจการบางสตูดิโอ เช่น Bungie ก็ไม่เป็นไปตามเป้าหมาย</a> การใช้บริการ 3rd party (เช่น Square Enix) แล้วแบ่งกำไรกัน น่าจะเป็นวิธีการที่ดีกว่า</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/ff7-exclusive.jpg\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/ff7-exclusive.jpg 900w, https://markpeak.net/wp-content/uploads/2024/02/ff7-exclusive-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2024/02/ff7-exclusive-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2024/02/ff7-exclusive-700x394.jpg 700w\" /></p>\n<p>ในอีกด้านของโซนี่คือการผลักดันเกม exclusive ของตัวเองไปยัง “แพลตฟอร์มอื่น” (ในที่นี้คือ PC ยังไม่ไปไกลถึงขั้นลง Xbox) เพื่อคืนทุนค่าพัฒนาเกมให้มากขึ้นและเร็วขึ้น ซึ่งเป็นสิ่งที่โซนี่ทำมาได้สักพักใหญ่ๆ แล้วเช่นกัน</p>\n<p>เท่านั้นยังไม่จบ หลังจากนั้นอีกไม่กี่วัน <a href=\"https://www.blognone.com/node/138346\">โซนี่ก็ประกาศว่าจะเปิดให้แว่น PS VR2 ที่เดิมเป็น exclusive PS5 สามารถใช้กับ PC ได้ด้วย</a> เพราะเกม PS VR2 ก็ขายไม่ค่อยดีนัก การขายแว่น VR ไม่ได้ช่วยดึงให้ยอดขายคอนโซลหรือเกม VR เพิ่มตาม</p>\n<p>เว็บไซต์ PC Gamer พาดหัวซะเห็นภาพว่า “Another wall crumbles in the console exclusivity war” (กำแพง exclusive พังลงไปอีกอัน)</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.pcgamer.com/another-wall-crumbles-in-the-console-exclusivity-war-sony-testing-psvr2-on-pc\">\n\t\t\t\t\t<img src=\"https://markpeak.net/wp-content/plugins/content-cards/skins/default/content-cards-placeholder.png\" alt=\"We've got some trouble | 403 - Access Denied\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.pcgamer.com/another-wall-crumbles-in-the-console-exclusivity-war-sony-testing-psvr2-on-pc\">\n\t\t\tWe've got some trouble | 403 - Access Denied\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.pcgamer.com/another-wall-crumbles-in-the-console-exclusivity-war-sony-testing-psvr2-on-pc\">\n\t\t\t\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://www.pcgamer.com/favicon.ico\" alt=\"www.pcgamer.com\" />\t\twww.pcgamer.com\t</div>\n</div>\n<p>ภาพรวมของเรื่องนี้ (ทั้งฝั่ง Xbox และ PlayStation) คงเป็นสิ่งที่ <a href=\"https://markpeak.net/the-cost-of-making-games/\">Shawn Layden อดีตประธานของ PlayStation Studios เคยพูดไว้หลายปี</a>แล้ว ว่าต้นทุนค่าพัฒนาเกมเพิ่มขึ้นเรื่อยๆ มันเป็นสิ่งที่ไม่ยั่งยืน เพราะตลาดเกมคอนโซลมันใหญ่เท่าเดิม มีผู้เล่นประมาณ 240-260 ล้านคน</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://markpeak.net/the-cost-of-making-games/\">\n\t\t\t\t\t<img src=\"https://markpeak.net/wp-content/uploads/2021/09/unity-making-games.jpg\" alt=\"The Cost of Making Games\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://markpeak.net/the-cost-of-making-games/\">\n\t\t\tThe Cost of Making Games\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://markpeak.net/the-cost-of-making-games/\">\n\t\t\t\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://markpeak.net/wp-content/uploads/2019/01/mk.png\" alt=\"markpeak.net\" />\t\tmarkpeak.net\t</div>\n</div>\n<p>ในช่วงต้นปี 2024 ยังมีเคสตัวอย่างของเกมที่ไม่ใหญ่แต่ประสบความสำเร็จสูงมากบนทั้งสองแพลตฟอร์ม นั่นคือ Palworld (Xbox) และ Helldivers 2 (PS5) ที่ไม่ได้มาจากค่ายใหญ่เลย แต่สามารถแสดงให้เห็นว่า เกมต้นทุนไม่สูงมาก ถ้าทำออกมาดีๆ ก็ประสบความสำเร็จได้ (อย่างไรก็ตาม วงการเกมเป็นเหมือนหนัง คือเป็น hit or miss business ไม่มีอะไรการันตีว่าอะไรจะดังหรือแป๊ก)</p>\n<p>Phil Spencer เองก็พูดเรื่องนี้ไว้ใน<a href=\"https://www.theverge.com/24073666/microsoft-gaming-phil-spencer-interview-ps5-switch-games\">การสัมภาษณ์กับ The Verge</a></p>\n<blockquote><p>In a business that’s very hit driven, you get Palworld out of left field that does incredibly well, and you have other games that don’t.</p></blockquote>\n<p>แนวทางธุรกิจของไมโครซอฟท์จึงพยายามสร้างโมเดลธุรกิจที่หลากหลาย ทั้งการทำ subscription ที่รายได้สม่ำเสมอ (Game Pass), การขายเกมแยกแบบดั้งเดิม, การมีเกมแนว free-to-play ที่หารายได้จากการขายของในเกม และโมเดลใหม่ล่าสุดคือ การนำเกมไปขายบนแพลตฟอร์มอื่นด้วยนั่นเอง</p>\n<blockquote><p>I tell you honestly, running the business, having <strong>a diversity of business models that are working is pretty critical.</strong> The one thing I will say about the <strong>Game Pass subscriber revenue is that it’s consistent.</strong> You can look at it, it’s growing. You can kind of see its growth. <strong>You know plus or minus what it’s going to be next month and the month after.</strong></p>\n<p>I like the fact that we get a mix of things happening with our business. <strong>Our business model is not just about hardware sales, it’s not just about first-party game sales. It’s a diverse business model</strong> that leads to the business success that we’re seeing today</p></blockquote>\n<h2>Nintendo</h2>\n<p>เมื่อพูดถึงปัญหา exclusive &amp; ต้นทุนการพัฒนาเกมของโซนี่และไมโครซอฟท์ ย่อมต้องมี counter example เสมอว่า “ทำไมนินเทนโดยังทำได้”</p>\n<p>คำตอบคือ นินเทนโดเป็นโมเดลธุรกิจที่ต่างไปจากคนอื่น (ในด้านดี) แต่เป็นโมเดลที่บริษัทอื่นผลิตซ้ำความสำเร็จได้ยากมาก เรียกว่านอกจากนินเทนโดแล้วไม่น่ามีใครทำได้เลย</p>\n<p>อย่างแรกคือ เครื่องเกมของนินเทนโดนั้นต้นทุนต่ำกว่า PS5/Xbox มาก เพราะใช้ชิปเก่าเกือบ 10 ปีแล้ว (Tegra X1 ออกปี 2015) ไม่จำเป็นต้องขายฮาร์ดแวร์ต่ำกว่าทุน เพื่อไปเอากำไรจากค่าซอฟต์แวร์เกม เพราะนินเทนโดขายฮาร์ดแวร์แบบมีกำไรตั้งแต่แรก</p>\n<p>ผ่านไปหลายปีแล้ว Switch ยังขายได้เรื่อยๆ ด้วยการออกโมเดลย่อยๆ (เช่น Lite และ OLED) มากระตุ้นตลาด และในไตรมาสเดียวกับที่โซนี่ปรับเป้ายอดขาย PS5 ลง, นินเทนโดกลับปรับเป้ายอดขาย “เพิ่ม” อีกเล็กน้อยได้ด้วย น่าอิจฉาสุดๆ</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-3.png\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-3.png 900w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-3-300x169.png 300w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-3-768x432.png 768w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-3-700x394.png 700w\" /></p>\n<p>ฝั่งซอฟต์แวร์ยิ่งน่าอิจฉาเข้าไปอีก เพราะนินเทนโดมีสัดส่วนยอดขาย 1st party ที่สูงมาก (<a href=\"https://www.nintendo.co.jp/ir/pdf/2024/240206_3e.pdf\">ตัวเลขของไตรมาสล่าสุด</a>คือมากถึง 82.5%) หากเราดู<a href=\"https://en.wikipedia.org/wiki/List_of_best-selling_Nintendo_Switch_video_games\">รายชื่อเกมขายดีของ Switch</a> จะเห็นว่า 23 อันดับแรกคือเกมนินเทนโดล้วนๆ ส่วนเกม 3rd party เกมแรกที่เบียดบังเข้ามาในชาร์ทได้คือ Monster Hunter Rise ของ Capcom</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-2-1024x576.png\" width=\"700\" height=\"394\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-2-1024x576.png 1024w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-2-300x169.png 300w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-2-768x432.png 768w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-2-700x394.png 700w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-2.png 1152w\" /></p>\n<p>หากดูยอดขายเกม 1st party ต่อปีของนินเทนโด จะเห็นว่าคงตัวมาสักพักแล้วในปี FY 2021 เป็นต้นมา เรียกว่าธุรกิจค่อนข้างเสถียรเลยทีเดียว</p>\n<p>การที่บริษัทพึ่งพายอดขายเกม 1st party ในระดับที่สูงมาก ทำให้รายได้จากซอฟต์แวร์เข้าบริษัทเต็มๆ ไม่ต้องแบ่งใครมากนัก แถมข้อดีของเกม 1st party ของนินเทนโดยังมีเรื่องต้นทุนที่ต่ำกว่าโซนี่-ไมโครซอฟท์ เพราะกราฟิกไม่ต้องอลังการมาก ทีมพัฒนาไม่ต้องเป็นระดับ AAA ไปซะทุกเกม (ความคาดหวังของผู้เล่นต่ำกว่า) เน้นคาแรกเตอร์และเกมเพลย์เป็นหลัก ในช่วงหลังๆ เรายังเห็นการ “รีเมค-รีมาสเตอร์” เกมเก่าๆ ของยุค Wii, Wii U มาขายอยู่เรื่อยๆ แปลว่าต้นทุนค่าพัฒนาเกมยิ่งต่ำลงไปอีก</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-4.jpg\" width=\"900\" height=\"506\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-4.jpg 900w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-4-300x169.jpg 300w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-4-768x432.jpg 768w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-4-700x394.jpg 700w\" /></p>\n<p>เมื่อรวมข้อดีทั้งหมดเข้าด้วยกันแล้ว อัตรากำไรจากการดำเนินงาน (operating profit) ของนินเทนโดจึงสูงมาก สูงถึง 33% เลยทีเดียว เทียบกับเคสของโซนี่ที่กำไรในธุรกิจเกม ลดลงจากหลัก 1X% ลงมาเหลือเลขตัวเดียวแล้วในช่วงหลังๆ</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-1-1024x576.png\" width=\"700\" height=\"394\" srcset=\"https://markpeak.net/wp-content/uploads/2024/02/nintendo-1-1024x576.png 1024w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-1-300x169.png 300w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-1-768x432.png 768w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-1-700x394.png 700w, https://markpeak.net/wp-content/uploads/2024/02/nintendo-1.png 1051w\" /></p>\n<p>ทุกคนในธุรกิจเกมย่อมอยากเป็นนินเทนโด แต่ไม่มีใครสามารถทำได้แบบเดียวกัน เพราะไม่มี “แต้มบุญ” หรือ IP เก่าที่แข็งแกร่งมากๆ อย่าง Mario, Pokemon, Zelda มาช่วยอุ้มชูยอดขายนั่นเอง</p>\n<p>อย่างไรก็ตาม โมเดลธุรกิจขั้นเทพของนินเทนโดก็ไม่สามารถขยายตัวแบบนี้ไปได้ง่ายนัก คำถามที่น่าสนใจคือ Nintendo Switch 2 หรือเครื่องเกมเจ็นหน้าจะเป็นอย่างไร การอัพเกรดสเปกย่อมมาพร้อมต้นทุนที่สูงขึ้น และ reason to buy ของผู้เล่นที่มี Switch อยู่แล้วก็ไม่ชัดเจนนัก เป็นสิ่งที่ต้องติดตามดูกันว่านินเทนโดจะแก้สมการนี้ได้แค่ไหน หรือสุดท้ายแล้ว Switch 2 มันจะกลายเป็น Wii U 2 หรือเปล่า</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.windowscentral.com/gaming/xbox/the-future-of-xbox-is-the-end-of-exclusive-games-the-right-choice\">\n\t\t\t\t\t<img src=\"https://cdn.mos.cms.futurecdn.net/HS7XLP4tEQm9CDerm3p22g-1200-80.jpg\" alt=\"The future of Xbox: Will history remember 'the end of exclusive games' as the right choice?\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.windowscentral.com/gaming/xbox/the-future-of-xbox-is-the-end-of-exclusive-games-the-right-choice\">\n\t\t\tThe future of Xbox: Will history remember 'the end of exclusive games' as the right choice?\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.windowscentral.com/gaming/xbox/the-future-of-xbox-is-the-end-of-exclusive-games-the-right-choice\">\n\t\t\t<p>A gamble that could pay off, or backfire.</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://cdn.mos.cms.futurecdn.net/flexiimages/e3utnesr6b1647264394.png\" alt=\"Windows Central\" />\t\tWindows Central\t</div>\n</div>\n<p>อีกประเด็นที่น่าสนใจคือ สภาพการแข่งขันในอุตสาหกรรมเกมนั้นเปลี่ยนไป จากเดิมที่ “ใช้เกม exclusive สุดฮิต ดันยอดขายฮาร์ดแวร์ให้พุ่ง” (เช่น Halo ดันยอดขาย Xbox 360) แล้วไปทำกำไรจากยอดขายเกมอื่นๆ ภายหลัง มันไม่เวิร์คอีกแล้ว เพราะเกมยุคนี้มันนำไปเล่นในคอนโซลเจ็นหน้าได้ (เริ่มจาก PS4 -&gt; PS5, Xbox One -&gt; Xbox Series และกำลังจะเกิดกับ Switch -&gt; Switch 2) เกมเมอร์ยุคนี้ใช้วิธี “สะสมเกมในคลัง” แล้วนำไปใช้กับคอนโซลรุ่นถัดไป ทำให้การมีเกมดังๆ ฮิตๆ เพียงไม่กี่เกม ไม่สามารถดึงคนข้ามค่ายคอนโซลได้ง่ายเหมือนเดิม</p>\n<p>Spencer สรุปไว้ชัดเจน</p>\n<blockquote><p>I know there’s this fictitious world where people think that<strong> one exclusive game kind of kicks off the sales of a platform, but the industry just doesn’t really work that way today.</strong></p>\n<p>We’ve made a commitment in recognizing and respecting <strong>the library of games that people have purchased on our platform</strong>. I think <strong>we have a good track record with our backward compatibility</strong>, with Xbox Play Anywhere giving you a PC and console entitlement when you buy a game from us. When we’ve talked about <strong>future hardware that we’re going to go build, compatibility and library support is just kind of fundamental</strong> for us when we think about what our plans are. So we’re very, very committed to that.</p></blockquote>\n<p>ส่วนตัวแล้วคิดว่า การปรับทิศทางธุรกิจของทั้ง Xbox/PlayStation เป็นสัญญาณบ่งชี้ว่า การตุน exclusive เพื่อจูงใจให้คนอยู่บนแพลตฟอร์มคอนโซลมีข้อจำกัดเรื่องต้นทุนมากขึ้นเรื่อยๆ ทำให้บริษัทแม่ต้องตัดสินใจนำเกม exclusive ไปทำเงินทางอื่นเพิ่มเติม ซึ่งเป็นประโยชน์ในแง่ธุรกิจจริงๆ (แม้อาจไม่มากสุดๆ) ในแง่การแข่งขันคงไม่มีการเปลี่ยนแปลงอะไรจากเดิมมากนัก คนกลุ่มเดียวที่เสียประโยชน์คือแฟนบอยนั่นเอง</p>The post <a href=\"https://markpeak.net/the-end-of-console-exclusivity/\">The End of Console Exclusivity</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"62dc4def157af849dbaaf3c4463cb9ad8b914bd68249fb7e466352b0b4329b0b","category":"Thai"}