{"title":"★ The Names They Call Themselves","link":"https://daringfireball.net/2026/01/the_names_they_call_themselves","date":1769537576000,"content":"\n<p>Jonathan Rauch, writing for The Atlantic, “<a href=\"https://www.theatlantic.com/ideas/2026/01/america-fascism-trump-maga-ice/685751/?gift=aQyUJR7AIw1mJWdQ6Ed6yAGei6y469cre0s3RYa6ArU\">Yes, It’s Fascism</a>” (gift link):</p>\n\n<blockquote>\n  <p>Until recently, I resisted using the F-word to describe President\nTrump. For one thing, there were too many elements of classical\nfascism that didn’t seem to fit. For another, the term has been\noverused to the point of meaninglessness, especially by\nleft-leaning types who call you a fascist if you oppose abortion\nor affirmative action. For yet another, the term is hazily\ndefined, even by its adherents. From the beginning, fascism has\nbeen an incoherent doctrine, and even today scholars can’t agree\non its <a href=\"https://scholarworks.lib.csusb.edu/cgi/viewcontent.cgi?article=1160&amp;context=history-in-the-making\">definition</a>. Italy’s original version differed from\nGermany’s, which differed from Spain’s, which differed from\nJapan’s. [...]</p>\n\n<p>When the facts change, I change my mind. Recent events have\nbrought Trump’s governing style into sharper focus. <em>Fascist</em> best\ndescribes it, and reluctance to use the term has now become\nperverse. That is not because of any one or two things he and his\nadministration have done but because of the totality. Fascism is\nnot a territory with clearly marked boundaries but a constellation\nof characteristics. When you view the stars together, the\nconstellation plainly appears.</p>\n</blockquote>\n\n<p>Rauch goes on to describe that constellation clearly and copiously, with evidence. I agree, wholeheartedly, with his conclusion that “If, however, Trump is a fascist <em>president</em>, that does not mean that America is a fascist <em>country</em>.” The shoe fits, however <a href=\"https://apnews.com/article/trump-swelling-legs-chronic-venous-insufficiency-health-40beb3c818cfb914645db9d1f143fdd8\">tightly</a>.</p>\n\n<p>But there’s a problem that’s been gnawing at me ever since the 2.0 Trump Administration began. The entire premise of Rauch’s essay — the issue he changed his mind about — is that it’s contentious to describe people, let alone an entire political party or government, as “fascist” or “Nazi”. With only the most extremist exceptions, it’s a broad cultural value — a shared global value, not merely an American or western one — that the Nazis and Fascists were abominable. Also, they were <a href=\"https://www.nytimes.com/interactive/2020/05/07/magazine/ve-day-anniversary.html\">losers</a>, and their complete and total destruction was <a href=\"https://www.life.com/history/v-j-day-kiss-times-square/\">celebrated</a> around the world. Hitler shot himself, hiding <a href=\"https://www.life.com/history/after-the-fall-photos-of-hitlers-bunker-and-the-ruins-of-berlin/\">in a dingy filthy bunker</a>. Mussolini was summarily executed and his body <a href=\"https://en.wikipedia.org/wiki/Death_of_Benito_Mussolini\">strung up in a public square in Milan</a>. Hirohito surrendered unconditionally and lived his remaining days in quiet shame and infamy. No matter how apt the definition of <em>fascist</em> fits the Trump regime, they themselves reject the term, as they do not see themselves as being on the wrong side, and the definition of fascism is that it’s wrong. And they (exemplified by Trump himself) have a deep-seated psychological aversion to being seen as losers, even when it is as plain to see as the sun <a href=\"https://www.nytimes.com/interactive/2020/11/03/us/elections/results-president.html\">that they have lost</a> — and no one denies that the Fascists and Nazis lost, bigly.</p>\n\n<p>We call Benito Mussolini’s regime “fascist” because <a href=\"https://www.history.com/articles/mussolini-italy-fascism\">he coined the term</a>. His political movement was literally named the Fascist Party. There was no debate whether Hitler and his regime were Nazis <em>because that was their name</em>. “Fascist” and “Nazi” weren’t slurs that were applied to them by their political or military opponents. That’s what they called themselves, and their names <em>became</em> universally recognized slurs because the actions and beliefs of the Fascists and Nazis were universally recognized as reprehensible and evil. And because they lost.</p>\n\n<p>Our goal should not be to make <em>fascist</em> or <em>Nazi</em> apply to Trump’s movement, no matter <a href=\"https://www.thebulwark.com/p/mattis-told-woodward-he-agreed-trump\">how well</a> those rhetorical gloves fit his <a href=\"https://www.vanityfair.com/news/2016/03/how-donald-trump-became-the-short-fingered-vulgarian\">short-fingered</a> <a href=\"https://www.irishstar.com/news/us-news/donald-trump-hand-bruise-meaning-35799798\">disgustingly</a> <a href=\"https://www.ms.now/news/trump-hand-bruise-photo\">bruised</a> hands. Don’t call Trump “Hitler”. Instead, work until “Trump” becomes a new end state of <a href=\"https://en.wikipedia.org/wiki/Godwin%27s_law\">Godwin’s Law</a>.</p>\n\n<p>The job won’t be done, this era of madness will not end, until we make <em>the names they call themselves</em> universally acknowledged slurs.</p>\n\n<p>“MAGA” and “Trumpist”, for sure. “Republican”, <a href=\"https://www.nbcnews.com/politics/2026-election/minnesota-governor-candidate-chris-madel-gop-immigration-enforcement-rcna255949\">perhaps</a>. Make <em>those</em> names <a href=\"https://www.nytimes.com/interactive/2026/01/24/us/minneapolis-shooting-alex-pretti-timeline.html?unlocked_article_code=1.HlA.jIxp.ieLWsJ7EHyct\">shameful</a>, <a href=\"https://www.wsj.com/politics/policy/the-48-hours-that-convinced-trump-to-change-course-in-minnesota-a91d7683?st=xEZf8d\">deservedly</a>, now, and there will be no need to apply the shameful names of hateful anti-democratic illiberal failed nationalist movements from a century ago. We need to assert this rhetoric with urgency, make <em>their</em> names shameful, lest the slur become <em>our</em> name — “American”.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"63ee9d0f9035e60b27205c26692bd6ce0e60f955427d311aff63fc4fb6a50d33","category":"Tech"}