{"title":"San Francisco Bay Area Loop by Thomas Woodson","link":"https://moots.com/blogs/news/san-francisco-bay-area-loop-by-thomas-woodson","date":1769127218000,"content":"\n      <p>The San Francisco Bay Area, despite its massive population, holds an equally massive amount of protected land: networks of multi-use trails and campgrounds stitched throughout. You trade remoteness for convenience, but this kind of variety is something I love to fold into my bikepacking goals. Plentiful food, quality sleep, hard-charging downhills—elements worth remembering the next time you<span>’</span>re really out there and feeling a bit thrashed.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/202512_BayAreaLoop_Woodson_639.jpg?v=1769127093\" alt=\"\" /></p>\n<p>My introduction to the area was the SF Peninsula Traverse, a route I used to start a weeklong ride from San Francisco Airport to Los Angeles Airport in 2019. In 2024, Adam Sklar showed me around some of the Marin and Fairfax classics. I<span>’</span>ve been fascinated by the sheer number of options ever since, to the point that my Gaia GPS maps are now borderline too cluttered to navigate.</p>\n<p>Looking for ways to combine the SF Peninsula Traverse with the Bay Area Triple Crossover led us to Bikepack the Bay—a 265-mile, +27,000ft route that we trimmed slightly to fit more comfortably into a three-day window with limited December daylight.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/202512_BayAreaLoop_Woodson_643.jpg?v=1769127121\" alt=\"\" /></p>\n<p>Day 1 covered 64 miles and +5,600ft from Sklar<span>’</span>s shop in the Mission District, following the SF Peninsula Traverse through Half Moon Bay, climbing into the redwoods (at night), and dropping into a Palo Alto hotel. The route starts urban, slowly dissolving into crumbling abandoned roads through the hills, coastline bike paths, and finally a lush, pine-needle climb that<span>’</span>s absolutely grueling. From Skyline Road, the Kings Mountain Road descent—ridden in the dark—was the best road descent of my life. Dynamo-illuminated reflectors twisted through the redwoods like the ultimate video game.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/202512_BayAreaLoop_Woodson_154.jpg?v=1769127149\" alt=\"\" /></p>\n<p>Day 2 began with a long bridge and shoreline crossing, then followed nearly the entire skyline from Fremont to Richmond along the Bay Area Ridge Trail (decently signed).<span>  </span>77 miles and +7,700ft. Spending the entire day on bike paths, wide dirt roads, and ripping singletrack was hard to believe given the proximity to millions of people. Fifty-two-tooth cassettes and the absence of camping gear were especially welcome for just how steep every climb was on this stretch.</p>\n<p>Day 3 opened with another bridge traverse and 67 miles of +7,300ft along ridge top fire roads to Lagunitas—the only resupply point—before a final push along Bolinas Ridge, around Tam, and across the Golden Gate back into San Francisco. Once again, a full day without really touching a road. We skipped the Headlands trails as sunset approached, but there are plenty of options to explore there.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/202512_BayAreaLoop_Woodson_360.jpg?v=1769127177\" alt=\"\" /></p>\n<p>The varied, ever-changing terrain kept us engaged. The urban offered a reprieve from the steeps; the steeps, a reprieve from the urban. Staying in cheap hotels felt like a luxury—less luggage, more riding. Kyle is typically the route master when we<span>’</span>re out together, but I believe I showed him some things to change his perspectives this time around. The Bay Area is about to be one of our winter classics.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/202512_BayAreaLoop_Woodson_690.jpg?v=1769127196\" alt=\"\" /></p>\n<p><b>Tips</b><br />– Navigation is constant. A head unit is essential, and having the tracks on your phone as backup is smart. Trail closures around the Baylands in Palo Alto before the bridge crossing added a few miles of backtracking<br />– The Richmond Bridge closes the bike lane during the week but offers a free shuttle bus in its place. If you want to ride it, check schedules and plan a weekend crossing<br />– Keeping a variety of Bay Area routes saved allows for easy on-the-fly modifications or side quests<br />– SFO Airport offers luggage storage and a bike stand if you want to start and finish the loop there</p>\n<p><b>Incredible resources:</b><br />SF Peninsula Traverse – <a href=\"https://bikepacking.com/routes/sf-peninsula-traverse/\"><span>https://bikepacking.com/routes/sf-peninsula-traverse/</span></a><br />Bay Area Triple Crossover – <a href=\"https://bikepacking.com/routes/bay-area-triple-crossover/\"><span>https://bikepacking.com/routes/bay-area-triple-crossover/</span></a><br />Bay Area Ridge Trail – <a href=\"https://ridgetrail.org/\"><span>https://ridgetrail.org/</span></a><br />Bikepack the Bay – <a href=\"https://www.bikepackthebay.com/\"><span>https://www.bikepackthebay.com/</span></a></p>\n<p><span>--- </span><span></span></p>\n<p><span>\n<strong>Thomas Woodson</strong> is a Colorado-based photographer and Moots ambassador known for capturing long days, quiet moments, and the kind of riding that rewards curiosity over convenience. He currently rides a dropbar MXC in our Groundswell finish, a setup well suited to the mixed terrain and exploratory routes that shape his work.</span></p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"64e657b8661e63beba691aa0ef7fb567755c15f685fcad2dd8bc0c041822f0b4","category":"Cycling"}