{"title":"Wikipedia blacklists Archive.today, starts removing 695,000 archive links","link":"https://arstechnica.com/tech-policy/2026/02/wikipedia-bans-archive-today-after-site-executed-ddos-and-altered-web-captures/","date":1771612543000,"content":"<p>The English-language edition of Wikipedia is blacklisting Archive.today after the controversial archive site was used to direct a distributed denial of service (DDoS) attack against a blog.</p>\n<p>In the course of discussing whether Archive.today should be deprecated because of the DDoS, Wikipedia editors discovered that the archive site altered snapshots of webpages to insert the name of the blogger who was targeted by the DDoS. The alterations were apparently fueled by a grudge against the blogger over a post that described how the Archive.today maintainer hid their identity behind several aliases.</p>\n<p>\"There is consensus to immediately deprecate <a href=\"https://en.wikipedia.org/wiki/Archive.today\">archive.today</a>, and, as soon as practicable, add it to the spam blacklist (or create an edit filter that blocks adding new links), and remove all links to it,\" stated an <a href=\"https://en.wikipedia.org/wiki/Wikipedia:Requests_for_comment/Archive.is_RFC_5\">update</a> today on Wikipedia's Archive.today discussion. \"There is a strong consensus that Wikipedia should not direct its readers towards a website that hijacks users' computers to run a DDoS attack (see <a href=\"https://en.wikipedia.org/wiki/Wikipedia:ELNO#EL3\">WP:ELNO#3</a>). Additionally, evidence has been presented that archive.today's operators have altered the content of archived pages, rendering it unreliable.\"</p><p><a href=\"https://arstechnica.com/tech-policy/2026/02/wikipedia-bans-archive-today-after-site-executed-ddos-and-altered-web-captures/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/tech-policy/2026/02/wikipedia-bans-archive-today-after-site-executed-ddos-and-altered-web-captures/#comments\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6a4bb0cc8ba53ca5a0965b0a2e2207af6d88360728937c4d9f02bcbd5ee9b7de","category":"Tech"}