{"title":"MLS 2026 Season Begins February 21 on Apple TV With Free Access for Subscribers","link":"https://www.macrumors.com/2026/02/19/major-league-soccer-2026-season-start/","date":1771521875000,"content":"The 31st Major League Soccer season is <a href=\"https://www.apple.com/newsroom/2026/02/major-league-soccer-kicks-off-2026-season-on-apple-tv/\">set to begin on Saturday, February 21</a>, with games set to be available through the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> subscription service. ‌Apple TV‌ subscribers in more than 100 countries can access MLS matches with no blackouts and no additional fees.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/apple-mls-season-begins-2026.jpg\" alt=\"\" width=\"1960\" height=\"1104\" />\r<br />\nApple used to charge $14.99 per month or $99 for the MLS Season Pass, but the Season Pass was removed for the 2026 season to give all ‌Apple TV‌ subscribers access for free. MLS is aiming to expand its fanbase and make content easier to access through its partnership with Apple.\r<br />\n\r<br />\nApple says that MLS on ‌Apple TV‌ will include Walmart Saturday Showdown, which spotlights a featured matchup during the Saturday slate of matches throughout the regular season. It will include enhanced production that's designed to \"help viewers feel more connected to the match,\" with Shot on <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> moments captured with dynamic angles. This week's Saturday Showdown will feature LAFC vs Miami at the LA Memorial Coliseum. The game is set to begin at 9:30 p.m. Eastern Time.\r<br />\n\r<br />\nAll 30 MLS teams will take the pitch on February 21 and February 22 for MLS is Back Weekend. 13 of 15 season openers are scheduled for Saturday, with two games on Sunday. The season will begin with St. Louis facing off against Charlotte at 2:30 p.m. Eastern Time. A full schedule can be <a href=\"https://www.mlssoccer.com/competitions/mls-regular-season/2025/schedule/#date=2026-02-10\">found on the MLS website</a>.\r<br />\n\r<br />\nSoccer fans can keep up to date with scores, stats, and standings throughout the MLS season with the <a href=\"https://apps.apple.com/us/app/apple-sports/id6446788829\">Apple Sports app</a>. The app offers Live Activities for all MLS matches, with live scores and play-by-play information. Apple will also have special curated playlists on <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, dedicated Matchday Guides in <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a>, an MLS hub in the <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a> app, and MLS info in <a href=\"https://www.macrumors.com/guide/apple-news/\">Apple News</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/mls-season-pass/\">MLS Season Pass</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2026/02/19/major-league-soccer-2026-season-start/\">MLS 2026 Season Begins February 21 on Apple TV With Free Access for Subscribers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/mls-2026-season-begins-february-21-on-apple-tv-with-free-access-for-subscribers.2477941/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6ac800c74e5f9784f80eea7b93efabec00888b0ac82b2416632f22104d23d71b","category":"Apple"}