{"title":"Elisa Longo Borghini is insatiable for more success: 'You won’t get rid of me anytime soon. I want to be ELB 3.0'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/elisa-longo-borghini-is-insatiable-for-more-success-you-won-t-get-rid-of-me-anytime-soon-i-want-to-be-elb-3-0","date":1768239201000,"content":"\n      <p><span>“When I retire you will not see Elisa Longo Borghini anywhere in cycling,” the queen of Italian racing states, firmly. ‘You will not see me anymore. No social media, nothing. I want to disappear. Some cows, a dog, a horse, a family. And a job.” When she was starting out in cycling, all the way back in 2012 when riders were lucky to be even paid for riding their bike, she was </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/question-time-with-elisa-longo-borghini?srsltid=AfmBOorAA3NRfx_JbeuZ0KXqT9y6lw5JtRYRl3O0u7Lm9LwaJwB_5FS0\"><span>working as a part-time police officer</span></a><span>. “I've been out of the police since 2017 and it’s hard [to come back] but I’ll figure out my way.” Could she be a sports director? “It’s the last job I will ever do!” she laughs. “I will never be a sports director in my life, full stop. </span><em>Never</em><span>. I am better at driving the bus.”</span><b></b></p>\n<p><span>All this prompts a giggle, but it’s all pretty much irrelevant right now because Longo Borghini has zero intention of retiring anytime soon. Recently-turned 34, Longo Borghini is the peloton’s elder stateswoman, a rider who took her first UCI win in 2012, claimed her first Tour of Flanders title in 2015, and who has then gotten better and better and better as her 20s and then her 30s developed: a Paris-Roubaix win, another Flanders victory, two Giro d’Italia <em>maglia rosas</em>, and plenty more in between. 2026, she intends, will just be a continuation of her enduring greatness.</span><b></b></p>\n<p><span>“It’s not actually ticking a box, like I want this or want that, but it’s more that I am passionate about my job, I love my job, and every year I want to become a little bit better,” she tells </span><em>Rouleur</em><span> when asked what’s left for her to achieve. “Results or victories are just a consequence. I like to be ELB 2.0 or ELB 3.0 every year, every year a little bit better, the best version of myself, and whatever I win, I win. I don’t mind winning, I </span><em>love</em><span> winning.”<br /><br /></span><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_63_1_4288c0b3-d727-48dd-a22c-2467108e565c.png?v=1768200064\" alt=\"\" /></b><em>Focused, determined and conviction: Longo Borghini's defining traits.</em></p>\n<p><span>The emotion and sensation of winning is addictive. Longo Borghini strives to feel it again and again. Motivation, she insists, is never in short supply because each win is wrapped in its own uniqueness. “Over a year you change as a person, you change inside, and every victory feels different,” she says. “The hunger is the same, but you just change as a person. Life is a process, right? We are evolving every single day, you’re not the same person today as you were yesterday, and you’re not going to be the same person tomorrow. It’s just a fact that you will perceive the victory in a different way to how you perceived the victory when you were 23.” Take Flanders, for example. This April she’ll go back for a record-equalling third title. “For sure if I ever win Flanders for a third time it will feel different. If I look back and try to feel what I was feeling in 2015 when I was just a kid, it’s something completely different to what I was feeling in 2024, so I do believe if I will win it in 2027 it will be different again.”</span><b></b></p>\n<p><span>Twelve months ago Longo Borghini took the decision to leave Lidl-Trek after six highly impressive years to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/elisa-longo-borghini-i-didn-t-transfer-to-uae-team-adq-for-the-money?srsltid=AfmBOor7sg3kErwK0vj7ztzGNzKktUIfzu4kz9pdOzofzw3Ntp0D3KGa\">move to UAE Team ADQ.</a> Her first season was a success with nine wins, and the team, only four years into its current iteration, had its winningest campaign yet. Riders like Maeva Squiban, Lara Gillespie and Dominika Wlodarczyk emerged as serious players. “It was definitely a big pride for me as I saw the team growing,” Longo Borghini says. “I’m very happy because I love to be surrounded by strong riders and strong women so it’s super cool.”</span><b></b></p>\n<p><span>But she bristles at the suggestion that her own role in the team will evolve from star rider to mentor. “To be honest, I am very hungry for victories and very focused on myself and what I can achieve with my team,” the reigning and six-time Italian champion proclaims. “You won’t get rid of me anytime soon. I have been improving quite a lot in the last couple of years and I do believe I can improve a little bit more, and the rest comes with experience I guess. Knowledge brings success, and that brings a level up all the time.”</span></p>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_62_1_abfcc4c7-a11f-459e-ba59-730a6d7d0344.png?v=1768200064\" alt=\"\" /></b><em>Longo Borghini's first big target of the 2026 season will be the spring Classics. Last year she won Dwars door Vlaanderen and De Brabantse Pijl.</em></p>\n<p><span>Of the many goals Longo Borghini has in 2026, starting with Strade Bianche and then targeting a third successive Giro title, the one she’s most keen to set out is her plans for the </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\"><span>Tour de France Femmes avec Zwift</span></a><span>. It’s a race where she’s got a monkey clinging to her back, refusing to let go. “My main goal is to finish it because for one reason or another I haven’t finished the Tour de France since 2023, or I haven’t even started it because in 2024 I crashed before the Tour. I would be very happy to finish in Nice this time.”</span><b></b></p>\n<p><span>Why does she appear to have so much bad luck at the season’s centrepiece race? “I have no fucking clue,” she retorts. “In 2023 I got an intention that came out of the blue and I got sepsis. In 2024 I crashed while training three days before and I had no skin on my body and fever for a week. And in 2025 I had a gastro problem [and withdrew after two days]. The only time I finished the Tour was in 2022 but I made so many silly mistakes like taking the </span><a href=\"https://www.rouleur.cc/en-us/blogs/the-rouleur-journal/tour-de-france-femmes-2022-stage-five-debrief-a-long-day-a-big-sprint-and-a-wrong-turn\"><span>car deviation in the final [of stage five]</span></a><span>. So I don’t really know what’s going on with the Tour de France but I really like the race and I really wish I can finish it.”</span><b></b></p>\n<p><span>But, of course, Longo Borghini won’t go to the Tour de France </span><em>just</em><span> to finish it. “My main goal at the Tour will be hunting stages, but then you’re Longo Borghini and no-one will let you go away alone, because then if you gain time it’s a problem,” she says. “I would never let Demi Vollering – even if she had the most genuine intention to just win a stage and then get dropped the next stage – to win a stage of the Tour de France; she’s just too much of a threat. We will see, I will go with the flow.” All this is just further confirmation that Longo Borghini is far from done in the sport. “If I was 39 or 40, I wouldn’t want to miss this era; I’d like to stay.” At 34, then, she’s still a spring chicken. </span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6cb3d58be24b3bb4c19867f6c095ef4780eb5e4c09c65ebec6cf4a1887a96719","category":"Cycling"}