{"title":"Winter Miles & Community Vibes – Tucson Cycling","link":"https://moots.com/blogs/news/winter-miles-community-vibes-tucson-cycling","date":1742870837000,"content":"\n      <p> </p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_4891-1024x768.jpg?v=1762206703\" alt=\"\" /></figure>\n<p>There’s something special about Tucson, AZ – a place where the sun always seems to shine, the roads are made for riding, and the cycling community feels like family. For the past eight years or so, this has been one of my go-to training locations, offering everything from fast -paced group rides to long solo miles on wide-open roads. It’s a place that keeps calling me back, and for good reason.</p>\n<p>One of the best ways to experience Tucson’s cycling culture is the legendary <strong>Shootout</strong>, a Saturday morning group ride that brings together riders of all levels- from weekend warriors to World Tour and Gravel pros. It’s a staple in the cycling world, a true test of fitness, and one of the best ways to push yourself while soaking in the energy of the local riding scene.</p>\n<p>Beyond the Shootout, Tucson offers endless options for both challenging and relaxed rides. <strong>The Loop </strong>provides over <strong>130 miles of car-free riding</strong>, perfect for easy spins or recovery days. And then there’s <strong>Mt. Lemmon</strong> -an iconic, nearly 7,000-foot climb that rewards riders with epic views. <strong>Gates Pass</strong> is another favorite, offering one of the most stunning ride experiences in town.</p>\n<p>And what better way to enjoy these roads than on my <a href=\"https://moots.com/bikes/road/vamoots-rcs/\"><strong>Moots Vamoots RCS</strong></a>? The smooth titanium ride, responsive handling, and all-day comfort make it the perfect companion for Tucson’s terrain.</p>\n<h2>Giving Back: Tucson Bicycle Classic</h2>\n<p> </p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/01174701-1024x768.jpg?v=1762206692\" alt=\"\" /></figure>\n<p> </p>\n<p>For the past four years, I’ve had the privilege of helping with the <strong>Tucson Bicycle Classic</strong>, a race that has become an incredible launching pad for new women racers. The turnout was fantastic and seeing so many new faces on the start line was inspiring. Supporting women’s racing has always been close to my heart, and Tucson continues to be a place where the cycling community truly steps up to make the sport more inclusive and exciting.</p>\n<h2>Coming Up…</h2>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_4905-768x1024.jpg?v=1762206703\" alt=\"\" /></p>\n<p>While I’ve been soaking up all that Tucson has to offer, I’m also gearing up for some exciting events. Next stops: <strong>Monterey, CA for the Sea Otter Classic</strong>, <strong>San Francisco for the Climate Ride on April 22nd </strong></p>\n<p>If you’re in the area, I’d love to connect, ride, and talk about how USA Cycling Foundation is supporting the next generation of cyclists!</p>\n<p>Tucson has reminded me once again why I love this sport-it’s about more than just the miles. It’s the people, the places, and the experiences that make cycling such a powerful and lifelong passion.</p>\n<p>See you on the road!</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"6cce93ee97215e4f0535317b8116fea27cc2fdbcf5b4afb9c43b802f75154bff","category":"Cycling"}