{"title":"How Benchling saved 8,000 hours by changing how it used Terraform","link":"https://www.hashicorp.com/blog/how-benchling-saved-8000-hours-by-changing-how-it-used-terraform","date":1771437600000,"content":"<p>Benchling is a vertical B2B SaaS company that builds cloud software for biologists. With hundreds of engineers supporting scientists who rely on the platform for critical research workflows, Benchling operates a large and complex cloud environment spanning more than 165,000 cloud resources. As the company scaled, developers were dealing with 30-minute Terraform plans, lots of manual coordination, and then having to babysit many of their releases. Their workflows were a huge drain on engineering time and energy.</p>\n\n<p>To address this, Benchling changed how it managed <a href=\"https://www.hashicorp.com/en/resources/what-is-infrastructure-as-code\">infrastructure as code</a>: No more Terraform runs on individual machines. They wanted centralized governance and execution. Those changes, and several others, eliminated significant operational toil, <strong>saving an estimated 8,000 developer hours</strong> across the engineering organization.</p>\n\n<p>This post will drill down into the specific workflows and organizational changes that made those time and cost savings possible. Then we’ll see how Benchling used those extra hours to focus on higher-value work, including disaster recovery automation and targeted cloud cost optimizations.</p>\n\n<p><em>This story comes from a HashiConf <a href=\"https://www.youtube.com/watch?v=b8HS0TIW-2w\">fireside chat</a> featuring Christian Monaghan, Senior Infrastructure Engineer at Benchling.</em></p>\n\n<h2>The cost of decentralized Terraform runs</h2>\n\n<p>In its early days, Benchling relied on what Christian described as laptop-based Terraform execution. Developers ran <code>terraform plan</code> and <code>terraform apply</code> directly from their own machines, carrying responsibility for execution, timing, and coordination themselves. That approach worked early on, but it became increasingly fragile as the company and its cloud footprint grew.</p>\n\n<p>At the time, Benchling was managing roughly 350 Terraform workspaces. Some infrastructure changes touched dozens of those workspaces, and in certain cases, a single change could fan out to nearly 100 workspaces.</p>\n\n<p>That scale turned routine changes into slow, attention-draining work:</p>\n\n<ul>\n<li>Terraform plans could take up to 30 minutes per workspace</li>\n<li>Large changes required manual coordination across environments</li>\n<li>Developers often had to babysit releases as plans and applies progressed</li>\n<li>Releasing infrastructure changes demanded sustained focus over long periods</li>\n</ul>\n\n<p>To avoid conflicts, teams relied on a Slack channel to call “dibs” on environments — a way of signaling that someone was testing a change and asking others not to touch that environment until they were done.</p>\n\n<p>The team had already tried to reduce some of this friction by building a custom Python script to orchestrate Terraform runs across multiple environments. While the script helped kick off runs in parallel, it didn’t eliminate the underlying problem. Developers still had to review results workspace-by-workspace, watching long-running plans and intervening when something went wrong.</p>\n\n<p>When an incident occurred, figuring out what went wrong meant chasing down:</p>\n\n<ul>\n<li>Commit history</li>\n<li>Execution timing</li>\n<li>Who ran the change, and from which machine</li>\n</ul>\n\n<p>The pain was visible across the engineering organization, and the limits of laptop-based workflows made the case for change obvious.</p>\n\n<h2><strong>Shifting execution from laptops to a shared platform</strong></h2>\n\n<p>Benchling adopted HCP Terraform roughly two and a half years ago, giving developers the platform they needed to centralize infrastructure execution and drastically reduce coordination toil.</p>\n\n<p>Instead of developers running Terraform locally, HCP Terraform became the system responsible for:</p>\n\n<ul>\n<li>Executing plans and applies</li>\n<li>Managing state and locking</li>\n<li>Recording which commit triggered each run</li>\n</ul>\n\n<p>That change alone removed a significant amount of manual coordination and guesswork from the process, especially when incidents occurred.</p>\n\n<p>It also laid the groundwork for broader changes in how Benchling structured its infrastructure.</p>\n\n<h2><strong>Rethinking workspace strategy once automation removed friction</strong></h2>\n\n<p>Benchling’s initial workspace strategy was shaped by pain. Running Terraform was slow and attention-heavy, so the team tried to minimize how often it had to happen.</p>\n\n<p>That led to more bad practices:</p>\n\n<ul>\n<li><strong>Action</strong>: Fewer workspaces, to reduce the number of runs</li>\n<li><strong>Result</strong>: Very large workspaces, some managing 4,000+ resources</li>\n</ul>\n\n<p>HCP Terraform eventually led the team to adopt better practices because its centralized and automated execution workflows drastically reduced the amount of attention required.</p>\n\n<p>That allowed the team to shift in the opposite direction:</p>\n\n<ul>\n<li>Biasing toward more workspaces</li>\n<li>Smaller workspaces reduced the blast radius if a harmful change was introduced</li>\n<li>Letting automation absorb the cost of scale, instead of engineers</li>\n</ul>\n\n<h2><strong>Managing everything as code, not just IaaS</strong></h2>\n\n<p>As Benchling’s infrastructure matured, the team extended its infrastructure as code approach beyond cloud resources alone. Wherever a <a href=\"https://developer.hashicorp.com/terraform/language/providers\">Terraform provider</a> existed for a tool they were using, they preferred to orchestrate that system with Terraform.</p>\n\n<p>That meant that, instead of just orchestrating AWS infrastructure, they could also orchestrate setup for:</p>\n\n<ul>\n<li>Datadog</li>\n<li>PagerDuty</li>\n<li>and more...</li>\n</ul>\n\n<p>… all through one platform.</p>\n\n<p>This approach helped standardize workflows across a growing SaaS surface area and reduced the number of one-off operational processes engineers had to learn or maintain.</p>\n\n<h2><strong>Improving security by changing the release model</strong></h2>\n\n<p>One of the most significant side effects of adopting HCP Terraform was how <strong>it changed Benchling’s security posture — without requiring a separate security-driven initiative</strong>.</p>\n\n<p>In their earlier workflows, developers needed direct production access to run Terraform from their laptops. After the transition, that model changed entirely:</p>\n\n<ul>\n<li><p>Developers submit changes via pull requests</p></li>\n<li><p>HCP Terraform handles execution in production</p></li>\n<li><p>Direct production access for developers was reduced to almost zero</p></li>\n</ul>\n\n<p>That shift made several things possible:</p>\n\n<ul>\n<li><p>Smaller blast radius for security exposures</p></li>\n<li><p>Easier integration with security processes</p></li>\n<li><p>The ability to introduce <a href=\"https://www.hashicorp.com/en/sentinel\">Sentinel</a> <a href=\"https://www.hashicorp.com/en/blog/policy-as-code-explained\">policy as code</a> into the workflow — something that was effectively impossible when runs happened on laptops</p></li>\n</ul>\n\n<p>Because HCP Terraform was already in place, later efforts to harden production access were significantly easier than they would have been otherwise.</p>\n\n<h2><strong>Making the transition without disrupting teams</strong></h2>\n\n<p>While the technical case for HCP Terraform was clear, the bigger challenge was changing how developers worked day to day. As Christian noted during the discussion, selling the value of a new tool wasn’t especially difficult. What took more care was shifting established workflows.</p>\n\n<p>Benchling approached the transition gradually, focusing first on building confidence rather than enforcing change:</p>\n\n<ul>\n<li><p>Starting with a small number of development workspaces</p></li>\n<li><p>Running hands-on demos and tutorials</p></li>\n<li><p>Expanding adoption only after teams could see how the workflow worked in practice</p></li>\n</ul>\n\n<p>Team selection also played an important role. Although many teams touched infrastructure code, three teams managed roughly 90% of the infrastructure. Onboarding those teams first helped establish clear patterns that the rest of the organization could follow.</p>\n\n<p>The rollout moved quickly but deliberately:</p>\n\n<ul>\n<li><p>About 3 months to build a prototype workflow in development</p></li>\n<li><p>Roughly 6 months to migrate most production workspaces</p></li>\n</ul>\n\n<p>As HCP Terraform became the standard way to manage infrastructure, onboarding additional teams became more predictable. The security team, in particular, emerged as an early adopter. Their involvement, especially around policy and governance, reinforced HCP Terraform’s role as a central platform rather than a tool owned by a single team.</p>\n\n<h2><strong>Security and governance as enablers, not gates</strong></h2>\n\n<p>As Benchling centralized infrastructure execution, it also created an opportunity to rethink how security and governance fit into their workflows. Instead of treating policy as a blocking mechanism, the team deliberately approached it as a learning tool.</p>\n\n<p>The security team took ownership of authoring Sentinel automated policies, with the initial goal of increasing visibility rather than enforcing strict controls. Policies were first deployed in informational mode (called <a href=\"https://developer.hashicorp.com/sentinel/docs/concepts/enforcement-levels\">soft-mandatory</a> in Sentinel), allowing teams to see how proposed infrastructure changes aligned with Benchling’s standards without preventing releases.</p>\n\n<p>That approach was intentional:</p>\n\n<ul>\n<li><p><strong>Visibility before enforcement</strong>, so teams could understand the impact of policies and how they would have to change their code before submission</p></li>\n<li><p><strong>Avoid blocking releases</strong> while platform, compliance, and security teams fine-tune policies to be clear and correct</p></li>\n<li><p><strong>Build confidence</strong> in developers’ ability to meet policies before turning blocking enforcement on</p></li>\n</ul>\n\n<p>At Benchling, Sentinel policies today only flag issues during runs but do not block changes. Developers see policy results alongside other signals they already trust, such as test results and CI checks.</p>\n\n<p>Over time, this has shifted how policy is perceived. Rather than acting as a gate that slows teams down, policy becomes another source of feedback that helps developers understand expectations and improve infrastructure changes before anything is deployed. With that confidence in place, stricter enforcement is possible when the organization is ready.</p>\n\n<h2><strong>Freeing up time to focus on DR, cloud cost reduction, and customers</strong></h2>\n\n<p>Eliminating manual infrastructure toil saved thousands of hours and made day-to-day operational work much easier. What do you do with 8,000 extra hours? </p>\n\n<p>Benchling decided they would use that reclaimed time to have their teams focus on long-deferred priorities, including:</p>\n\n<ul>\n<li>Automating <strong>disaster recovery</strong> processes</li>\n<li>Driving deeper <strong>cost optimization</strong> efforts</li>\n<li>Enabling engineers to focus on features and improvements that <strong>directly support Benchling’s customers</strong></li>\n</ul>\n\n<p>Strong infrastructure tagging discipline also played an important role. By embedding tags into reusable Terraform modules, Benchling ensured that new resources inherited cost allocation metadata by default, without relying on manual enforcement.</p>\n\n<p>Their cost explorations also uncovered some unexpected findings. NAT gateways, for example, emerged as one of the larger cost drivers, which was a surprise even for a team with a strong operations background. Having the time and data to investigate those patterns made targeted cost optimization possible in ways that hadn’t been feasible before.</p>\n\n<h2><strong>Business impact and what comes next</strong></h2>\n\n<p>The most tangible outcome of these changes was time. By moving away from laptop-based Terraform execution and eliminating manual coordination and babysitting, Benchling estimates it reclaimed <strong>approximately 8,000 engineering hours</strong> across the organization.</p>\n\n<p>Those savings were driven by a few core shifts:</p>\n\n<ul>\n<li>No more running Terraform plan and apply from individual machines</li>\n<li>Centralized, parallelized runs handled by HCP Terraform</li>\n<li>Less human attention required to coordinate and monitor releases</li>\n</ul>\n\n<p>That reclaimed time was reinvested into higher-value work, including:</p>\n\n<ul>\n<li><strong>Reducing dev environment sprawl</strong> by reassessing how many environments were truly needed and how large they needed to be</li>\n<li><strong>Right-sizing overprovisioned databases</strong>, particularly in non-production environments</li>\n<li><strong>Fully automating disaster recovery</strong></li>\n</ul>\n\n<p>Several lessons emerged from the journey:</p>\n\n<ul>\n<li><strong>Centralize execution, not ownership</strong>: Teams can still contribute through code without running infrastructure themselves</li>\n<li><strong>Start with visibility before enforcement</strong>: Learning builds trust faster than hard gates</li>\n<li><strong>Remove humans from repetitive infrastructure tasks wherever possible</strong></li>\n</ul>\n\n<p>Looking ahead, Benchling continues to iterate on its infrastructure practices. Areas of focus include </p>\n\n<ul>\n<li>Staged or canary-style rollouts for production changes</li>\n<li>Reducing repetitive human approvals for production changes</li>\n<li>Exploring AI-assisted review to cut down on manual oversight</li>\n</ul>\n\n<p>The team is also interested in better workflow orchestration for processes that extend beyond Terraform alone, including emerging capabilities like <a href=\"https://www.hashicorp.com/en/blog/terraform-stacks-explained\">Terraform Stacks</a>.</p>\n\n<p>Throughout this process, Benchling has leaned on HashiCorp’s field experience to benchmark its approach against other large-scale users. </p>\n\n<blockquote>\n<p>You can take advantage of that field experience too and benchmark your approach against other large-scale users. <a href=\"https://www.hashicorp.com/en/contact-sales?utm_source=hashicorp&amp;utm_medium=internal&amp;utm_campaign=26Q1_WW_TDM_MULTI_benchling-blog_CONTACTSALES&amp;utm_content=end-blog-cta&amp;utm_offer=contactsales\">Let’s have a chat</a>!</p>\n</blockquote>\n\n<p>That outside perspective, combined with ongoing experimentation, has helped the team validate what’s working, identify what needs improvement, and continue evolving its infrastructure operations as the company grows.</p>\n<p>You can watch Benchling’s full fireside chat here:</p>\n","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"6e65ea66c6c946dba80134fdeb84172ac1a310e2ebec141f41908b15aab72023","category":"Tech"}