{"title":"'I feel like it really touched a lot of people' – Simon Yates and the miracle of the Finestre","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/simon-yates-and-the-miracle-of-the-finestre","date":1770886802000,"content":"\n      <p><em>This article was first published in Rouleur <a href=\"https://www.rouleur.cc/products/issue-140-copy\" target=\"_blank\">Issue 141</a></em></p>\n<p>Simon Yates is laughing. Actually giggling. The whole thing was absurd then, and six months on it’s still utterly barmy. “I met the Pope!” he chuckles. “I’ve shook the Pope’s hand. Can you believe that?” I laugh along with him. “Surreal.” He’s not stopped being bewildered. “I still think it’s unbelievable,” he adds, really elongating and stretching the beginning of that adjective's prefix.</p>\n<p>It was June 1 when Yates exchanged a few words with the recently-ordained Pope Leo XIV, the day after His Redemption and the Miracle of Finestre. The day he won the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\" target=\"_blank\">Giro d’Italia</a> in the most outrageous manner. It was a where-were-you kinda day, a moment in time that no-one watching will ever forget, let alone the protagonists. Seven years on from blowing up on the Finestre while in the lead of the Giro d’Italia on stage 19, Yates came back to the very same mountain and not just took the maglia rosa off Isaac Del Toro with a day to go, but tore and yanked it from his shoulders with bravery, aggression and career-defining panache. The Mexican acted like a nonplussed victim, forgetting that his pockets had been ransacked and instead engaging in a suicidal tussle with Richard Carapaz. For all of Del Toro’s many errors, it was Yates who the moment – and history – belonged to.</p>\n<p>In one hour of epic riding, this “cold bloke” – his words, not ours – endeared himself to just about every watching spectator, and everyone in the peloton. We won’t see him in the peloton again though: in January Yates announced a shock decision to retire from the sport immediately. It ensured that he bowed out from the sport as the reigning Giro d’Italia champion. “I feel like it really touched a lot of people,” the 33-year-old tells me backstage at Rouleur Live. “Lessons about sacrifice, hard work. Many years ago I came back to the Giro to try again, and I got nowhere close [to winning]. Always something went wrong. I think a lot of people resonated with that – that mentality of keep on trying.”</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_58_2b7e5dbb-6021-479e-b23d-ac7babde98de_1024x1024.png?v=1770812502\" alt=\"\" /></div>\n<p><em>Yates announced his retirement at the start of 2026 (Portrait by Véronique Rolland)</em></p>\n<h4>Rest and reflection</h4>\n<p>Yates’s complicated relationship with the mountain he’s now synonymous with, the Colle delle Finestre, began in 2018. A switchback-laden and part-gravel climb that rises to 2,176m in Piedmont, ordinarily it shouldn’t have posed a huge threat to him back in May 2018. Excelling on long Alpine climbs was his bread and butter – it’s what he did, and continued to do until his retirement, even as the grey hairs started to sprout through his short, cropped brown hair. Already in that Giro d’Italia – his first participation in the race – he had won three stages, and been in the lead for 13 days. He was having the time of his life – attacking the race how Tadej Pogačar does now.</p>\n<p>“The way we went after that Giro wasn’t really a thing then – everyone was just behind the Sky train,” he reflects. “But that year we had the riders, we had the guys with the legs, and every day we took it up. If there was a stage we could win, we tried to win it. We had the jersey, and I had a fairly comfortable gap [of 2:11 over Tom Dumoulin after stage 15] so there was no reason to chase stages, but we were going after it. I like to race that way, really get stuck in.”</p>\n<p>As fun as it was, it proved his undoing. He lost around a minute on stage 16’s time-trial, shipped 30 seconds on stage 18, and then the race spectacularly fell through his grasp on stage 19. Partly because of Chris Froome’s audacious 80km attack that won him the race – itself an antidote to the aforementioned Sky train that Froome was intrinsically linked with – but mostly because Yates was “really deeply fatigued”. All that attacking had caught up with him. “It had started to fall apart a day before, when we climbed to Prato Nevoso. It was the first time the legs just weren’t there. During the final stages, I just had no energy. I was completely dead. I was really sick afterwards – I had a full week bedbound; I don’t want to overexaggerate but it was one of the worst illnesses that I’ve ever had – but at that moment I didn’t feel sick. It was just that my body wouldn’t give me what I needed it to give me.”</p>\n<p>It was a crushing defeat – but Yates insists that “I had a fantastic Giro and I look back fondly at it.” Once he’d recovered from his illness – he speculates it might have been pneumonia – Yates took himself and his partner to the Seychelles for ten days to recover. “No bike, nothing, complete relaxation,” he recalls. “I had a really significant amount of time off in between.” He returned to racing later that summer, and four months after he looked all but certain to achieve the milestone, Yates finally won a Grand Tour. Not the Giro, but the Vuelta a España. “It felt like I had put the pain to bed to be honest,” he says. But the disappointment of the Giro, he can admit now, lived rent free in his head. Most years he went back to try and hold the maglia rosa all the way to the end, but every time he came up short. Third in 2021, four minutes off the winner Egan Bernal, was the best he managed. “Year after year, it wasn’t to be,” he sighs.</p>\n<p>And then in early January 2025, the route of the forthcoming Giro was announced. Yates’s eyes were immediately drawn to one stage, and one mountain only. It was the start of the Redemption.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_59_07ff9d1e-90f0-4fc1-9bc6-1d354a268eeb_1024x1024.png?v=1770812615\" alt=\"\" /></div>\n<p><em>Yates was at <a href=\"https://www.rouleur.cc/pages/rouleur-live\" target=\"_blank\">Rouleur Live</a> 2025 (Image: Sean Hardy)</em></p>\n<h4>Good vibrations</h4>\n<p>After 11 years with the various guises of the GreenEdge team, Yates moved to Vis-ma-Lease a Bike at the start of the 2025 season. Ostensibly, he was brought in to act as a super-domestique to Jonas Vingegaard in the Tour de France, to do the same job his twin brother Adam has been doing at UAE Team Emirates-XRG for Pogačar since 2023. It was only when Visma’s head of racing Grischa Niermann proposed that Yates ride the GC at the Giro that he first thought about it. “And then the route came out and I saw that the Finestre was back again, the first time since I’d last been there, and the cogs started ticking. You think, ‘Maybe I can go back and do something different’. I hit Grischa up and said I’d give it a go.”</p>\n<p>Preparation involved two altitude camps at Tenerife, two stage races, and one training ride crash. “I got hit by a car in Tenerife and had to go to hospital for some stitches for a wound,” he says. But mostly he was feeling good. When the Giro got underway in Albania he received immediate confirmation that he was in fine fettle. “If you look at the result of my TT in Albania [21st] you’d go ‘ahhh, hmm’, but I did some really big numbers there and that was a good indicator that I was actually going really well.”</p>\n<p>Further reassurance came on stage nine’s gravel around Siena’s famed strade bianche, and come stage 14, Yates was second, 1:20 adrift of Del Toro. “I felt good all race. From start to finish, it went smoothly. I didn’t have a bad day, I didn’t get sick, I didn’t crash, I didn’t have one puncture, nothing. There wasn’t really a moment where I thought maybe I could take this, but I just had a good feeling about it.” Carapaz leapfrogged him four stages later, and going into the penultimate day’s test, which ascended four cols including the HC Finestre and finish at Sestrière, Yates was 1:21 behind Del Toro, with Carapaz 38 seconds closer to the leader. It was a three-way battle for pink, and Yates had it all to do.</p>\n<h4>Mind games</h4>\n<p>“You won’t believe me,” Yates says, a wry smile forming. “But it’s impossible for me to say otherwise: it went how I expected it to. The whole stage. Those two looking at each other.” The events on the Finestre are seared into the minds of anyone who watched the race. Carapaz started attacking at the base of the 18.6km mountain, initially distancing Yates but not Del Toro. Yates recovered ground, and five kilometres into the climb he made his move. On his fourth attack, he stayed away. “You know Carapaz is going to race aggressively – it’s his last chance, he’s already won a Giro, so second or third, does it matter?” Yates retrospectively gameplans. “Who is Del Toro going to watch? The only person who’s been able to match him in the really strong accelerations has been Carapaz, so if there’s an opportunity and I get a gap, I need to take it. I need to try, I need to do something.”</p>\n<p>There was also the pull of history, the significance of the mountain. “This was a stage I had targeted from the winter. I have that emotional connection to it, and I knew I wanted to have a crack at this stage, to show myself. But I didn’t think, even on the morning of the stage, that I would be fighting for the overall. I thought I wouldn’t get a big enough gap, or it’d be close and be really touch and go at the finish line.”</p>\n<p>It was anything but. Del Toro stuck to Carapaz’s wheel – “He was obsessed with me,” the latter said, still fuming – and Yates marched off into the distance. When he joined Wout van Aert, strategically placed up the road as a deluxe satellite rider, it was game over. “The one guy who you need there, who has the power and the legs to make it over the climb, and to then pull in the valley, you don’t want anyone else but Wout,” Yates says. “But do you know what I reckon the biggest thing was? It wasn’t physical, it was mental. Those two behind me, already fighting, already had a falling out, already hate each other, and then they hear on the radio that I’ve just joined Wout.” He puffs his cheeks out. “Bff, I think that played a bigger role.”</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-2217964950_1024x1024.jpg?v=1770812700\" /></div>\n<div><em>Yates in the Maglia Rosa with the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-giro-d-italia-trophy-maker-inside-the-factory\" target=\"_blank\">Trofeo Senza Fine</a> - The prize he dreamt of for the best part of a decade (Image: Getty)</em></div>\n<div><br /></div>\n<h4>Ending on a high</h4>\n<p>The finish line approached, just about visible through the cold and wet mist that hung over the ski station, and Yates was the only person on the planet who still didn’t think – know – he was about to do it. He was screaming into his radio to Visma DS Marc Reef. “Even with 400m to go, I knew the gap was huge, but I kept asking what it was. It was all going too smoothly! Marc’s whole voice changed, his whole demeanour. He knew it was over, but I was still going full gas. I couldn’t accept that it was going to happen.”</p>\n<p>With 200m remaining, reality finally hit him. “I could see the finish line and it must have finally started to go in and I’m like, ‘Fuck, I’ve fucking done it. Can you believe that?’ I couldn’t believe that it happened the way I dreamed about it. I crossed the line and I’m thinking, ‘Jesus Christ, I’ve pulled this off ’. Honestly, it’ll never happen again. Never. At least not for me personally. It’s not possible. The odds are insane.” It definitely won’t now he’s retired.</p>\n<p>Tears, lots of them, flowed at the finish line, and continued to flow. That day, he agrees, fans connected with him like never before. “Out of nowhere this cold bloke opens up,” he says. His fellow professionals, too, congratulated him en masse. Him closing the circle, completing the redemption arc, had struck a chord. “When I won the Vuelta, everyone was like, ‘Yeah, well done, good job’. Here it was like that connection thing we’ve spoken about, but even on a deeper level: the sacrifices that we all make as riders. Seven years it was.</p>\n<p>Not every year on the bounce, but pretty often I went back [to the Giro] and tried to win it but couldn’t do it. I think that really resonated with a lot of riders. Some of them I’ve never spoken with before and they’d come up to me and say, ‘Unbelievable, mate, what a win’. It was really, really touching to have that.</p>\n<p>And that’s what led to his encounter with the Pope. For only the third time in the Giro’s history, the peloton passed through the Vatican City for an audience with the leader of the Catholic church, the man who oversees a religion of 1.3 billion people. Yates cracks up again as he recounts the tale. “The organisers said that we were going to roll through the Vatican, stop for a second and take a picture of us all in a line. They said the Pope might be there. We were in the neutral zone, and one of the motorbikes came up to me, 400m from the Vatican, and said, ‘Simon, we need to speed up, the Pope’s waiting’. I’m like, ‘Fuck, come on, let’s go!’ and started riding fast. It hadn’t crossed my mind at any point, let alone two minutes before, that I’d be able to meet him.”</p>\n<p>The peloton, headed by Yates, arrived at the Vatican City. “The organiser says to me, ‘Do you want to meet the Pope?’ And I’m like, ‘You mean I can go and say hello to him?’ She says yeah. ‘Yeah, I’ll say hello to him, yeah’, I tell her. Some of the other guys didn’t want to go, and I’m like, ‘Mate, this is your one chance to meet the Pope and go and shake his hand’.”</p>\n<p>What did Pope Leo say to the champion-elect? “‘Hello, well done, where are you from?’. The general questions. And then he blessed the whole peloton and we cracked on. I’m not religious – although I might be now! – but what a surreal moment. That was almost more surreal than winning the race.”</p>\n<p>Back in the centre of Rome, in the shadow of the Coliseum, Yates lifted the never-ending golden trophy – “It’s really heavy!” he says – that now takes pride of place on his bookshelf at home in Andorra. Basking in the plaudits, trying to understand what the heck had happened, Yates was conscious that his sporting career had most probably peaked; this was the best it’d ever get. “I don’t think I’ll ever again feel as emotional as when I crossed the line on stage 20,” he says. “I’m terrible for this, but I’ll be chasing that high I had for the rest of my life.”</p>\n<p>He pauses and enters a pensive state. He looks outside, through the misty single-glazed windows. “I’m oversharing here!” he sniggers. “But I won a stage of the Tour this year and it didn’t change my life.” I point out that he’s won 11 Grand Tour stages and two Grand Tour overall titles, so it’s understandable if the euphoria isn’t as great as the first ones.</p>\n<p>“Yeah, but do you understand where I’m going with this? Don’t get me wrong, I was ecstatic that I won that stage [to Le Mont on the Tour’s stage 10], but it didn’t change my life. I wonder if this is almost how these real superstars feel, Tadej and that. He wins a Tour stage now and he’s like yeah, what’s that? Because he can still accomplish more goals. I know I can’t win the Tour de France. I’m not good enough. As a GC rider, as a climber, I can’t get any higher than the Giro. I’ll be chasing that high forever.” Perhaps no surprise, then, that he decided to hang his wheels up while still at the top of sport. One of his final Acts was the Redemption and the Miracle of Finestre.</p>\n<p><em>Cover Image: Getty</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6f3e4b2c6f641b513b54d4f42ef4175eabcba2454791d441811690f0c9b9100c","category":"Cycling"}