{"title":"'Watching the Tour became something like a religion' — Pauline Ferrand-Prévot and life at the top","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/pauline-ferrand-prevot-life-at-the-top","date":1770287096000,"content":"\n      <p><em>This article was first published in Rouleur <a href=\"https://www.rouleur.cc/products/issue-140-copy\" target=\"_blank\">Issue 141</a></em></p>\n<p>Pauline Ferrand-Prévot is proudly scrolling through her camera roll showing me photos of the Halloween costume she wore while on holiday in New York a few weeks previously. She was dressed as Tim Burton’s ‘Corpse Bride’ with black face paint dripping down ghostly-white cheeks, complete with backcombed purple hair and a matching lace wedding dress. Her fiancé, fellow professional cyclist Dylan van Baarle, stands next to her with a similarly accurate costume on – make-up, tuxedo and a wig to boot. In the image, Ferrand-Prévot stares at the camera intensely, eyes wide, mouth set into a severe, thin line. She’s in character. This was Halloween, and Pauline Ferrand-Prévot does things properly.</p>\n<p>“I’m a person of extremes,” she says with a grin as she places her phone back in her pocket. “I got it from my mother, for sure.”</p>\n<p>Whether it is trying to win an Olympic medal, chasing yellow at the biggest bike race in the world, or having the most impressive halloween costume at a party in her off-season, Ferrand-Prévot will do what she can to be the very best – whatever that takes.</p>\n<p>“When I started out, I loved cycling first, but I really loved winning. I love to work hard for something, I was training crazy hours already when I was young – everyone was telling my parents they were crazy because they thought they’d asked me to do it. But no, I just love to get better. I love to point out my weaknesses and work on them. I’m like my mother, she’s even a step higher than me.”</p>\n<p>The Frenchwoman is speaking to me at <em>Rouleur Live</em> in London, at the end of a historic season in which she won Paris-Roubaix and the Tour de France Femmes avec Zwift. When she took victory in stage nine of the Tour and punched the sky in celebration, resplendent in a yellow jersey, Ferrand-Prévot captured the hearts of her nation again – just like she did 12 months before when she sealed a gold medal in the Olympic mountain bike race on home soil. It’s been an incredible two years for the Visma-Lease a Bike rider.</p>\n<p>I was there in Châtel Les Portes du Soleil as the Tour victory happened, standing just past the finish line as the applause from fans by the roadside built to a crescendo. I watched Ferrand-Prévot collapse in a heap once it was done, saw her body convulse in sobs, and heard the calls of congratulations from her teammates and colleagues. Throughout the nine days of racing, I’d listened to Ferrand-Prévot speak in interviews and press conferences, and I thought that I understood her.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VRSean_HARDYCC_Rouleur_Pauline_Portraits_Mag-6_1024x1024.jpg?v=1770286785\" alt=\"\" /></div>\n<p>This was an athlete who had a razor-sharp focus, giving serious answers with an air of unshakeable professionalism when it came to her sport. Her Visma teammate, Eva van Agt, described Ferrand-Prévot as “really focused, not super talkative” when I asked what the French rider was like to work with. A few months on, though, as I watch how Ferrand-Prévot conducts herself in London during her off-season, I realise that there’s a lot more to this woman than I could have ever realised.</p>\n<p>With that win in the biggest bike race of her life in her pocket, she has now been sitting with Matt Stephens tasting different types of cheese, happily blowing her “smelly” breath in his direction after trying a particularly strong stilton. She wants a glass of red wine to go with it – naturally – and berates the fact that the bar only offered a screw top option. For the last four hours, she’s taken selfies with fans, signed posters and photos, and chatted jovially to everyone she met. Her schedule has been packed with meet and greets, but the 33-year-old hasn’t so much as grumbled a complaint. In fact, she’s having fun with it. What I’m coming to learn is that there’s multiple sides to Pauline Ferrand-Prévot.</p>\n<p>“Before the Olympics, I worked with a psychologist on the mental aspects of my job. I think that is as important as the physical,” Ferrand-Prévot tells me. “I spoke with this person every week and they taught me about focus and staying relaxed and calm in every situation. It’s crazy as when you do that in a race, you can see things so differently. It’s like the world opens out in front of you. It’s an amazing feeling.”</p>\n<p>The version of Pauline with a well-crafted, race-ready mindset is verging on obsessiveness when it comes to the pursuit of success in her sport. It is this person who we’ve watched win races for the last 15 years. It’s not who she is right now, but it is who she was when she spent months at altitude to prepare for the Tour de France Femmes after she’d made the choice to transition from mountain biking to the road in order to try and win her nation’s biggest event.</p>\n<p>“I knew how I prepared for the Olympics and I knew I just needed to do the same for the Tour. I went to altitude for two months, I didn’t race at all. I trained alone. I knew that was the way to do it. Maybe it’s not the same for everyone but for me, I need to stay in this bubble and train hard to make it work,” she recalls.</p>\n<p>“I was staying in the same hotel I did for the Olympics but I realised that this year I would spend a lot of time at altitude, so I made my life a bit easier and I bought a house in the mountains. It felt more like home and I made an altitude tent in a room there too. Like this, I could train in my own environment, bring my parents close by, and try not to feel too lonely.”</p>\n<p>Although you might not have realised from the way she turned up in Vannes last July looking like a lean, ruthless winning machine, Ferrand-Prévot’s path to the Tour had been a rollercoaster. She was forced to rely on the lessons she learned from her mental coach to stay calm in a sport which has the ability to take its players from the highest highs to the lowest lows in a matter of moments.</p>\n<p>“Towards the start of the season, I’d been at altitude for two months so I asked my coach if I could do Paris-Roubaix. I wanted to race it to support Marianne [Vos] and help her in the best way possible with the shape I had,” she remembers.</p>\n<p>“The whole story with that race is crazy – it’s hard to believe. My ankle got infected two days before the start and I was very sick. I didn’t sleep all night long the day before the race. I thought the DS would call me and tell me I wasn’t starting, but he took me to the bus and said ‘it’s no risk for you or your health to race, so just take to the start, do your best and we will see.’ I just wanted to attack early for Marianne to make the others work, then they all looked at each other too much. So I won Roubaix. It was nice to win, but I felt so bad as I was so sick already after the race that I didn’t even really enjoy it. It was a mixed feeling.</p>\n<p>“I didn’t do any recon or anything for that race so I went in blind. But sometimes when you don’t really expect things, they come to you. Sometimes you want to do everything perfectly and you miss things. In this race, I had nothing to lose. Sometimes it works like this in life.”</p>\n<p>The period after that victory was as chaotic as the Roubaix cobbles themselves for Ferrand-Prévot. She attempted the Vuelta España Femenina but was clearly below her usual form while racing in Spain. In the end, she retired due to illness on stage five, and few believed she could still be a viable Tour contender with this preparation “In some ways, it worried me that I’d never finished a full stage race that season before the Tour. But at the end of the day it’s not always about comparing yourself to others in those situations. It’s about how you prepare and make the best out of yourself. I just wanted to have nothing to regret in the end. I went to do a full recon of all the Tour stages with my parents – they were following me with a campervan behind. I had such a good time with them and it’s what I needed to ride my bike and be with my family. That was what prepared me.”</p>\n<p>Ferrand-Prévot repeatedly mentions the importance of the support system she has around her. Much of this comes from her parents, who she is extremely close to, but also her team, Visma-Lease a Bike. When the French rider transitioned back to the road after years solely focusing on mountain biking, she had a plethora of squads who would have gladly accepted her signature on a contract. She confidently went with the Dutch squad in yellow and black though, trusting that they would help her reach her lofty ambitions.</p>\n<p>“They understand that I need my freedom and I need to learn. But they also get that I am 33-years-old and I have a lot of experience. Simply, they trust me. They believe in my background. Also it’s a young team, they have young athletes who started cycling only a few years ago and I can really work with them because they want to learn. That’s why we won as a team,” Ferrand-Prévot states.</p>\n<p>Vos, the three-time world champion who is widely thought of as the greatest rider women’s cycling has ever seen, and Ferrand-Prévot racing in the same colours always had the potential to create an unstoppable duo, but it took some time for them to get used to each other’s racing style.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_25_c35b9c4b-6821-4d1f-95de-f0c2bbd77a25_1024x1024.png?v=1770286953\" alt=\"\" /></div>\n<p>“I remember when we started the first race of the year, it was not so good. I didn’t want to be in her way, she didn’t want to be in my way. We both raced without much of a plan and in the debrief afterwards we said ‘that was not good, we have to be better.’ We knew that going to the Tour with Marianne going for stages and me going for the general classification, we had to find a way to work together. We spent a lot of time together in camp and really learnt that.</p>\n<p>“I had to learn how to fit into the group because I was used to racing on my own in mountain biking. I was a bit scared when I first came back because of that.”</p>\n<p>When the Tour de France Femmes rolled around, it was clear that Visma had perfected their team bond through open communication, and Ferrand-Prévot got what she needed from her teammates to handle the pressure when the stakes were at their highest. In the opening stage of the Tour, Vos took an astounding victory on the lumpy route to Plumelec, with Ferrand-Prévot finishing in third place behind her. It was an indicator of what the team would do together as the week continued.</p>\n<p>“Because I’d done a recon of all the stages, I knew that the first three stages wouldn’t be possible for me to win, but I could lose it there. I knew I had to be in the front and Marianne would go for stages. The first stage was a dream, I said to the girls afterwards: ‘We have to enjoy this one because it won’t happen very often. We executed the plan perfectly, we can be proud of ourselves already.’”</p>\n<p>Those first few stages of the Tour were rife with crashes and controversy, along with plenty of talk about respect and safety in the peloton. Ferrand-Prévot kept quiet with her head down throughout while her competitors took the spotlight in the media. She was waiting for the mountains at the end of the week where she knew she would come into her own.</p>\n<p>“Normally I’m joking around a bit, but I was quite quiet during the Tour for those first days. I didn’t want the girls to think I wasn’t hungry or not good, so I just spoke to them and said it was my biggest goal of the year and I was so focused. I explained that if I wasn’t laughing or saying too much at the dinner table, it wasn’t because I have anything against anyone, I just want to stay focused and do my own thing.”</p>\n<p>August 2, 2025 was the day it all happened. An ascent of the 18-kilometre Col du Madeleine awaited the Tour de France Femmes peloton, and Ferrand-Prévot sat second on the general classification, just 26-seconds behind Kim Le Court of AG Soudal-Insurance. She’d been on the slopes of the fabled climb before, traced every switchback, felt every subtle gradient change, rode through the light and shadows. All she had to do was be the best when it mattered. And that is what Pauline Ferrand-Prévot does with aplomb.</p>\n<p>“I did race simulations before and I knew the climb was one hour, like a mountain bike race. It was the same effort and I knew I had to stay calm and keep my own pace to the top. I saw Sarah [Gigante] going so I thought I would try to close the gap slowly and I won. I already had the feeling I was flying that day. I was also happy I hadn’t had the yellow jersey before because of the number of interviews and podiums you have to do after the race.”</p>\n<p>Despite proving herself as unquestionably the strongest climber on the penultimate stage of the Tour with her clinical dissection of the Col du Madeleine, Ferrand-Prévot was acutely aware that the work was not over.</p>\n<p>“It was a mixed feeling. It took me three hours to get back to the bus after the stage, it was cold, I was tired but happy. I couldn’t celebrate yet. The next day I had the weight of the yellow jersey before the stage and it was the first time in my life that I felt pressure.”</p>\n<p>She recalls a moment on the final stage when she thought it might all be over: “During the stage I left a gap. I was distracted and nervous. After just ten kilometres, I had to call my whole team back to pace me back to the bunch and I knew the day had started in the worst way. My DS told me to stay sharp and focused, and said I could attack on the next climb. He said if we wanted to win, I needed to go then. When Demi [Vollering] attacked, I knew it was a good moment to counter. I went with five kilometres to go. Then you just close your eyes and go as full gas as possible. It’s crazy, you know you can win the yellow jersey, but at one point I thought I wanted it too much. Sometimes when you want to win everything, you win nothing. But I just gave it my best, and that’s it.”</p>\n<p>It was only when she’d crested the summit, 20 seconds before Vollering, that the other version of Pauline Ferrand-Prévot – the one she has brought to London in her off-season – came to the surface. In those moments of release, as she cried and celebrated, the focus was finally allowed to fizzle away and the mask slipped off. Underneath it was an emotional, passionate, smiling woman who had left a part of her soul in the French Alps.</p>\n<p>“It took me a few weeks to really realise what I’d done. I started to understand how big it was, even bigger than the Olympics. For French people, winning the Tour is something bigger than I even expected. I remember when I was a kid watching the Tour de France with my grandparents. It became something like a religion.”</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VRSean_HARDYCC_Rouleur_Pauline_Portraits_Mag-44_1024x1024.jpg?v=1770286995\" alt=\"\" /></div>\n<p>Has winning the yellow jersey changed who Ferrand-Prévot is?</p>\n<p>“I don’t know, maybe I feel more confident that I can win on the road against riders like Demi. I didn’t think that was possible before,” she muses.</p>\n<p>In some ways, the Tour de France Femmes win has created yet another version of Ferrand-Prévot. She embodies the fun, playful character in her off-season that we’ve seen during her time at <em>Rouleur Live</em>, she is a dedicated, professional athlete when it matters, and she is also now a Tour champion. With that comes pressure and expectation – she won’t go to France next year as an unknown quantity who has just come from the mountain bike scene, but as defending champion.</p>\n<p>“It’s a different approach I’ll have to take. It’s not because I won last year that I have to win again. I also like this pressure, I don’t get weaker because of it, I’ll do my best and we’ll see.”</p>\n<p>This is a bike rider who has always chased challenges. When she won the Olympic mountain bike gold medal, Ferrand-Prévot immediately needed something else to work towards, which is why she set her sights on the Tour the following year. Now, the challenge is to win it again, proving herself, once again, as the best climber this sport has ever seen.</p>\n<p>“Next year has an uphill time-trial so I need to get back on the TT bike again which is a new challenge for me, but I really love it. I know the roads well, they’re right by where I used to live, my training roads. I’m really looking forward to it,” she grins.</p>\n<p>When the time comes, Ferrand-Prévot will shapeshift from her relaxed, chatty, cheese-eating, wine-drinking self, and back to the strict regime of a champion athlete. That’s not something she sees as a chore, but a privilege. Success for Ferrand-Prévot, it seems, is about balancing every part of her being. That’s how she has become the best.</p>\n<p>“I want to try to win the Tour again. This preparation is what I like the most. The weeks before, I’ll train like crazy. I go to bed at 8:30pm, I wake up at 5am, I’m so focused. In the moment, it’s hard. I can’t see my friends or enjoy a drink or a good meal. But in the end, when you say, okay, I did my best, I got the best result possible, you forget about it all. Then it’s worth it.”</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"70630e75a4c481bdd4a3fa31658fe31c126ec77299729e4b10fc22021d62ab5a","category":"Cycling"}