{"title":"Accessible UX Research, eBook Now Available For Download","link":"https://smashingmagazine.com/2025/12/accessible-ux-research-ebook-release/","date":1765296000000,"content":"<p>This article is a sponsored by <a href=\"undefined\">Accessible UX Research</a></p>\n<p>Smashing Library expands again! We’re so happy to announce our newest book, <strong><em>Accessible UX Research</em></strong>, is now <strong>available for download</strong> in eBook formats. Michele A. Williams takes us for a deep dive into the real world of UX testing, and provides a road map for including users with different abilities and needs in every phase of testing.</p>\n\n<p>But the truth is, you don’t need to be conducting UX testing or even be a UX professional to get a lot out of this book. Michele gives in-depth descriptions of the <strong>assistive technology we should all be familiar with</strong>, in addition to disability etiquette, common pitfalls when creating accessible prototypes, and so much more. You’ll refer to this book again and again in your daily work.</p>\n\n\n    <a href=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/accessible-ux-research-coming-soon-light-opt.png\">\n    <img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/accessible-ux-research-coming-soon-light-varnish-opt.png\" />\n    </a>\n\n\n\n\n<p>This is also your last chance to get your printed copy at our discounted presale price. We expect printed copies to start <strong>shipping in early 2026</strong>. We know you’ll love this book, but don’t just take our word for it — we asked a few industry experts to check out <em>Accessible UX Research</em> too:</p>\n\n<blockquote><img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/eric-bailey-opt.png\" />“<em>Accessible UX Research</em> stands as a vital and necessary resource. In addressing disability at the User Experience Research layer, it helps to set an equal and equitable tone for products and features that resonates through the rest of the creation process. The book provides a <strong>solid framework</strong> for all aspects of conducting research efforts, including not only process considerations, but also importantly the mindset required to approach the work.<br /><br />This is <strong>the book I wish I had</strong> when I was first getting started with my accessibility journey. It is a gift, and I feel so fortunate that Michele has chosen to share it with us all.”<br /><br />Eric Bailey, Accessibility Advocate</blockquote>\n\n<blockquote><img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/devon-pershing-opt.png\" />“User research in accessibility is non-negotiable for actually meeting users’ needs, and this book is a <strong>critical piece in the puzzle</strong> of actually doing and integrating that research into accessibility work day to day.”<br /><br />Devon Pershing, Author of <em>The Accessibility Operations Guidebook</em></blockquote>\n\n<blockquote><img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/manuel-matuzovic-opt.png\" />“Our decisions as developers and designers are often based on recommendations, assumptions, and biases. Usually, this doesn’t work, because checking off lists or working solely from our own perspective can never truly represent the <strong>depth of human experience</strong>. Michele’s book provides you with the strategies you need to conduct UX research with diverse groups of people, challenge your assumptions, and create truly great products.”<br /><br />Manuel Matuzović, Author of the <em>Web Accessibility Cookbook</em></blockquote>\n\n<blockquote><img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/anna-e-cook-opt.png\" />“This book is a vital resource on inclusive research. Michele Williams expertly breaks down key concepts, guiding readers through disability models, language, and etiquette. A <strong>strong focus on real-world application</strong> equips readers to conduct impactful, inclusive research sessions. By emphasizing diverse perspectives and proactive inclusion, the book makes a compelling case for accessibility as a core principle rather than an afterthought. It is a must-read for researchers, product-makers, and advocates!”<br /><br />Anna E. Cook, Accessibility and Inclusive Design Specialist</blockquote>\n\nAbout The Book\n\n<p>The book isn’t a checklist for you to complete as a part of your accessibility work. It’s a <strong>practical guide to inclusive UX research</strong>, from start to finish. If you’ve ever felt unsure how to include disabled participants, or worried about “getting it wrong,” this book is for you. You’ll get clear, practical strategies to make your research more inclusive, effective, and reliable.</p>\n\n<p>Inside, you’ll learn how to:</p>\n\n<ul>\n<li><strong>Plan research</strong> that includes disabled participants from the start,</li>\n<li><strong>Recruit participants</strong> with disabilities,</li>\n<li><strong>Facilitate sessions</strong> that work for a range of access needs,</li>\n<li><strong>Ask better questions</strong> and avoid unintentionally biased research methods,</li>\n<li><strong>Build trust and confidence</strong> in your team around accessibility and inclusion.</li>\n</ul>\n\n<p>The book also challenges common assumptions about disability and urges readers to <strong>rethink what inclusion really means</strong> in UX research and beyond. Let’s move beyond compliance and start doing research that reflects the full diversity of your users. Whether you’re in industry or academia, this book gives you the tools — and the mindset — to make it happen.</p>\n\n<p>High-quality hardcover, 320 pages. Written by Dr. Michele A. Williams. Cover art by Espen Brunborg. <strong>Print edition shipping early 2026.</strong> eBook now available for download. <a href=\"https://smashed.by/accessibleresearchsample\">Download a free sample</a> (PDF, 2.3MB) and <a href=\"/printed-books/accessible-ux-research/\">reserve your print copy at the presale price.</a></p>\n\n\n    <a href=\"https://files.smashing.media/articles/accessible-ux-research-ebook-release/accessible-ux-research-inside-the-book-1-opt.png\">\n    <img src=\"https://files.smashing.media/articles/accessible-ux-research-ebook-release/accessible-ux-research-inside-the-book-1-opt.png\" />\n    </a>“Accessible UX Research” shares successful strategies that’ll help you recruit the participants you need for the study you’re designing. (<a href=\"https://files.smashing.media/articles/accessible-ux-research-ebook-release/accessible-ux-research-inside-the-book-1-opt.png\">Large preview</a>)\n\n\nContents\n\n<ol>\n<li><strong>Disability mindset</strong>: For inclusive research to succeed, we must first confront our mindset about disability, typically influenced by ableism.</li>\n<li><strong>Diversity of disability</strong>: Accessibility is not solely about blind screen reader users; disability categories help us unpack and process the diversity of disabled users.</li>\n<li><strong>Disability in the stages of UX research</strong>: Disabled participants can and should be part of every research phase — formative, prototype, and summative.</li>\n<li><strong>Recruiting disabled participants</strong>: Recruiting disabled participants is not always easy, but that simply means we need to learn strategies on where to look.</li>\n<li><strong>Designing your research</strong>: While our goal is to influence accessible products, our research execution must also be accessible.</li>\n<li><strong>Facilitating an accessible study</strong>: Preparation and communication with your participants can ensure your study logistics run smoothly.</li>\n<li><strong>Analyzing and reporting with accuracy and impact</strong>: How you communicate your findings is just as important as gathering them in the first place — so prepare to be a storyteller, educator, and advocate.</li>\n<li><strong>Disability in the UX research field</strong>: Inclusion isn’t just for research <em>participants</em>, it’s important for our <em>colleagues</em> as well, as explained by blind UX Researcher Dr. Cynthia Bennett.</li>\n</ol>\n\n\n    <a href=\"https://files.smashing.media/articles/accessible-ux-research-ebook-release/accessible-ux-research-inside-the-book-2-opt.png\">\n    <img src=\"https://files.smashing.media/articles/accessible-ux-research-ebook-release/accessible-ux-research-inside-the-book-2-opt.png\" />\n    </a>The book will challenge your disability mindset and what it means to be truly inclusive in your work. (<a href=\"https://files.smashing.media/articles/accessible-ux-research-ebook-release/accessible-ux-research-inside-the-book-2-opt.png\">Large preview</a>)\n\n\nWho This Book Is For\n\n<p>Whether a UX professional who conducts research in industry or academia, or more broadly part of an engineering, product, or design function, you’ll want to read this book if…</p>\n\n<ol>\n<li>You have been tasked to <strong>improve accessibility of your product</strong>, but need to know where to start to facilitate this successfully.</li>\n<li>You want to establish a <strong>culture for accessibility</strong> in your company, but not sure how to make it work.</li>\n<li>You want to <strong>move from WCAG/EAA compliance</strong> to established accessibility practices and inclusion in research practices and beyond.</li>\n<li>You want to <strong>improve your overall accessibility knowledge</strong> and be viewed as an Accessibility Specialist for your organization.</li>\n</ol>\n\n\n    <a href=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/accessible-ux-research-kind-support-light-opt.png\">\n    <img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/accessible-ux-research-kind-support-light-varnish-opt.png\" />\n    </a>\n\n\n\n\nAbout the Author\n\n<p><a href=\"https://mawconsultingllc.com/\"><img src=\"https://files.smashing.media/articles/accessible-ux-research-pre-release/michele-williams-opt.png\" /></a>Dr. Michele A. Williams is owner of <a href=\"https://mawconsultingllc.com/\">M.A.W. Consulting, LLC - Making Accessibility Work</a>. Her 20+ years of experience include influencing top tech companies as a Senior User Experience (UX) Researcher and Accessibility Specialist and obtaining a PhD in Human-Centered Computing focused on accessibility. An international speaker, <a href=\"https://scholar.google.com/citations?user=1IfsBJEAAAAJ&amp;hl=en\">published academic author</a>, and <a href=\"https://patents.justia.com/patent/10854103\">patented inventor</a>, she is passionate about educating and advising on technology that does not exclude disabled users.</p>\n\nTechnical Details\n\n<ul>\n<li>ISBN: 978-3-910835-03-0 (print)</li>\n<li><strong>Quality hardcover</strong>, stitched binding, ribbon page marker.</li>\n<li>Free worldwide airmail <strong>shipping from Germany early 2026</strong>. We are currently <strong>unable to ship printed books to the United States</strong> due to customs clearance issues. If you have any questions, please <a href=\"mailto:help@smashingmagazine.com\">contact us any time</a>.</li>\n<li>eBook now available for download as <strong>PDF, ePUB, and Amazon Kindle</strong>.</li>\n<li><strong><a href=\"/ebooks/accessible-ux-research-ebook/\">Order the eBook for instant download now.</a></strong></li>\n<li><strong><a href=\"/printed-books/accessible-ux-research/\">Reserve your print copy at the presale price.</a></strong></li>\n</ul>\n\nCommunity Matters ❤️\n\n<p>Producing a book takes quite a bit of time, and we couldn’t pull it off without the support of our wonderful <strong>community</strong>. A huge shout-out to Smashing Members for the kind, ongoing support. The eBook is and always will be <a href=\"https://www.smashingmagazine.com/membership\">free for <em>Smashing Members</em></a>. Plus, Members get a friendly discount when purchasing their printed copy. Just sayin’! ;-)</p>\n\nMore Smashing Books &amp; Goodies\n\n<p>Promoting best practices and providing you with practical tips to master your daily coding and design challenges has always been (and will be) at the <strong>core of everything we do</strong> at Smashing.</p>\n\n<p>In the past few years, we were very lucky to have worked together with some talented, caring people from the web community to publish their wealth of experience as <a href=\"/printed-books/\">printed books that stand the test of time</a>. Trine, Heather, and Steven are three of these people. Have you checked out their books already?</p>\n\n<div>\n\n<div><a href=\"/printed-books/ethical-design-handbook/\"><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1f1cc2de-e6ed-4262-a1cb-cc0b2d4e3243/ethical-design-cover-shop-opt.png\" /></a></div><h4><a href=\"/printed-books/ethical-design-handbook/\">The Ethical Design Handbook</a></h4><p>A practical guide on ethical design for digital products.</p><p><a href=\"/printed-books/ethical-design-handbook/\">Add to cart $44</a></p>\n\n<div><a href=\"/printed-books/understanding-privacy/\"><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d2da7a90-acdb-43c7-82b2-5225c33ca4d7/understanding-privacy-cover-new-opt.png\" /></a></div><h4><a href=\"/printed-books/understanding-privacy/\">Understanding Privacy</a></h4><p>Everything you need to know to put your users first and make a better web.</p><p><a href=\"/printed-books/understanding-privacy/\">Add to cart $44</a></p>\n\n<div><a href=\"/printed-books/touch-design-for-mobile-interfaces/\"><img src=\"https://archive.smashing.media/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b14658fc-bb2d-41a6-8d1a-70eaaf1b8ec8/touch-design-book-shop-opt.png\" /></a></div><h4><a href=\"/printed-books/touch-design-for-mobile-interfaces/\">Touch Design for Mobile Interfaces</a></h4><p>Learn how touchscreen devices really work — and how people really use them.</p><p><a href=\"/printed-books/touch-design-for-mobile-interfaces/\">Add to cart $44</a></p>\n\n</div>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"7150b629ec5d6f6d71786ee5c243b8caa0eafbcb5e382181f5a3cf60706f598f","category":"Tech"}