{"title":"Electric Tech Stack","link":"https://markpeak.net/electric-tech-stack/","date":1766286743000,"content":"<p>บทความนี้เป็นภาคต่อของ <a href=\"https://markpeak.net/electromagnetism-vs-thermodynamics/\">Electromagnetism vs Thermodynamics</a> โดย Noah Smith คนเดิม ได้เขียนบทความชื่อ <a href=\"https://www.noahpinion.blog/p/why-every-country-needs-to-master\">Why every country needs to master the Electric Tech Stack</a> เพื่อขยายแนวคิดของเขาในเรื่อง “อุตสาหกรรมที่ขับเคลื่อนด้วยพลังงานไฟฟ้า” แทนที่จะเป็นพลังงานกล-ความร้อนแบบเดิม</p>\n<p>Noah Smith ย้อนความว่าในประวัติศาสตร์ เราเห็นอุตสาหกรรมที่เป็น “ผู้ชนะ” ในแต่ละยุคสมัย เช่น รถไฟ รถยนต์ เหล็กกล้า เซมิคอนดักเตอร์ ประเทศไหนที่เลือกอุตสาหกรรมได้ถูกต้อง (ไม่ว่าบังเอิญหรือตั้งใจ) จะผงาดขึ้นมาเป็นมหาอำนาจ</p>\n<p>ถ้าเอาแง่มุมของสงครามและความมั่นคงมาประกอบด้วย ประเทศมหาอำนาจทางการทหารในอดีตคือประเทศที่ผลิตรถถังและเครื่องบินได้มาก (เหล็กกล้า) แต่ปัจจัยชี้ขาดในสงครามยุคนี้ (ตัวอย่างที่ชัดเจนคือสงครามยูเครน-รัสเซีย) คือ โดรนอัตโนมัติ</p>\n<p>คำถามที่ตามมาคือ ถ้าเราอยากสร้างอุตสาหกรรมผลิตโดรน เราต้องมีเทคโนโลยีอะไรบ้าง? คำตอบคือมี 4 กลุ่ม</p>\n<ol>\n<li><strong>แบตเตอรี่</strong> เพื่อจ่ายพลังงาน</li>\n<li><strong>มอเตอร์ไฟฟ้า (electric motors)</strong> เพื่อหมุนใบพัด</li>\n<li><strong>อิเล็กทรอนิกส์กําลัง (power electronics)</strong> ใช้ควบคุมการจ่ายไฟจากแบตเตอรี่ไปยังมอเตอร์</li>\n<li><strong>ชิปคอมพิวเตอร์</strong> เพื่อควบคุม สื่อสาร สั่งการ</li>\n</ol>\n<p>ใครๆ ก็รู้ความสำคัญของชิปคอมพิวเตอร์ในยุคนี้ แต่ชิ้นส่วน 1-3 กลับไม่ค่อยถูกพูดถึงกันเท่าไรนัก ซึ่ง Noah เรียกรวมกันว่า Electric Tech Stack</p>\n<p>ความสำคัญของ Electric Tech Stack คือมันไม่ใช่แค่เรื่องโดรน แต่เป็นพื้นฐานของการผลิตเครื่องยนต์กลไกทุกอย่างในโลกยุคนี้ไปเรียบร้อยแล้ว ถ้าประเทศของคุณสามารถผลิตโดรนโดยใช้ชิ้นส่วนในประเทศได้เอง ก็แทบจะผลิตสินค้าอื่นๆ ได้แทบทุกอย่างแล้ว</p>\n<blockquote><p>If you have the ability to make drones domestically, you can also manufacture an increasingly large percentage of everything else.</p></blockquote>\n<p>ในอดีตการผลิตรถยนต์ ทีวี โทรศัพท์มือถือใช้เทคโนโลยีที่ต่างกันสุดขั้ว แต่ทุกวันนี้สินค้าเกือบทุกอย่างต้องมีชิปและแบตเตอรี่ ถ้าต้องการให้มันเคลื่อนไหวได้ก็ต้องมีมอเตอร์ไฟฟ้า และอิเล็กทรอนิกส์กำลังเพิ่มเข้ามา ตัวอย่างที่ชัดเจนที่สุดของการเปลี่ยนผ่านยุคสมัยนี้คือ รถไฟฟ้า EV</p>\n<p>แนวคิดเรื่อง Electric Tech Stack จึงอธิบายได้ว่าทำไมจีนถึงทำรถไฟฟ้า EV ได้ดี เพราะสั่งสมความเชี่ยวชาญในการผลิตชิ้นส่วนที่สำคัญแห่งยุคสมัย (เช่น ชิปและแบตเตอรี่) มายาวนาน และเป็นคำอธิบายได้ว่าทำไม Xiaomi หรือ BYD ถึงขยายธุรกิจมาทำรถยนต์ EV เพราะมีชิ้นส่วนต่างๆ ครบอยู่แล้ว แค่ใส่ล้อเข้ามาเพิ่มเท่านั้น</p>\n<p>Noah ยังยกคำพูดของ Ryan McEntush แห่งบริษัทลงทุนชื่อดัง Andreessen Horowitz ที่มีแนวคิดคล้ายๆ กัน แต่เขาใช้คำว่า electro‑industrial stack ซึ่งนิยามใกล้เคียงกันมาก</p>\n<blockquote><p>That bridge is the electro‑industrial stack — the technologies that enable machines to behave like software: minerals and metals processed into advanced components, energy stored in batteries, electrons channeled by power electronics, force delivered by motors and actuators, all orchestrated by software running on high-performance compute…</p></blockquote>\n<p>Noah เขียนเรื่อง Electric Tech Stack ในบริบทของการป้องกันประเทศ อเมริกา vs จีน แต่ผมคิดว่ามันใช้ได้กับบริบทของนโยบายอุตสาหกรรมไทยได้ด้วยเช่นกัน ดังนั้นถ้าหากเราต้องการพลิกฟื้นภาคอุตสาหกรรมไทยให้กลับขึ้นมารุ่งเรืองใหม่อีกครั้ง เราก็จำเป็นต้องมุ่งหน้าผลักดันเทคโนโลยีในชุด Electric Tech Stack ในระดับสูงอย่างจริงจัง</p>\n<p>หมายเหตุ: Noah แนะนำให้อ่านบทความ <a href=\"https://www.notboring.co/p/the-electric-slide\">The Electric Slide ของ Packy McCormick</a> ซึ่งยาวมาก ละเอียดมาก</p>\n<p><em>ภาพประกอบ: แผนผังชิ้นส่วนของโดรน DJI Mavic Pro จากเอกสารคู่มือโดรน</em></p>The post <a href=\"https://markpeak.net/electric-tech-stack/\">Electric Tech Stack</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"7434cd530b81562245f138f30e1a2f9a8a11ad5e957318645dbf580094aa097e","category":"Thai"}