{"title":"FCC asks stations for \"pro-America\" programming, like daily Pledge of Allegiance","link":"https://arstechnica.com/tech-policy/2026/02/fcc-asks-stations-for-pro-america-programming-like-daily-pledge-of-allegiance/","date":1771624859000,"content":"<p>Federal Communications Commission Chairman Brendan Carr today urged broadcasters to join a \"Pledge America Campaign\" that Carr established to support President Trump's \"Salute to America 250\" project.</p>\n<p>Carr said in a <a href=\"https://docs.fcc.gov/public/attachments/DOC-418890A1.pdf\">press release</a> that \"I am inviting broadcasters to pledge to air programming in their local markets in support of this historic national, non-partisan celebration.\" The press release said Carr is asking broadcasters to \"air patriotic, pro-America programming in support of America’s 250th birthday.\"</p>\n<p>Carr gave what he called examples of content that broadcasters can run if they take the pledge. His examples include \"starting each broadcast day with the 'Star Spangled Banner' or Pledge of Allegiance\"; airing \"PSAs, short segments, or full specials specifically promoting civic education, inspiring local stories, and American history\"; running \"segments during regular news programming that highlight local sites that are significant to American and regional history, such as National Park Service sites\"; airing \"music by America’s greatest composers, such as John Philip Sousa, Aaron Copland, Duke Ellington, and George Gershwin\"; and providing daily “Today in American History” announcements highlighting significant events from US history.</p><p><a href=\"https://arstechnica.com/tech-policy/2026/02/fcc-asks-stations-for-pro-america-programming-like-daily-pledge-of-allegiance/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/tech-policy/2026/02/fcc-asks-stations-for-pro-america-programming-like-daily-pledge-of-allegiance/#comments\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7513e48cb826edfcb32cea4c873d16d7995f992ebcd3fa9f3d6b82422911a86b","category":"Tech"}