{"title":"Apple’s next Macs will finally check every box","link":"https://www.macworld.com/article/3023806/apple-mac-features-oled-budget-touchscreen-5g.html","date":1771772400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>According to rumors, 2026 is shaping up to be a huge year for the Mac, starting in just a couple of weeks with <a href=\"https://www.macworld.com/article/3062338/apple-books-special-experiences-around-the-globe-on-march-4.html\">Apple’s first event</a> (or “experience”) of the year. Along with the usual faster chips, Apple reportedly has new tricks up its sleeve in 2026, with several new features that will have Mac users everywhere saying, “Finally!” Here are four major overdue announcements we expect to arrive this year.</p>\n\n\n\n<h2>A budget MacBook</h2>\n\n\n\n<p>iPhone fans have long pined for a truly affordable MacBook priced below the $999 MacBook Air that isn’t just an older model with a cut-rate price. That dream machine may finally arrive in just two short weeks. On March 4, Apple will hold a series of “experiences” in New York, London, and Shanghai, and the star is expected to be the first-ever <a href=\"https://www.macworld.com/article/2854313/a18-pro-macbook-design-processor-specs-release-rumors.html\">low-cost MacBook</a>. </p>\n\n\n\n<p>After tackling the mid-range market with the MacBook Air, Apple reportedly wants to compete with Chromebooks and Windows laptops, with a new laptop that could be as cheap as $599. Apple will reportedly use an A18 Pro or A19 Pro iPhone chip, and it will likely have a smaller screen than the Air and possibly fewer USB ports. But it will be powerful enough for everyday tasks and light work. For a lot of users, that’s all that’s needed.</p>\n\n\n\n<h2>MacBooks with OLED displays</h2>\n\n\n\n<p>When Apple unveiled the M1 Pro/M1 Max MacBook Pro in 2021, it was the first Mac to get the Liquid Retina XDR display, which was introduced in the 12.9-inch iPad Pro a few months earlier. The new mini-LED display was a huge upgrade over the previous model, bringing extreme dynamic range HDR, 120Hz ProMotion refresh, and up to 1,000 nits of sustained, full-screen brightness. it’s an excellent display, but it’s no longer the best.</p>\n\n\n\n<p>Apple is expected to upgrade the MacBook Pro’s display again in 2026 by taking another page from the iPad Pro. The M4 iPad Pro, released in 2024, introduced the Ultra Retina XDR display with tandem OLED technology to deliver high brightness, wide color support, and impressive color accuracy. Mac users have wanted it ever since, and it looks like Ultra Retina XDR will finally come with the <a href=\"https://www.macworld.com/article/2931833/touchscreen-macbook-pro-m6-design-processor-specs-release.html\">M6 Pro and M6 Max MacBook Pro</a> later this year.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2024/11/M4-MacBook-Pros.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M4 MacBook Pros\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>By the end of 2026, the MacBook Pro will be a very different laptop.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>A touchscreen MacBook Pro</h2>\n\n\n\n<p>One of the most frequent barbs I get from Windows users who want to needle me about my Mac devotion is, “When are MacBooks going to get touchscreens?” We may finally have an answer in 2026, when rumors say Apple will launch the first-ever <a href=\"https://www.macworld.com/article/2931833/touchscreen-macbook-pro-m6-design-processor-specs-release.html\">MacBook with a touchscreen display</a> in the fall. There’s a chance it could slip into the early part of 2027, but signs suggest Apple really wants to make it happen in 2026.</p>\n\n\n\n<p>The MacBook Pro’s <a href=\"https://www.macworld.com/article/3028720/macbook-pro-20th-anniversary.html\">20th anniversary</a> is this year, and Apple reportedly wants to mark the occasion by introducing the new model. Along with a touchscreen, the redesign will also bring a thinner profile and speedier M6 Pro and Max chips. We expect the laptop to retain its trackpad, but for users who’ve been wanting to reach up and place their fingers on the screen, they’ll finally get their wish.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2025/09/c1x.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple C1X\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>The replacement for the C1X modem could make its way into the M6 Pro and Max MacBook Pro.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>MacBooks with 5G</h2>\n\n\n\n<p>For many longtime Mac users, it’s a head-scratcher why Apple hasn’t put a modem inside a MacBook, especially when the entire iPad line has one. Of course, you can always tether to an iPhone when there’s no Wi-Fi around (depending on your wireless plan), but it’s not ideal if you need to move a lot of large files around. And of course, you’re also draining your iPhone <em>and</em> MacBook batteries.</p>\n\n\n\n<p>Last year, Apple released its first homegrown cellular modems, the <a href=\"https://www.macworld.com/article/2626940/apple-c1-modem-real-world-tests-iphone-16e-download-upload-speeds-performance.html\">C1</a> in the iPhone 16e and the <a href=\"https://www.macworld.com/article/2905765/the-a19-n1-and-c1x-the-drumbeat-of-impressive-apple-silicon-continues.html\">C1X</a> in the iPhone Air and iPad Pro. With the C2 in 2026, which will likely support mmWave, Apple is expected to expand the modem to more devices, starting with the <a href=\"https://www.macworld.com/article/2931833/touchscreen-macbook-pro-m6-design-processor-specs-release.html\">M6 Pro and M6 Max MacBook Pro</a>. With an Apple modem in a MacBook Pro, you can stop worrying about staying connected and draining the life out of your tethered iPhone. </p>\n\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"75a74671048106c098540ce4d2ba976902f4d3f020fa425c14eed7ca521d8227","category":"Apple"}