{"title":"Rumored Colors for Low-Cost MacBook Were Originally Tested for 2022 MacBook Air Redesign","link":"https://www.macrumors.com/2026/02/20/low-cost-macbook-colors-2022-air-redesign/","date":1771594178000,"content":"Apple tested color options for the 2022 MacBook Air redesign that are said to be similar to the finishes planned for its forthcoming low-cost MacBook, according to a Chinese leaker.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/Multicolored-Low-Cost-A18-Pro-MacBook-Feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\nApple is expected to announce its rumored low-cost MacBook at an event on March 4, with the device coming in a selection of bold color options that are believed to include yellow, green, and blue – <a href=\"https://www.macrumors.com/2026/02/18/low-cost-macbook-expected-on-march-4/\">as seen on Apple's invite graphic</a>. \r<br />\n\r<br />\nIn a post on Weibo, the account known as \"<a href=\"https://weibo.com/5143897135/QsJwCDf0W\">Instant Digital</a>\" says Apple originally planned to offer the same kind of light, playful color scheme for the MacBook Air with M2 chip.\r<br />\n\r<br />\nIndeed, back in <a href=\"https://www.macrumors.com/2021/10/21/macbook-air-2022-details-leaked/\">October 2021</a>, a proven leaker claimed the redesigned MacBook Air would come in color options that are similar to the 24-inch iMac, but it didn't happen. The model eventually dropped in July 2022 in silver, starlight, space gray, and midnight colors. \r<br />\n\r<br />\nWriting in his Power On newsletter over the weekend, <a href=\"https://www.macrumors.com/2026/02/16/low-cost-macbook-yellow-green-blue-pink/\"><em>Bloomberg</em>'s Mark Gurman</a> said the colors Apple has tested for its budget MacBook so far include light yellow, light green, blue, pink, classic silver, and dark gray, although he says it's unlikely all of them will ship.\r<br />\n\r<br />\nIf the colorful palette is unveiled, it would make the budget MacBook the most colorful laptop Apple has offered since the iBook G3 era in the late 90s. Apple offered the machines in Tangerine, Blueberry, Indigo, Graphite, and Key Lime.\r<br />\n\r<br />\nAs previously reported by Apple analyst <a href=\"https://www.macrumors.com/2025/06/30/apple-to-launch-low-cost-macbook/\">Ming-Chi Kuo</a>, the low-cost machine will retail for well under $1,000 and run an iPhone chip – potentially the A18 Pro – rather than an M-series processor. It will feature a slightly-under-13-inch display and an aluminum chassis, which is being built using a new, faster manufacturing process that Apple developed to keep costs down, according to Gurman.\r<br />\n\r<br />\nApple is believed to be trying to compete with Chromebooks, targeting the budget MacBook at students and enterprise users. Earlier this week, Apple <a href=\"https://www.macrumors.com/2026/02/16/apple-announces-special-event-in-new-york/\">announced</a> a \"special Apple Experience\" for the media in New York, London, and Shanghai, taking place on March 4, 2026 at 9:00am ET, when we're hoping to get a glimpse of the new machine.<div>Tags: <a href=\"https://www.macrumors.com/guide/instant-digital/\">Instant Digital</a>, <a href=\"https://www.macrumors.com/guide/macbook-a18-pro/\">MacBook (A18 Pro)</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2026/02/20/low-cost-macbook-colors-2022-air-redesign/\">Rumored Colors for Low-Cost MacBook Were Originally Tested for 2022 MacBook Air Redesign</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/rumored-colors-for-low-cost-macbook-were-originally-tested-for-2022-macbook-air-redesign.2477980/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"76b1dcb2870c50f3f69be9446a8b92707b20c1f7c9b6595eb87db29cb197d19d","category":"Apple"}