{"title":"Winter Desert Miles","link":"https://moots.com/blogs/news/winter-desert-miles","date":1766012476000,"content":"\n      <p><span>When the temperatures drop and the mountains start to get capped with snow, many of us in the mountains start looking south. As winter settles into the high country and riding up high fades, the desert opens up. Cooler days, fewer crowds, and long stretches of quiet make late fall and early winter the right time to ride White Rim. It’s not about speed or numbers—it’s about choosing the season, committing to the miles, and finding space before winter fully takes hold. Richard takes us on his adventure on the White Rim outside of the famed Moab, Utah. </span><span></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-12-17_at_3.04.33_PM.png?v=1766009195\" alt=\"\" /></span></p>\n<p>I just got back from eight days in the desert.</p>\n<p>Already checking the weather for the next warm window, planning how I’m going to keep riding through winter, something I’ve always abandoned for skiing. Living in the mountains, you share an unspoken bond with winter. It’s a fortunate place with easy access to snow and the outdoors. I’ve skied resort and earned my uphill turns for the last nine years, but lately the chairlift scene feels played out. So when opening weekend and the first storm of the year rolled through, I did the opposite and headed west, away from the noise. Offseason in Moab.</p>\n<p><strong>Bike choice:</strong> Routt CRD. 34mm road slicks mounted. 44mm Mezcals in the truck for when dirt was good</p>\n<p>One bike. Keep it simple.<span> </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-12-17_at_3.04.47_PM.png?v=1766009263\" alt=\"\" /></p>\n<p>Day one: blue sky above the red rock canyons, fresh snow on the La Sals. No wind, just stillness in the cold desert air. Cold start that never really warmed up, but I was out there riding, and that was the plan. River Road to Castle Valley, then out and back to Arches National Park. One hundred scenic miles, and 7k. Easily one of the best road rides in the country. Had to bail into the truck near the end, blast the heaters, and warm up. Then back outside to finish it. Glad I did.<span> </span></p>\n<p>I fell into a rhythm for the next three days. Wake up, coffee, pick a direction, go ride, try not to freeze. Hit all the Moab road classics: 313 out to Island in the Sky, Potash Road, the Canyon Path, Arches, Upper Colorado River Scenic Byway to Dewey Bridge. Missed the window for La Sal Mountain Loop Road, but that was okay.<span> </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-12-17_at_3.06.09_PM.png?v=1766009386\" alt=\"\" /></span></p>\n<p>The views in the Moab desert are magnificent, whether you're on pavement or deep in the desert. I was chasing another route. By the end of the week, after the cold front cleared, it became clear that conditions in Canyonlands would be dry enough. Saturday would be the day. Forecast in the 50s. White Rim.</p>\n<p>White Rim is a one-hundred-mile route through the Island in the Sky district of Canyonlands National Park. First rode it in December 2019, but I keep coming back to check in. It's become a benchmark. A testing ground. An escape. Just hard enough. Just remote enough. But this wasn't about PRs or pushing numbers. This was about chasing desert miles and the low winter sun. About being out there and just riding.</p>\n<p>Texted Andrew on Friday. “White Rim tomorrow?”</p>\n<p>“Yeah, I'm in.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-12-17_at_3.05.03_PM.png?v=1766009304\" alt=\"\" /></p>\n<p>Quick logistics: 8am start, Mineral Bottom/313 intersection, counter-clockwise. Day permits sorted. Self-supported, everything we needed on the bikes. Keep it simple.  Andrew runs a custom bikepacking gear company with his wife Katie, out of an off-grid workshop at the foot of the La Sal Mountains. We first connected on the Colorado Trail back in 2019. It's always good to reconnect with racing friends, and to ride with someone who gets the appeal of long days, minimal setups, and backcountry routes. I’ve taken a lot of inspiration from the way Andrew approaches cycling and racing. Most of the ride was a conversation about gear, bikes, and what’s next on the list. By then, we had already approached the final climb up Schafer Trail, the sun had gone down, and we rolled the final 8ish miles by headlamp. A full day on the pedals, no major mechanical issues, and good conditions. Hard to ask for more.<span>  </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-12-17_at_3.05.21_PM.png?v=1766009322\" alt=\"\" /></p>\n<p>On the way back to the mountains, I stopped and camped on 18rd in Fruita, spun the legs out once more around the Colorado National Monument, another Colorado classic. Back to winter, for now.<span> </span></p>\n<p><a href=\"https://www.strava.com/athletes/6042499\" target=\"_blank\">https://www.strava.com/athletes/6042499</a></p>\n<p><span> - Richard</span></p>\n<p><br /></p>\n<p><br /></p>\n<p> </p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"786fc0e21c7dc78e34337f81246062f1332d6ca5922787dc80453ac4baee1ef7","category":"Cycling"}