{"title":"Can AI Solve String Theory?","link":"https://markpeak.net/can-ai-solve-string-theory/","date":1757653912000,"content":"<p>ดูคลิปช่อง StarTalk เชิญ Lara Anderson ผู้เชี่ยวชาญด้าน String Theory มาออกรายการ แล้วตั้งคำถามที่น่าสนใจมากว่า Can AI Solve String Theory? เลยตามไปดูคลิปเต็มจนจบ</p>\n<p>ปูพื้นวงการฟิสิกส์สักนิดว่า พัฒนาการสำคัญด้านฟิสิกส์ในช่วงศตวรรษ 1900s มีอยู่ 2 เรื่อง คือ ทฤษฎีสัมพัทธภาพทั่วไป (general relativity) ของ Einstein ที่ทำให้เราเข้าใจกาลอวกาศ (space &amp; time) และกลศาสตร์ควอนตัม (quantum mechanics) ที่อธิบายเรื่องฟิสิกส์อนุภาค</p>\n<p>ปัญหาคือสองทฤษฎีนี้มีความขัดแย้งกันเอง (แต่ดันอธิบายปรากฏการณ์จริงได้ทั้งคู่) นักวิทยาศาสตร์เลยพยายามหาวิธีรวมสองทฤษฎีนี้เข้าด้วยกัน โดยตั้งชื่อให้มันล่วงหน้าว่า theory of everything คือใช้อธิบายทุกอย่างในจักรวาลได้</p>\n<p>หนึ่งในทฤษฎีตัวเต็งที่พยายามเป็น theory of everything คือ string theory ที่เสนอไอเดีย (แปลว่ายังไม่ได้รับการพิสูจน์) ว่าจักรวาลมีมิติมากกว่า 4 มิติ (space &amp; time) แต่มิติอื่นๆ ที่เหนือขึ้นไปจากนี้มันถูกลดขนาดลงเหลือเล็กมากๆ (compactification) จนเราสัมผัสไม่ได้ แต่ปรากฏการณ์ทางฟิสิกส์บางอย่างที่นักวิทยาศาสตร์ยังหาคำอธิบายไม่ได้ (เช่น พฤติกรรมของแรงโน้มถ่วง ซึ่งเป็นแรง 1 ใน 4 ชนิด อย่างสุดท้ายที่ยังรวมแรงไม่ได้) มันเชื่อมต่อกันผ่านมิติพิเศษเหล่านี้</p>\n<p></p>\n<p>ฟังดูโอเวอร์เหนือจินตนาการ แต่ปัญหาสำคัญของ string theory คือตัวทฤษฎีมันถูกพัฒนาขึ้นนานพอสมควรแล้ว (เริ่มคิดกันประมาณปี 1960s แล้วพัฒนาเรื่อยมา) แต่ยังไม่สามารถพิสูจน์ได้เลยว่ามันจริง ทั้งในทางคณิตศาสตร์ และในการทดลองจริงๆ</p>\n<p>ผมคิดว่าเป็นคำถามที่น่าสนใจมากว่า ทำไมเรายังไม่สามารถพิสูจน์ string theory ได้ และคำถามที่น่าสนใจต่อจากนั้นคือ แล้ว AI ช่วยเราได้ไหม</p>\n<p>Lara Anderson เป็นอาจารย์ด้านฟิสิกส์และคณิตศาสตร์ที่ Virginia Tech ซึ่งทำเรื่อง string theory โดยตรง เธออธิบายเรื่อง string theory ได้เข้าใจง่ายที่สุดเท่าที่ผมเคยฟังมา และตอบคำถามเรื่องนี้ว่า</p>\n<p>นักทฤษฎีฟิสิกส์พยายามคำนวณหาค่าตัวเลขความเป็นไปได้ของมิติต่างๆ ที่สอดคล้องกับสมการของ Einstein และ Quantum กันมานาน แต่การคำนวณนั้นยากมาก เพราะสมการเหล่านี้ยากอยู่แล้ว (เป็น non-liner คือ differential equation) แล้วพอต้องเพิ่มจำนวนมิติเข้าไปเยอะๆ สมการมันยิ่งซับซ้อนเข้าไปอีก การหาตัวเลขค่าคงที่ (constant) ที่สอดคล้องกันใน 6-7-8 มิติจึงเป็นเรื่องยากสุดๆ ไปเลย เหมือนงมเข็มในมหาสมุทร</p>\n<p>Neil deGrasse Tyson เสริมว่าในโลกของวิทยาศาสตร์ มันมีงานอยู่ 2 ประเภท แบบแรกคือ ปัญหาที่เราหาสมการเจอ แก้สมการได้ค่าตัวเลขมาแล้วจบกันไป กับแบบที่สองคือ เราต้องทดลองใส่ค่าตัวเลขไปเรื่อยๆ แล้วดูผลลัพธ์ ปรับแต่งไปเรื่อยๆ จนกว่าจะเจอ พวกเรานักวิทยาศาสตร์เกลียดโจทย์แบบที่ 2 แต่โลกก็เป็นแบบนี้ ไม่มีทางเลือกอื่น นอกจากลองคำนวณไปเรื่อยๆ</p>\n<p>Lara บอกว่าเดิมที นักทฤษฎีฟิสิกส์ต้องรอมีซูเปอร์คอมพิวเตอร์ใช้งาน แล้วลองใส่คำสั่งรันทดสอบ  simulation ตัวเลข รอไปหลายวันหรือหลายเดือนถึงได้คำตอบ (ที่ไม่รู้ว่าถูกหรือไม่) แต่ในยุค AI ก็ช่วยลดงานตรงนี้ลงได้ โดยใช้ machine learning ช่วยแก้สมการ differential equation ได้ในพีซีธรรมดา</p>\n<p>Lara บอกว่าการใช้ AI ในโลกฟิสิกส์ มันไม่เหมือนกับ AI แต่งภาพที่รู้แนวทางแก้ปัญหา (solution) แล้ว ให้ AI ไปเรียนรู้แพทเทิร์นแล้วเลียนแบบ เพราะฟิสิกส์ยังไม่มีคำตอบชัดๆ แต่อย่างน้อยก็ใช้ machine learning ช่วยเร่งความเร็วของการคำนวณได้เร็วกว่าเดิมมาก และเมื่อไม่นานมานี้ก็ใช้ AI ช่วยคำนวณมวลของ quark ออกมาได้บางกรณีแล้ว (Lara ไม่ได้พูด แต่เข้าใจว่าหมายถึง<a href=\"https://arxiv.org/abs/2402.01615\">เปเปอร์อันนี้</a>)</p>\n<p>กล่าวโดยสรุปคือ</p>\n<ul>\n<li>ที่ string theory ยังไม่สามารถพิสูจน์ได้ (แม้ในทางการคำนวณตัวเลขอย่างเดียว) เพราะโจทย์มันยากอยู่แล้วในทางคณิตศาสตร์</li>\n<li>เทคนิค AI ช่วยแก้ปัญหาได้บ้างแล้ว แม้ยังไม่สามารถแก้ string theory ได้ทั้งหมดก็ตาม</li>\n</ul>\n<p>ใครสนใจเรื่อง string theory แนะนำให้ฟังคลิปเต็มของ Lara อันนี้ดีจริงๆ</p>\n<p></p>The post <a href=\"https://markpeak.net/can-ai-solve-string-theory/\">Can AI Solve String Theory?</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"7a7013bd0e8d70a59e0841d366af5016d03d1ed145f69601c7ea517e803fe55c","category":"Thai"}