{"title":"เปิดศึกอีกครั้ง! Sam Altman บอกไอเดียสร้าง Data Center บนอวกาศของ Elon Musk \"ไร้สาระ\"","link":"https://www.blognone.com/node/149826","date":1771753619000,"content":"<span>เปิดศึกอีกครั้ง! Sam Altman บอกไอเดียสร้าง Data Center บนอวกาศของ Elon Musk \"ไร้สาระ\"</span>\n\n  <div>\n    <div>Body</div>\n              <div><p>ก่อนหน้านี้ SpaceX ได้<a href=\"https://www.blognone.com/node/149611\">ยื่นเอกสาร</a>เพื่อขอส่งดาวเทียมขึ้นสู่วงโคจรจำนวน 1 ล้านดวง สำหรับรองรับการประมวลผล AI บนอวกาศ เป็นการสร้างศูนย์ข้อมูลที่ใช้พลังงานแสงอาทิตย์ได้เต็มรูปแบบบนนั้น ซึ่งแผนงานนี้ก็นำมาสู่การ<a href=\"https://www.blognone.com/node/149620\">ควบรวมธุรกิจ</a>ของ Elon Musk คือ SpaceX และ xAI ให้รองรับการประมวลผล AI ที่มีความต้องการมหาศาล และ Musk ก็บอกด้วยว่าพลังงานไฟฟ้าที่โลกผลิตได้นั้นไม่เพียงพอ</p>\n<p>แม้ไอเดียนี้จะสร้างมุมมองที่หลากหลายว่าเป็นไปได้มากแค่ไหน แต่ก็มีขาประจำท่านหนึ่งออกมาแสดงความเห็นต่างแล้วนั่นคือ Sam Altman ซีอีโอ OpenAI คู่ปรับคนเดิมนั่นเอง</p>\n<p>Altman ให้สัมภาษณ์กับสื่ออินเดียในระหว่างการเดินทางไปร่วมงาน <a href=\"https://www.blognone.com/node/149803\">India AI Impact Summit</a> โดยเขาบอกว่าไอเดียการสร้างศูนย์ข้อมูลในอวกาศนั้นช่างไร้สาระ (ridiculous) สำหรับ<strong>สถานการณ์ในปัจจุบัน</strong> (current landscape) แต่ Altman ก็ไม่ได้ปิดประตูต่อไอเดียนี้ทั้งหมด เขาบอกว่าวันหนึ่งไอเดียนี้มันอาจจะสมเหตุสมผลขึ้นก็ได้ แต่วันนี้ปัจจัยหลายอย่างไม่ว่าจะเป็น ต้นทุน การซ่อมแซมอุปกรณ์ ทำให้เรื่องนี้ไม่น่าสนใจ อย่างน้อยก็ใน 10 ปีนี้</p>\n<p>อย่างไรก็ตามไอเดียสร้างศูนย์ข้อมูลประมวลผลในอวกาศ โดยใช้พลังงานแสงอาทิตย์นั้น ไม่ได้มีแค่ SpaceX และ xAI ที่เสนอแนวทางนี้ เมื่อปีที่แล้ว<a href=\"https://www.blognone.com/node/148764\">กูเกิลก็เสนองานวิจัย Project Suncatcher</a> ในการนำ TPU ไปประมวลผลในอวกาศเช่นกัน เพียงแต่กรณีของกูเกิลนั้นทุกอย่างยังเป็นการทดสอบแนวคิดเท่านั้น ไม่ได้มีทรัพยากรสนับสนุนเพื่อยิงดาวเทียมจำนวนมากสู่อวกาศแบบ SpaceX</p>\n<p>ที่มา: <a href=\"https://www.businessinsider.com/sam-altman-elon-musk-data-centers-space-timeline-2026-2\">Business Insider</a></p>\n</div>\n          </div>\n<span><a href=\"https://www.blognone.com/user/arjin\">arjin</a></span>\n<span><time>Sun, 22/02/2026 - 16:46</time>\n</span>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7ca159ca43163cefb5c37904879fcd03b0189f8d68a4aee53bfc1e06cbe1edd9","category":"Thai"}