{"title":"No, Apple won’t drop USB-C from the iPhone 18","link":"https://www.macworld.com/article/3066138/no-apple-wont-drop-usb-c-from-the-iphone-18.html","date":1771525080000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Most iPhone fans are currently focused on the imminent launch of the <a href=\"https://www.macworld.com/article/2881175/iphone-17e-release-date-specs-features-price.html\">iPhone 17e</a>, which could be here in a matter of days. But one dubious rumor doing the rounds on social media right now concerns a flagship phone from the next generation. It’s just a shame that it’s almost certainly wrong.</p>\n\n\n\n<p><a href=\"https://www.tiktok.com/@appleluxs/video/7601882273931201810\">This TikTok video</a>, which at the time of writing has been viewed more than 17 million times, purports to show the charging port of the iPhone 18. (Or “iPhone18,” as it’s labelled by the clearly knowledgeable maker.) But rather than the USB-C port, which has been used on all Apple smartphones since the iPhone 15 in 2023, the animation shows something more akin to the MagSafe connector that appears on newer MacBooks.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/02/iphone-18-magsafe-concept.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"TikTok video still of the iPhone 18 with MagSafe connector\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>This video might look cool, but it’s not going to happen.</p></figcaption></figure><p>TikTok</p></div>\n\n\n\n<p>The charging cable, which has a rather nice black braided cord, attaches via a magnetic connection. When it’s in place a green LED lights up on the charger head, and a small green lightning bolt is shown at the bottom of the previously blank phone screen. (Never mind that iPhones don’t behave like this; it’s the least of our worries.) It looks very similar to the MagSafe cable on my 2021 MacBook Pro, except with three pins instead of five and a chunkier body.</p>\n\n\n\n<p>Now, the video doesn’t list its sources; we don’t get the usual “supply-chain sources” or “people with knowledge of the matter.” It’s just an animation. So in some ways it’s quite difficult to refute: where did this information come from? Who said this was likely? Is this simply a concept that an illustrator dreamed up, like <a href=\"https://www.tiktok.com/@appleluxs/photo/7608583192567713032\">this animation</a> from the same channel showing possible iPhone 18 Pro colors?</p>\n\n\n\n<p>Whatever the video’s intention, it’s getting major traction from viewers who think it’s real. A quick browse through a handful of the 9,700-odd comments reveals viewer after viewer complaining about Apple’s foolishness in doing this, or the impracticality of the design. A few appear to be Android fans mocking iPhone users for their misfortune. I couldn’t find any comments pointing out that this is extraordinarily unlikely to happen.</p>\n\n\n\n<p>Because, as several commenters argue, it wouldn’t be a practical solution. It would disconnect very easily, and unlike on the MacBook, disconnecting easily isn’t necessary to protect it from a specific type of accident. It would annoy customers and accessories makers. And it could create problems with the EU, who mandated USB-C connectors on all smartphones sold in its territory.</p>\n\n\n\n<p>What may have happened is that someone has got confused between MagSafe on the iPhone and MagSafe on the Mac. They’re both charging standards that use a magnetic connection to keep the charging points in place, but in most other respects they’re totally different. (For example, the phone’s magnetic connection is stronger so that it remains connected if you nudge the device, whereas the laptop is designed to detach if you trip on the wire.) The iPhone 17 already has the phone version of MagSafe, and the iPhone 18 will too, but that doesn’t mean it will have the Mac version as well. If nothing else, it would be enormously confusing.</p>\n\n\n\n<p>Whereas the iPhone 17e is expected to be here in time for Apple’s “experience” on March 4, the first 18-series iPhones won’t arrive until September. And the actual iPhone 18, the cheaper baseline model, might not turn up until the following spring. So bookmark our <a href=\"https://www.macworld.com/article/2953687/iphone-18-pro-2026-release-date-design-specs-rumors.html\">iPhone 18 superguide</a> to keep up with all the latest news and rumors.</p>\n\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7ec2fcab8b90fda2eeb7bafbfb866232f7d8432e2068450ac21d47a98689eaf0","category":"Apple"}