{"title":"Designers, (Re)define Success First","link":"https://alistapart.com/article/redefine-success-first/","date":1652364000000,"content":"\n<p>About two and a half years ago, I introduced the idea of <a href=\"https://alistapart.com/article/daily-ethical-design/\">daily ethical design</a>. It was born out of my frustration with the many obstacles to achieving design that’s usable and equitable; protects people’s privacy, agency, and focus; benefits society; and restores nature. I argued that we need to overcome the inconveniences that prevent us from acting ethically and that we need to elevate design ethics to a more practical level by structurally integrating it into our daily work, processes, and tools.</p>\n\n\n\n<p>Unfortunately, we’re still very far from this ideal. </p>\n\n\n\n<p>At the time, I didn’t know yet <em>how</em> to structurally integrate ethics. Yes, I had found some tools that had worked for me in previous projects, such as using checklists, assumption tracking, and “dark reality” sessions, but I didn’t manage to apply those in <em>every</em> project. I was still struggling for time and support, and at best I had only partially achieved a higher (moral) quality of design—which is far from my definition of <em>structurally integrated</em>.</p>\n\n\n\n<p>I decided to dig deeper for the root causes in business that prevent us from practicing daily ethical design. Now, after much research and experimentation, I believe that I’ve found the key that will let us structurally integrate ethics. And it’s surprisingly simple! But first we need to zoom out to get a better understanding of what we’re up against.</p>\n\n\n\n<h2>Influence the system</h2>\n\n\n\n<p>Sadly, we’re trapped in a capitalistic system that reinforces <a href=\"https://www.nature.com/articles/s41467-020-16941-y\">consumerism</a> and <a href=\"https://www.aljazeera.com/economy/2022/1/11/brace-yourself-for-an-even-more-unequal-post-pandemic-world-wef\">inequality</a>, and it’s obsessed with the <a href=\"https://www.goodreads.com/book/show/53328332-less-is-more\">fantasy of endless growth</a>. Sea levels, temperatures, and our demand for energy continue to rise unchallenged, while the gap between rich and poor continues to widen. Shareholders expect ever-higher returns on their investments, and companies feel forced to set short-term objectives that reflect this. Over the last decades, those objectives have <a href=\"https://creativegood.com/blog/21/losing-faith-in-ux.html\">twisted our well-intended human-centered mindset into a powerful machine</a> that promotes ever-higher levels of consumption. When we’re working for an organization that pursues “double-digit growth” or “aggressive sales targets” (which is 99 percent of us), that’s very hard to resist while remaining human <em>friendly</em>. Even with our best intentions, and even though we like to say that we create solutions for people, we’re a part of the problem.</p>\n\n\n\n<p>What can we do to change this?</p>\n\n\n\n<p>We can start by acting on the right level of the system. Donella H. Meadows, a system thinker, once listed <a href=\"https://www.goodreads.com/book/show/3828902-thinking-in-systems\">ways to influence a system</a> in order of effectiveness. When you apply these to design, you get:</p>\n\n\n\n<ul><li>At the lowest level of effectiveness, you can affect <strong>numbers</strong> such as usability scores or the number of design critiques. But none of that will change the direction of a company.</li><li>Similarly, affecting <strong>buffers </strong>(such as team budgets), <strong>stocks</strong> (such as the number of designers), <strong>flows</strong> (such as the number of new hires), and <strong>delays</strong> (such as the time that it takes to hear about the effect of design) won’t significantly affect a company.</li><li>Focusing instead on <strong>feedback loops</strong> such as management control, employee recognition, or design-system investments can help a company become better at achieving its objectives. But that doesn’t change the objectives themselves, which means that the organization will still work against your ethical-design ideals.</li><li>The next level, <strong>information flows</strong>,<strong><em> </em></strong>is what most ethical-design initiatives focus on now: the exchange of ethical methods, toolkits, articles, conferences, workshops, and so on. This is also where ethical design has remained mostly <em>theoretical</em>. We’ve been focusing on the wrong level of the system all this time.</li><li>Take <strong>rules,</strong> for example—they beat knowledge every time. There can be widely accepted rules, such as how finance works, or a scrum team’s definition of done. But ethical design can also be smothered by unofficial rules meant to maintain profits, often revealed through comments such as “the client didn’t ask for it” or “don’t make it too big.”</li><li>Changing the rules without holding official power is very hard. That’s why the next level is so influential: <strong>self-organization</strong>. Experimentation, bottom-up initiatives, passion projects, self-steering teams—all of these are examples of self-organization that improve the resilience and creativity of a company. It’s exactly this diversity of viewpoints that’s needed to structurally tackle big systemic issues like consumerism, wealth inequality, and climate change.</li><li>Yet even stronger than self-organization are <strong>objectives</strong> and <strong>metrics</strong>. Our companies want to make more money, which means that everything and everyone in the company does their best to… make the company more money. And once I realized that profit is nothing more than a measurement, I understood how crucial a very specific, defined metric can be toward pushing a company in a certain direction.</li></ul>\n\n\n\n<p>The takeaway? If we truly want to incorporate ethics into our daily design practice, we must first change the measurable objectives of the company we work for, from the bottom up.</p>\n\n\n\n<h2>Redefine success</h2>\n\n\n\n<p>Traditionally, <a href=\"https://designthinking.ideo.com/\">we consider a product or service successful if it’s desirable to humans, technologically feasible, and financially viable</a>. You tend to see these represented as equals; if you type the three words in a search engine, you’ll find diagrams of three equally sized, evenly arranged circles.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image01-1024x576.png\" alt=\"A Venn diagram with three overlapping circles representing Viable, Desirable, and Feasible with the target directly in the central intersection of all three.\" /></figure>\n\n\n\n<p>But in our hearts, we all know that the three dimensions aren’t equally weighted: it’s viability that ultimately controls whether a product will go live. So a more realistic representation might look like this:</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image02-1024x576.png\" alt=\"A Venn diagram with two circles (Desirable and Feasible) overlapping. An arrow points from their intersection to a separate circle marked as Viable, with a target inside it.\" /></figure>\n\n\n\n<p>Desirability and feasibility are the <em>means</em>; viability is the <em>goal</em>. Companies—outside of nonprofits and charities—exist to make money.</p>\n\n\n\n<p>A genuinely purpose-driven company would try to reverse this dynamic: it would recognize finance for what it was intended for: a <em>means</em>. So both feasibility and viability are means to achieve what the company set out to achieve. It makes intuitive sense: to achieve most anything, you need resources, people, and money. (Fun fact: the Italian language knows no difference between feasibility and viability; both are simply <em>fattibilità</em>.)</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image03-1024x576.png\" alt=\"A Venn diagram with two circles (Viable and Feasible) overlapping. An arrow points from their intersection to a separate circle marked as Desirable, with a target inside it.\" /></figure>\n\n\n\n<p>But simply swapping <em>viable</em> for <em>desirable</em> isn’t enough to achieve an ethical outcome. Desirability is still linked to consumerism because the associated activities aim to identify what people want—<em>whether it’s good for them or not</em>. Desirability objectives, such as user satisfaction or conversion, don’t consider whether a product is healthy for people. They don’t prevent us from creating products that distract or manipulate people or stop us from contributing to society’s wealth inequality. They’re unsuitable for establishing a healthy balance with nature.</p>\n\n\n\n<p>There’s a fourth dimension of success that’s missing: our designs also need to be <em>ethical</em> in the effect that they have on the world.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image04-1024x576.png\" alt=\"The original Venn diagram of three circles (Desirable, Viable, and Feasible) overlapping with the target in their central intersection. This time, a fourth circle named Ethical encompasses all three.\" /></figure>\n\n\n\n<p>This is hardly a new idea. Many similar models exist, some calling the fourth dimension <em>accountability</em>, <em>integrity</em>, or <em>responsibility</em>. What I’ve never seen before, however, is the necessary step that comes after: to influence the system as designers and to make ethical design more practical, we must create objectives for ethical design that are achievable and inspirational. There’s no one way to do this because it highly depends on your culture, values, and industry. But I’ll give you the version that I developed with a group of colleagues at a design agency. Consider it a template to get started.</p>\n\n\n\n<h2>Pursue well-being, equity, and sustainability</h2>\n\n\n\n<p>We created objectives that address design’s effect on three levels: individual, societal, and global.</p>\n\n\n\n<p>An objective on the individual level tells us what success is beyond the typical focus of usability and satisfaction—instead considering matters such as how much time and attention is required from users. We pursued <strong>well-being</strong>:</p>\n\n\n\n<blockquote><p>We create products and services that allow for people’s health and happiness. Our solutions are calm, transparent, nonaddictive, and nonmisleading. We respect our users’ time, attention, and privacy, and help them make healthy and respectful choices.</p></blockquote>\n\n\n\n<p>An objective on the societal level forces us to consider our impact beyond just the user, widening our attention to the economy, communities, and other indirect stakeholders. We called this objective <strong>equity</strong>:</p>\n\n\n\n<blockquote><p>We create products and services that have a positive social impact. We consider economic equality, racial justice, and the inclusivity and diversity of people as teams, users, and customer segments. We listen to local culture, communities, and those we affect.</p></blockquote>\n\n\n\n<p>Finally, the objective on the global level aims to ensure that we remain in balance with the only home we have as humanity. Referring to it simply as <strong>sustainability</strong>, our definition was:</p>\n\n\n\n<blockquote><p>We create products and services that reward sufficiency and reusability. Our solutions support the circular economy: we create value from waste, repurpose products, and prioritize sustainable choices. We deliver functionality instead of ownership, and we limit energy use.</p></blockquote>\n\n\n\n<p>In short, ethical design (to us) meant achieving wellbeing for each user and an equitable value distribution within society through a design that can be sustained by our living planet. When we introduced these objectives in the company, for many colleagues, <em>design ethics</em> and <em>responsible design</em> suddenly became tangible and achievable through practical—and even familiar—actions.</p>\n\n\n\n<h2>Measure impact </h2>\n\n\n\n<p>But defining these objectives still isn’t enough. What truly caught the attention of senior management was the fact that we created a way to <em>measure</em> every design project’s well-being, equity, and sustainability.</p>\n\n\n\n<p>This overview lists example metrics that you can use as you pursue well-being, equity, and sustainability:</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image05-1024x576.png\" alt=\"A list of example metrics for ethical impact at individual, societal, and planetary levels. Individual well-being examples include increased calmness, lower screen time, improved safety and privacy. Societal equity examples include improved accessibility, increased team and stakeholder diversity, and increased progressive enhancement. Finally, planetary sustainability examples include reduced energy use, reduced website carbon emissions and device turnover, and increased expert involvement.\" /></figure>\n\n\n\n<p>There’s a lot of power in measurement. As the saying goes, what gets measured gets done. <a href=\"https://www.goodreads.com/book/show/3828902-thinking-in-systems\">Donella Meadows</a> once shared this example:</p>\n\n\n\n<blockquote><p>“If the desired system state is national security, and that is defined as the amount of money spent on the military, the system will produce military spending. It may or may not produce national security.”</p></blockquote>\n\n\n\n<p>This phenomenon explains why <em>desirability</em> is a poor indicator of success: it’s typically <a href=\"https://www.interaction-design.org/literature/article/google-s-heart-framework-for-measuring-ux\">defined as the increase in customer satisfaction, session length, frequency of use, conversion rate, churn rate, download rate</a>, and so on. But none of these metrics increase the health of people, communities, or ecosystems. What if instead we measured success through metrics for (digital) well-being, such as (reduced) <a href=\"https://en.wikipedia.org/wiki/Screen_time#Physical_health_effects\">screen time</a> or software energy consumption?</p>\n\n\n\n<p>There’s another important message here. Even if we set an objective to build a calm interface, if we were to choose the wrong metric for calmness—say, the number of interface elements—we could still end up with a screen that induces anxiety. Choosing the wrong metric can completely undo good intentions. </p>\n\n\n\n<p>Additionally, choosing the right metric is enormously helpful in <em>focusing</em> the design team. Once you go through the exercise of <a href=\"https://www.franklincovey.com/the-4-disciplines-old/discipline-2-act/\">choosing metrics for our objectives</a>, you’re forced to consider what success looks like <em>concretely</em> and how you can prove that you’ve reached your ethical objectives. It also forces you to consider what we as designers have <em>control</em> over: what can I include in my design or change in my process that will lead to the right type of success? The answer to this question brings a lot of clarity and focus.</p>\n\n\n\n<p>And finally, it’s good to remember that traditional businesses run on measurements, and managers love to spend much time discussing charts (ideally hockey-stick shaped)—especially if they concern profit, the one-above-all of metrics. For good or ill, to improve the system, to have a serious discussion about ethical design with managers, we’ll need to speak that business language.</p>\n\n\n\n<h2>Practice daily ethical design</h2>\n\n\n\n<p>Once you’ve defined your objectives and you have a reasonable idea of the potential metrics for your design project, <em>only</em> then do you have a chance to structurally practice ethical design. It “simply” becomes a matter of using your creativity and choosing from all the knowledge and toolkits already available to you.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image06-1024x576.png\" alt=\"A set of example methods and tools for practicing at the individual, societal, and planetary level. Individual tools include the principle of minimum necessary data, white-hat persuasion techniques, calm-technology guidelines, and more. Societal tools include stakeholder mapping, inclusive sampling and testing, progressive enhancement, accessibility principles, and more. Planetary tools include the flourishing business canvas, extended-service blueprint, website carbon calculators, product-lifecycle mapping, and more.\" /></figure>\n\n\n\n<p>I think this is quite exciting! It opens a whole new set of challenges and considerations for the design process. Should you go with that energy-consuming video or would a simple illustration be enough? Which typeface is the most calm and inclusive? Which new tools and methods do you use? When is the website’s end of life? How can you provide the same service while requiring less attention from users? How do you make sure that those who are affected by decisions are there when those decisions are made? How can you measure our effects?</p>\n\n\n\n<p>The redefinition of success will completely change what it means to do good design.</p>\n\n\n\n<p>There is, however, a final piece of the puzzle that’s missing: convincing your client, product owner, or manager to be mindful of well-being, equity, and sustainability. For this, it’s essential to engage stakeholders in a dedicated kickoff session.</p>\n\n\n\n<h2>Kick it off or fall back to status quo</h2>\n\n\n\n<p>The kickoff is the most important meeting that can be so easy to forget to include. It consists of two major phases: 1) the alignment of <em>expectations</em>, and 2) the definition of <em>success</em>.</p>\n\n\n\n<p>In the first phase, the entire (design) team goes over the project brief and meets with all the relevant stakeholders. Everyone gets to know one another and express their expectations on the outcome and their contributions to achieving it. Assumptions are raised and discussed. The aim is to get on the same level of understanding and to in turn avoid preventable miscommunications and surprises later in the project.</p>\n\n\n\n<p>For example, for a recent freelance project that aimed to design a digital platform that facilitates US student advisors’ documentation and communication, we conducted an online kickoff with the client, a subject-matter expert, and two other designers. We used a combination of canvases on Miro: one with questions from “<a href=\"https://www.manualof.me/\">Manual of Me</a>” (to get to know each other), a <a href=\"https://www.theteamcanvas.com/\">Team Canvas</a> (to express expectations), and a version of the <a href=\"http://www.projectcanvas.dk/\">Project Canvas</a> to align on scope, timeline, and other practical matters.</p>\n\n\n\n<p>The above is the traditional purpose of a kickoff. But just as important as expressing expectations is agreeing on what <em>success</em> means for the project—in terms of desirability, viability, feasibility, and ethics. What are the objectives in each dimension?</p>\n\n\n\n<p>Agreement on what success means at such an early stage is crucial because you can rely on it for the remainder of the project. If, for example, the design team wants to build an inclusive app for a diverse user group, they can raise diversity as a specific success criterion during the kickoff. If the client agrees, the team can refer back to that promise throughout the project. “As we agreed in our first meeting, having a diverse user group that includes A and B is necessary to build a successful product. So we do activity X and follow research process Y.” Compare those odds to a situation in which the team didn’t agree to that beforehand and had to ask for permission halfway through the project. The client might argue that that came <em>on top</em> of the agreed scope—and she’d be right.</p>\n\n\n\n<p>In the case of this freelance project, to define success I prepared a round canvas that I call the <em>Wheel of Success</em>. It consists of an inner ring, meant to capture ideas for objectives, and a set of outer rings, meant to capture ideas on how to measure those objectives. The rings are divided into five dimensions of successful design: healthy, equitable, sustainable, desirable, feasible, and viable.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image07-956x1024.jpg\" alt=\"The wheel of success. The central circle reads 'The product is a success when it is'. The next ring outside lists example values such as healthy, equitable, sustainable, viable, feasible, and desirable. The next ring out lists out measurable objectives for those values, and the outermost ring lists tools that can measure those objectives.\" /></figure>\n\n\n\n<p>We went through each dimension, writing down ideas on digital sticky notes. Then we discussed our ideas and verbally agreed on the most important ones. For example, our client agreed that sustainability and progressive enhancement are important success criteria for the platform. And the subject-matter expert emphasized the importance of including students from low-income and disadvantaged groups in the design process.</p>\n\n\n\n<p>After the kickoff, we summarized our ideas and shared understanding in a project brief that captured these aspects:</p>\n\n\n\n<ul><li>the project’s origin and purpose: <strong><em>why</em></strong><em> are we doing this project?</em></li><li>the problem definition: <em>what do we want to </em><strong><em>solve</em></strong><em>?</em></li><li>the concrete goals and metrics for each success dimension: <em>what do we want to </em><strong><em>achieve</em></strong><em>?</em></li><li>the scope, process, and role descriptions: <strong><em>how</em></strong><em> will we achieve it?</em></li></ul>\n\n\n\n<p>With such a brief in place, you can use the agreed-upon objectives and concrete metrics as a checklist of success, and your design team will be ready to pursue the right objective—using the tools, methods, and metrics at their disposal to achieve ethical outcomes.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/05/image08-1024x576.png\" alt=\"A drawing of a set of mountains that also looks vaguely like a graph. The leftmost valley has 'Pursue the right objective' pointing at it. The middle valley has 'Solve the right problem' and the rightmost valley is labelled 'Build the right solution.' Below the mountains, a timeline shows from left to right: Kick-off, Problem space, Solution space, and Development.\" /></figure>\n\n\n\n<h2>Conclusion</h2>\n\n\n\n<p>Over the past year, quite a few colleagues have asked me, “Where do I start with ethical design?” My answer has always been the same: organize a session with your stakeholders to (re)define success. Even though you might not always be 100 percent successful in agreeing on goals that cover all responsibility objectives, that beats the alternative (the status quo) every time. If you want to be an ethical, responsible designer, there’s no skipping this step.</p>\n\n\n\n<p>To be even more specific: if you consider yourself a <em>strategic designer</em>, your challenge is to define ethical objectives, set the right metrics, and conduct those kick-off sessions. If you consider yourself a <em>system designer</em>, your starting point is to understand how your industry contributes to consumerism and inequality, understand how finance drives business, and brainstorm which levers are available to influence the system on the highest level. Then redefine success to create the space to exercise those levers.</p>\n\n\n\n<p>And for those who consider themselves service designers or UX designers or UI designers: if you truly want to have a positive, meaningful impact, stay away from the toolkits and meetups and conferences for a while. Instead, gather your colleagues and define goals for well-being, equity, and sustainability through design. Engage your stakeholders in a workshop and challenge them to think of ways to achieve and measure those ethical goals. Take their input, make it concrete and visible, ask for their agreement, and hold them to it.</p>\n\n\n\n<p>Otherwise, I’m genuinely sorry to say, you’re wasting your precious time and creative energy.</p>\n\n\n\n<p>Of course, engaging your stakeholders in this way can be uncomfortable. Many of my colleagues expressed doubts such as “What will the client think of this?,” “Will they take me seriously?,” and “Can’t we just do it within the design team instead?” In fact, a product manager once asked me why ethics couldn’t just be a structured part of the design <em>process</em>—to just do it without spending the effort to define ethical objectives. It’s a tempting idea, right? We wouldn’t have to have difficult discussions with stakeholders about what values or which key-performance indicators to pursue. It would let us focus on what we like and do best: designing.</p>\n\n\n\n<p>But as systems theory tells us, that’s not enough. For those of us who aren’t from marginalized groups and have the privilege to be able to speak up and be heard, that uncomfortable space is exactly where we need to be if we truly want to make a difference. We can’t remain within the design-for-designers bubble, enjoying our privileged working-from-home situation, disconnected from the real world out there. For those of us who have the possibility to speak up and be heard: if we solely keep <em>talking</em> about ethical design and it remains at the level of articles and toolkits—we’re not designing ethically. It’s just theory. We need to actively engage our colleagues and clients by challenging them to redefine success in business.</p>\n\n\n\n<p>With a bit of courage, determination, and focus, we can break out of this cage that finance and business-as-usual have built around us and become facilitators of a new type of business that can see beyond financial value. We just need to agree on the right objectives at the start of each design project, find the right metrics, and realize that we already have everything that we need to get started. That’s what it means to do daily ethical design.</p>\n\n\n\n<p><em>For their inspiration and support over the years, I would like to thank Emanuela Cozzi Schettini, José Gallegos, Annegret Bönemann, Ian Dorr, Vera Rademaker, Virginia Rispoli, Cecilia Scolaro, Rouzbeh Amini, and many others.</em></p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"7fd773cc86fd5b9a6505075c17c1155a27e5a038dd25a51f372a1ad0a1e4be1c","category":"Tech"}