{"title":"Introducing HashiCorp Agent Skills","link":"https://www.hashicorp.com/blog/introducing-hashicorp-agent-skills","date":1770051600000,"content":"<p>Today, we're announcing <strong><a href=\"https://github.com/hashicorp/agent-skills\">HashiCorp Agent Skills</a></strong>, a repository of <a href=\"https://agentskills.io/home\">Agent Skills</a> and Claude Code plugins for HashiCorp products. At launch, this includes Skills for Terraform and Packer. </p>\n\n<p>These Skills give AI assistants specialized HashiCorp product knowledge, including plugin framework architectures, schema definitions, and up-to-date best practices. The initial HashiCorp Agent Skills pack includes Skills that can:</p>\n\n<ul>\n<li>Follow HashiCorp style conventions when generating Terraform code</li>\n<li>Write and run Terraform tests</li>\n<li>Create orchestrations with Terraform Stacks</li>\n<li>Help build Terraform providers according to best practices</li>\n<li>Refactor Terraform modules</li>\n<li>Build AWS, Azure, and Windows images with Packer</li>\n<li>and more</li>\n</ul>\n\n<p>In this post, we'll cover what Agent Skills are, how these skills improve your infrastructure workflow, and how to install them in your AI assistant. </p>\n\n<h2>What are Agent Skills?</h2>\n\n<p>Agent Skills are based on an <a href=\"https://agentskills.io/home\">open standard</a> for packaging domain expertise into portable, reusable instructions that AI agents can load on demand. Developed by Anthropic and released as an open format, skills solve a fundamental problem: AI assistants often lack the specific technical context needed to perform complex tasks reliably.</p>\n\n<blockquote>\n<p>A note on the Model Context Protocol (MCP). You might be wondering how this differs from MCP. Agent Skills and MCP are complementary technologies. MCP is the \"pipe\" or server interface that connects data to an AI, while Agent Skills are the \"textbooks\" of knowledge. You can use them together to create a powerful, context-aware assistant.</p>\n</blockquote>\n\n<p>Each Skill is a folder containing instructions, reference materials, and resources. When you load a Skill, your AI assistant gains access to curated expertise it can apply to your work, significantly reducing hallucinations and adhering to strict architectural standards.</p>\n\n<h2>Skills for every stage of your DevOps journey</h2>\n\n<p>The HashiCorp Agent Skills package currently includes Skills that address the most common challenges that Terraform and Packer users face, with more planned for the future:</p>\n\n<p><u><strong>Building a new provider</strong></u>: Creating a Terraform provider requires understanding of the plugin framework, resource lifecycle methods, schema design, and testing patterns. Our provider development Skills give AI assistants the context to guide you through the entire process, from scaffolding a new provider to implementing complex data sources to testing, all without having to point your AI to different documents manually or risk bad practices and nonsensical results from creeping in. </p>\n\n<p><u><strong>Maintaining an existing provider</strong></u>: Provider maintenance involves handling breaking changes, updating to new framework versions, and addressing community issues. The Terraform Skills also help AI assistants understand your existing codebase and suggest changes that follow established patterns.                     </p>\n\n<p><u><strong>Generating quality Terraform code</strong></u>: We’ve baked our coding conventions into AI workflows with our Terraform style guide Skill. That means when you start generating Terraform configurations with the style guide Skill, the code will follow HashiCorp’s documented style conventions, rather than potentially using conventions from code found in the wild. </p>\n\n<p><u><strong>Breaking down monoliths</strong></u>: The refactor module Skill helps refactor monolithic Terraform configurations into modules, making your configurations more reusable and manageable.  </p>\n\n<p><u><strong>Using Terraform Stacks</strong></u>: <a href=\"https://www.hashicorp.com/en/blog/terraform-stacks-explained\">Terraform Stacks</a> are a configuration layer in HCP Terraform and Terraform Enterprise designed to manage complex, multi-environment, multi-region infrastructure as a single, cohesive unit. With the Terraform Stacks Skill, you can simplify the coding process of Stack components without as many general-LLM pitfalls.</p>\n\n<p><u><strong>Building machine images with Packer</strong></u>: Packer Skills help users build golden images across AWS, Azure, and Windows with proper builder configurations, provisioners, platform-specific patterns, and HCP Packer integration for image lifecycle management.</p>\n\n<h2>Evaluating our Agent Skills</h2>\n\n<p>A key part of creating our Skills was evaluating their efficacy and iteratively improving them based on evaluation data. Skills can significantly improve how an agent completes a task when written well. Written poorly, they may consume too much context with little gain. They can also lack critical information or be phrased in ways that different models interpret inconsistently.</p>\n\n<p>HashiCorp partnered with <a href=\"https://tessl.io/\">Tessl</a> to evaluate and improve our Agent Skills. We used two evaluation techniques:</p>\n\n<ul>\n<li><strong>Review evals</strong>, which test Skill structure against <a href=\"https://platform.claude.com/docs/en/agents-and-tools/agent-skills/best-practices\">Anthropic's best practices</a></li>\n<li><strong>Task evals</strong>, which run agents through real tasks with and without the Skill to assess results</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1770050836-tests-of-ag-sklls.png\" alt=\"Run\" /><p>You can see the full review eval results on our listing <a href=\"https://tessl.io/skills/github/hashicorp/agent-skills\">here</a>.</p>\n\n<h2>Install Skills in seconds</h2>\n\n<p>We designed the installation process to be as simple as possible. You have a few options:<br />\n* Using <strong>npx</strong>, run:\n    *  <code>npx skills add hashicorp/agent-skills</code><br />\n* Using <strong>Tessl</strong>, run:\n    *  <code>npm i -g @tessl/cli &amp;&amp; tessl i github:hashicorp/agent-skills</code>\n* For <strong>Claude Code</strong> specifically, run:\n    *  <code>/plugin marketplace add hashicorp/agent-skills</code>\n    *  <code>/plugin install terraform-provider-development@hashicorp</code></p>\n\n<p>Any of these methods will install the Skill files directly into your AI assistant's configuration directory, with no manual copying or configuration editing.                                                                                                                                                             </p>\n\n<h2>What's next</h2>\n\n<p>This initial release covers Terraform and Packer, but we plan to expand the library to cover additional HashiCorp products very soon.</p>\n\n<p>We also welcome contributions from the community. If you have expertise to share or ideas for new Skills, visit our repository to get involved. Let us know how these Skills help your workflow and tell us what you’d like to see next by opening an issue in the repository.                                                                                                                                                           </p>\n\n<h2>More resources</h2>\n\n<ul>\n<li><strong>Keep up to date with HashiCorp Agent Skills:</strong> Follow the <a href=\"https://github.com/hashicorp/agent-skills\">GitHub Repository.</a> Install via <code>/plugin</code>,  Tessl, or <code>npx</code>.</li>\n<li><strong>Learn the standard:</strong> Read about <a href=\"https://agentskills.io/home\">Agent Skills</a> to understand how the open format works.</li>\n<li><strong>Scale your impact:</strong> Sign up for <a href=\"https://www.hashicorp.com/en/products/terraform?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_PRAC_MULTI_hashicorp-agent-skills-blog_PRODUCTPAGE&amp;utm_content=end-blog-cta&amp;utm_offer=product_page\">HCP Terraform</a> and <a href=\"https://www.hashicorp.com/en/products/packer?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_PRAC_MULTI_hashicorp-agent-skills-blog_PRODUCTPAGE&amp;utm_content=end-blog-cta&amp;utm_offer=product_page\">HCP Packer</a> to manage your new infrastructure configurations at scale. </li>\n</ul>\n","author":"Gautam Baghel","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"80a63845175b190fb3659b74a96dc28a9eb98b9613a591db8eb60bfd646ee5dd","category":"Tech"}