{"title":"Suunto’s New Routeplanner Site Hands-On: Totally free, no account required!?!","link":"https://www.dcrainmaker.com/2026/01/suunto-routeplanner-hands-on-details.html","date":1768997395000,"content":"<p><img title=\"IMG_1957.jpeg\" src=\"https://media.dcrainmaker.com/images/2026/01/IMG_1957-1.jpeg\" alt=\"\" width=\"720\" height=\"540\" srcset=\"https://media.dcrainmaker.com/images/2026/01/IMG_1957-1.jpeg 1440w, https://media.dcrainmaker.com/images/2026/01/IMG_1957-1-200x150.jpeg 200w, https://media.dcrainmaker.com/images/2026/01/IMG_1957-1-720x540.jpeg 720w, https://media.dcrainmaker.com/images/2026/01/IMG_1957-1-768x576.jpeg 768w\" /></p>\n<p>It seems rare in 2026 (or anytime this decade) for a new web platform to be launched that allows you to create routes, save those routes as files, and more…all without paying for it. Or, even more notably, without creating a single account. But here we are – with <a href=\"https://routeplanner.suunto.com\">Suunto’s Routeplanner</a> that was launched in December. I’ve been playing with it since launch, and it’s actually pretty darn cool.</p>\n<p>It effectively gives you the core functionality of Strava Routes &amp; Komoot Routes, but for free. And sure, if you have a Suunto or Hammerhead device, you can link up your account, and then it’ll magically flow to those devices. But for everyone else, you can simply save and export the routes as a GPX file, and then import them into your watch or bike computer.</p>\n<p>In short, the website does all the following without even creating an account:</p>\n<p>A) Create new routes using variety of map types<br />\nB) Can optimize routes for either running/hiking/pedestrian activities or cycling activities (leverages that heat map data)<br />\nC) Can see heat map data for roughly a dozen sport types<br />\nD) Can see elevation profile, and ascent/descent metrics<br />\nE) Can save/export routes as GPX files<br />\nF) Can share routes as a URL (for others to download), valid for 6 months<br />\nG) Can open up existing routes (GPX/FIT files)<br />\nH) Can modify existing GPX/FIT file routes<br />\nI) Can save any of the above to your Suunto account for automatic device sync (optional)</p>\n<p>I’m sure I’m missing other tiny ancillary features, but that’s the gist of it, which is a pretty cool gist. But, as noted, I just want to quickly run though things. And note that this doesn’t take away from the existing suite of tools in the dedicated Suunto App, though that’s for actual Suunto device users/owners. But of course, this leans heavily on the backend infrastructure, which they share.</p>\n<h3><span><strong>Creating a Route:</strong></span></h3>\n<p>So, starting off is easy, simply navigate to <a href=\"https://routeplanner.suunto.com/\">https://routeplanner.suunto.com</a> and boom – a map is there, ready to do cuddle your creation. Note that if you permit your browser tab to see your current location, it’ll be centered on your location. But of course, that’s not required. On the right side are two options to let you control the map imagery. The first one controls the map itself, including layers for: Outdoor (seen below), Satellite (seen next), Light, Dark, Winter, Avalanche Terrain, and Finland Terrain. Yes, there’s actually a dedicated Finland Map option. Perhaps Greenland is also considering requesting a Greenland Map option that would hide the terrain.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage.png\" alt=\"\" width=\"720\" height=\"379\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage.png 1440w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-200x105.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-720x379.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-768x404.png 768w\" /></p>\n<p>In any event, the second option switches from 2D (shown above) to 3D (shown below), and then the third option lets you toggle on heatmaps for all the sports you see below. You can also adjust the transparency level. For probably close to a decade, one of the best features of Suunto’s platforms/apps has been the heatmaps. Specifically, the per-sport option, and more specifically the swimming option. In a place like Mallorca (shown below), it’s less important. But in many areas that might have openwater swim restrictions (e.g., the greater Washington DC area), seeing where people openwater swim frequently is incredibly helpful.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-1.png\" alt=\"\" width=\"719\" height=\"378\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-1.png 1438w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-1-200x105.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-1-720x379.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-1-768x404.png 768w\" /></p>\n<p>Finally, on the options front, below that you’ve got routing preferences:</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-2.png\" alt=\"\" width=\"720\" height=\"482\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-2.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-2-200x134.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-2-300x200.png 300w\" /></p>\n<p>Ok, with that set, let’s create a route. In my case, we’re going to go with trail run, but I’ve created road runs, trail runs, road rides, and more without any issues.</p>\n<p>To do so, I literally just start tapping. It’s not that difficult. Tap-tap-tap, and off it goes, creating a route. Just like every other route planner on earth. Down at the bottom, you can expand out a chart to show the elevation profile (and also see the exact gains/distances/etc…). Now in this case, I’ve left the heat map on (specified for trail run), and I’m following a route I know fairly well (<a href=\"https://www.strava.com/activities/16658042446\">most recently done back a month or so ago</a>).</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-3.png\" alt=\"\" width=\"720\" height=\"376\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-3.png 1440w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-3-200x104.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-3-720x376.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-3-768x401.png 768w\" /></p>\n<p>Of course, it also supports free-drawing mode, in the event you need to short-circuit something, or the routing isn’t quite what you want. For example, pretend I want to go bushwhacking here to scratch up my legs and regret my life choices (thankfully, there are no deadly snakes in Mallorca to worry about – Australia this is not). I can simply toggle the option for Free Drawing, and then connect the two points directly. After that, I can resume back to ‘Any road or path’, and get back on the trail.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-4.png\" alt=\"\" width=\"720\" height=\"406\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-4.png 1440w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-4-200x113.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-4-720x405.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-4-124x70.png 124w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-4-768x433.png 768w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-4-300x169.png 300w\" /></p>\n<p>Once done, I’ve got this pleasant 17KM route, complete with elevation profile and all. In fact, about the only complaint I’d have here is that the thin blue line can be a bit tough to see against the heatmap. Sure, I could reduce the heatmap a bit, but I would prefer to just make the route line thicker/more visible.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-5.png\" alt=\"\" width=\"720\" height=\"378\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-5.png 1440w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-5-200x105.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-5-720x378.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-5-768x403.png 768w\" /></p>\n<p>You can always undo points, as well as re-draw points to add distance/changes, as well as reverse a route too (the two options in the lower right side). The lower left options are searching for a location, centering the map on you, and then zooming the map to fit your whole route.</p>\n<p>Now comes the good part, which are the options along the bottom right. These are for exporting/saving a route, plus importing a route. Oh, and that little settings icon? It lets you change to about 20 languages, change from metric to statute, and change among another 15 or so different GPS grid formats. In any case, let’s save this route (again, we still haven’t created any account here). Just tap the ‘down’ icon, and that will save it as a GPX file, which you can name whatever you want.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-7.png\" alt=\"\" width=\"718\" height=\"351\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-7.png 1436w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-7-200x98.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-7-720x352.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-7-768x375.png 768w\" /></p>\n<p>And with that, you’re ready to use it on any device you want. It’s that simple, just a GPX file.</p>\n<p>However, perhaps even cooler is that you can also create a shareable link, which lasts for 6 months. People can’t modify the route, but you can quickly share it with friends/teams/groups/etc…</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-9.png\" alt=\"\" width=\"718\" height=\"390\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-9.png 1436w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-9-200x109.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-9-720x391.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-9-768x417.png 768w\" /></p>\n<p><a href=\"https://routeplanner.suunto.com/?route=sant-elm-17km-trail-run-1768995083839&amp;style=satellite&amp;heatmap=trail-running&amp;bottomBar=open\">Here’s that exact route link</a>, in case you want to look at things. What’s neat is that it even saves your settings (trail running heatmaps, satellite view, etc…) within the link properties. Nice touch!</p>\n<p>The last two options here are:</p>\n<p>1) Linking your Suunto account, to save it directly into your Suunto route profile/devices<br />\n2) Uploading a GPX/FIT file to look at/share/tweak.</p>\n<p>To me what’s interesting about the Suunto account linking is that this is kinda going full-circle for Suunto. Way-back-when, Suunto Movescount was a website first, then became the ‘Suunto App’, and Movescount was even blended/something’d with SportsTracker for a time period, before ultimately Suunto ditching the website and going full-on app. I think they’ve come to realize that many people, especially for route planning, really prefer a larger desktop experience. I know I do. Sure, I can make routes just fine on my phone. But for longer/more complex routes, having a larger screen and such just makes for a better experience.</p>\n<p>Finally, for those who want a bit more geekery, Suunto actually has a number of little easter eggs in there. Notably, you can create links to just specific points, simply to show someone something. For example, here’s a <a href=\"https://routeplanner.suunto.com/?lat=19.791083&amp;lng=-155.994537&amp;zoom=11.14&amp;style=satellite&amp;heatmap=triathlon&amp;pitch=65.0&amp;view=3d&amp;bearing=54.7\">link to the Ironman World Championships location in Kona (Hawaii)</a>, with the triathlon heat map enabled, and the zoom/angle/map situated to show most of the entire course. That’s pretty neat.</p>\n<p>Even more, here’s all the parameters you can pass in the URL currently/today, if you want:</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-10.png\" alt=\"\" width=\"718\" height=\"444\" srcset=\"https://media.dcrainmaker.com/images/2026/01/UntitledImage-10.png 1436w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-10-200x124.png 200w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-10-720x445.png 720w, https://media.dcrainmaker.com/images/2026/01/UntitledImage-10-768x475.png 768w\" /></p>\n<p>That last one is notable, it lets you create a route automatically from the user’s start location, to a given point. Akin to basically giving out the start location of a route/meeting point, and then people can simply save/sync that to get to the start (e.g.,  for a group ride). Super cool. <a href=\"https://routeplanner.suunto.com/?lat=41.373432&amp;lng=2.186632&amp;zoom=13.56&amp;routehere=true\">Here’s an example using the ferry terminal in Barcelona as an example</a> (where you’d board the boat to come see me in Mallorca).</p>\n<h3><span><strong>Wrap-Up:</strong></span></h3>\n<p>I could geek out all day long on this kind of stuff. No account needed, no payment, just creating routes for fun with tons of options (both practical and geeky). But perhaps more notable for Suunto customers, is a bit of a return of features they lost half a decade or so ago. Features that some of their competitors have, that Suunto could potentially tempt new customers too.</p>\n<p>Easily, this is incredibly useful for people who don’t want to pay for routing on Strava or Komoot. I’d have zero issues using this to quickly create routes with this for just about any GPS device (since almost all of them support importing in .GPX files, well, save Apple Watch). I’d love to see someone like Wahoo link up a bit with Suunto on letting them push routes from this to Wahoo devices. Sure, Suunto already has a partnership with Hammerhead for route data – but one not a threesome? Atop that, Wahoo is done making watches (years ago), so they aren’t really competitors anymore. Anyway, food for thought.</p>\n<p>With that – thanks for reading!</p>","author":"Ray Maker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"8200c28b9302af69e2340bf2a4e22d5ee77da68cfd3d15d88baf0d4bfda74aef","category":"Cycling"}