{"title":"Older Tech In The Browser Stack","link":"https://smashingmagazine.com/2025/11/older-tech-browser-stack/","date":1763020800000,"content":"<p>I’ve been in front-end development long enough to see a trend over the years: younger developers working with a new paradigm of programming without understanding the historical context of it. </p>\n<p>It is, of course, perfectly understandable to <em>not</em> know something. The web is a very big place with a diverse set of skills and specialties, and we don’t always know what we don’t know. Learning in this field is an ongoing journey rather than something that happens once and ends.</p>\n<p>Case in point: Someone on my team asked if it was possible to tell if users navigate away from a particular tab in the UI. I pointed out JavaScript’s <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/beforeunload_event\"><code>beforeunload</code> event</a>. But those who have tackled this before know this is possible because they have been hit with alerts about unsaved data on other sites, for which <code>beforeunload</code> is a typical use case. I also pointed out the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/pagehide_event\"><code>pageHide</code></a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Document/visibilitychange_event\"><code>visibilityChange</code></a> events to my colleague for good measure.</p>\n<p>How did I know about that? Because it came up in another project, not because I studied up on it when initially learning JavaScript.</p>\n<p>The fact is that modern front-end frameworks are standing on the shoulders of the technology giants that preceded them. They abstract development practices, often for a better developer experience that reduces, or even eliminates, the need to know or touch what have traditionally been essential front-end concepts everyone probably ought to know.</p>\n<p>Consider the <a href=\"https://css-tricks.com/an-introduction-and-guide-to-the-css-object-model-cssom/\">CSS Object Model (CSSOM)</a>. You might expect that anyone working in CSS and JavaScript has a bunch of hands-on CSSOM experience, but that’s not always going to be the case.</p>\n<p>There was a React project for an e-commerce site I worked on where we needed to load a stylesheet for the currently selected payment provider. The problem was that the stylesheet was loading on every page when it was only really needed on a specific page. The developer tasked with making this happen hadn’t ever loaded a stylesheet dynamically. Again, this is totally understandable when React abstracts away the traditional approach you might have reached for.</p>\n<p>The CSSOM is likely not something you need in your everyday work. But it is likely you will need to interact with it at some point, even in a one-off instance.</p>\n<p>These experiences inspired me to write this article. There are many existing web features and technologies in the wild that you may never touch directly in your day-to-day work. Perhaps you’re fairly new to web development and are simply unaware of them because you’re steeped in the abstraction of a specific framework that doesn’t require you to know it deeply, or even at all.</p>\n<p>I’m speaking specifically about <a href=\"https://developer.mozilla.org/en-US/docs/Web/XML/Guides/XML_introduction\">XML</a>, which many of us know is an ancient language not totally dissimilar from HTML.</p>\n<p>I’m bringing this up because of recent WHATWG discussions <a href=\"https://github.com/whatwg/html/issues/11523\">suggesting</a> that a significant chunk of the XML stack known as <a href=\"https://developer.mozilla.org/en-US/docs/Web/XML/XSLT\">XSLT</a> programming should be removed from browsers. This is exactly the sort of older, existing technology we’ve had for years that could be used for something as practical as the CSSOM situation my team was in.</p>\n<p>Have you worked with XSLT before? Let’s see if we lean heavily into this older technology and leverage its features outside the context of XML to tackle real-world problems today.</p>\nXPath: The Central API\n<p>The most important XML technology that is perhaps the most useful outside of a straight XML perspective is <strong>XPath</strong>, a query language that allows you to find any node or attribute in a markup tree with one root element. I have a personal affection for XSLT, but that also relies on XPath, and personal affection must be put aside in ranking importance.</p>\n<p>The argument for removing XSLT does not make any mention of XPath, so I suppose it is still allowed. That’s good because XPath is the central and most important API in this suite of technologies, especially when trying to find something to use outside normal XML usage. It is important because, while CSS selectors can be used to find most of the elements in your page, they cannot find them all. Furthermore, CSS selectors cannot be used to find an element based on its current position in the DOM.</p>\n<p>XPath can. </p>\n<p>Now, some of you reading this might know XPath, and some might not. XPath is a pretty big area of technology, and I can’t really teach all the basics and also show you cool things to do with it in a single article like this. I actually tried writing that article, but the average Smashing Magazine publication doesn’t go over 5,000 words. I was already at more than 2,000 words while only halfway through the basics.</p>\n<p>So, I’m going to start doing cool stuff with XPath and give you some links that you can use for the basics if you find this stuff interesting.</p>\nCombining XPath &amp; CSS\n<p>XPath can do lots of things that CSS selectors can’t when querying elements. But CSS selectors can also do a few things that XPath can’t, namely, query elements by class name.</p>\n<table>\n    <thead>\n        <tr>\n            <th>CSS</th>\n            <th>XPath</th>\n        </tr>\n    </thead>\n    <tbody>\n        <tr>\n            <td><code>.myClass</code></td>\n            <td><code>/*[contains(@class, \"myClass\")]</code></td>\n        </tr>\n    </tbody>\n</table>\n\n<p>In this example, CSS queries elements that contain a <code>.myClass</code> classname. Meanwhile, the XPath example queries elements that contain an attribute class with the string “<code>myClass</code>”. In other words, it selects elements with <code>myClass</code> in any attribute, including elements with the <code>.myClass</code> classname — as well as elements with “<code>myClass</code>” in the string, such as <code>.myClass2</code>. XPath is broader in that sense.</p>\n<p>So, no. I’m not suggesting that we ought to toss out CSS and start selecting all elements via XPath. That’s not the point.</p>\n<p>The point is that XPath can do things that CSS cannot and could still be very useful, even though it is an older technology in the browser stack and may not seem obvious at first glance.</p>\n<p>Let’s use the two technologies together not only because we can, but because we’ll learn something about XPath in the process, making it another tool in your stack — one you might not have known has been there all along!</p>\n<p>The problem is that JavaScript’s <code>document.evaluate</code> method and the various query selector methods we use with the CSS APIs for JavaScript are incompatible.</p>\n<p>I have made a compatible querying API to get us started, though admittedly, I have not put a lot of thought into it since it’s a departure from what we’re doing here. Here’s a fairly simple working example of a reusable query constructor:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/jEqEyEx\">queryXPath [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>I’ve added two methods on the document object: <code>queryCSSSelectors</code> (which is essentially <code>querySelectorAll</code>) and <code>queryXPaths</code>. Both of these return a <code>queryResults</code> object:</p>\n<div>\n<pre><code>{\n  queryType: nodes | string | number | boolean,\n  results: any[] // html elements, xml elements, strings, numbers, booleans,\n  queryCSSSelectors: (query: string, amend: boolean) =&gt; queryResults,\n  queryXpaths: (query: string, amend: boolean) =&gt; queryResults\n}\n</code></pre>\n</div>\n\n<p>The <code>queryCSSSelectors</code> and <code>queryXpaths</code> functions run the query you give them over the elements in the results array, as long as the results array is of type <code>nodes</code>, of course. Otherwise, it will return a <code>queryResult</code> with an empty array and a type of <code>nodes</code>. If the <code>amend</code> property is set to <code>true</code>, the functions will change their own <code>queryResults</code>.</p>\n<p><strong>Under no circumstances should this be used in a production environment.</strong> I am doing it this way purely to demonstrate the various effects of using the two query APIs together. </p>\nExample Queries\n<p>I want to show a few examples of different XPath queries that demonstrate some of the powerful things they can do and how they can be used in place of other approaches.</p>\n<p>The first example is <code>//li/text()</code>. This queries all <code>li</code> elements and returns their text nodes. So, if we were to query the following HTML:</p>\n<pre><code>&lt;ul&gt;\n  &lt;li&gt;one&lt;/li&gt;\n  &lt;li&gt;two&lt;/li&gt;\n  &lt;li&gt;three&lt;/li&gt;\n&lt;/ul&gt;\n</code></pre>\n\n<p>…this is what is returned:</p>\n<div>\n<pre><code>{\"queryType\":\"xpathEvaluate\",\"results\":[\"one\",\"two\",\"three\"],\"resultType\":\"string\"}\n</code></pre>\n</div>\n\n<p>In other words, we get the following array: <code>[\"one\",\"two\",\"three\"]</code>.</p>\n<p>Normally, you would query for the <code>li</code> elements to get that, turn the result of that query into an array, map the array, and return the text node of each element. But we can do that more concisely with XPath:</p>\n<pre><code>document.queryXPaths(\"//li/text()\").results.\n</code></pre>\n\n<p>Notice that the way to get a text node is to use <code>text()</code>, which looks like a function signature — and it is. It returns the text node of an element. In our example, there are three <code>li</code> elements in the markup, each containing text (<code>\"one\"</code>, <code>\"two\"</code>, and <code>\"three\"</code>).</p>\n<p>Let’s look at one more example of a <code>text()</code> query. Assume this is our markup:</p>\n<pre><code>&lt;pa href=\"/login.html\"&gt;Sign In&lt;/a&gt;\n</code></pre>\n\n<p>Let’s write a query that returns the <code>href</code> attribute value:</p>\n<pre><code>document.queryXPaths(\"//a[text() = 'Sign In']/@href\").results.\n</code></pre>\n\n<p>This is an XPath query on the current document, just like the last example, but this time we return the <code>href</code> attribute of a link (<code>a</code> element) that contains the text “Sign In”. The actual returned result is <code>[\"/login.html\"]</code>.</p>\nXPath Functions Overview\n<p>There are a number of XPath functions, and you’re probably unfamiliar with them. There are several, I think, that are worth knowing about, including the following:</p>\n<ul>\n<li><strong><code>starts-with</code></strong><br />If a text starts with a particular other text example, <code>starts-with(@href, 'http:')</code> returns <code>true</code> if an <code>href</code> attribute starts with <code>http:</code>.</li>\n<li><strong><code>contains</code></strong><br />If a text contains a particular other text example, <code>contains(text(), \"Smashing Magazine\")</code> returns <code>true</code> if a text node contains the words “Smashing Magazine” in it anywhere. </li>\n<li><strong><code>count</code></strong><br />Returns a count of how many matches there are to a query. For example, <code>count(//*[starts-with(@href, 'http:'])</code> returns a count of how many links in the context node have elements with an <code>href</code> attribute that contains the text beginning with the <code>http:</code>.</li>\n<li><strong><code>substring</code></strong><br />Works like JavaScript <code>substring</code>, except you pass the string as an argument. For example, <code>substring(\"my text\", 2, 4)</code> returns <code>\"y t\"</code>.</li>\n<li><strong><code>substring-before</code></strong><br />Returns the part of a string before another string. For example, <code>substing-before(\"my text\", \" \")</code> returns <code>\"my\"</code>. Similarly, <code>substring-before(\"hi\",\"bye\")</code> returns an empty string.</li>\n<li><strong><code>substring-after</code></strong><br />Returns the part of a string after another string. For example, <code>substing-after(\"my text\", \" \")</code> returns <code>\"text\"</code>. Similarly, <code>substring-after(\"hi\",\"bye\")</code>returns an empty string.</li>\n<li><strong><code>normalize-space</code></strong><br />Returns the argument string with whitespace normalized by stripping leading and trailing whitespace and replacing sequences of whitespace characters by a single space. </li>\n<li><strong><code>not</code></strong><br />Returns a boolean <code>true</code> if the argument is false, otherwise <code>false</code>. </li>\n<li><strong><code>true</code></strong><br />Returns boolean <code>true</code>.</li>\n<li><strong><code>false</code></strong><br />Returns boolean <code>false</code>.</li>\n<li><strong><code>concat</code></strong><br />The same thing as JavaScript <code>concat</code>, except you do not run it as a method on a string. Instead, you put in all the strings you want to concatenate. </li>\n<li><strong><code>string-length</code></strong><br />This is not the same as JavaScript <code>string-length</code>, but rather returns the length of the string it is given as an argument.</li>\n<li><strong><code>translate</code></strong><br />This takes a string and changes the second argument to the third argument. For example, <code>translate(\"abcdef\", \"abc\", \"XYZ\")</code> outputs <code>XYZdef</code>.</li>\n</ul>\n<p>Aside from these particular XPath functions, there are a number of other functions that work just the same as their JavaScript counterparts — or counterparts in basically any programming language — that you would probably also find useful, such as <code>floor</code>, <code>ceiling</code>, <code>round</code>, <code>sum</code>, and so on.</p>\n<p>The following demo illustrates each of these functions:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/emZmgzX\">XPath Numerical functions [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>Note that, like most of the string manipulation functions, many of the numerical ones take a <strong>single input</strong>. This is, of course, because they are supposed to be used for querying, as in the last XPath example:</p>\n<pre><code>//li[floor(text()) &gt; 250]/@val\n</code></pre>\n\n<p>If you use them, as most of the examples do, you will end up running it on the first node that matches the path. </p>\n<p>There are also some type conversion functions you should probably avoid because JavaScript already has its own type conversion problems. But there can be times when you want to convert a string to a number in order to check it against some other number. </p>\n<p>Functions that set the type of something are boolean, number, string, and node. These are the important XPath datatypes. </p>\n<p>And as you might imagine, most of these functions can be used on datatypes that are not DOM nodes. For example, <code>substring-after</code> takes a string as we’ve already covered, but it could be the string from an <code>href</code> attribute. It can also just be a string:</p>\n<div>\n<pre><code>const testSubstringAfter = document.queryXPaths(\"substring-after('hello world',' ')\");\n</code></pre>\n</div>\n\n<p>Obviously, this example will give us back the results array as <code>[\"world\"]</code>. To show this in action, I have made a demo page using functions against things that are not DOM nodes:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/qEZERqd\">queryXPath [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>You should note the surprising aspect of the <code>translate</code> function, which is that if you have a character in the second argument (i.e., the list of characters you want translated) and no matching character to translate to, that character gets removed from the output.</p>\n<p>Thus, this:</p>\n<div>\n<pre><code>translate('Hello, My Name is Inigo Montoya, you killed my father, prepare to die','abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ,','*')\n</code></pre>\n</div>\n\n<p>…results in the string, including spaces:</p>\n<pre><code>[\" * *  ** \"]\n</code></pre>\n\n<p>This means that the letter “a” is being translated to an asterisk (<code>*</code>), but every other character that does not have a translation given the target string is completely removed. The whitespace is all we have left between the translated “a” characters.</p>\n<p>Then again, this query:</p>\n<div>\n<pre><code>translate('Hello, My Name is Inigo Montoya, you killed my father, prepare to die','abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ,','**************************************************')\")\n</code></pre>\n</div>\n\n<p>…does not have the problem and outputs a result that looks like this:</p>\n<div>\n<pre><code>\"***** ** **** ** ***** ******* *** ****** ** ****** ******* ** ***\"\n</code></pre>\n</div>\n\n<p>It might strike you that there is no easy way in JavaScript to do exactly what the XPath <code>translate</code> function does, although for many use cases, <code>replaceAll</code> with regular expressions can handle it. </p>\n<p>You could use the same approach I have demonstrated, but that is suboptimal if all you want is to translate the strings. The following demo wraps XPath’s <code>translate</code> function to provide a JavaScript version:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/ZYWYLyZ\">translate function [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>Where might you use something like this? Consider <a href=\"https://en.wikipedia.org/wiki/Caesar_cipher\">Caesar Cipher</a> encryption with a three-place offset (e.g., top-of-the-line encryption from 48 B.C.):</p>\n<div>\n<pre><code>translate(\"Caesar is planning to cross the Rubicon!\", \n \"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz\",\n  \"XYZABCDEFGHIJKLMNOPQRSTUVWxyzabcdefghijklmnopqrstuvw\")\n</code></pre>\n</div>\n\n<p>The input text “Caesar is planning to cross the Rubicon!” results in “Zxbpxo fp mixkkfkd ql zolpp qeb Oryfzlk!”</p>\n<p>To give another quick example of different possibilities, I made a <code>metal</code> function that takes a string input and uses a <code>translate</code> function to return the text, including all characters that take umlauts.</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/YPqPNrN\">metal function [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<div>\n<pre><code>const metal = (str) =&gt; {\n  return translate(str, \"AOUaou\",\"ÄÖÜäöü\");\n}\n</code></pre>\n</div>\n\n<p>And, if given the text “Motley Crue rules, rock on dudes!”, returns “Mötley Crüe rüles, röck ön düdes!”</p>\n<p>Obviously, one might have all sorts of parody uses of this function. If that’s you, then this <a href=\"https://tvtropes.org/pmwiki/pmwiki.php/Main/HeavyMetalUmlaut\">TVTropes article</a> ought to provide you with plenty of inspiration.</p>\nUsing CSS With XPath\n<p>Remember our main reason for using CSS selectors together with XPath: CSS pretty much understands what a class is, whereas the best you can do with XPath is string comparisons of the class attribute. That will work in most cases.</p>\n<p>But if you were to ever run into a situation where, say, someone created classes named <code>.primaryLinks</code> and <code>.primaryLinks2</code> and you were using XPath to get the <code>.primaryLinks</code> class, then you would likely run into problems. As long as there’s nothing silly like that, you would probably use XPath. But I am sad to report that I have worked at places where people do those types of silly things. </p>\n<p>Here’s another demo using CSS and XPath together. It shows what happens when we use the code to run an XPath on a context node that is not the document’s node.</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/ogxgBpz\">css and xpath together [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>The CSS query is <code>.relatedarticles a</code>, which fetches the two <code>a</code> elements in a <code>div</code> assigned a <code>.relatedarticles</code> class.</p>\n<p>After that are three “bad” queries, that is to say, queries that do not do what we want them to do when running with these elements as the context node. </p>\n<p>I can explain why they are behaving differently than you might expect. The three bad queries in question are:</p>\n<ul>\n<li><code>//text()</code>: Returns all the text in the document.</li>\n<li><code>//a/text()</code>: Returns all the text inside of links in the document.</li>\n<li><code>./a/text()</code>: Returns no results.</li>\n</ul>\n<p>The reason for these results is that while your context is <code>a</code> elements returned from the CSS query, <code>//</code> goes against the whole document. This is the strength of XPath; CSS cannot go from a node up to an ancestor and then to a sibling of that ancestor, and walk down to a descendant of that sibling. But XPath can.</p>\n<p>Meanwhile, <code>./</code> queries the children of the current node, where the dot (<code>.</code>) represents the current node, and the forward slash (<code>/</code>) represents going to some child node — whether it is an attribute, element, or text is determined by the next part of the path. But there is no child <code>a</code> element selected by the CSS query, thus that query also returns nothing. </p>\n<p>There are three good queries in that last demo:</p>\n<ul>\n<li><code>.//text()</code>,</li>\n<li><code>./text()</code>,</li>\n<li><code>normalize-space(./text())</code>.</li>\n</ul>\n<p>The <code>normalize-space</code> query demonstrates XPath function usage, but also fixes a problem included in the other queries. The HTML is structured like this:</p>\n<div>\n<pre><code>&lt;a href=\"<a href=\"https://www.smashingmagazine.com/2018/04/feature-testing-selenium-webdriver/&quot;\">https://www.smashingmagazine.com/2018/04/feature-testing-selenium-webdriver/\"</a>&gt;\n  Automating Your Feature Testing With Selenium WebDriver\n&lt;/a&gt;\n</code></pre>\n</div>\n\n<p>The query returns a line feed at the beginning and end of the text node, and <code>normalize-space</code> removes this. </p>\n<p>Using any XPath function that returns something other than a boolean with an input XPath applies to other functions. The following demo shows a number of examples:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/JoXYGeN\">xpath functions examples [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>The first example shows a problem you should watch out for. Specifically, the following code:</p>\n<div>\n<pre><code>document.queryXPaths(\"substring-after(//a/@href,'https://')\");\n</code></pre>\n</div>\n\n<p>…returns one string:</p>\n<div>\n<pre><code>\"<a href=\"http://www.smashingmagazine.com/2018/04/feature-testing-selenium-webdriver/&quot;\">www.smashingmagazine.com/2018/04/feature-testing-selenium-webdriver/\"</a>\n</code></pre>\n</div>\n\n<p>It makes sense, right? These functions do not return arrays but rather single strings or single numbers. Running the function anywhere with multiple results only returns the first result. </p>\n<p>The second result shows what we really want:</p>\n<div>\n<pre><code>document.queryCSSSelectors(\"a\").queryXPaths(\"substring-after(./@href,'https://')\");\n</code></pre>\n</div>\n\n<p>Which returns an array of two strings:</p>\n<div>\n<pre><code>[\"<a href=\"http://www.smashingmagazine.com/2018/04/feature-testing-selenium-webdriver/&quot;,&quot;www.smashingmagazine.com/2022/11/automated-test-results-improve-accessibility/&quot;]\">www.smashingmagazine.com/2018/04/feature-testing-selenium-webdriver/\",\"www.smashingmagazine.com/2022/11/automated-test-results-improve-accessibility/\"]</a>\n</code></pre>\n</div>\n\n<p>XPath functions can be nested just like functions in JavaScript. So, if we know the Smashing Magazine URL structure, we could do the following (using template literals is recommended):</p>\n<pre><code>`translate(\n    substring(\n      substring-after(./@href, ‘www.smashingmagazine.com/')\n    ,9),\n '/','')`\n</code></pre>\n\n<p>This is getting a bit too complex to the extent that it needs comments describing what it does: take all of the URL from the <code>href</code> attribute after <code>www.smashingmagazine.com/</code>, remove the first nine characters, then translate the forward slash (<code>/</code>) character to nothing so as to get rid of the ending forward slash. </p>\n<p>The resulting array:</p>\n<div>\n<pre><code>[\"feature-testing-selenium-webdriver\",\"automated-test-results-improve-accessibility\"]\n</code></pre>\n</div>\n\nMore XPath Use Cases\n<p>XPath can really shine in <strong>testing</strong>. The reason is not difficult to see, as XPath can be used to get every element in the DOM, from any position in the DOM, whereas CSS cannot.</p>\n<p>You cannot count on CSS classes remaining consistent in many modern build systems, but with XPath, we are able to make more robust matches as to what the text content of an element is, regardless of a changing DOM structure.</p>\n<p>There has been <a href=\"https://ieeexplore.ieee.org/document/6983884\">research on techniques</a> that allow you to make resilient XPath tests. Nothing is worse than having tests flake out and fail just because a CSS selector no longer works because something has been renamed or removed.</p>\n<p>XPath is also really great at <strong>multiple locator extraction</strong>. There is more than one way to use XPath queries to match an element. The same is true with CSS. But XPath queries can drill into things in a more targeted way that limits what gets returned, allowing you to find a specific match where there may be several possible matches.</p>\n<p>For example, we can use XPath to return a specific <code>h2</code> element that is contained inside a <code>div</code> that immediately follows a sibling <code>div</code> that, in turn, contains a child image element with a <code>data-testID=\"leader\"</code> attribute on it:</p>\n<pre><code>&lt;div&gt;\n  &lt;div&gt;\n    &lt;h1&gt;don't get this headline&lt;/h1&gt;\n  &lt;/div&gt;\n\n  &lt;div&gt;\n    &lt;h2&gt;Don't get this headline either&lt;/h2&gt;\n  &lt;/div&gt;\n\n  &lt;div&gt;\n    &lt;h2&gt;The header for the leader image&lt;/h2&gt;\n  &lt;/div&gt;\n\n  &lt;div&gt;\n    &lt;img data-testID=\"leader\" src=\"image.jpg\"/&gt;\n  &lt;/div&gt;\n&lt;/div&gt;\n</code></pre>\n\n<p>This is the query:</p>\n<pre><code>document.queryXPaths(`\n  //div[\n    following-sibling::div[1]\n    /img[@data-testID='leader']\n  ]\n  /h2/\n  text()\n`);\n</code></pre>\n\n<p>Let’s drop in a demo to see how that all comes together:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/zxqxNev\">Complex H2 Query [forked]</a> by <a href=\"https://codepen.io/bryanrasmussen\">Bryan Rasmussen</a>.</p>\n<p>So, yes. There are lots of possible paths to any element in a test using XPath. </p>\nXSLT 1.0 Deprecation\n<p>I mentioned early on that <a href=\"https://xslt.rip/\">the Chrome team plans on removing XSLT 1.0 support from the browser</a>. That’s important because XSLT 1.0 uses XML-focused programming for document transformation that, in turn, relies on XPath 1.0, which is what is found in most browsers.</p>\n<p>When that happens, we’ll lose a key component of XPath. But given the fact that XPath is really great for writing tests, I find it unlikely that XPath as a whole will disappear anytime soon. </p>\n<p>That said, I’ve noticed that people get interested in a feature when it’s taken away. And that’s certainly true in the case of XSLT 1.0 being deprecated. <a href=\"https://news.ycombinator.com/item?id=45006098\">There’s an entire discussion happening over at Hacker News</a> filled with arguments against the deprecation. The post itself is a great example of creating a blogging framework with XSLT. You can read the discussion for yourself, but it gets into how JavaScript might be used as a shim for XLST to handle those sorts of cases.</p>\n<p>I have also <a href=\"https://www.saxonica.com/saxonjs/documentation3/index.html#!browser\">seen suggestions</a> that browsers should use SaxonJS, which is a port to JavaScript’s Saxon XSLT, XQUERY, and XPath engines. That’s an interesting idea, especially as Saxon-JS implements the current version of these specifications, whereas there is no browser that implements any version of XPath or XSLT beyond 1.0, and none that implements XQuery. </p>\n<p>I reached out to <a href=\"https://norm.tovey-walsh.com\">Norm Tovey-Walsh</a> at Saxonica, the company behind SaxonJS and other versions of the Saxon engine. He said:</p>\n<blockquote>“If any browser vendor was interested in taking SaxonJS as a starting point for integrating modern XML technologies into the browser, we’d be thrilled to discuss it with them.”<br /><br />— <a href=\"https://norm.tovey-walsh.com\">Norm Tovey-Walsh</a></blockquote>\n\n<p>But also added:</p>\n<blockquote>“I would be very surprised if anyone thought that taking SaxonJS in its current form and dropping it into the browser build unchanged would be the ideal approach. A browser vendor, by nature of the fact that they build the browser, could approach the integration at a much deeper level than we can ‘from the outside’.”<br /><br />— <a href=\"https://norm.tovey-walsh.com\">Norm Tovey-Walsh</a></blockquote>\n\n<p>It’s worth noting that Tovey-Walsh’s comments came about a week before the XSLT deprecation announcement.</p>\nConclusion\n<p>I could go on and on. But I hope this has demonstrated the <strong>power of XPath</strong> and given you plenty of examples demonstrating how to use it for achieving great things. It’s a perfect example of older technology in the browser stack that still has plenty of <strong>utility</strong> today, even if you’ve never known it existed or never considered reaching for it.</p>\n<h3>Further Reading</h3>\n<ul>\n<li>“<a href=\"https://dl.acm.org/doi/full/10.1145/3700523.3700536\">Enhancing the Resiliency of Automated Web Tests with Natural Language</a>” (ACM Digital Library) by Maroun Ayli, Youssef Bakouny, Nader Jalloul, and Rima Kilany<br /><em>This article provides many XPath examples for writing resilient tests.</em></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/XML/XPath\">XPath</a> (MDN)<br /><em>This is an excellent place to start if you want a technical explanation detailing how XPath works.</em></li>\n<li><a href=\"http://www.zvon.org/xxl/XPathTutorial/General/examples.html\">XPath Tutorial</a> (ZVON)<br /><em>I’ve found this tutorial to be the most helpful in my own learning, thanks to a wealth of examples and clear explanations.</em></li>\n<li><a href=\"https://xpather.com\">XPather</a><br /><em>This interactive tool lets you work directly with the code.</em></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"84672de21d73bf3343bdf4f6ddf633ac9908a73d3d9c316f9a91f74a7e5153bf","category":"Tech"}