{"title":"Penpot Is Experimenting With MCP Servers For AI-Powered Design Workflows","link":"https://smashingmagazine.com/2026/01/penpot-experimenting-mcp-servers-ai-powered-design-workflows/","date":1767859200000,"content":"<p>This article is a sponsored by <a href=\"https://penpot.app?utm_source=SmashingMag&amp;utm_medium=Article&amp;utm_campaign=MCPserver\">Penpot</a></p>\n<p>Imagine that your Penpot file contains a full icon set in addition to the design itself, which uses some but not all of those icons. If you were to ask an AI such as Claude or Gemini to export only the icons that are being used, it wouldn’t be able to do that. It’s not able to interact with Penpot files.</p>\n<p>However, a <strong>Penpot MCP server</strong> can. It can perform a handpicked number of operations under set rules and permissions, especially since Penpot has an extensive API and even more so because it’s <strong>open-source</strong>.</p>\n<p>The AI’s job is simply to understand your intent, choose the right operation for the MCP server to perform (an export in this case), and pass along any parameters (i.e., icons that are being used). The MCP server then translates this into a structured API request and executes it.</p>\n<p>It might help to think of AI as a server in a restaurant that takes your order, the MCP server as both the menu and chef, and the API request as (hopefully) a hot pizza pie on a warm plate.</p>\n<p>Why MCP servers, exactly? Well, Penpot isn’t able to understand your intent because it’s not an LLM, nor does it allow third-party LLMs to interact with your Penpot files for the security and privacy of your Penpot data. Although Penpot MCP servers do act as a <strong>secure bridge</strong>, translating AI intent into API requests using your Penpot files and data as context.</p>\n<p>What’s even better is that because Penpot takes a <strong>design-expressed-as-code approach</strong>, designs can be programmatically created, edited, and analyzed on a granular level. It’s more contextual, more particular, and therefore more powerful in comparison to what other MCP servers offer, and <em>far</em> more thoughtful than the subpar ‘Describe → Generate’ AI workflow that I don’t think anybody really wants. <a href=\"https://penpot.app/blog/penpot-ai-whitepaper/\">Penpot’s AI whitepaper</a> describes this as the bad approach and the ‘Convert to Code’ approach as the ugly approach, whereas MCP servers are more refined and adaptable.</p>\nFeatures And Technical Details\n<p>Before we move on to use cases, here are some features and technical details that further explain how Penpot MCP servers work:</p>\n<ul>\n<li>Complies with MCP standards;</li>\n<li>Integrates with the Penpot API for real-time design data;</li>\n<li>Includes a Python SDK, REST API, plugin system, and CLI tools;</li>\n<li>Works with any MCP-enabled AI assistant (Claude in VS Code, Claude in Cursor, Claude Desktop, etc.);</li>\n<li>Supports sharing design context with AI models, and letting them see and understand components;</li>\n<li>Facilitates communication with Penpot using natural language.</li>\n</ul>\n<p>What, then, could MCP servers enable us to do in Penpot, and what have existing experiments already achieved? Let’s take a look.</p>\nPenpot MCP Server Use-Cases\n<p>If you just want to skip to what Penpot MCP servers can do, Penpot have a few <a href=\"https://drive.google.com/drive/u/0/folders/1CCuBqHEevWsp15bYkf3W7CLXLja5R_M_\">MCP demos</a> stashed in a Google Drive that are more than worth watching. Penpot CEO Pablo Ruiz-Múzquiz mentioned that videos 03, 04, 06, 08, and 12 are their favorites.</p>\n<p>An even faster way to summarize MCP servers is to <a href=\"https://www.youtube.com/watch?v=KNsvFc4Elfs&amp;list=PLgcCPfOv5v57Sp_vY4VggqUpAbP5fTIkM\">watch the unveiling from Penpot Fest 2025</a>.</p>\n<p>Otherwise, let’s take a look at some of the more refined examples that Penpot demonstrated in their <a href=\"https://community.penpot.app/t/penpot-mcp-server-showcase-ask-for-help/10040?utm_source=SmashingMagazine&amp;utm_medium=Article&amp;utm_campaign=MCPserver\">public showcase</a>.</p>\n<h3>Design-to-Code and Back Again (and More)</h3>\n<p>Running on from what I was saying earlier about how Penpot designs are expressed as code, this means that MCP servers can be used to convert design to code using AI, but also code to design, design to documentation, documentation to design system elements, design to code again <em>based</em> on said design system, and then completely new components based on said design system.</p>\n<p>It sounds surreal, but the demo below shows off this <strong>transmutability</strong>, and it’s not from vague instruction but rather previous design choices, regardless of how they were expressed (design, code, or documentation). There are no surprises — these are simply the decisions that you would’ve made anyway based on previous decisions, executed swiftly.</p>\n<p>In the demo, Juan de la Cruz García, Designer at Penpot, frictionlessly transmutes some simple components into documentation, design system elements, code, new components, and even a complete Storybook project like a piece of Play-Doh:</p>\n<h3>Design-to-Code, Design/Code Validation, And Simple Operations</h3>\n<p>In a similar demo below, Dominik Jain, Co-Founder at Oraios AI, creates a Node.js web app based on the design before updating the frontend styles, saves names and identifiers to memory to ensure smooth design-to-code translation before checking it for consistency, adds a comment next to the selected shape in Penpot, and then replaces a scribble in Penpot with an adapted component. There’s a lot happening here, but you can see exactly what Dominik is typing into Claude Desktop as well as Claude’s responses, and it’s <em>very</em> robust:</p>\n<p>By the way, the previous demo used Claude in VS Code, so I should note that <strong>Penpot MCP servers are LLM-agnostic</strong>. Your tech stack is totally up to you. IvanTheGeek managed to <a href=\"https://community.penpot.app/t/penpot-mcp-server-showcase-ask-for-help/10040/3?utm_source=SmashingMagazine&amp;utm_medium=Article&amp;utm_campaign=MCPserver\">set up their MCP server with the JetBrains Rider IDE and Junie AI</a>.</p>\n<h3>More Use Cases</h3>\n<p>Translate a Penpot board to production-ready semantic HTML and modular CSS while leveraging any Penpot design tokens (remember that Penpot designs are already expressed as code, so this isn’t a shot in the dark):</p>\n<p>Generate an interactive web prototype without changing the existing HTML:</p>\n<p>As shown earlier, convert a scribble into a component, leveraging existing design and/or design system elements:</p>\n<p>Create design system documentation from a Penpot file:</p>\n<p>And here are some more use-cases from Penpot and the community:</p>\n<ul>\n<li>Advanced exports,</li>\n<li>Search for design elements using natural language,</li>\n<li>Pull data from external APIs using natural language,</li>\n<li>Easily connect Penpot to other external tools,</li>\n<li>Saving repetitive tasks to memory and executing them,</li>\n<li>Visual regression testing,</li>\n<li>Design consistency and redundancy checking,</li>\n<li>Accessibility and usability analysis and feedback,</li>\n<li>Design system compliance checking,</li>\n<li>Guideline compliance checking (brand, content, etc.),</li>\n<li>Monitor adoption and usage with design analytics,</li>\n<li>Automatically keep documentation in sync with design,</li>\n<li>Design file organization (e.g., tagging/categorization).</li>\n</ul>\n<p>Essentially, Penpot MCP servers lead the way to an <strong>infinite number of workflows</strong> thanks to the efficiency and ease of your chosen LLM/LLM client, but without exposing your data to it.</p>\nWhat Would You Use MCP Servers For?\n<p>Penpot MCP servers aren’t even at the beta stage, but it is an <strong>active experiment</strong> that you can be a part of. Penpot users have already begun exploring use cases for MCP servers, but Penpot wants to see more. To ensure that the next generation of design tools meets the needs of designers, developers, and product teams in general, they must be built <strong>collectively</strong> and <strong>collaboratively</strong>, especially where AI is concerned.</p>\n<p><strong>Note</strong>: <em>Penpot is looking for beta testers eager to explore, experiment with, and help refine Penpot’s MCP Server. To join, write to <a href=\"mailto:support@penpot.app\">support@penpot.app</a> with the subject line “MCP beta test volunteer.”</em></p>\n<p>Is there anything that you feel Penpot MCP servers could do that current tools aren’t able to do well enough, fast enough, or aren’t able to do at all?</p>\n<p>You can learn <a href=\"https://github.com/penpot/penpot-mcp\">how to set up a Penpot MCP server right here</a> and start tinkering today, or if your brain’s buzzing with ideas already, Penpot want you to <a href=\"https://community.penpot.app/t/penpot-mcp-server-showcase-ask-for-help/10040?utm_source=SmashingMagazine&amp;utm_medium=Article&amp;utm_campaign=MCPserver\">join the discussion</a>, share your feedback, and talk about your use-cases. Alternatively, the comment section right below isn’t a bad place to start either!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"869ddea807bdcc208c25e231084a629a1dd08b7f1763ed4234f9f3b0bb838e23","category":"Tech"}