{"title":"Travel Light, Ride Hard: My Moots on the Move","link":"https://moots.com/blogs/news/travel-light-ride-hard-my-moots-on-the-move","date":1744766969000,"content":"\n      <figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_5264-768x1024.jpg?v=1762206904\" alt=\"\" /></figure>\n<p>From the moment I picked up my Moots, I knew it was special. The titanium frame is not just beautiful -it’s durable, reliable, and can take a beating from TSA without flinching. Whether I’m packing it into a bike bag for a cross-country flight or tossing it on the bike rack on my truck for a road trip, I never worry about it showing up on the other side worse for wear.</p>\n<p>My go-to bike bag is the <a href=\"https://us.sciconsports.com/collections/bike-travel-bags-and-bike-travel-cases/products/aerocomfort-3-0-road-bike-travel-bag-tp053105013\">Scion Sports Aerocomfort bike bag</a>. When I pack my bike into the bike bag, I remove the pedals, take the rotors off the wheels, and unplug the Shimano Di2 battery before packing everything securely. I stash my helmet (in it’s case) and shoes in the bike bag, slide bottles into the cages, and always drop an Apple AirTag in there-just in case I need to track it along the way.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_5257-225x300.jpg?v=1762206904\" alt=\"\" /></figure>\n<p>The only carbon on the bike is the wheels-everything else is rock solid. That gives me total confidence every time I throw a leg over, knowing it’s all in working order and ready to roll.</p>\n<p>I travel a lot for my work with USA Cycling and for events around the country, and let’s be honest-bike travel can be a pain. But Moots takes a lot of that stress off my shoulders. It’s just one of those brands that makes you feel like you’re part of something solid. No squeaks, creaks, no fuss, just smooth riding and peace of mind.</p>\n<p>Traveling with a Moots means I always have a little piece of home with me-no matter the airport, the hotel, or the back of a rental car. And for someone who’s constantly on the move with her bike, that’s priceless.</p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_5263-768x1024.jpg?v=1762206904\" alt=\"\" /></figure>\n<p>This spring and summer, my Vamoots RCS is hitting the road again. I’ll be taking it to San Francisco in April multiple times, then to the mountains of West Virginia for the <a href=\"https://roadnats.usacycling.org/pro-road\">USA Cycling Road National Championships</a>, where I’ll be commentating the elite races on FloBikes. And later this summer, it’s off to Annecy, France for our USA Cycling Foundation trip to watch the Tour de France Femmes avec Zwift-one of the highlight trips of the summer!</p>\n<p>Wherever the calendar takes me next, I know my Moots is ready. And honestly, that makes the travel easier for me- more peace of mind, and more excitement about the destinations and the chance to ride with my cycling community.</p>\n<p>If you have more questions about traveling wiht your Moots please reachout and we can guide you with recommendations. Stay tuned for the next Lauren Hall blog in May...</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"86dbe10b57575f048b26154d067c1f29f07465da3d96fe338058b9624b769b8c","category":"Cycling"}