{"title":"HCP Packer adds SBOM vulnerability scanning","link":"https://www.hashicorp.com/blog/hcp-packer-adds-sbom-vulnerability-scanning","date":1771353900000,"content":"<p>We are excited to announce the release of <em>SBOM vulnerability scanning</em>, now available in public beta for HCP Packer. HCP Packer is a powerful tool that helps organizations manage the lifecycle of their image artifacts across hybrid-cloud environments. With this release, we aim to provide platform teams with further visibility into their images to help address vulnerabilities earlier in the deployment process and <a href=\"https://www.hashicorp.com/blog/fix-the-developers-vs-security-conflict-by-shifting-further-left\">shift security left</a>.</p>\n\n<h2>Artifact visibility</h2>\n\n<p>In today’s hybrid-cloud world, system images (such as <a href=\"https://en.wikipedia.org/wiki/Amazon_Machine_Image\">AMIs</a> for Amazon EC2, virtual machines, Docker containers, and more) are the foundation of modern computing infrastructure. They also sit at the very start of the software security supply chain. As organizations increasingly depend on a complex software supply chain that includes both third-party and in-house software packages and dependencies, the need for comprehensive visibility into these components has never been more critical.</p>\n\n<p>A popular solution to address artifact visibility is to keep a record of the components with a software bill of materials (SBOM) for each artifact. SBOMs are like an ingredient list on a food item; they list the internal parts that make up the image. </p>\n\n<p><strong><u>Background</u></strong>: Last year, we introduced new capabilities that empower platform teams to <a href=\"https://www.hashicorp.com/en/blog/hcp-packer-provides-further-artifact-visibility-with-sbom-storage\">seamlessly generate and securely store SBOMs</a> and <a href=\"https://developer.hashicorp.com/packer/tutorials/hcp/track-artifact-package-metadata?product_intent=terraform&amp;utm_source=hashicorp&amp;utm_medium=referral&amp;utm_offer=whitepaper&amp;utm_campaign=26Q3_WW_RISK_10-strategies-mitigate-hybrid-cloud-risk&amp;utm_content=related-content-conclusion&amp;utm_channel_bucket=paid\">surface essential package information</a> for their software artifacts directly in HCP Packer (<em>package visibility beta</em>).</p>\n\n<p><strong><u>What’s new</u></strong>: Building on these efforts, we are excited to announce that: </p>\n\n<ul>\n<li><em>Package visibility</em> is now generally available (GA)</li>\n<li><em>SBOM vulnerability scanning</em> is available in public beta</li>\n</ul>\n\n<p>With these new capabilities, organizations can scan SBOMs for common vulnerabilities and exposures to proactively identify and address risks, and surface these insights directly in HCP Packer. Together, these enhancements help organizations improve software supply chain security overall.</p>\n\n<h2>SBOM vulnerability scanning</h2>\n\n<p>CVE (Common Vulnerabilities and Exposures) scanning is a type of vulnerability scanning that focuses on identifying and managing vulnerabilities assigned based on publicly disclosed security vulnerabilities in software and hardware. One of the best-known efforts for this is <a href=\"https://www.cve.org/\">MITRE’s CVE Program</a>, which provides a global system for assigning unique IDs to publicly known security vulnerabilities so organizations can track, share, and manage fixes consistently.</p>\n\n<p>In HCP Packer, you can now see which SBOMs contain known vulnerabilities referenced against MITRE’s CVE database, and classify them based on severity. </p>\n\n<p>By seeing which package versions are affected and when the vulnerabilities were detected, organizations can make informed decisions about remediation priorities and reduce vulnerability risk overall.</p>\n<img src=\"https://www.datocms-assets.com/2885/1771282458-vulns-list-packer.png\" alt=\"Vulnerabilities\" /><p>This new capability aims to help organizations identify vulnerabilities faster, streamline compliance efforts, and respond to security incidents with confidence. </p>\n\n<h2>Next steps</h2>\n\n<p>With SBOM vulnerability scanning now available for HCP Packer artifacts, customers gain further visibility into software dependencies, helping them proactively secure their software supply chain, and mitigate risk overall.</p>\n\n<p>To get started with this new feature, please refer to our <a href=\"https://developer.hashicorp.com/hcp/docs/packer/store/sbom\">SBOM documentation</a> and our <a href=\"https://developer.hashicorp.com/packer/tutorials/hcp/track-artifact-package-metadata\">Track artifact package metadata tutorial</a> to learn how to create and download SBOMs. <a href=\"https://www.hashicorp.com/en/products/packer?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_PRAC_RISK_sbom-scanning-beta-blog_PRODUCT-PAGE&amp;utm_content=end-blog-cta&amp;utm_offer=product-page\">Get started with HCP Packer for free</a> and see the benefits of a centralized artifact registry in action. </p>\n","author":"Mitchell Ross","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"896c8cb2766113b9d3524fe8af56c57d060584149af135568cf4a65294750017","category":"Tech"}