{"title":"‘I keep myself tough through the winter’ — Why Seth Dunwoody chose Armagh over Girona as he steps into professional cycling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-keep-myself-tough-through-the-winter-why-seth-dunwoody-chose-armagh-over-girona-as-he-steps-into-professional-cycling","date":1769618037000,"content":"\n      <p><span>Seth Dunwoody has a buzz about him — he is open, chatty and clearly excited about the opportunity to ride for the Bahrain Victorious senior team. The 19-year-old from Armagh is part of the outfit’s development team, where he has built up a steady stream of consistent results.</span></p>\n<p><span>“So you’re also getting to avoid the crappy weather,” Dunwoody quips and rightly so, as we dodge Europe's January rain, sitting in the Saudi sun on the eve of his season debut, the AlUla Tour. </span></p>\n<p><span>Adapting to different climates and conditions is commonplace for cyclists, something Dunwoody has a unique experience of despite his relatively brief time in the sport.</span></p>\n<p><span>“I based myself out of Girona at the start of last year, but as of this year I'm basing myself out of home, which is kind of what I'm most comfortable with. But I had to go away to experience that to know what I want or what I'm looking for.</span></p>\n<p><span>“I think at home is the ideal setup. Okay, the weather is not great in Ireland, but I have everything I need. It's probably my favourite place to ride a bike — I wouldn't say there are ideal 20-30 minute climbs, but in terms of just hard roads for training there are lots of options. It’s character building as well,” Dunwoody says. </span></p>\n<p><span>Cycling is a family affair for Dunwoody, who first got into the sport when he followed his dad around the amateur Irish racing scene and now the roles have reversed with Dunwoody junior on a WorldTour team's development squad. Dunwoody senior recently bought a motorbike so he can do some motor pacing sessions with his son on the roads of County Armagh.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-2220062977_1024x1024.jpg?v=1769502755\" alt=\"\" /></div>\n<p><em>Dunwoody winning the fourth stage of Giro Next Gen 2025 (Image: Tommaso Berardi/NurPhoto via Getty Images)</em></p>\n<p><span>Finding out what works best for yourself is an important, yet individual, learning process in professional cycling. If Dunwoody’s decision to live in Northern Ireland is an unconventional choice, so far his career trajectory is more of the traditional pathway — working through the junior ranks and being gradually exposed to bigger races.</span></p>\n<p><span>“I did one race last year with the (Bahrain Victorious) WorldTour team in April and that was a pretty good eye-opener. But this is going to be a proper experience with the WorldTour squad,” Dunwoody says of the AlUla Tour, which has a startlist including the likes of green jersey winner from last year’s </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\"><span>Tour de France</span></a><span>, Jonathan Milan.</span></p>\n<p><span>At six foot three, Dunwoody is a powerful all-round rider, with a strong TT and a handy sprint which he has “without really trying over the past few years”. This versatility is best suited to one-day races and stage hunting. </span></p>\n<p><span>“I love the Classics and the Belgian classics. I’ve done most of the junior Classics, like E3 (which he won in 2024) Kerne-Brussels-Kerne (where he was second in 2024) and Paris-Roubaix juniors (where he was 12th in 2024) and I just fell in love with them. They’re my kind of races with the cold starts in Belgium,” says Dunwoody.</span></p>\n<p><span>He is one to watch in the future on the cobbles and bergs of northern France and Belgium. And his aims for 2026? </span></p>\n<p><span>“Just win races,” Dunwoody says enthusiastically.</span></p>\n<p><span>“It was the same as last year. Last year was my first year under 23 and the team wanted me to gain experience, but in the back of my head, I wanted to win races, and I got three really nice wins last year (the Giro d'Italia Next Gen stage and a stage at the Tour of Romania and Circuit des Ardennes). One was from a break, where one was from a bunch sprint. One was a kind of solo/sprint, yeah, you know, so I'm kind of just winning in any way I can.</span></p>\n<p><span>“I don't really like to target races because you're generating a bit of pressure for yourself, which can be good at times, but I just like putting my arms up in the air as much as possible, whenever that can be. I'll target races in season with my coach to make sure I'm in peak shape for certain times a year, but if I can win races along the way, that's what I find fun.”</span></p>\n<p><span>Fun. Knowing what he enjoys most in the sport is what gets Dunwoody performing at his best. It’s what gets him out in the cold and rain in County Armagh, it compels him to make the races hard and it’s why he is a rider to watch.</span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8a00ea7ad646a72886f62cef2635c9b7fdaeb6a53e2bc9d7d7b83affa1c67939","category":"Cycling"}