{"title":"How resilient is HCP Vault during real AWS regional outages?","link":"https://www.hashicorp.com/blog/how-resilient-is-hcp-vault-during-real-aws-regional-outages","date":1769446800000,"content":"<p>On October 20, 2025, <a href=\"https://aws.amazon.com/message/101925/\">a significant service disruption</a> affected AWS us-east-1, impacting numerous services across the cloud ecosystem. This event provided a <strong>real-world validation of HashiCorp Cloud Platform (HCP) Vault Dedicated's architectural design principles.</strong> </p>\n\n<p>At approximately 7:00 AM UTC, the HCP Vault control plane (hosted in us-east-1 and serving both AWS and Azure data planes) experienced elevated HTTP 500 error rates and intermittent panics. Even in the midst of this AWS us-east1 disruption, HCP Vault Dedicated customer clusters <strong>maintained 100% uptime throughout the event</strong>, continuing to serve workloads without interruption. Affected workflows were swiftly rectified with minimal impact, underscoring our robust operational procedures and the resilience provided by building on foundational AWS compute and networking services.</p>\n\n<p>This post shares our experience during this event, the architectural decisions that contributed to our data plane resilience, and the lessons we're applying to further strengthen our platform. Our goal is to provide transparency into how cloud-native services can be designed for resilience and to share practical insights with the broader community.</p>\n\n<h2>Understanding HCP Vault Dedicated architecture</h2>\n\n<p><a href=\"https://developer.hashicorp.com/hcp/docs/vault/what-is-hcp-vault?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_hcp-vault-resilience-aws-outage-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">HCP Vault Dedicated</a> is a a SaaS version of <a href=\"https://developer.hashicorp.com/vault/docs/enterprise?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_hcp-vault-resilience-aws-outage-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">Vault Enterprise</a> that consists of two primary components:</p>\n\n<h3>Control plane</h3>\n\n<p>This is a centralized management layer where customers perform operations such as: </p>\n\n<ul>\n<li>Creating Vault clusters</li>\n<li>Adjusting cluster configurations</li>\n<li>Managing cluster tiers</li>\n<li>Retrieving audit logs</li>\n<li>Configuring backups or secondary regions</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1769444478-01-vault-overview.png\" alt=\"Vault\" /><h3>Data plane</h3>\n\n<p>This consists of dedicated Vault clusters that handle all secrets management operations, including the CRUD-L (Create, Read, Update, Delete, List) API calls that applications depend on for accessing secrets, encryption keys, and other sensitive data.</p>\n<img src=\"https://www.datocms-assets.com/2885/1769444468-02-secrets-engines.png\" alt=\"Secrets\" /><p>This separation of concerns is fundamental to our architecture: </p>\n\n<ul>\n<li>Administrative functions are centralized in the control plane for operational efficiency</li>\n<li>Production workloads interact with Vault in the data plane and run independently in dedicated, customer-specific infrastructure</li>\n</ul>\n\n<h2>Impact summary</h2>\n\n<p>The impact reporting is broken down by the effects on the control plane and the data plane.</p>\n\n<h3>Control plane impact</h3>\n\n<p>During the AWS service disruption, the HCP Vault control plane experienced partial impact to specific administrative workflows like creating new snapshots, fetching audit logs, updating tiers, adding new backup regions, or adding new secondary regions. During the outage, two primary workflows experienced transient issues:</p>\n\n<ul>\n<li><strong>Create snapshot workflow</strong>: This periodic backup process, which runs every 24 hours, failed due to errors when the control plane attempted to create a snapshot blob on S3.</li>\n<li><strong>Forward update workflow</strong>: This routine workflow for base image and certificate refresh operations experienced transient failures because it requires bringing up new EC2 instances for Vault clusters.</li>\n</ul>\n\n<p>However, during the incident, no customers reported issues accessing control plane functionality for their day-to-day administrative needs. After AWS services stabilized, these workflows resumed automatically, and no customer clusters were degraded. The HCP Vault team retriggered the create snapshot workflow manually to ensure a backup of the customer cluster is taken every 24 hours to be SOC2 compliant.</p>\n\n<h3>Data plane impact</h3>\n\n<p>Zero customer impact. All HCP Vault Dedicated clusters across all regions and cloud providers (including those running in us-east-1) remained fully operational throughout the event. </p>\n\n<h2>Key successes</h2>\n\n<p>We observed the following success indicators during the outage:</p>\n\n<ul>\n<li><strong>Zero downtime for the data plane despite regional cloud failure</strong>: Even with the AWS us-east-1 region-wide incident, HCP Vault clusters across various regions (including us-east-1) and cloud providers remained operational, meeting our 99.99% SLA across tiers. This confirms that our reliance on core AWS services like EC2 and VPC, and our minimal dependency on auxiliary services, provides stability benefits.</li>\n<li><strong>Multi-cloud fault tolerance</strong>: Azure Data Planes, despite their dependency on the control plane hosted in AWS us-east-1, continued functioning without interruption, validating our cross-cloud resiliency. This demonstrates that even when our control plane faces issues, individual customer Vault clusters remain online and fully functional.</li>\n</ul>\n\n<h2>Lessons learned and improvements</h2>\n\n<p>While the outage reinforced confidence in HVD's architecture, it also brought to light opportunities for long-term enhancements in resilience, particularly for the control plane:</p>\n\n<h3>Automated workflow recovery</h3>\n\n<p><strong>Current state</strong>: Some workflows required manual intervention to restart after the event.</p>\n\n<p><strong>Improvement</strong>: We're implementing intelligent retry mechanisms that will automatically resume failed workflows once dependencies are healthy, eliminating the need for manual intervention and ensuring continuous compliance with our backup schedules.</p>\n\n<h3>Fleet-wide workflow management</h3>\n\n<p><strong>Current state</strong>: Workflow management during service disruptions required individual cluster attention.</p>\n\n<p><strong>Improvement</strong>: We're developing fleet-wide automation for snapshot creation and cluster update workflows, enabling faster, more comprehensive recovery from future regional events and reducing operational overhead.</p>\n\n<h2>Looking forward</h2>\n\n<p>Cloud service disruptions are an industry reality, and no cloud provider is immune to complex system failures. What matters is how services are architected to handle these scenarios and what we learn from them.</p>\n\n<p>This event demonstrated that HCP Vault Dedicated's architecture successfully protected customer workloads during a regional disruption. It also showed us where we can improve our administrative operations to provide an even more seamless experience during future events.</p>\n\n<p>We're committed to continuous improvement and transparency. As we implement the enhancements described above, we'll continue sharing our learnings with the community.</p>\n\n<h2>More information and references around the outage</h2>\n\n<p>For those interested in the technical details of the AWS event, Amazon has published a comprehensive post-event analysis: <a href=\"https://aws.amazon.com/message/101925/\">Summary of the Amazon DynamoDB Service Disruption in the Northern Virginia (US-EAST-1) Region</a></p>\n\n<p>The report details the cascading impacts across DynamoDB, EC2, NLB, and other services, providing valuable insights into the complexity of operating large-scale distributed systems. Some key points:</p>\n\n<ol>\n<li>Amazon DynamoDB experienced increased API error rates in the N. Virginia (us-east-1) region.</li>\n<li>Network Load Balancer (NLB) experienced increased connection errors for some newly launched instances. This was caused by health check failures in the NLB fleet, which resulted in increased connection errors on some NLBs</li>\n<li>New EC2 instance launches failed and, while instance launches began to succeed from 10:37 AM, some newly launched instances experienced connectivity issues</li>\n</ol>\n\n<p>If you’re interested in testing HCP Vault Dedicated yourself, visit our <a href=\"https://portal.cloud.hashicorp.com/sign-up?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_hcp-vault-resilience-aws-outage-blog&amp;utm_content=end-blog-cta&amp;utm_offer=signup\">HCP portal</a> and sign up for the service, which can take advantage of the $500 HCP <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/admin/billing#trial\">trial</a> credit.</p>\n","author":"Glenn Chia Jin Wee","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"8a8f74701c5416b4f3e9029c89bb3569907c413494a021b827111724e13dbf2f","category":"Tech"}