{"title":"iPhone Fold: Launch, Pricing, and What to Expect From Apple's Foldable","link":"https://www.macrumors.com/2026/02/20/iphone-fold-launch-pricing-what-to-expect/","date":1771586469000,"content":"Apple is expected to launch a new foldable iPhone this year, based on multiple rumors and credible sources. The long-awaited device has been rumored for years now, but signs increasingly suggest that Apple will release its first foldable device in 2026.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nBelow, we've collated an updated set of key details that have been leaked about Apple's foldable iPhone so far. Apple will allegedly call the device the \"‌iPhone‌ Fold,\" which is the name the media has already adopted when sharing rumors about the product.\r<br />\n\r<br />\n<span>Overall Design</span><br />\r<br />\n<span>Book-Style</span><br />\r<br />\nAccording to <a href=\"https://www.bloomberg.com/news/newsletters/2025-03-23/apple-aapl-explores-turning-watches-into-wearable-ai-devices-with-cameras-m8ll6mvy\"><em>Bloomberg</em>'s Mark Gurman</a>, Apple's foldable iPhone is similar in style to Samsung's Galaxy Z Fold, which uses a book-style folding mechanism, rather than the clamshell design of the Samsung Galaxy Z Flip. <a href=\"https://mingchikuo.craft.me/84AOn3Ll8Zah6f\">Industry analyst Ming-Chi Kuo</a> expects the foldable ‌iPhone‌ to measure between 9 and 9.5 mm when folded, and around 4.5 to 4.8 mm when unfolded. More recently, Weibo-based leaker Instant Digital has said that the foldable iPhone will have a thickness of <a href=\"https://www.macrumors.com/2025/07/16/foldable-iphone-thickness-and-price-rumors/\">at least 4.8mm</a>. The leaker has also <a href=\"https://www.macrumors.com/2026/02/02/first-foldable-iphone-design-details-revealed/\">claimed</a> that the volume buttons will be located on the top edge of the device, aligned to the right, similar to the iPad mini, while the power button and Camera Control continue to be located on the right edge of the device, just like other recent iPhones. The back left of the device is also said to feature an ‌iPhone‌ Air-style camera plateau.\r<br />\n\r<br />\n<span>Display</span><br />\r<br />\n<span>Dual Screens</span><br />\r<br />\nWhen folded, users will interact with a 5.5-inch outer display that is similar to a typical iPhone screen, while unfolding it will reveal a larger 7.8-inch iPad-style screen. These dimensions have been corroborated by <a href=\"https://www.macrumors.com/2025/02/21/alleged-display-sizes-apple-foldable-iphone/\">two</a> reputable <a href=\"https://www.macrumors.com/2025/03/06/kuo-apple-foldable-iphone-book-style-2000/\">sources</a>. However, a more <a href=\"https://www.macrumors.com/2025/12/16/foldable-iphone-screen-sizes-leaked/\">recent report</a> by <em>The Information</em> claims that the device will have a 5.3-inch front screen and a 7.7-inch inner display. According to one rumor, the inner folding display will be approximately the size of a piece of A6 paper and will use a 2,713 x 1,920 resolution, while the outer display will use a 2,088 x 1,422 resolution. Apple is <a href=\"https://www.macrumors.com/2026/02/05/tougher-display-for-foldable-iphone/\">reportedly</a> evaluating a tougher display film technology for its foldable, with the use of a transparent polyimide film as a protective layer that would sit on top of the ultra-thin glass.\r<br />\n\r<br />\n<span>Crease Visibility</span><br />\r<br />\n<span>'Crease-Free'</span><br />\r<br />\nThe inner display is said to be <a href=\"https://www.macrumors.com/2025/02/25/apple-2026-foldable-phone-has-no-crease/\">virtually crease-free</a>, thanks to Apple's use of a <a href=\"https://www.macrumors.com/2025/07/15/foldable-iphone-crease-free-samsung-display/\">metal plate</a> that can disperse and control the stress generated by bending the display, according to analyst Ming-Chi Kuo. Apple is said to be using liquid metal in the hinges to improve durability and help eliminate screen creasing. Liquid metal, manufactured using a die-casting process, has been chosen by Apple to address this common issue with foldable devices, <a href=\"https://www.macrumors.com/2025/03/21/apple-liquid-metal-foldable-iphone-hinges/\">according to the analyst</a>. Citing supply chain sources, Chinese site <em>UDN</em> says that Apple has <a href=\"https://www.macrumors.com/2025/11/24/iphone-fold-2026-engineering-validation/\">solved \"the crease problem\"</a> that has plagued most foldable smartphones, and the foldable ‌iPhone‌ will be the first crease-free foldable smartphone on the market.\r<br />\n\r<br />\n<span>Chassis and Hinge</span><br />\r<br />\n<span>Durable Materials</span><br />\r<br />\nThe foldable iPhone reportedly has a titanium chassis, with the hinge constructed from a combination of titanium and stainless steel, <a href=\"https://mingchikuo.craft.me/84AOn3Ll8Zah6f\">according to analyst Ming-Chi Kuo</a>. The frame itself will use a titanium alloy to prevent bending issues – a solution that has worked well for Apple's new ultra-thin iPhone Air. However, analyst Jeff Pu <a href=\"https://www.macrumors.com/2025/10/08/foldable-iphone-titanium-aluminum-frame/\">believes</a> that Apple is using aluminum and titanium, whereas Kuo believes a mix of stainless steel and titanium has been chosen. \r<br />\n\r<br />\n<span>Cameras</span><br />\r<br />\n<span>Front and Rear</span><br />\r<br />\nThe foldable iPhone is expected to include a dual-lens rear camera, with a front-facing camera for both folded and unfolded states, <a href=\"https://mingchikuo.craft.me/84AOn3Ll8Zah6f\">according to Kuo</a>. <em>Bloomberg</em>'s Mark Gurman recently <a href=\"https://www.macrumors.com/2025/08/24/foldable-iphone-rumored-features/\">corroborated</a> reports that the device will have four cameras consisting of one front camera, one inner camera, and two rear cameras. Prolific Weibo-based leaker Digital Chat Station claims that the rear dual lenses will be <a href=\"https://www.macrumors.com/2025/06/26/foldable-iphone-dual-rear-camera-rumor/\">48 megapixels each</a>. Other sources have claimed that the inner display features an <a href=\"https://www.macrumors.com/2025/04/14/iphone-fold-display-resolutions-cameras/\">under-screen camera (USC)</a>, while the outer display – in the device's folded state – will have a <a href=\"https://www.macrumors.com/2025/04/16/iphone-fold-camera-setup-outer-display/\">punch-hole camera</a>. A more recent report by <em>The Information</em> claims that the outer display's camera will be located in the <a href=\"https://www.macrumors.com/2025/12/16/foldable-iphone-screen-sizes-leaked/\">top-left corner of the screen</a>.\r<br />\n\r<br />\n<span>Authentication</span><br />\r<br />\n<span>Touch ID</span><br />\r<br />\nKuo believes the phone will <a href=\"https://mingchikuo.craft.me/84AOn3Ll8Zah6f\">forgo Face ID authentication</a>, and instead use a Touch ID side button as a means to save precious internal space, and Bloomberg's Mark Gurman recently <a href=\"https://www.bloomberg.com/news/newsletters/2025-08-24/apple-to-launch-iphone-17-pro-iphone-17-air-in-september-iphone-fold-next-year-mepmzpcj\">corroborated</a> the rumor. Apple has previously integrated Touch ID into the side button of the iPad, iPad Air, and iPad mini.\r<br />\n\r<br />\n<span>Cellular Connectivity</span><br />\r<br />\n<span>C2 Modem</span><br />\r<br />\nThe foldable iPhone will use Apple's second-generation C2 modem for cellular connectivity, according to <a href=\"https://www.macrumors.com/2025/08/24/foldable-iphone-rumored-features/\"><em>Bloomberg</em>'s Mark Gurman</a>. Apple debuted its custom-designed C1 modem in the iPhone 16e last year, followed by the C1X featured in the iPhone Air, as part of a multi-year plan to transition away from Qualcomm modems. Gurman says the foldable device will not have a physical SIM slot.\r<br />\n\r<br />\n<span>Battery Life</span><br />\r<br />\n<span>High-Density Cells</span><br />\r<br />\nThe device is allegedly features the <a href=\"https://www.macrumors.com/2026/02/02/first-foldable-iphone-design-details-revealed/\">biggest battery ever used in an ‌iPhone‌</a>. Apple is also putting a heavy focus on improving power efficiency by slimming down key components like the display driver to make room for more battery cells, according to a <a href=\"https://www.macrumors.com/2025/03/21/foldable-iphone-impressive-battery-life-thinness/\">Korean blog</a> that has leaked accurate details about unreleased products before. The phone will reportedly use <a href=\"https://mingchikuo.craft.me/84AOn3Ll8Zah6f\">high-density battery cells</a>. Expect the C2 modem to be faster overall, and for it to gain mmWave support in the United States. Further power efficiency improvements are likely too.\r<br />\n\r<br />\n<span>Color Options</span><br />\r<br />\n<span>Black and White</span><br />\r<br />\nApple is currently only testing variations of black and white for the folding phone with suppliers, according to <a href=\"https://www.bloomberg.com/news/newsletters/2025-08-24/apple-to-launch-iphone-17-pro-iphone-17-air-in-september-iphone-fold-next-year-mepmzpcj\"><em>Bloomberg</em>'s Mark Gurman</a>, although he says that Apple's plans could evolve before the device launches.\r<br />\n\r<br />\n<span>Pricing</span><br />\r<br />\n<span>Premium Segment</span><br />\r<br />\n<a href=\"https://www.macrumors.com/2025/03/17/foldable-iphone-price-estimate/\">Multiple</a> <a href=\"https://www.macrumors.com/2025/03/24/foldable-iphone-to-launch-next-year/\">reports</a> have suggested the foldable iPhone will be priced between $2,000 and $2,500 in the United States, which could make it the most expensive iPhone ever. Meanwhile, analysts at investment banking firm UBS and Fubon Research believe the phone will be either between <a href=\"https://www.macrumors.com/2025/07/16/foldable-iphone-thickness-and-price-rumors/\">$1,800 and $2,000</a> or around <a href=\"https://www.macrumors.com/2025/11/24/foldable-iphone-could-cost-2400/\">$2,399</a>, respectively. However, Kuo recently <a href=\"https://www.macrumors.com/2025/10/13/foldable-iphone-could-be-cheaper-than-expected/\">claimed</a> that the hinge is expected to carry an average selling price (ASP) of approximately $70 to $80 when mass production begins – well below the market expectation of $100 to $120 or higher. Kuo attributed the cost decline to \"assembly design optimization\" and Foxconn's influence in production scaling. Whether the reduction in hinge price will reduce retail price or simply bolster Apple's margins is an open question. Regardless of the price, the foldable is expected to tap into Apple's loyal fanbase, some of whom will view it as a \"must-have device\" if its quality meets expectations.\r<br />\n\r<br />\n<span>Launch Date</span><br />\r<br />\n<span>Late 2026</span><br />\r<br />\nAccording to industry analyst Jeff Pu, the device entered the <a href=\"https://www.macrumors.com/2025/03/16/apple-foldables-mass-production-2026/\">New Product Introduction (NPI) phase</a> at Foxconn in March 2025, while a November report from Chinese site <em>UDN</em> reported that the device had <a href=\"https://www.macrumors.com/2025/11/24/iphone-fold-2026-engineering-validation/\">entered the engineering validation stage</a>, and Apple is gearing up for mass production. Foxconn is <a href=\"https://www.macrumors.com/2025/06/18/foldable-iphone-manufacturing-2025-start/\">expected</a> to officially start producing Apple's foldable iPhone early in the fourth quarter (October), and a recent report has suggested Apple is already <a href=\"https://www.macrumors.com/2025/10/31/apple-stockpiling-parts-foldable-iphone/\">stockpiling components</a> for pre-production. An exact launch date is currently unknown, but both Kuo and Pu say mass production is planned for the second half of 2026. <em>Bloomberg</em> reporter Mark Gurman has said he expects the device to be <a href=\"https://www.macrumors.com/2025/03/24/foldable-iphone-to-launch-next-year/\">launched this year</a> in the <a href=\"https://www.bloomberg.com/news/newsletters/2025-08-24/apple-to-launch-iphone-17-pro-iphone-17-air-in-september-iphone-fold-next-year-mepmzpcj\">fall season</a>. However, Japan's Mizuho Securities banking firm has suggested a <a href=\"https://www.macrumors.com/2025/10/17/foldable-iphone-could-be-delayed/\">postponement to 2027</a> could still happen because of Apple taking longer to decide on key design elements such as the hinge.<br />This article, \"<a href=\"https://www.macrumors.com/2026/02/20/iphone-fold-launch-pricing-what-to-expect/\">iPhone Fold: Launch, Pricing, and What to Expect From Apple's Foldable</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-fold-launch-pricing-and-what-to-expect-from-apples-foldable.2477977/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8c24cde76a4fd09f9e67eb4fb96cd7e752e80bd22af23fa69b1bdf684c325c5b","category":"Apple"}