{"title":"เรื่องเงิน","link":"https://lewcpe.com/blog/archives/2353/money/","date":1767280184000,"content":"<p>คิดไว้นานแล้วว่าจดแนวทางการจัดการเงินของตัวเองเอาไว้ ก่อนจบปีเลยต้องจัดให้จบเสียที</p>\n\n\n\n<h2>ให้ยืม</h2>\n\n\n\n<p>เรื่องแรกคือการยืมเงิน แนวคิดคือต้องแยกการลงทุนด้วยการให้ยืม/ปล่อยกู้ ออกจากการให้ยืมด้วยความสัมพันธ์ ไม่ว่าจะเป็นเพื่อน ญาติ หรือคนรู้จักอื่นๆ</p>\n\n\n\n<blockquote>\n<p>หากให้ยืมด้วยความสัมพันธ์ต้องถือว่าเงินก้อนนั้นหายไปแล้วทั้งก้อน</p>\n</blockquote>\n\n\n\n<p>เป็นแนวทางแรก คือเราไม่ควรให้ยืมจากความสัมพันธ์ใดๆ โดยที่เราไม่พร้อมจะเสียเงินก้อนนั้นไปทั้งก้อน ดังนั้นเราอาจจะต้องวัดความสัมพันธ์ของคนที่มาขอยืมเรานั้น หากเงินก้อนนั้นหายไปแล้วเราจะเสียใจไหม หรือเราพร้อมจะเสียเงินก้อนนั้นอยู่แล้ว อีกเรื่องที่ตามมาคือเงินจะมากจะน้อยขึ้นกับสุขภาพทางการเงินของเราเอง แม้เราจะพร้อมให้เงินคนสักคนมากๆ แต่สุขภาพทางการเงินของเราไม่ดีพอ หากเสียเงินก้อนนั้นไปทั้งก้อนแล้วเราจะทำให้ตัวเองหรือคนในครอบครัวลำบากก็ต้องลดวงเงินที่ให้ได้ลง</p>\n\n\n\n<p>การที่พร้อมเราจะเสียทั้งก้อนไม่ได้แปลว่าเราต้องให้ไปเปล่าๆ เสมอไป การให้โดยบอกว่าเป็นการให้ยืม การให้โดยมีสัญญากู้ยืม หรือแม้แต่การให้โดยมีหลักทรัพย์ค้ำประกัน แต่ต้นทางของการให้คือความสัมพันธ์ เราสามารถเลือกรูปแบบที่ให้ที่เหมาะสมได้ เป็นคนละเรื่องกัน</p>\n\n\n\n<p>การค้ำประกันเท่ากับการให้ยืม คิดเหมือนกัน วงเงินค้ำประกันเท่าไหร่ก็เท่ากับเตรียมให้ไปเลยเท่าวงเงิน ถ้าไม่พร้อมให้ก็ไม่ควรค้ำ</p>\n\n\n\n<h2>ใช้เงิน</h2>\n\n\n\n<p>แยกระหว่างการจ่ายเพื่อความหรูหราฟุ่มเฟือย และการปรับปรุงคุณภาพชีวิตออกจากกัน และพยายามจ่ายเพื่อปรับปรุงคุณภาพชีวิตก่อนเสมอ การปรับปรุงคุณภาพชีวิต มี 3 อย่างหลักๆ ความปลอดภัย, สุขอนามัย, และเวลา</p>\n\n\n\n<p>ความปลอดภัย แปลว่าหากเรายังต้องเสี่ยงกว่าปกติ เรายังต้องอยู่ในซอยเปลี่ยว ก็อาจจะควรย้ายที่  เราอาจจะยอมจ่ายค่าแท็กซี่เพื่อลดความเสี่ยงจากมอเตอร์ไซต์ ฯลฯ สุขอนามัยเป็นปัจจัยสำคัญในการเลือกอาหาร เลือกร้านที่ครัวสะอาด กินอาหารที่มาตรฐานการผลิตดี ไปพบเภสัชหรือแพทย์เมื่อป่วย เวลา เป็นสิ่งที่เรายอมจ่ายได้หากลดเวลาลง ยอมเช่าที่อยู่แพงขึ้นอีกหน่อยเพื่อให้ใกล้ที่ทำงานขึ้น หรือเข้าใกล้สถานีรถไฟฟ้าให้เดินทางสะดวก</p>\n\n\n\n<p>การจ่ายเพื่อความฟุ่มเฟือยไม่ใช่เรื่องผิด แต่ต้องอยู่หลังคุณภาพชีวิต และต้องเลี่ยง ลด งด หากสุขภาพทางการเงินยังไม่ดี</p>\n\n\n\n<h2>ค่าใช้จ่าย</h2>\n\n\n\n<p>เราควรคิดค่าใช้จ่ายของเราเป็น 2 ระดับ ระดับไม่อนาถ และระดับสบาย</p>\n\n\n\n<p>ระดับไม่อนาถเป็นระดับต่ำสุดที่เราคิดว่าพออยู่ไหว อาจจะเป็นช่วงเวลาหนึ่งๆ ที่เราเคยใช้ชีวิตแบบนั้น หรืออาจจะจินตนาการเอา ระดับสบายน่าจะเป็นระดับที่เราคิดถึงกันเวลาเราวางแผนเกษียญกันก่อนหน้านี้ เราน่าจะคิดถึงชีวิตแบบหนึ่งที่น่าจะสบายๆ และคิดว่าถ้าเรามีชีวิตแบบนั้นได้ตลอดชีวิตก็คงดี</p>\n\n\n\n<p>เหตุผลที่เราควรคิดค่าใช้จ่ายเป็นสองระดับเพื่อให้เรามองระยะเวลาที่เราทนได้ เรามักจะคิดถึงระดับสบายๆ ไว้สูงกว่าที่เราทนได้มาก และเมื่อเราเก็บเงินไปเรื่อยๆ เราก็มักจะพบว่าเราช่างห่างไกลจากความมั่นคงทางการเงิน เงินที่เรามีอยู่ได้ไม่กี่เดือน หรือห่างไกลจากการเกษียญมาก การที่เรามีระดับที่ยอมรับได้ไปพร้อมกัน ทำให้เรามองระยะเวลาได้ไกลขึ้น เมื่อเราเห็นระยะเวลาที่ไกลขึ้นเราจะมีกำลังใจในการเก็บเงิน และมีความกล้าในการตัดสินใจต่างๆ ไม่ว่าจะเป็นการเปลี่ยนงาน การลงทุน ฯลฯ</p>\n\n\n\n<h2>สินทรัพย์</h2>\n\n\n\n<p>หลายคนมักพยายามแยกกระเป๋า เงินลงทุน เงินฉุกเฉิน เงินออม ฯลฯ ออกจากกันแล้วพยายามใช้สิ่งต่างๆ แยกกัน ส่วนตัวแล้วไม่ชอบการแบ่งเงินแบบนั้นนัก สินทรัพย์ก็คือสินทรัพย์ เราสามารถมองเป็นผืนเดียวกันได้ทั้งหมด ว่าเรามีความมั่งคั่งรวมเท่าใด</p>\n\n\n\n<p>แต่สิ่งที่เราควรตระหนัก คือสินทรัพย์แต่ละตัวมีความยืดหยุ่นในการแปลงเป็นเงินสดไม่เท่ากัน เงินฝากในธนาคารสามารถแปลงเป็นเงินสดได้ทันทีจากโทรศัพท์ ทองอาจจะเสียเวลาต่อคิวหรือหากไปขายจริงก็อาจจะถูกกดราคาบางส่วน สินทรัพย์บางอย่างแปลงเป็นเงินยากมากเช่นที่ดิน เราอาจจะต้องคิดมูลค่าว่าหากจะขายได้ทันทีต้องขายลดถึงครึ่งหนึ่ง และถึงอย่างนั้นก็อาจจะใช้เวลานับเดือน สินทรัพย์บางประเภทอาจจะแปลงง่ายกว่าที่ดินแต่มีส่วนลดเหมือนกัน เช่น หุ้นกู้ หรือประกันสะสมทรัพย์ที่อาจจะเวณคืนได้ ก็ควรบันทึกเป็นมูลค่าที่เวณคืนได้</p>\n\n\n\n<p>แม้จะมองสินทรัพย์เป็นความมั่งคั่งรวมผืนเดียวกันไปหมด แต่เราควรมีสินทรัพย์ใกล้เงินสดที่แปลงเป็นเงินได้ภายใน  24 ชั่วโมง เอาไว้เพียงพอสำหรับการใช้จ่ายขั้นต่ำสัก 6 เดือนเผื่อฉุกเฉินหรือมากกว่านั้น</p>\n\n\n\n<p>สินทรัพย์หนึ่งที่เป็นประเด็นกับหลายคนคือเรื่องที่ดิน โดยส่วนตัวไม่เชื่อเรื่องการสะสมที่ดินนัก เพราะค่าใช้จ่ายเยอะ และหากไม่ได้มีความเชี่ยวชาญมองทะลุว่าทำเลใดจะราคาขึ้น ราคาที่ปรับขึ้นช้าๆ หลายครั้งก็ไม่ได้คุ้มเมื่อคิดว่าต้องลงเงินที่อาจจะได้ดอกเบี้ย ความยุ่งยากเสียเวลาดูแล และภาษี แต่หากมีข้อมูลความสามรถมองทะลุว่าทำเลใดกำลังได้รับความนิยม มีความสามารถปรับปรุงทำราคาขายต่อบ้าน ฯลฯ ก็เป็นความเชี่ยวชาญเฉพาะตัวของแต่ละคนไม่ใช่เครื่องมือการลงทุนโดยทั่วไป</p>\n\n\n\n<h2>ดอกเบี้ย</h2>\n\n\n\n<p>ดอกเบี้ยเป็นเหมือนลมในชีวิตของเราที่เราวิ่งไปข้างหน้า ดอกเบี้ยเงินกู้คือลมต้าน และดอกเบี้ยที่เราได้รับเป็นลมส่ง การมีเงินกู้ขึ้นกับช่วงเวลาของชีวิต แต่สิ่งหนึ่งที่ไม่เห็นด้วยบ่อยๆ คือการกู้ไปพร้อมๆ กับรับดอกเบี้ยไปพร้อมกัน การกู้โดยใช้หลักทรัพย์ที่มีมูลค่าเต็มในตัว เช่น การจำนำทอง การกู้โดยนำสลากออกสินไปค้ำ ฯลฯ รูปแบบเหล่านี้เราแทบจะเสียดอกเบี้ยไปโดยฝั่งคนให้กู้แทบไม่มีความเสี่ยง หากเราจำเป็นต้องใช้เงินก็สามารถตัดใจนำสินทรัพย์เหล่านั้นออกไปใช้ได้เลย นอกจากเราจะมีการจัดการที่ซับซ้อนเพื่อจัดการภาษีแบบที่คนรวยๆ ทำกันบางกรณี </p>\n\n\n\n<p>การลงทุนความเสี่ยงต่ำที่ได้รายได้แน่นอนมีน้อยกรณีมากๆ ที่ได้รับดอกเบี้ยเกินกว่าเงินกู้ บางครั้งเหมือนเจอได้ เช่น การฝากเงินต่างประเทศแต่ในความเป็นจริงก็มีความเสี่ยงอื่นๆ เช่น ค่าเงินเข้ามา</p>\n\n\n\n<p>โดยรวมแนวคิดเหล่านี้ก็คงเป็นแค่แนวคิด จดโน้ตไว้เผื่อจะมีประโยชน์กับคนอื่นๆ ครับ</p>","author":"lewcpe","siteTitle":"LewCPE's Blog","siteHash":"be60e5c67c985916e913225e0fa8794018c33c335df997dc89cd85d60cc43d78","entryHash":"918e2e52044db3476e3bdf6f16b4ce9851d8ee88cc8984ee340bbd37e5b513bf","category":"Thai"}