{"title":"Why Final Fantasy is now targeting PC as its \"lead platform\"","link":"https://arstechnica.com/gaming/2026/02/why-final-fantasy-is-now-targeting-pc-as-its-lead-platform/","date":1771608419000,"content":"<p>For a long time now, PC gamers have been used to the Final Fantasy series treating their platform as somewhat secondary to the game's core console versions. There are some signs that may be starting to change, though, as director Naoki Hamaguchi has confirmed that the PC is now the \"lead platform\" for development of the <em>Final Fantasy VII Remake</em> trilogy.</p>\n<p>In <a href=\"https://automaton-media.com/en/game-development/final-fantasy-7-remake-trilogys-third-entry-will-not-compromise-on-graphics-whatsoever-despite-multiplatform-shift-director-naoki-hamaguchi-addresses-co/\">a recent interview with Automaton</a>, Hamaguchi clarified that the team takes the relatively common practice of creating visual assets for its multiplatform games by targeting \"high-end environments first,\" then performing a \"reduction\" for less powerful platforms. These days, that means \"our 3D assets are created at the highest quality level based on PC as the foundation,\" he said. Players have already noticed this graphical difference in the PC version of <em>Final Fantasy VII Rebirth</em>, Hamaguchi said, and \"our philosophy will not change for the third installment.\"</p>\n<p>While PC gaming is only \"gradually expanding in Japan,\" Hamaguchi said the rapid growth in international PC gamers has led the company to \"develop assets with the broad PC market in mind.\"</p><p><a href=\"https://arstechnica.com/gaming/2026/02/why-final-fantasy-is-now-targeting-pc-as-its-lead-platform/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/gaming/2026/02/why-final-fantasy-is-now-targeting-pc-as-its-lead-platform/#comments\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9195c8b99c209b6d767c0a1154ceb01264b80c0c0b444d5f0a9ca3c3560b5c79","category":"Tech"}