{"title":"Gurman: New Siri Might Be Delayed Again","link":"https://www.bloomberg.com/news/articles/2026-02-11/apple-s-ios-26-4-siri-update-runs-into-snags-in-internal-testing-ios-26-5-27","date":1770917074000,"content":"\n<p>Mark Gurman, reporting for Bloomberg:</p>\n\n<blockquote>\n  <p>After planning to include the new capabilities in iOS 26.4 — an\noperating system update slated for March — Apple is now working\nto spread them out over future versions, according to people\nfamiliar with the matter. That would mean possibly postponing some\nfeatures until at least iOS 26.5, due in May, and iOS 27, which\ncomes out in September. [...]</p>\n\n<p>In recent days, Apple instructed engineers to use the upcoming iOS\n26.5 in order to test new Siri features, implying that the\nfunctionality may have been moved back by at least one release.\nInternal versions of that update now include a notice describing\nthe addition of some Siri enhancements. One feature is especially\nlikely to slip: the expanded ability for Siri to tap into personal\ndata. That technology would let users ask the assistant to, say,\nsearch old text messages to locate a podcast shared by a friend\nand immediately play it.</p>\n\n<p>Internal iterations of iOS 26.5 also include a settings toggle\nallowing employees to enable a “preview” of that functionality.\nThat suggests Apple is weighing the idea of warning users that the\ninitial launch is incomplete or may not work reliably — similar\nto what it does with beta tests of new operating systems.</p>\n</blockquote>\n\n<p>When Gurman began reporting about personalized Siri delays a year ago, his reporting turned out to be exactly right. If these features are going to drop in iOS 26.4, they should be in pretty good shape right now internally. If they’re in bad shape right now in internal builds, it’s really hard to see how they could drop in iOS 26.4. And once you start talking about iOS 26.5 (let alone 26.6), we’d be getting <em>really</em> close to WWDC, where Apple’s messaging will turn to the version 27 OSes.</p>\n\n<p>Something <a href=\"https://daringfireball.net/2025/03/something_is_rotten_in_the_state_of_cupertino\">still seems rotten</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/02/12/gurman-new-siri-might-be-delayed-again\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"92070c278529aae6f34c6939f7dffd5b24cdf7c48c410f61aef59c2a2b46e4df","category":"Tech"}