{"title":"Apple Sued by West Virginia for Allegedly Allowing CSAM Distribution Through iCloud","link":"https://www.macrumors.com/2026/02/19/apple-west-virginia-csam-lawsuit/","date":1771524300000,"content":"West Virginia's Attorney General JB McCuskey today announced a lawsuit against Apple, accusing the company of knowingly allowing <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> to be used to distribute and store child sexual abuse material (CSAM). McCuskey says that Apple has opted to \"do nothing about it\" for years.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/12/iCloud-General-Feature-Redux.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\n<blockquote>\"Preserving the privacy of child predators is absolutely inexcusable. And more importantly, it violates West Virginia law. Since Apple has so far refused to police themselves and do the morally right thing, I am filing this lawsuit to demand Apple follow the law, report these images, and stop re-victimizing children by allowing these images to be stored and shared,\" Attorney General JB McCuskey said.</blockquote>\r<br />\nAccording to the lawsuit [<a href=\"https://ago.wv.gov/sites/default/files/2026-02/Filing.pdf\">PDF</a>], Apple has described itself as the \"greatest platform for distributing child porn\" internally, but it submits far fewer reports about CSAM than peers like Google and Meta.\r<br />\n\r<br />\nBack in 2021, Apple announced <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">new child safety features</a>, including a system that would detect known CSAM in images stored in <a href=\"https://www.macrumors.com/guide/icloud-photo-library/\">iCloud Photos</a>. After backlash from <a href=\"https://www.macrumors.com/2021/08/13/apple-employees-concerns-over-csam/\">customers</a>, <a href=\"https://www.macrumors.com/2021/08/06/snowden-eff-slam-plan-to-scan-messages-images/\">digital rights groups</a>, child safety advocates, and <a href=\"https://www.macrumors.com/2021/08/05/security-researchers-alarmed-apple-csam-plans/\">security researchers</a>, Apple decided to <a href=\"https://www.macrumors.com/2022/12/07/apple-abandons-icloud-csam-detection/\">abandon its plans</a> for CSAM detection in ‌iCloud Photos‌.\r<br />\n\r<br />\n\"Children can be protected without companies combing through personal data, and we will continue working with governments, child advocates, and other companies to help protect young people, preserve their right to privacy, and make the internet a safer place for children and for us all,\" Apple said when announcing that it would not implement the feature.\r<br />\n\r<br />\nApple <a href=\"https://www.macrumors.com/2023/09/01/apple-explains-csam-plan-abandoned/\">later explained</a> that creating a tool for scanning private ‌iCloud‌ data would \"create new threat vectors for data thieves to find and exploit.\"\r<br />\n\r<br />\nWest Virginia's Attorney General says that Apple has shirked its responsibility to protect children under the guise of user privacy, and that Apple's decision not to deploy detection technology is a choice, not passive oversight. The lawsuit suggests that since Apple has end-to-end control over hardware, software, and cloud infrastructure, it is not able to claim to be an \"unknowing, passive conduit of CSAM.\"\r<br />\n\r<br />\nThe lawsuit is seeking punitive damages and injunctive relief requiring Apple to implement effective CSAM detection measures.\r<br />\n\r<br />\nApple was also sued in 2024 over its decision to abandon CSAM detection. A lawsuit representing a potential group of 2,680 victims said that Apple's failure to implement CSAM monitoring tools has caused ongoing harm to victims. That lawsuit is seeking $1.2 billion.<div>Tag: <a href=\"https://www.macrumors.com/guide/lawsuit/\">Apple Lawsuits</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2026/02/19/apple-west-virginia-csam-lawsuit/\">Apple Sued by West Virginia for Allegedly Allowing CSAM Distribution Through iCloud</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-sued-by-west-virginia-for-allegedly-allowing-csam-distribution-through-icloud.2477946/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9330ebd937c8912113142e4c7a6aac12e36289b2567ea9bfde3047ed1937e517","category":"Apple"}