{"title":"The Wax and the Wane of the Web","link":"https://alistapart.com/article/the-wax-and-the-wane-of-the-web/","date":1709217900000,"content":"\n<p>I offer a single bit of advice to friends and family when they become new parents: <strong>When you start to think that you’ve got everything figured out, everything will change.</strong> Just as you start to get the hang of feedings, diapers, and regular naps, it’s time for solid food, potty training, and overnight sleeping. When you figure those out, it’s time for preschool and rare naps. The cycle goes on and on.</p>\n\n\n\n<p>The same applies for those of us working in design and development these days. Having worked on the web for almost three decades at this point, I’ve seen the regular wax and wane of ideas, techniques, and technologies. Each time that we as developers and designers get into a regular rhythm, some new idea or technology comes along to shake things up and remake our world.</p>\n\n\n\n<h2><strong>How we got here</strong></h2>\n\n\n\n<p>I built my first website in the mid-’90s. Design and development on the web back then was a free-for-all, with few established norms. For any layout aside from a single column, we used <code>table</code> elements, often with empty cells containing a single pixel spacer GIF to add empty space. We styled text with numerous <code>font</code> tags, nesting the tags every time we wanted to vary the font style. And we had only three or four typefaces to choose from: Arial, Courier, or Times New Roman. When Verdana and Georgia came out in 1996, we rejoiced because our options had nearly doubled. The only safe colors to choose from were the 216 “web safe” colors known to work across platforms. The few interactive elements (like contact forms, guest books, and counters) were mostly powered by CGI scripts (predominantly written in Perl at the time). Achieving any kind of unique look involved a pile of hacks all the way down. Interaction was often limited to specific pages in a site.</p>\n\n\n\n<h3><strong>The birth of web standards</strong></h3>\n\n\n\n<p>At the turn of the century, a new cycle started. Crufty code littered with <code>table</code> layouts and <code>font</code> tags waned, and a push for web standards waxed. <a href=\"https://alistapart.com/article/fear/\">Newer technologies like CSS</a> got more widespread adoption by browsers makers, developers, and designers. This shift toward standards didn’t happen accidentally or overnight. It took active engagement between the <a href=\"https://www.w3.org/\">W3C</a> and browser vendors and heavy evangelism from folks like the <a href=\"https://www.webstandards.org/\"><em>Web Standards Project</em> </a>to build standards. <a href=\"https://alistapart.com/\"><em>A List Apart</em></a> and books like <em>Designing with Web Standards</em> by Jeffrey Zeldman played key roles in teaching developers and designers why standards are important, how to implement them, and how to sell them to their organizations. And approaches like <a href=\"http://hesketh.com/publications/progressive_enhancement_and_the_future_of_web_design.html\">progressive enhancement</a> introduced the idea that content should be available for all browsers—with additional enhancements available for more advanced browsers. Meanwhile, sites like the <a href=\"https://csszengarden.com/\"><em>CSS Zen Garden</em></a> showcased just how powerful and versatile CSS can be when combined with a solid semantic HTML structure.</p>\n\n\n\n<p>Server-side languages like PHP, Java, and .NET overtook Perl as the predominant back-end processors, and the cgi-bin was tossed in the trash bin. With these better server-side tools came the first era of web applications, starting with content-management systems (particularly in the blogging space with tools like <a href=\"https://web.archive.org/web/19991012022531/http://blogger.com/\">Blogger</a>, <a href=\"https://web.archive.org/web/20010124065100/http://noahgrey.com/greysoft/\">Grey Matter</a>, <a href=\"https://web.archive.org/web/20101206044705/http://www.movabletype.com/blog/2001/10/please-read-before-downloading.html\">Movable Type</a>, and <a href=\"https://wordpress.org/news/2003/05/wordpress-now-available/\">WordPress</a>). In the mid-2000s, <a href=\"https://alistapart.com/article/gettingstartedwithajax/\">AJAX</a> opened doors for asynchronous interaction between the front end and back end. Suddenly, pages could update their content without needing to reload. A crop of JavaScript frameworks like <a href=\"http://prototypejs.org/\">Prototype</a>, <a href=\"https://web.archive.org/web/20080611093629/http://yuiblog.com/blog/2006/02/13/the-yahoo-user-interface-library/\">YUI</a>, and <a href=\"https://web.archive.org/web/20060204064635/https://jquery.com/\">jQuery</a> arose to help developers build more reliable client-side interaction across browsers that had wildly varying levels of standards support. Techniques like <a href=\"https://alistapart.com/article/dynatext/\">image replacement</a> let crafty designers and developers display fonts of their choosing. And technologies like Flash made it possible to add animations, games, and even more interactivity.</p>\n\n\n\n<p>These new technologies, standards, and techniques reinvigorated the industry in many ways. Web design flourished as designers and developers explored more diverse styles and layouts. But we still relied on tons of hacks. Early CSS was a huge improvement over table-based layouts when it came to basic layout and text styling, but its limitations at the time meant that designers and developers still relied heavily on images for <a href=\"https://alistapart.com/article/slidingdoors/\">complex shapes (such as rounded or angled corners)</a> and tiled backgrounds for <a href=\"https://alistapart.com/article/fauxcolumns/\">the appearance of full-length columns</a> (among other hacks). Complicated layouts required all manner of nested floats or absolute positioning (or both). Flash and image replacement for custom fonts was a great start toward varying the typefaces from the big five, but both hacks introduced accessibility and performance problems. And JavaScript libraries made it easy for anyone to add a dash of interaction to pages, although at the cost of doubling or even quadrupling the download size of simple websites.</p>\n\n\n\n<h3><strong>The web as software platform</strong></h3>\n\n\n\n<p>The symbiosis between the front end and back end continued to improve, and that led to the current era of modern web applications. Between expanded server-side programming languages (which kept growing to include Ruby, Python, Go, and others) and newer front-end tools like React, Vue, and Angular, we could build fully capable software on the web. Alongside these tools came others, including collaborative version control, build automation, and shared package libraries. What was once primarily an environment for linked documents became a realm of infinite possibilities.</p>\n\n\n\n<p>At the same time, mobile devices became more capable, and they gave us internet access in our pockets. <a href=\"https://abookapart.com/products/mobile-first\">Mobile apps</a> and <a href=\"https://alistapart.com/article/responsive-web-design/\">responsive design</a> opened up opportunities for new interactions anywhere and any time.</p>\n\n\n\n<p>This combination of capable mobile devices and powerful development tools contributed to the waxing of social media and other centralized tools for people to connect and consume. As it became easier and more common to connect with others directly on Twitter, Facebook, and even Slack, the desire for hosted personal sites waned. Social media offered connections on a global scale, with both the good and bad that that entails.</p>\n\n\n\n<p>Want a much more extensive history of how we got here, with some other takes on ways that we can improve? Jeremy Keith wrote “<a href=\"https://adactio.com/articles/20638\">Of Time and the Web</a>.” Or check out the “<a href=\"https://www.webdesignmuseum.org/web-design-history\">Web Design History Timeline</a>” at the <a href=\"https://www.webdesignmuseum.org/\">Web Design Museum</a>. Neal Agarwal also has a fun tour through “<a href=\"https://neal.fun/internet-artifacts/\">Internet Artifacts</a>.”</p>\n\n\n\n<h2><strong>Where we are now</strong></h2>\n\n\n\n<p>In the last couple of years, it’s felt like we’ve begun to reach another major inflection point. As <a href=\"https://techcrunch.com/2024/02/07/how-twitters-descent-into-chaos-is-paving-the-way-for-a-new-web/\">social-media platforms fracture</a> and wane, there’s been a <a href=\"https://matthiasott.com/articles/into-the-personal-website-verse\">growing interest in owning our own content</a> again. There are many different ways to make a website, from the tried-and-true classic of hosting plain HTML files to <a href=\"https://www.cloudflare.com/learning/performance/static-site-generator/\">static site generators</a> to content management systems of all flavors. The fracturing of social media also comes with a cost: we lose crucial infrastructure for discovery and connection. <a href=\"https://indieweb.org/Webmention\">Webmentions</a>, <a href=\"https://www.rssboard.org/rss-specification\">RSS</a>, <a href=\"https://activitypub.rocks/\">ActivityPub</a>, and other tools of the <a href=\"https://indieweb.org/\">IndieWeb</a> can help with this, but they’re still relatively underimplemented and <a href=\"https://mxb.dev/blog/the-indieweb-for-everyone/#h-lowering-the-barrier\">hard to use for the less nerdy</a>. We can build amazing personal websites and add to them regularly, but without discovery and connection, it can sometimes feel like we may as well be shouting into the void.</p>\n\n\n\n<p>Browser support for CSS, JavaScript, and other standards like web components has accelerated, especially through efforts like <a href=\"https://github.com/web-platform-tests/interop\">Interop</a>. New technologies gain support across the board in a fraction of the time that they used to. I often learn about a new feature and <a href=\"https://caniuse.com/\">check its browser support</a> only to find that its coverage is already above 80 percent. Nowadays, the barrier to using newer techniques often isn’t browser support but simply the limits of how quickly designers and developers can learn what’s available and how to adopt it.</p>\n\n\n\n<p>Today, with <a href=\"https://daverupert.com/2024/01/time-to-unmaintainable/\">a few commands and a couple of lines of code</a>, we can prototype almost any idea. All the tools that we now have available make it easier than ever to start something new. But the upfront cost that these frameworks may save in initial delivery eventually comes due as upgrading and maintaining them becomes a part of our technical debt.</p>\n\n\n\n<p>If we rely on third-party frameworks, adopting new standards can sometimes take longer since we may have to wait for those frameworks to adopt those standards. These frameworks—which used to let us adopt new techniques sooner—have now become hindrances instead. These same frameworks often come with <a href=\"https://tonsky.me/blog/js-bloat/\">performance costs</a> too, forcing users to wait for scripts to load before they can read or interact with pages. And when <a href=\"https://www.kryogenix.org/code/browser/everyonehasjs.html\">scripts fail</a> (whether through poor code, network issues, or other environmental factors), there’s often no alternative, leaving users with blank or broken pages.</p>\n\n\n\n<h2><strong>Where do we go from here?</strong></h2>\n\n\n\n<p>Today’s hacks help to shape tomorrow’s standards. And there’s nothing inherently wrong with embracing hacks—for now—to move the present forward. Problems only arise when we’re unwilling to admit that they’re hacks or we hesitate to replace them. So what can we do to create the future we want for the web?</p>\n\n\n\n<p><strong>Build for the long haul.</strong> Optimize for performance, for accessibility, and for the user. Weigh the costs of those developer-friendly tools. They may make your job a little easier today, but how do they affect everything else? What’s the cost to users? To future developers? To standards adoption? Sometimes the convenience may be worth it. Sometimes it’s just a hack that you’ve grown accustomed to. And sometimes it’s holding you back from even better options.</p>\n\n\n\n<p><strong>Start from standards.</strong> Standards continue to evolve over time, but browsers have done a remarkably good job of continuing to support older standards. The same isn’t always true of third-party frameworks. Sites built with even the hackiest of HTML from the ’90s still <a href=\"https://www.vortex.com/\">work</a><a href=\"https://www.spacejam.com/1996/\"> just fine</a> today. The same can’t always be said of sites built with frameworks even after just a couple years.</p>\n\n\n\n<p><strong>Design with care.</strong> Whether your craft is code, pixels, or processes, consider the impacts of each decision. The convenience of many a modern tool comes at the cost of not always understanding the underlying decisions that have led to its design and not always considering the impact that those decisions can have. Rather than rushing headlong to “move fast and break things,” use the time saved by modern tools to consider more carefully and design with deliberation.</p>\n\n\n\n<p><strong>Always be learning.</strong> If you’re always learning, you’re also growing. Sometimes it may be hard to pinpoint what’s worth learning and what’s just today’s hack. You might end up focusing on something that won’t matter next year, even if you were to focus solely on learning standards. (<a href=\"https://alistapart.com/article/webstandards2008/\">Remember XHTML?</a>) But constant learning opens up new connections in your brain, and the hacks that you learn one day may help to inform different experiments another day.</p>\n\n\n\n<p><strong>Play, experiment, and be weird!</strong> This web that we’ve built is the ultimate experiment. It’s the single largest human endeavor in history, and yet each of us can create our own pocket within it. <a href=\"https://www.rollingstone.com/culture/culture-commentary/internet-future-about-to-get-weird-1234938403/\">Be courageous and try new things</a>. Build a <a href=\"https://lynnandtonic.com/work/\">playground</a> for ideas. Make <a href=\"https://a-k-apart.com/\">goofy experiments</a> in your own mad <a href=\"https://neal.fun/\">science</a> <a href=\"https://labs.jensimmons.com/\">lab</a>. Start your own <a href=\"https://www.zeldman.com/2023/11/28/fly-my-designers-fly/\">small business</a>. There has never been a more empowering place to be creative, take risks, and explore what we’re capable of.</p>\n\n\n\n<p><strong>Share and amplify.</strong> As you experiment, play, and learn, share what’s worked for you. Write on your own website, post on whichever social media site you prefer, or shout it from a TikTok. <a href=\"https://alistapart.com/about/contribute/\">Write something for <em>A List Apart</em></a>! But take the time to <a href=\"https://hidde.blog/sharing-links/\">amplify others</a> too: find new voices, learn from them, and share what they’ve taught you.</p>\n\n\n\n<h3><strong>Go forth and make</strong></h3>\n\n\n\n<p>As designers and developers for the web (and beyond), we’re responsible for building the future every day, whether that may take the shape of personal websites, social media tools used by billions, or anything in between. Let’s imbue our values into the things that we create, and let’s make the web a better place for everyone. Create that thing that only you are uniquely qualified to make. Then share it, make it better, make it again, or make something new. Learn. Make. Share. Grow. Rinse and repeat. Every time you think that you’ve mastered the web, everything will change.</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"97f43ff91318c2de74c3ae0117801d78ab0d3d8d7f14ba4291cf95d56a122063","category":"Tech"}