{"title":"AWS Weekly Roundup: Amazon Bedrock agent workflows, Amazon SageMaker private connectivity, and more (February 2, 2026)","link":"https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-bedrock-agent-workflows-amazon-sagemaker-private-connectivity-and-more-february-2-2026/","date":1770052788000,"content":"<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/31/Screenshot-2026-01-31-at-19.17.02.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/01/31/Screenshot-2026-01-31-at-19.17.02-300x213.png\" alt=\"\" width=\"300\" height=\"213\" /></a>Over the past week, we passed <a href=\"https://en.wikipedia.org/wiki/Laba_Festival\">Laba festival</a>, a traditional marker in the Chinese calendar that signals the final stretch leading up to the Lunar New Year. For many in China, it’s a moment associated with reflection and preparation, wrapping up what the year has carried, and turning attention toward what lies ahead.</p> \n<p>Looking forward, next week also brings <a href=\"https://en.wikipedia.org/wiki/Lichun\">Lichun</a>, the beginning of spring and the first of the 24 solar terms. In Chinese tradition, spring is often seen as the season when growth begins and new cycles take shape. There’s a common saying that “a year’s plans begin in spring,” capturing the idea that this is a time to set one’s direction and start fresh.</p> \n<p><strong><u>Last week’s launches</u></strong><br /> Here are the launches that got my attention this week:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock</a> enhances support for agent workflows with server-side tools and extended prompt caching – Amazon Bedrock introduced two updates that improve how developers build and operate AI agents. <a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-bedrock-server-side-custom-tools-responses-api/\">The Responses API now supports server-side tool use</a>, so agents can perform actions such as web search, code execution, and database updates within AWS security boundaries. <a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-bedrock-one-hour-duration-prompt-caching/\">Bedrock also adds a 1-hour time-to-live (TTL) option for prompt caching</a>, which helps improve performance and reduce the cost for long-running, multi-turn agent workflows. Server-side tools are available with OpenAI GPT OSS 20B and 120B models, and the 1-hour prompt caching TTL is generally available for select Claude models by Anthropic in Amazon Bedrock.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-sagemaker-unified-studio-aws-privatelink/\">Amazon SageMaker Unified Studio adds private VPC connectivity with AWS PrivateLink</a> – <a href=\"https://aws.amazon.com/sagemaker/unified-studio/\">Amazon SageMaker Unified Studio</a> now supports AWS PrivateLink, providing private connectivity between your VPC and SageMaker Unified Studio without routing customer data over the public internet. With SageMaker service endpoints onboarded into a VPC, data traffic remains within the AWS network and is governed by IAM policies, supporting stricter security and compliance requirements.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/change-the-server-side-encryption-type-of-s3-objects/\">Amazon S3 adds support for changing object encryption without data movement</a> – <a href=\"https://aws.amazon.com/s3/\">Amazon S3</a> now supports changing the server-side encryption type of existing encrypted objects without moving or re-uploading data. Using the <code>UpdateObjectEncryption</code> API, you can switch from SSE-S3 to SSE-KMS, rotate customer -managed AWS Key Management Service (AWS KMS) keys, or standardize encryption across buckets at scale with S3 Batch Operations while preserving object properties and lifecycle eligibility.</li> \n <li><a href=\"https://aws.amazon.com/blogs/database/introducing-pre-warming-for-amazon-keyspaces-tables/\">Amazon Keyspaces introduces table pre-warming for predictable high-throughput workloads</a> – Amazon Keyspaces (for Apache Cassandra) now supports table pre-warming, which helps you proactively set warm throughput levels so tables can handle high read and write traffic instantly without cold-start delays. Pre-warming helps reduce throttling during sudden traffic spikes, such as product launches or sales events, and works with both on-demand and provisioned capacity modes, including multi-Region tables. The feature supports consistent, low-latency performance while giving you more control over throughput readiness.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-dynamodb-global-tables-with-mrsc-fis/\">Amazon DynamoDB MRSC global tables integrate with AWS Fault Injection Service</a> – <a href=\"https://aws.amazon.com/dynamodb/\">Amazon DynamoDB</a> multi-Region strong consistency (MRSC) global tables now integrate with AWS Fault Injection Service. With this integration, you can simulate Regional failures, test replication behavior, and validate application resiliency for strongly consistent, multi-Region workloads.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/cloudwatch-application-signals-kiro-powers/\">Amazon CloudWatch Application Signals integration with Kiro powers</a> – You can investigate application health issues faster with AI agent-assisted workflows in Kiro. This Kiro power packages the Application Signals MCP server with targeted observability guidance, giving the Kiro agent instant context for service health monitoring, SLO compliance, and investigation workflows.</li> \n</ul> \n<p>For a full list of AWS announcements, be sure to keep an eye on the <a href=\"https://aws.amazon.com/new/?trk=769a1a2b-8c19-4976-9c45-b6b1226c7d20&amp;sc_channel=el\">What’s New with AWS?</a> page.</p> \n<p><strong><u>Additional updates</u></strong><br /> Here are some additional projects, blog posts, and news items that I found interesting:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/blogs/networking-and-content-delivery/building-zero-trust-access-across-multi-account-aws-environments/\">Building zero-trust access across multi-account AWS environments with AWS Verified Access</a> – This post walks through how to implement AWS Verified Access in a centralized, shared-services architecture. It shows how to integrate with AWS IAM Identity Center and AWS Resource Access Manager (AWS RAM) to apply zero trust access controls at the application layer and reduce operational overhead across multi-account AWS environments.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/amazon-eventbridge-increases-event-payload-size-256-kb-1-mb/\">Amazon EventBridge increases event payload size to 1 MB</a> – Amazon EventBridge now supports event payloads up to 1 MB, an increase from the previous 256 KB limit. This update helps event-driven architectures carry richer context in a single event, including complex JSON structures, telemetry data, and machine learning (ML) or generative AI outputs, without splitting payloads or relying on external storage.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2025/01/aws-announces-deployment-agent-sops-in-aws-mcp-server-preview/\">AWS MCP Server adds deployment agent SOPs (preview)</a> – AWS introduced deployment standard operating procedures (SOPs) that AI agents can deploy web applications to AWS from a single natural language prompt in MCP -compatible integrated development environments (IDEs) and command line interfaces (CLIs) such as Kiro, Cursor, and Claude Code. The agent generates AWS Cloud Development Kit (AWS CDK) infrastructure, deploys AWS CloudFormation stacks, and sets up continuous integration and continuous delivery (CI/CD) workflows following AWS best practices. The preview supports frameworks including React, Vue.js, Angular, and Next.js.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/aws-network-firewall-web-category-based-filtering/\">AWS Network Firewall adds generation AI traffic visibility with web category filtering</a> – AWS Network Firewall now provides visibility into generative AI application traffic through predefined web categories. You can use these categories directly in firewall rules to govern access to generative AI tools and other web services. When combined with TLS inspection, category-based filtering can be applied at the full URL level.</li> \n <li>A<a href=\"https://aws.amazon.com/about-aws/whats-new/2026/01/aws-Lambda-observability-for-kafka-esm/\">WS Lambda adds enhanced observability for Kafka event source mappings</a> – <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> introduced enhanced observability for Kafka event source mappings, providing Amazon CloudWatch Logs and metrics to monitor event polling configuration, scaling behavior, and event processing state. The update improves visibility into Kafka-based Lambda workloads, helping teams diagnose configuration issues, permission errors, and function failures more efficiently. The capability supports both Amazon Managed Streaming for Apache Kafka (Amazon MSK) and self-managed Apache Kafka event sources.</li> \n <li><a href=\"https://aws.amazon.com/blogs/devops/aws-cloudformation-2025-year-in-review/\">AWS CloudFormation 2025 year in review</a> – This year-in-review post highlights CloudFormation updates delivered throughout 2025, with a focus on early validation, safer deployments, and improved developer workflows. It covers enhancements such as improved troubleshooting, drift-aware change sets, stack refactoring, StackSets updates, and new -IDE and AI -assisted tooling, including the CloudFormation language server and the Infrastructure as Code (IaC) MCP server.</li> \n</ul> \n<p><strong><u>Upcoming AWS events</u></strong><br /> Check your calendars so that you can sign up for this upcoming event:</p> \n<p><a href=\"https://aws-community.ro/\">AWS Community Day Romania (April 23–24, 2026)</a> – This community-led AWS event brings together developers, architects, entrepreneurs, and students for more than 10 professional sessions delivered by AWS Heroes, Solutions Architects, and industry experts. Attendees can expect expert-led technical talks, insights from speakers with global conference experience, and opportunities to connect during dedicated networking breaks, all hosted at a premium venue designed to support collaboration and community engagement.</p> \n<p>If you’re looking for more ways to stay connected beyond this event, join the <a href=\"https://builder.aws.com/?trk=e61dee65-4ce8-4738-84db-75305c9cd4fe&amp;sc_channel=el\">AWS Builder Center</a> to learn, build, and connect with builders in the AWS community.</p> \n<p>Check back next Monday for another <a href=\"https://aws.amazon.com/blogs/aws/tag/week-in-review/?trk=e82bba63-d46d-4435-acd0-7531b14ad817&amp;sc_channel=el\">Weekly Roundup</a>.</p> \n<p>–<a href=\"http://www.linkedin.com/in/zhengyubin714\">betty</a></p>","author":"Betty Zheng (郑予彬)","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"9a02d47e88784535ae8a5b02ab568bfefdb987ee85978664c6d6cc862172f22a","category":"Tech"}