{"title":"Personalization Pyramid: A Framework for Designing with User Data","link":"https://alistapart.com/article/personalization-pyramid/","date":1670511600000,"content":"\n<p>As a UX professional in today’s data-driven landscape, it’s increasingly likely that you’ve been asked to design a personalized digital experience, whether it’s a public website, user portal, or native application. Yet while there continues to be no shortage of marketing hype around personalization platforms, we still have very few standardized approaches for implementing personalized UX.</p>\n\n\n\n<p>That’s where we come in. After completing dozens of personalization projects over the past few years, we gave ourselves a goal: could you create a holistic personalization framework specifically for UX practitioners? The <strong>Personalization Pyramid</strong> is a designer-centric model for standing up human-centered personalization programs, spanning data, segmentation, content delivery, and overall goals. By using this approach, you will be able to understand the core components of a contemporary, UX-driven personalization program (or at the very least know enough to get started). </p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image20-1024x595.png\" alt=\"A chart answering the question Do you have the resources you need to run personalization in your organization? Globally, 13% don’t 33% have limited access, 39% have it (on demand), and 15% have it dedicated.\" /><figcaption><p><strong>Growing tools for personalization:</strong> According to a Dynamic Yield survey, 39% of respondents felt support is available on-demand when a business case is made for it (up 15% from 2020).</p><p><small>Source: “The State of Personalization Maturity – Q4 2021” Dynamic Yield conducted its annual maturity survey across roles and sectors in the Americas (AMER), Europe and the Middle East (EMEA), and the Asia-Pacific (APAC) regions. This marks the fourth consecutive year publishing our research, which includes more than 450 responses from individuals in the C-Suite, Marketing, Merchandising, CX, Product, and IT.</small></p></figcaption></figure>\n\n\n\n<h2><strong>Getting Started</strong></h2>\n\n\n\n<p>For the sake of this article, we’ll assume you’re already familiar with the basics of digital personalization. A good overview can be found here: <a href=\"https://www.uxbooth.com/articles/website-personalization-planning/\">Website Personalization Planning</a>. While UX projects in this area can take on many different forms, they often stem from similar starting points.      </p>\n\n\n\n<p><strong>Common scenarios for starting a personalization project:</strong></p>\n\n\n\n<ul>\n<li>Your organization or client purchased a content management system (CMS) or marketing automation platform (MAP) or related technology that supports personalization</li>\n\n\n\n<li>The CMO, CDO, or CIO has identified personalization as a goal</li>\n\n\n\n<li>Customer data is disjointed or ambiguous</li>\n\n\n\n<li>You are running some isolated targeting campaigns or A/B testing</li>\n\n\n\n<li>Stakeholders disagree on personalization approach</li>\n\n\n\n<li>Mandate of customer privacy rules (e.g. GDPR) requires revisiting existing user targeting practices</li>\n</ul>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image22.png\" alt=\"Two men and a woman discussing personalization using a card deck. They are seated at a round table in a hotel conference room. The workshop leaders, two women, are at a podium in the background.\" width=\"768\" height=\"576\" /><figcaption>Workshopping personalization at a conference.</figcaption></figure>\n\n\n\n<p>Regardless of where you begin, a successful personalization program will require the same core building blocks. We’ve captured these as the “levels” on the pyramid. Whether you are a UX designer, researcher, or strategist, understanding the core components can help make your contribution successful.  </p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image14-975x1024.png\" alt=\"The Personalization Pyramid visualized. The pyramid is stacks labeled, from the bottom, raw data (1m+), actionable data (100k+), user segments (1k+), contexts &amp; campaigns (100s), touchpoints (dozens), goals (handful). The North Star (one) is above. An arrow for prescriptive, business driven data goes up the left side and an arrow for adaptive user-driven data goes down the right side.\" width=\"488\" height=\"512\" /><figcaption>From the ground up: Soup-to-nuts personalization, without going nuts.</figcaption></figure>\n\n\n\n<p>From top to bottom, the levels include:</p>\n\n\n\n<ol>\n<li><strong>North Star: </strong>What larger strategic objective is driving the personalization program? </li>\n\n\n\n<li><strong>Goals:</strong> What are the specific, measurable outcomes of the program? </li>\n\n\n\n<li><strong>Touchpoints: </strong>Where will the personalized experience be served?</li>\n\n\n\n<li><strong>Contexts and Campaigns: </strong>What personalization content will the user see?</li>\n\n\n\n<li><strong>User Segments:</strong> What constitutes a unique, usable audience? </li>\n\n\n\n<li><strong>Actionable Data: </strong>What reliable and authoritative data is captured by our technical platform to drive personalization?  </li>\n\n\n\n<li><strong>Raw Data: </strong>What wider set of data is conceivably available (already in our setting) allowing you to personalize?</li>\n</ol>\n\n\n\n<p>We’ll go through each of these levels in turn. To help make this actionable, we created an accompanying <strong>deck of cards</strong> to illustrate specific examples from each level. We’ve found them helpful in personalization brainstorming sessions, and will include examples for you here.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image2.png\" alt=\"A deck of personalization brainstorming cards (the size of playing cards) against a black background.\" /><figcaption><strong>Personalization pack:</strong> Deck of cards to help kickstart your personalization brainstorming.</figcaption></figure>\n\n\n\n<h2><strong>Starting at the Top</strong></h2>\n\n\n\n<p>The components of the pyramid are as follows:</p>\n\n\n\n<h3>North Star</h3>\n\n\n\n<p>A north star is what you are aiming for overall with your personalization program (big or small). The North Star defines the (one) overall mission of the personalization program. What do you wish to accomplish? North Stars cast a shadow. The bigger the star, the bigger the shadow. Example of North Starts might include: </p>\n\n\n\n<ol>\n<li><strong>Function:</strong> Personalize based on basic user inputs. Examples: “Raw” notifications, basic search results, system user settings and configuration options, general customization, basic optimizations</li>\n\n\n\n<li><strong>Feature:</strong> Self-contained personalization componentry. Examples: “Cooked” notifications, advanced optimizations (geolocation), basic dynamic messaging, customized modules, automations, recommenders</li>\n\n\n\n<li><strong>Experience:</strong> Personalized user experiences across multiple interactions and user flows. Examples: Email campaigns, landing pages, advanced messaging (i.e. C2C chat) or conversational interfaces, larger user flows and content-intensive optimizations (localization).</li>\n\n\n\n<li><strong>Product:</strong> Highly differentiating personalized product experiences. Examples: Standalone, branded experiences with personalization at their core, like the “algotorial” playlists by Spotify such as Discover Weekly.</li>\n</ol>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image7-656x1024.jpg\" alt=\"Function: React to basic user inputs\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image18-656x1024.jpg\" alt=\"Feature: personalized modules\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image8-656x1024.jpg\" alt=\"Experience: Integrated personalization\" /></figure>\n<figcaption><strong>North star cards. </strong>These can help orient your team towards a common goal that personalization will help achieve; Also, these are useful for characterizing the end-state ambition of the presently stated personalization effort.</figcaption></figure>\n\n\n\n<h3>Goals</h3>\n\n\n\n<p>As in any good UX design, personalization can help accelerate <a href=\"https://www.uxbooth.com/articles/designing-for-customer-intentions-part-1/\">designing with customer intentions</a><strong>. Goals</strong> are the tactical and measurable metrics that will prove the overall program is successful. A good place to start is with your current analytics and measurement program and metrics you can benchmark against. In some cases, new goals may be appropriate. The key thing to remember is that <em>personalization itself is not a goal</em>, rather it is a means to an end. Common goals include:</p>\n\n\n\n<ul>\n<li>Conversion</li>\n\n\n\n<li>Time on task</li>\n\n\n\n<li>Net promoter score (NPS)</li>\n\n\n\n<li>Customer satisfaction </li>\n</ul>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image12-656x1024.jpg\" alt=\"NPS: Net Promoter Score\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image23-656x1024.jpg\" alt=\"Time on Task: Users move quicker\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image13-656x1024.jpg\" alt=\"Conversion: Move more of the thing\" /></figure>\n<figcaption><strong>Goal cards.</strong> Examples of some common KPIs related to personalization that are concrete and measurable.</figcaption></figure>\n\n\n\n<h3>Touchpoints</h3>\n\n\n\n<p>Touchpoints are where the personalization happens. As a UX designer, this will be one of your largest areas of responsibility. The touchpoints available to you will depend on how your personalization and associated technology capabilities are instrumented, and should be rooted in improving a user’s experience at a particular point in the journey. Touchpoints can be multi-device (mobile, in-store, website) but also more granular (web banner, web pop-up etc.). Here are some examples:</p>\n\n\n\n<p><strong>Channel-level </strong>Touchpoints</p>\n\n\n\n<ul>\n<li>Email: Role</li>\n\n\n\n<li>Email: Time of open</li>\n\n\n\n<li>In-store display (JSON endpoint)</li>\n\n\n\n<li>Native app</li>\n\n\n\n<li>Search</li>\n</ul>\n\n\n\n<p><strong>Wireframe-level </strong>Touchpoints</p>\n\n\n\n<ul>\n<li>Web overlay</li>\n\n\n\n<li>Web alert bar</li>\n\n\n\n<li>Web banner</li>\n\n\n\n<li>Web content block</li>\n\n\n\n<li>Web menu</li>\n</ul>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image25-656x1024.jpg\" alt=\"In-store Display: End-cap interfaces\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image11-656x1024.jpg\" alt=\"Email: Time, personalize at time of open\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image19-656x1024.jpg\" alt=\"Content Block: Into the woodwork\" /></figure>\n<figcaption><strong>Touchpoint cards. </strong>Examples of common personalization touchpoints: these can vary from narrow (e.g., email) to broad (e.g., in-store).</figcaption></figure>\n\n\n\n<p>If you’re designing for web interfaces, for example, you will likely need to include personalized “zones” in your wireframes. The content for these can be presented programmatically in touchpoints based on our next step, contexts and campaigns.</p>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image21.png\" alt=\"\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image17.png\" alt=\"\" /></figure>\n<figcaption><strong>Targeted Zones:</strong> Examples from Kibo of personalized “zones” on page-level wireframes occurring at various stages of a user journey (Engagement phase at left and Purchase phase at right.)<br /><br />Source: “Essential Guide to End-to-End Personaliztion” by Kibo.</figcaption></figure>\n\n\n\n<h3>Contexts and Campaigns</h3>\n\n\n\n<p>Once you’ve outlined some touchpoints, you can consider the actual personalized content a user will receive. Many personalization tools will refer to these as “campaigns” (so, for example, a campaign on a web banner for new visitors to the website). These will programmatically be shown at certain touchpoints to certain user segments, as defined by user data. At this stage, we find it helpful to consider two separate models: a <strong>context model</strong> and a <strong>content model</strong>. The context helps you consider the level of engagement of the user at the personalization moment, for example a user casually browsing information vs. doing a deep-dive. Think of it in terms of information retrieval behaviors. The content model can then help you determine what type of personalization to serve based on the context (for example, an “Enrich” campaign that shows related articles may be a suitable supplement to extant content).</p>\n\n\n\n<p>Personalization <strong>Context</strong> Model:</p>\n\n\n\n<ol>\n<li>Browse</li>\n\n\n\n<li>Skim</li>\n\n\n\n<li>Nudge</li>\n\n\n\n<li>Feast</li>\n</ol>\n\n\n\n<p>Personalization <strong>Content</strong> Model:</p>\n\n\n\n<ol>\n<li>Alert</li>\n\n\n\n<li>Make Easier</li>\n\n\n\n<li>Cross-Sell</li>\n\n\n\n<li>Enrich</li>\n</ol>\n\n\n\n<p>We’ve written extensively about each of these models elsewhere, so if you’d like to read more you can check out Colin’s <a href=\"https://alistapart.com/article/emerging-ux-role-in-personalization/\">Personalization Content Model</a> and Jeff’s <a href=\"https://bucket.circle.so/c/field-notes/progressive-personalization-a-decisionmaking-model-for-better-outcomes-in-personalized-ux\">Personalization Context Model</a>. </p>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image28-656x1024.jpg\" alt=\"Cross Sell: You may also like…\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image3-656x1024.jpg\" alt=\"Enrich: You might find this interesting\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image27-656x1024.jpg\" alt=\"Browse: Lean back, shallow engagement\" /></figure>\n<figcaption><strong>Campaign and Context cards:</strong> This level of the pyramid can help your team focus around the types of personalization to deliver end users and the use-cases in which they will experience it.</figcaption></figure>\n\n\n\n<h3>User Segments</h3>\n\n\n\n<p>User segments can be created prescriptively or adaptively, based on user research (e.g. via rules and logic tied to set user behaviors or via A/B testing). At a minimum you will likely need to consider how to treat the <em>unknown</em> or first-time visitor, the <em>guest</em> or returning visitor for whom you may have a stateful cookie (or equivalent post-cookie identifier), or the <em>authenticated</em> visitor who is logged in. Here are some examples from the personalization pyramid:</p>\n\n\n\n<ul>\n<li>Unknown</li>\n\n\n\n<li>Guest</li>\n\n\n\n<li>Authenticated</li>\n\n\n\n<li>Default</li>\n\n\n\n<li>Referred</li>\n\n\n\n<li>Role</li>\n\n\n\n<li>Cohort</li>\n\n\n\n<li>Unique ID</li>\n</ul>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image16-656x1024.jpg\" alt=\"Authenticated: Logged in with token\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image10-656x1024.jpg\" alt=\"Unknown: Could be anyone really\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image9-656x1024.jpg\" alt=\"Guest: Dropped a cookie\" /></figure>\n<figcaption><strong>Segment cards.</strong> Examples of common personalization segments: at a minimum, you will need to consider the anonymous, guest, and logged in user types. Segmentation can get dramatically more complex from there.</figcaption></figure>\n\n\n\n<h3>Actionable Data</h3>\n\n\n\n<p>Every organization with any digital presence has data. It’s a matter of asking what data you can ethically collect on users, its inherent reliability and value, as to how can you use it (sometimes known as “data activation.”) Fortunately, the tide is turning to first-party data: a recent study by Twilio estimates some <strong>80% of businesses are using at least some type of first-party data</strong> to personalize the customer experience. </p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image6-1024x714.png\" alt=\"Chart that answers the question &quot;Why is your company focusing on using first-party data for personalization?&quot; The top answer (at 53%) is &quot;it’s higher quality.&quot; That is followed by &quot;It’s easier to manage&quot; (46%), &quot;it provides better privacy&quot; (45%), &quot;it’s easier to obtain&quot; (42%), &quot;it’s more cost-effective&quot; (40%), &quot;it’s more ethical&quot; (37%), &quot;our customers want us to&quot; (36%), &quot;it’s the industry norm&quot; (27%), &quot;it’s easier to comply with regulations&quot; (27%), and &quot;we are phasing out 3rd party cookies&quot; (21%).\" /><figcaption><small>Source: “The State of Personalization 2021” by Twilio. Survey respondents were n=2,700 adult consumers who have purchased something online in the past 6 months, and n=300 adult manager+ decision-makers at consumer-facing companies that provide goods and/or services online. Respondents were from the United States, United Kingdom, Australia, and New Zealand.Data was collected from April 8 to April 20, 2021.</small></figcaption></figure>\n\n\n\n<p>First-party data represents multiple advantages on the UX front, including being relatively simple to collect, more likely to be accurate, and less susceptible to the “creep factor” of third-party data. So a key part of your UX strategy should be to determine what the best form of data collection is on your audiences. Here are some examples:</p>\n\n\n\n<figure>\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image15-656x1024.jpg\" alt=\"Quizes: Tell us what you like\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image5-656x1024.jpg\" alt=\"Behavioral profiling: Males 40+ who wear fedoras\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image1-656x1024.jpg\" alt=\"Campaign Source: Your discount code 29780…\" /></figure>\n</figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image4.png\" alt=\"Chart showing the impact of personalization across different phases of personalization maturity. It shows that effort is high in the early phases, but drops off quickly starting in phase 3 (machine learning) while at the same time conversion rates, AOV, and ROI increase from a relatively low level to off the chart.\" /><figcaption><strong>Figure 1.1.2:</strong> Example of a personalization maturity curve, showing progression from basic recommendations functionality to true individualization. Credit: https://kibocommerce.com/blog/kibos-personalization-maturity-chart/</figcaption></figure>\n\n\n\n<p>There is a progression of profiling when it comes to recognizing and making decisioning about different audiences and their signals. It tends to move towards more granular constructs about smaller and smaller cohorts of users as time and confidence and data volume grow.</p>\n\n\n\n<p>While some combination of <strong>implicit / explicit</strong> <strong>data</strong> is generally a prerequisite for any implementation (more commonly referred to as first party and third-party data) <strong>ML efforts</strong> are typically not cost-effective directly out of the box. This is because a strong data backbone and content repository is a prerequisite for optimization. But these approaches should be considered as part of the larger roadmap and may indeed help accelerate the organization’s overall progress. Typically at this point you will partner with key stakeholders and product owners to design a <strong>profiling model</strong>. The profiling model includes defining approach to configuring profiles, profile keys, profile cards and pattern cards. A multi-faceted approach to profiling which makes it scalable.</p>\n\n\n\n<h2>Pulling it Together</h2>\n\n\n\n<p>While the cards comprise the starting point to an inventory of sorts (we provide blanks for you to tailor your own), a set of potential levers and motivations for the style of personalization activities you aspire to deliver, they are more valuable when thought of in a grouping. </p>\n\n\n\n<p>In assembling a card “hand”, one can begin to trace the entire trajectory from leadership focus down through a strategic and tactical execution. It is also at the heart of the way both co-authors have conducted workshops in assembling a program backlog—which is a fine subject for another article.</p>\n\n\n\n<p>In the meantime, what is important to note is that each colored class of card is helpful to survey in understanding the range of choices potentially at your disposal, it is threading through and making concrete decisions about for whom this decisioning will be made: where, when, and how.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2022/12/image26.jpg\" alt=\"Cards on a table. At the top: Function is the north star &amp; customer satisfaction is the goal. User segment is unknown, the actionable data is a quiz, context is a nudge, campaign is to make something easier, and the touchpoint is a banner.\" /><figcaption><strong>Scenario A:</strong> We want to use personalization to improve customer satisfaction on the website. For unknown users, we will create a short quiz to better identify what the user has come to do. This is sometimes referred to as “badging” a user in onboarding contexts, to better characterize their present intent and context.</figcaption></figure>\n\n\n\n<h2>Lay Down Your Cards</h2>\n\n\n\n<p>Any sustainable personalization strategy must consider near, mid and long-term goals. Even with the leading CMS platforms like Sitecore and Adobe or the most exciting composable CMS DXP out there, there is simply no “easy button” wherein a personalization program can be stood up and immediately view meaningful results. That said, there is a common grammar to all personalization activities, just like every sentence has nouns and verbs. These cards attempt to map that territory.</p>\n\n\n\n<p></p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"9d424dfd32b76e1e7f5675ce07a2d0504227e5c019ab63984852f1b150b01a70","category":"Tech"}