{"title":"From Residency to Routt RSL: A Ride Worth the Reward","link":"https://moots.com/blogs/news/from-residency-to-routt-rsl-a-ride-worth-the-reward","date":1745621562000,"content":"\n      <div>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Herrold_RouttRSLCRD_03-1024x683.jpg?v=1762205013\" alt=\"\" /></div>\n<div>Photo by Ethan Herrold\n<p> </p>\n<p>For some, a bike is just a tool. For others, it’s a milestone—a symbol of where they’ve been, and where they’re going. After completing medical residency, Dr. Emily gifted herself something extraordinary: a handcrafted titanium machine built for freedom, self-care, and serious fun. In this Q&amp;A, we dive into why she chose the <a href=\"https://moots.com/products/routt-rsl-red-xplr-build/\"><strong>Routt RSL</strong></a>, how the custom build came together, and why this bike—equal parts art and performance—continues to inspire her both on the trail and in the clinic.</p>\n \n<p><strong>What originally drew you to Moots? Was it the craftsmanship, the ride feel, the titanium, or something else? </strong></p>\n<p><em>I learned about Moots from Alpha Bicycle Studio and fell in love with the high quality, their Colorado heritage, and the art like details on their bikes. I wanted a sturdy bike that was comfortable, beautiful and well-crafted. </em></p>\n<p><strong> </strong></p>\n<p><strong>Why did you pick the Routt RSL?</strong></p>\n<p><em>I chose Routt RS as I wanted a fast, fun and playful gravel bike that could tackle over biking on single track but still be agile enough for riding on the road. </em></p>\n \n<p><strong>How did you decide on the finish or anodization? Are there any details of the bike you are obsessed with?</strong></p>\n<p><em>I chose the Stanley finish as I am an artist. I love the color and detail, especially on the chain stay. I also love Estes Park and the Stanley hotel; we go annually and always come to the Stanley. </em></p>\n \n<p><strong>Did you customize the build? Did you build this with a local shop, if so, which?</strong></p>\n<p><em>I customized the build with Alpha Bicycle Studio in Littleton. They completed a bike fit prior to the build, recommended sizes and coordinated with me on each aspect of the build.</em></p>\n \n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/IMG_8971-1024x768.jpg?v=1762205032\" alt=\"\" /></p>\n \n<p><strong>Any standout adventures, races, or moments that made you think, “This is why I bought this bike”?</strong></p>\n<p><em>I race Foco Fondo yearly and completed the blue course at SBT GRVL last year. The bike always turns heads, but I really love the bike on gnarly gravel descents where I feel comfortable, fast and confident that my Moots can handle it all.</em></p>\n \n<p><strong>What does riding a Moots mean to you?</strong></p>\n<p><em>Moots means expert craftsmanship that blends function and fun. </em></p>\n<p><em> </em><em> </em></p>\n<p><strong>If you had to describe your bike in three words, what would they be? </strong></p>\n<p><em>I describe my bike as a piece of art, reliable and a beast! </em></p>\n</div>\n<div>\n<img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Herrold_RouttRSLCRD_01-1024x683.jpg?v=1762205056\" alt=\"\" /> </div>\n<div>Photo by Ethan Herrold\n<p>I purchased my Moots after finishing medical residency, the bike represents an ultimate self-care gift and the beginning of freedom to enjoy outside hobbies. I now work as a primary care physician and medical director. I use my moots to clear my head after long days caring for patients. I often bond with patients on cycling and always push for patients to get outside and move!</p>\n<pre></pre>\n</div>\n</div>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"9ef266cde7f40b4b51d74a5e2e87959ffe5aac5f72d2f288dd1c9bfd11db60ee","category":"Cycling"}