{"title":"AWS Weekly Roundup: Amazon EC2 M8azn instances, new open weights models in Amazon Bedrock, and more (February 16, 2026)","link":"https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ec2-m8azn-instances-new-open-weights-models-in-amazon-bedrock-and-more-february-16-2026/","date":1771262932000,"content":"<p>I joined AWS in 2021, and since then I’ve watched the <a href=\"https://aws.amazon.com/ec2\">Amazon Elastic Compute Cloud (Amazon EC2)</a> instance family grow at a pace that still surprises me. From AWS Graviton-powered instances to specialized accelerated computing options, it feels like every few months there’s a new instance type landing that pushes performance boundaries further. As of February 2026, AWS offers over 1,160 Amazon EC2 instance types, and that number keeps climbing.</p> \n<p>This week’s opening news is a good example: The general availability of <a href=\"https://aws.amazon.com/about-aws/whats-new/2026/02/aws-m8azn-instances-generally-available/\">Amazon EC2 M8azn instances</a>. These are general purpose, high-frequency, high-network instances powered by fifth generation AMD EPYC processors, offering the highest maximum CPU frequency in the cloud at 5 GHz. Compared to the previous generation M5zn instances, M8azn instances deliver up to 2x compute performance, 4.3x higher memory bandwidth, and a 10x larger L3 cache. They also provide up to 2x networking throughput and up to 3x <a href=\"https://aws.amazon.com/ebs\">Amazon Elastic Block Store (Amazon EBS)</a> throughput compared with M5zn.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2026/02/15/wir-feb16-2026-v3.png\" alt=\"\" width=\"3024\" height=\"1692\" /></p> \n<p>Built on the <a href=\"https://aws.amazon.com/ec2/nitro/\">AWS Nitro System</a> using sixth generation Nitro Cards, M8azn instances target workloads such as real-time financial analytics, high-performance computing, high-frequency trading, CI/CD pipelines, gaming, and simulation modeling across automotive, aerospace, energy, and telecommunications. The instances feature a 4:1 ratio of memory to vCPU and are available in 9 sizes ranging from 2 to 96 vCPUs with up to 384 GiB of memory, including two bare metal variants. For more information visit the <a href=\"https://aws.amazon.com/ec2/instance-types/m8a\">Amazon EC2 M8azn instance page</a>.</p> \n<p><span><strong>Last week’s launches</strong></span><br /> Here are some of the other announcements from last week:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-bedrock-adds-support-six-open-weights-models/\">Amazon Bedrock adds support for six fully managed open weights models</a> – Amazon Bedrock now supports DeepSeek V3.2, MiniMax M2.1, GLM 4.7, GLM 4.7 Flash, Kimi K2.5, and Qwen3 Coder Next. These models span frontier reasoning and agentic coding workloads. DeepSeek V3.2 and Kimi K2.5 target reasoning and agentic intelligence, GLM 4.7 and MiniMax M2.1 support autonomous coding with large output windows, and Qwen3 Coder Next and GLM 4.7 Flash provide cost-efficient alternatives for production deployment. These models are powered by Project Mantle and provide out-of-the-box compatibility with OpenAI API specifications. With the launch, you can also use new open weight models–<a href=\"https://kiro.dev/blog/open-weight-models/\">DeepSeek v3.2 , MiniMax 2.1, and Qwen3 Coder Next in Kiro</a>, a spec-driven AI development tool.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-bedrock-expands-aws-privatelink-support-openai-api-endpoints/\">Amazon Bedrock expands support for AWS PrivateLink</a> – Amazon Bedrock now supports AWS PrivateLink for the <code>bedrock-mantle</code> endpoint, in addition to existing support for the <code>bedrock-runtime</code> endpoint. The bedrock-mantle endpoint is powered by Project Mantle, a distributed inference engine for large-scale machine learning model serving on Amazon Bedrock. Project Mantle provides serverless inference with quality of service controls, higher default customer quotas with automated capacity management, and out-of-the-box compatibility with OpenAI API specifications. AWS PrivateLink support for OpenAI API-compatible endpoints is available in 14 AWS Regions. To get started, visit the Amazon Bedrock console or the OpenAI API compatibility documentation.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-eks-auto-mode-enhanced-logging/\">Amazon EKS Auto Mode announces enhanced logging for managed Kubernetes capabilities</a> – You can now configure log delivery sources using Amazon CloudWatch Vended Logs in Amazon EKS Auto Mode. This helps you collect logs from Auto Mode’s managed Kubernetes capabilities for compute autoscaling, block storage, load balancing, and pod networking. Each Auto Mode capability can be configured as a CloudWatch Vended Logs delivery source with built-in AWS authentication and authorization at a reduced price compared to standard CloudWatch Logs. You can deliver logs to CloudWatch Logs, Amazon S3, or Amazon Data Firehose destinations. This feature is available in all Regions where EKS Auto Mode is available.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/02/amazon-opensearch-serverless-supports-collection-groups/\">Amazon OpenSearch Serverless now supports Collection Groups</a> – You can use new Collection Groups to share OpenSearch Compute Units (OCUs) across collections with different AWS Key Management Service (AWS KMS) keys. Collection Groups reduce overall OCU costs through a shared compute model while maintaining collection-level security and access controls. They also introduce the ability to specify minimum OCU allocations alongside maximum OCU limits, providing guaranteed baseline capacity at startup for latency-sensitive applications. Collection Groups are available in all Regions where Amazon OpenSearch Serverless is currently available.</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2026/02/rds-aurora-backup-configuration-restoring-snapshots/\">Amazon RDS now supports backup configuration when restoring snapshots</a> – You can view and modify the backup retention period and preferred backup window before and during snapshot restore operations. Previously, restored database instances and clusters inherited backup parameter values from snapshot metadata and could only be modified after restore was complete. You can now view backup settings as part of automated backups and snapshots, and specify or modify these values when restoring, eliminating the need for post-restoration modifications. This is available for all Amazon RDS database engines (MySQL, PostgreSQL, MariaDB, Oracle, SQL Server, and Db2) and Amazon Aurora (MySQL-Compatible and PostgreSQL-Compatible editions) in all AWS commercial Regions and AWS GovCloud (US) Regions at no additional cost.</li> \n</ul> \n<p>For a full list of AWS announcements, be sure to keep an eye on the <a href=\"https://aws.amazon.com/new/?trk=769a1a2b-8c19-4976-9c45-b6b1226c7d20&amp;sc_channel=el\">What’s New with AWS</a> page.</p> \n<p><span><strong>Upcoming AWS events</strong></span><br /> Check your calendar and sign up for upcoming AWS events:</p> \n<p><a href=\"https://aws.amazon.com/events/summits/?trk=ep_card_event_page&amp;awsf.location=*all&amp;refid=ep_card_event_page\">AWS Summits</a> – Join AWS Summits in 2026, free in-person events where you can explore emerging cloud and AI technologies, learn best practices, and network with industry peers and experts. Upcoming Summits include <a href=\"https://aws.amazon.com/events/summits/paris/\">Paris</a> (April 1), <a href=\"https://aws.amazon.com/events/summits/london/\">London</a> (April 22), and <a href=\"https://aws.amazon.com/events/summits/\">Bengaluru</a> (April 23–24).</p> \n<p><a href=\"https://aws.amazon.com/uki/cloud-services/aws-events/ai-and-data-conference-2026/\">AWS AI and Data Conference 2026</a> – A free, single-day in-person event on March 12 at the Lyrath Convention Centre in Ireland. The conference covers designing, training, and deploying agents with Amazon Bedrock, Amazon SageMaker, and QuickSight, integrating them with AWS data services, and applying governance practices to operate them at scale. The agenda includes strategic guidance and hands-on labs for architects, developers, and business leaders.</p> \n<p><a href=\"https://aws.amazon.com/events/community-day/\">AWS Community Days</a> – Community-led conferences where content is planned, sourced, and delivered by community leaders, featuring technical discussions, workshops, and hands-on labs. Upcoming events include <a href=\"https://awsahmedabad.community/\">Ahmedabad</a> (February 28), <a href=\"https://www.awscommunityday.sk/\">Slovakia</a> (March 11), and <a href=\"https://www.awsugpune.in/\">Pune</a> (March 21).</p> \n<p>Join the <a href=\"https://builder.aws.com/?trk=e61dee65-4ce8-4738-84db-75305c9cd4fe&amp;sc_channel=el\">AWS Builder Center</a> to connect with builders, share solutions, and access content that supports your development. Browse here for upcoming <a href=\"https://aws.amazon.com/events/explore-aws-events/?refid=e61dee65-4ce8-4738-84db-75305c9cd4fe\">AWS led in-person and virtual events</a> and <a href=\"https://builder.aws.com/connect/events?trk=e61dee65-4ce8-4738-84db-75305c9cd4fe&amp;sc_channel=el\">developer-focused events</a>.</p> \n<p>That’s all for this week. Check back next Monday for another Weekly Roundup!</p> \n<a href=\"https://www.linkedin.com/in/esrakayabali/\">— Esra</a> \n<p><em>This post is part of our Weekly Roundup series. Check back each week for a quick roundup of interesting news and announcements from AWS!</em></p> \n<p> </p>","author":"Esra Kayabali","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"a0a866639c2c84517d16bc4303881132706b9e8703d1f3eb40b266c0f52742eb","category":"Tech"}