{"title":"'In a sport where you suffer this much, mentality is a big factor' - Sam Watson on versatility, momentum and big dreams","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/in-a-sport-where-you-suffer-this-much-mentality-is-a-big-factor-sam-watson-on-versatility-momentum-and-big-dreams","date":1768998370000,"content":"\n      <p><span>At the end of last season, Sam Watson had a clear goal for 2026 and it was pretty simple. “I want to win more races — I don't care what races. Last year, I stepped up quite a lot, so I want to back that up and be even better.”</span><b></b></p>\n<p><span>It took the first WorldTour race of the year, the prologue of the Santos Tour Down Under for the 24-year-old to start making good on that objective — he took the spoils and the first ochre leader’s jersey.</span><b></b></p>\n<p><span>The short explosive efforts of prologues suit the attributes of the rider from Leeds, who can also win sprint finishes. Speaking at the end of last year during </span><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><span>Rouleur Live 2025</span></a><span>, Watson mentioned the need for versatility to compete in the modern peloton.</span><b></b></p>\n<p><span>“I think having versatility is good, especially nowadays in cycling. Even the pure sprinters don't get many opportunities. You have to be a pretty well-rounded athlete. It's something I want to carry on with, just being versatile and being able to go into different </span><em>parcours</em><span> and being able to perform at them,” said Watson.</span><b></b></p>\n<p><span>As the current British road race champion (in 2025 he was also second in the ITT) and a winner of reduced sprint finishes like at the Quatre Jours de Dunkerque final stage, which secured his overall title, Watson is a rider in the ilk of </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/one-day-i-was-at-altitude-training-the-next-day-i-was-in-hospital-michael-matthews-and-a-new-perspective?tag=member\"><span>Michael Matthews</span></a><span> — someone who can challenge over different disciplines. </span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_4_1024x1024.png?v=1768998215\" alt=\"\" /></div>\n<p><em>Watson in the TDU leader's jersey after the prologue (Image: Zac Williams/SWpix.com)</em></p>\n<p><span>This ability is something that is being championed recently at Ineos Grenadiers, the team he joined in 2025, from Groupama-FDJ. Last season, the British squad brought in fresh faces like Watson and </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/new-riders-new-mentality-are-there-finally-positive-signs-for-the-ineos-grenadiers?tag=member\"><span>started a new era</span></a><span>, where they would no longer put all their eggs in the GC basket that brought them success in the 2010s. And it has ended up being exactly the environment a rider like Watson is looking for.</span><b></b></p>\n<p><span>“I think I joined the team at the right time where it's really on the way up. It's fair to say that they had a dip, speaking with other riders, maybe it was the mentality or the vibe wasn't quite as good as previous years,” said Watson.</span><b></b></p>\n<p><span>Ineos’ new approach has worked. </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/on-the-attack-ineos-grenadiers-aggressive-racing-pays-early-dividends?tag=member\"><span>The aggressive and multi-leader tactics</span></a><span> paid off last year as they sought to get riders in breakaways instead of racing passively. It resulted in a more fruitful year compared to 2024, with stage wins at all three Grand Tours, and competitive results across the season at other races. Collective winning brings confidence for an individual too, which was the case for Watson.</span><b></b></p>\n<p><span>“I've always said winning breeds winning. I started to build momentum early last year — good results and stuff, like fifth at Omloop Nieuwsblad. Two years before that, I didn't really think that would be possible, I didn't think it would happen. Once you start getting a bit of confidence, and then you do pick up a win, then you can go into races with a different mentality. You're not going in and shying away, like: ‘oh, there's a climb here, I might get dropped’ — instead it's like, ‘okay, let's make it hard here, to put other guys under pressure’. I think in a sport where you suffer so much, mentality is a big factor,” Watson tells me.</span><b></b></p>\n<p><span>Watson's 2026 momentum has already begun at the Tour Down Under, so now it is a case of keeping it up, individually and within the team. As well as a winner with a big future ahead of him in the Classics and stage races, Watson is also a key domestique for Ineos. With the signing of Oscar Onley, the British squad have shown intent on competing for Grand Tour podiums once again, and they have set their sights on the biggest race of them all, the </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\"><span>Tour de France</span></a><span>.</span><b></b></p>\n<p><span>Watson tells me: “We want to be back at the top of the sport. I don't know when, but we want to win the Tour again.”</span></p>\n<p><b><em>Read more: <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/winning-a-grand-tour-is-possible-oscar-onleys-rise-from-the-scottish-borders-to-tour-de-france-stardom?tag=member\">'Winning a Grand Tour is possible' - Oscar Onley's rise from the Scottish Borders to Tour de France stardom</a></em><span> </span></b></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a41f6ab34f9512489d49ed28e482e86dfa039db5c4babac8d2f73c9139ca8e9b","category":"Cycling"}