{"title":"Jony Ive's First OpenAI Device Will Be Smart Speaker With Camera, 2027 Launch Planned","link":"https://www.macrumors.com/2026/02/20/jony-ive-openai-smart-speaker-2027/","date":1771618132000,"content":"OpenAI is working on several AI hardware devices in partnership with former Apple designer Jony Ive, and the first product that comes out could be a smart speaker. The company is developing a smart speaker, a smart lamp, and considering AI glasses, according to <em><a href=\"https://www.theinformation.com/articles/inside-openai-team-developing-ai-devices?rc=583sff\">The Information</a></em>, with the speaker set to come out in early 2027.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2025/05/jony-ive-sam-altman.jpg\" alt=\"\" width=\"1600\" height=\"900\" />\r<br />\nOpenAI's smart speaker has an integrated camera and it is designed to learn information about who is using it and what's around them. It will include a facial recognition feature similar to <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a>, and users will be able to use the speaker to make purchases. The speaker will have AI integration, so users can ask it questions and make requests.\r<br />\n\r<br />\nIn an internal presentation, OpenAI employees were told that the speaker would observe users and suggest actions to help them achieve goals, such as suggesting an early bedtime ahead of a morning meeting.\r<br />\n\r<br />\nApple is working on a similar home hub device that's set to come out this year. The home hub will include an integrated camera and speaker for video calls and controlling smart home products, plus it will have deep integration with the updated version of <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> that Apple is developing.\r<br />\n\r<br />\nOpenAI is planning to price the speaker between $200 and $300, with a launch planned for February 2027 at the earliest. OpenAI is exploring a smart lamp and smart glasses, but those products won't be ready until 2028 or later. With the exception of the speaker, OpenAI's hardware development is in the early stages and other products could be canceled.\r<br />\n\r<br />\nJony Ive has been working with OpenAI since OpenAI <a href=\"https://www.macrumors.com/2025/05/21/openai-buys-jony-ive-ai-startup/\">acquired Ive's hardware firm</a> io in May 2025. Ive and OpenAI CEO Sam Altman have shared some details on their AI hardware work, suggesting that there was an established prototype <a href=\"https://www.macrumors.com/2025/11/24/jony-ive-sam-altman-ai-device-2/\">in November 2025</a>. At the time, Ive and Altman said the device would be \"peaceful\" and an \"active participant\" that's not annoying. The duo also described the device as a product that would \"make people feel joy.\"\r<br />\n\r<br />\nAdditional rumors about OpenAI's plans came following <a href=\"https://www.macrumors.com/2025/05/22/details-leak-jony-ive-openai-device/\">an employee meeting</a>, where Ive and Altman said they didn't want a device with a screen. The device, which is presumably the speaker that <em>The Information</em> says is in development, was described as pocket-sized and contextually aware of the user's surroundings. Altman told employees it's \"the coolest piece of technology that the world will have ever seen.\"\r<br />\n\r<br />\nWhile Altman and Ive have promised the next big thing after the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, there is some internal tension at OpenAI. Ive's LoveFrom design company has remained separate from OpenAI, but LoveFrom is providing hardware designs to OpenAI. It's up to OpenAI's hardware and software engineers to actually make the products that LoveFrom comes up with.\r<br />\n\r<br />\nOpenAI employees have apparently complained about LoveFrom's secrecy and slow speed when it comes to design revisions. Former Apple designer Evans Hankey is leading industrial design, and Ive is said to be making the final call on almost all design choices. Other former Apple employees working at OpenAI on hardware include Tang Tan and Scott Cannon, plus <a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a>'s son Adam Cue is working on OpenAI software.<div>Tags: <a href=\"https://www.macrumors.com/guide/jony-ive/\">Jony Ive</a>, <a href=\"https://www.macrumors.com/guide/lovefrom/\">LoveFrom</a>, <a href=\"https://www.macrumors.com/guide/openai/\">OpenAI</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2026/02/20/jony-ive-openai-smart-speaker-2027/\">Jony Ive's First OpenAI Device Will Be Smart Speaker With Camera, 2027 Launch Planned</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/jony-ives-first-openai-device-will-be-smart-speaker-with-camera-2027-launch-planned.2477997/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a5195fca80e84aabe79589f7a4ae01aced103f859588c39dab6d2d8ba11b1017","category":"Apple"}