{"title":"ฟอนต์แม่ไก่ (iannnnn-HEN)","link":"https://iannnnn.com/2025/3366","date":1748970656000,"content":"<p>ตามธรรมเนียม คือพอสร้างฟอนต์เสร็จตัวนึงแล้วเราจะเอามาเล่าที่นี่ด้วยความเห่อ อย่างน้อยก็เป็นการบันทึกไว้เผื่อลืมว่าตอนนั้นตัวเองคิดอะไร ทำไมถึงทำมันขึ้นมา เคยลองไม่บันทึก เพราะกะว่ายังไงก็จำได้ ปรากฏว่าพอกาลเวลามันพัดพาไป เราก็ลืมจนได้ เสียดายมาก</p>\n\n\n\n<p>คราวนี้เป็นคิวของการทำ<strong>ฟอนต์แม่ไก่</strong> ฟอนต์ล่าสุดในตระกูลฟอนต์ iannnnn ยุคใหม่ ถัดจากฟอนต์ เป็ด หมา ห่าน เสือ และ<a href=\"https://iannnnn.com/2024/3140\">นกฮูก</a> ยังไม่นับที่ถอดลายมือของสะอาดและพลอย (ทั้งหมดสามารถดาวน์โหลดได้ฟรีจาก<a href=\"https://www.f0nt.com/author/iannnnn/\" target=\"_blank\">เว็บฟอนต์ &gt; iannnnn</a>)</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"1024\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0-1024x1024.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0-1024x1024.png 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0-300x300.png 300w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0-250x250.png 250w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0-768x768.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0-1536x1536.png 1536w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-0.png 1800w\" /></figure>\n\n\n\n<p>ฟอนต์แม่ไก่ ดาวน์โหลดฟรี ใช้ฟรี ใช้ทำมาหากินก็ได้ตามสบาย ที่ <a href=\"https://www.f0nt.com/release/iannnnn-hen/\" target=\"_blank\">f0nt.com/release/iannnnn-hen/</a></p>\n\n\n\n<p>ประวัติของฟอนต์แม่ไก่คร่าวๆ แบบเชิงบวก เชิงโฆษณา เชิงภาพลักษณ์ สามารถอ่านได้จากลิงก์ข้างบนนี้ เขียนให้มันสวยๆ สำหรับคนผ่านไปผ่านมา</p>\n\n\n\n<p>เวอร์ชันเนิร์ด เขียนบันทึกระหว่างทางการทำฟอนต์ ที่แปะไว้ในฟอรั่มหลังบ้านของเว็บฟอนต์ โชว์ไปเลยว่าเราทำงานช้าแค่ไหน เจอปัญหาอะไร แปะไว้ที่นี่ : <a href=\"https://forum.f0nt.com/index.php/topic,24741.0.html\">ฟอนต์แม่ไก่ (iannnnn-HEN)</a></p>\n\n\n\n<p>และเวอร์ชันบ่นให้คนรู้จักฟัง จะอยู่ถัดจากนี้ไปครับ…</p>\n\n\n\n<p>เป็นที่น่าใจหายมากๆ ที่ปีนี้ทั้งปี เราเพิ่งทำฟอนต์ออกมาได้แค่ฟอนต์เดียว จากที่เคยตั้งเป้าไว้ว่า 3-4 เดือน น่าจะมีสักฟอนต์ และก็จะทยอยทำแจกฟรีไปเรื่อยๆ จนตัวเองไม่ไหว เป็นงานอดิเรกที่ทำแล้วเพลิน แถมเรายังดื่มกินคำชื่นชม ขอบคุณ เสพความภูมิใจที่ได้ผลิตงานที่ตัวเองชอบออกมาสำเร็จ นี่เป็นกิเลสส่วนตัว มากกว่าเงินทอง ที่เราขัดแย้งกับเมียมาตลอด (เมียอยากให้ทำอะไรที่มันทำแล้วรวยน่ะ แต่เราไม่ถนัดจริงๆ)</p>\n\n\n\n<p>กลับมาเรื่องการทำฟอนต์ เราพบว่าเรามีปัญหาเดิมที่เกิดขึ้นในระยะหลังมานี้ คือ เราไม่ค่อยรู้จักพอ รู้จักการหยุด แล้วก็ปล่อยมันออกจากมือ ให้ไปสู่โลกกว้างได้เแล้ว งานมันไม่มีวันสมบูรณ์หรอก ถ้าจะแก้คือมึงก็แก้ไปเรื่อยๆ นั่นแหละ ไม่มีวันจบ</p>\n\n\n\n<p>สิ่งนี้เกิดขึ้นหนักมากกับฟอนต์แม่ไก่ ซึ่งเอาจริงๆ นับย้อนไปถึงตอนเริ่มโปรเจกต์ <a href=\"https://forum.f0nt.com/index.php/topic,7423.0.html\" target=\"_blank\">iannnnnPNG</a> เมื่อปี 2006 (ก็คือยี่สิบปีแล้ว…) เราอยากทำฟอนต์มินิมัล-ไม่มีหัวขึ้นมาสักชุด มาใช้ทดแทน หรืออย่างน้อยก็วางเคียงคู่ฟอนต์เจ้าตลาดในสมัยนั้นที่ยังไม่มีเวอร์ชันแจกฟรี แต่ก็พับไป บอกตามตรงว่าปากดี แต่ฝีมือไม่ถึง ออกแบบยังไงก็ไม่ลงตัว และไม่พยายามมากพอ มันเลยถูกปล่อยทิ้งร้าง แต่ชื่อมันสวย เลยอยากทำต่อในดีไซน์อื่น</p>\n\n\n\n<p>ต่อมา พอถึงยุคสมัยของฟอนต์ iannnnn รุ่นใหม่ๆ ที่เปลี่ยนไส้ในจาก kerning + liga เป็นระบบ kerning + mark (อ่านไม่รู้เรื่องก็ช่างมันเถอะ) และปรับสเกลฟอนต์เพื่อให้รองรับกับยุคสมัยปัจจุบัน และสร้างด้วยโปรแกรมฟอนต์แล็บราคาแพงระยับ ผมยังขุดดีไซน์ที่ร่างไว้จากฟอนต์มินิมัล-ไม่มีหัว มาลองเติมหัวดู เออ เข้าท่านี่หว่า</p>\n\n\n\n<p>คู่ขนานกับการได้เห็นฟอนต์ <a href=\"https://www.f0nt.com/release/iannnnngmo/\">iannnnnGMO</a> ที่ทำไว้เมื่อ 20 ปีก่อน (2005) แล้วดันเห็นว่ามันยังคงถูกใช้งานอย่างแพร่หลายในปัจจุบัน</p>\n\n\n\n<p>ซึ่งอย่างที่บอกว่า เทคโนโลยีการแสดงผลฟอนต์มันเปลี่ยนไปเยอะ ส่วนฝั่งของดีไซน์ คนทำเองก็เห็น “บาดแผล” ในงานของตัวเองมาตลอด อยากแก้ตรงนั้น อยากปรับตรงนี้ แต่ก็ยังไม่มีแรงใจจะรื้อใหญ่ คืองานแก้บาดแผลและแก้โครงสร้างภายในเนี่ยมันใหญ่เกินคำว่า<strong>สนุก</strong> (เป็นคีย์เวิร์ดหลักในชีวิตผมหากจะเลือกหมกมุ่นอยู่กับอะไร มันต้องสนุกก่อนดิ ไม่งั้นจะไม่มีแรงทำ)</p>\n\n\n\n<p>ใจจริงอยากลบมันออกและป่าวประกาศว่าอย่าใช้ GMO ได้ไหม เห็นแล้วฉันอยากกรี๊ด แต่ก็ทำไม่ได้ เพราะกระสุนถูกปล่อยออกไปนานเกินจะควบคุมแล้ว</p>\n\n\n\n<p>ความที่มีไอเดียฟอนต์นึงวนเวียนในหัวมากว่าสิบปี และความอยากรีโนเวตฟอนต์เดิม ทั้งสองสิ่งนี้เป็นแรงบันดาลใจให้เคาะโปรเจกต์ฟอนต์แม่ไก่ขึ้นมาเมื่อปี 2021 …ใช่ 4 ปีแน่ะ</p>\n\n\n\n<p>ที่ชื่อฟอนต์แม่ไก่ก็เพราะ ฟอนต์นี้เริ่มจากการที่เรามี ก.ไก่ แบบที่ชอบอยู่ในหัวเป็นตัวแรก เลยอยากพัฒนาต่อให้ออกมาเป็นฟอนต์ เลยตั้งชื่อ(ตอนนั้น)ว่า iannnnn-CHICKEN</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"1024\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1024x1024.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1024x1024.png 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-300x300.png 300w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-250x250.png 250w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-768x768.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1536x1536.png 1536w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-2048x2048.png 2048w\" /></figure>\n\n\n\n<p>ที่ตลกก็คือพอพัฒนาดีไซน์ไปเรื่อยๆ เรากลับนั่งปรับ ก.ไก่ อีกหลายครั้ง (คือเวลาออกแบบฟอนต์ เราจะแก้ไปแก้มา ทั้งในกระดาษและในคอมพ์) จนสุดท้ายก็กลายเป็น ก.ไก่ แบบที่เห็นในปัจจุบัน</p>\n\n\n\n<p>คือสำหรับเรา (ที่เป็นสายมวยวัดนะครับ ไม่ใช่สายหลักที่เขาร่ำเรียนกันเป็นระบบและฉลาดกว่านี้มาก) การพัฒนาฟอนต์ 1 ตัว มันดูแค่ตัวเดียวโดดๆ ไม่ได้ เวลาทำไปเรื่อยๆ แล้วหันกลับมาเช็ก </p>\n\n\n\n<ul>\n<li>มีไหม ตัวที่เห็นแล้วมันกระโดดออกจากกลุ่ม ไม่เข้ากับพวก ถ้ามีก็เอามาเกลาๆ ให้เข้า</li>\n\n\n\n<li>บุคลิกของน้ำเสียงที่ต้องการสื่อสารจากฟอนต์นี้ยังคงเป็นแบบที่เราตั้งใจไว้ไหม ถ้ามันเปลี่ยน เหตุผลที่เปลี่ยนไปนั้นเราโอเคไหม ถ้าโอเคก็รื้อ แล้วไปต่อ</li>\n</ul>\n\n\n\n<p>เนื่องจากมันเป็นโปรเจกต์ส่วนตัวที่ทำสนุกๆ การเปลี่ยนแนวกลางคัน เลยไม่รู้สึกว่าเป็นการขาดทุนอะไร เหมือนเห็นว่าวิ่งไปเลนใหม่น่าจะสนุกกว่าย้ำอยู่เลนเดิม ก็เปลี่ยน มักง่ายจังวะ</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"837\" height=\"1024\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2022-837x1024.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2022-837x1024.png 837w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2022-245x300.png 245w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2022-768x940.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2022-1255x1536.png 1255w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2022.png 1628w\" /></figure>\n\n\n\n<p>ซึ่งฟอนต์ไก่ ที่ถูกเปลี่ยนเป็นแม่ไก่ ก็เข้าข่ายนี้ มันถูกทำทิ้งไว้ปีนึง เอามาดูใหม่ ไม่ชอบบุคลิกนี้แล้ว ขอเปลี่ยนโทนหน่อย แต่ระหว่างนั้นก็เก็บเกี่ยวอะไรมาเพื่อเป็นทุนไว้สำหรับการไปต่อ เราโพสต์และทดความคิดไว้ในบอร์ดฟอนต์ อายคนเขาเหมือนกัน (ถึงจะอ่านแค่ไม่กี่คน) แต่ก็อยากบันทึกทิ้งไว้อยู่ดี</p>\n\n\n\n<p>จนสลับไปทำฟอนต์อื่นๆ หลายตัว แล้ววนกลับมาสู่โปรเจกต์ที่ต้องการแรงใจในการผลักดันให้จบให้จงได้</p>\n\n\n\n<p>2021 เริ่มออกแบบ<br />2022 รื้อแบบ<br />2023 รื้อใหม่ทั้งหมด<br />2024 พับโครงการยาว ไปทำฟอนต์อื่นๆ แทน<br />2025 เดือนเมษายน… คราวนี้ ตั้งใจไว้แล้วว่ากูจะจบงานให้ได้!</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"833\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2025-1024x833.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2025-1024x833.png 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2025-300x244.png 300w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2025-768x625.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen2025.png 1050w\" /></figure>\n\n\n\n<p>ก็คือรื้อใหม่ทั้งหมดตั้งแต่แรกอีกแล้วครับ เวอร์ชันล่าสุด (ที่เป็นเวอร์ชันจริง) ตัดสินใจกำหนดน้ำเสียงของตัวอักษรว่า เราจะไม่ตะโกนโฉ่งฉ่างมาก บุคลิกไม่ตะโกนนัก แปลง่ายๆ ว่ามันจะไม่ฉูดฉาดเท่าไหร่ แต่ก็ยังพอดูออกว่าเหมือนฟอนต์ที่ชินตาในสมัยก่อน เอามาปรับให้มันดูเล่นๆ มากขึ้น น่าจะได้ใช้งานเป็นปัจจุบันมากขึ้น ไรงี้</p>\n\n\n\n<p>(ลองย้อนไปดูข้างบนแล้วเปรียบเทียบก็ได้ครับ ดีไซน์ยุคแรกๆ ก็คือเฟี้ยวฟ้าว ถ้าใช้ในงานก็คือจะมีบุคลิกที่จี๊ดประมาณนึง แต่แบบใหม่จะนุ่มและน่ารักกว่า นี่จึงเป็นน้ำเสียงของชื่อ “แม่ไก่” ที่ตั้งใจ)</p>\n\n\n\n<p>พอ DNA มันมา ทีนี้ก็ยาวเลย งานออกแบบไปทำไป แก้ไป ที่จริงก็ใช้เวลาหลังเสร็จงานมานั่งปั่นฟอนต์ก่อนนอนทุกคืนที่ว่าง โดยที่ได้รับอนุญาตจากเมียแล้ว</p>\n\n\n\n<p>การได้นั่งทำฟอนต์ทุกคืน แม้จะคืนละนิดละหน่อย อาจจะชั่วโมง หรือสองสามสี่ชั่วโมง จะเรียกว่าผ่อนคลายไหมก็คงใช่และไม่ใช่ คือมันสนุก เพลิดเพลิน เป็นงานอดิเรกในฝัน ที่ถ้ามีแรงเราก็จะทำไปเรื่อยๆ… แต่ก็แลกมาด้วยข้อจำกัดของความชรา ตอนนี้เราอายุ 40 กว่าแล้ว ไม่ใช่ไอ้หนุ่มไฟแรงที่ทำแป๊บๆ ก็เสร็จ หรือโต้รุ่งได้ทั้งคืนโดยไม่ต้องมีภาระ หรือเสียสุขภาพอะไร</p>\n\n\n\n<p>ฟอนต์นี้เราตั้งใจจะทำ “ดีไซน์หลัก” ให้เสร็จใน 1 เดือน ซึ่งก็ทำได้จริง เสร็จดีไซน์หลักในดราฟต์แรกก่อนขึ้นเดือนพฤษภาฯ</p>\n\n\n\n<p>แต่นั่นคือครึ่งเดียว งานออกแบบฟอนต์สนุกๆ มันคือครึ่งเดียว</p>\n\n\n\n<p>ครึ่งหลังที่เหลือคือการเช็ดขี้เช็ดเยี่ยว ใส่เครื่องปรุง เติมกะปิน้ำปลาให้กับมัน นั่นคือฝั่งดีไซน์ ที่แก้และเพิ่มเติมจนคืนสุดท้ายของเดือนพฤษภาคม แต่ไอ้ที่หนักจริงๆ คือฝั่งงานกรรมกร ตรวจสอบความเรียบร้อย ปรับตรงนั้นเข้ามา ตรงนี้ออกไป ช่องไฟให้พอดี สระอีวางตรงนี้ ถ้าสระอิให้ขยับไปหน่อย ทำซ้ำๆ จนเสร็จ </p>\n\n\n\n<p>พอเสร็จก็มานึกว่า เออไอ้ที่ทำไปมันน่าจะ<strong>ดีได้มากกว่านี้</strong> (เริ่มละมึง) ก็เลยรื้อใหม่ (หมายเหตุเนิร์ด : เราแก้ระบบมาร์กจากแต่เดิมแค่มีวรรณยุกต์และสระบนแค่สองชั้น ขอปรับใหม่เป็นแปดตำแหน่ง มันจะได้คัสตอมได้ดั่งใจ)</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen-mark-1024x576.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen-mark-1024x576.png 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen-mark-300x169.png 300w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen-mark-768x432.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen-mark-1536x864.png 1536w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/hen-mark-2048x1152.png 2048w\" /><figcaption>ในภาพจะมีดาวสีแดงๆ เหนือ ก.ไก่ …นั่นแหละการวางตำแหน่งวรรณยุกต์ต่างๆ</figcaption></figure>\n\n\n\n<p>แล้วก็จะมีไอ้อะไรแบบนี้ที่เป็นส่วนผสมของความเรื่องมาก และความอยากลอง มันจะประมาณว่า “ไหน ฟอนต์นี้มันก็ใช้เวลาทำมานาน ขอใส่ไอ้นี่ลงไปนิดนึงเหอะวะ” งี้ ด้วยความที่รู้ชะตาว่าถ้าปล่อยมันไปสู่โลก มันคงจะอยู่ไปอีกอย่างน้อย 20 ปีเหมือนบรรพบุรุษของมันแน่ๆ แล้วทำไมจะปล่อยให้มีบั๊กอันไม่พึงประสงค์หลุดรอดไปได้อีกล่ะ</p>\n\n\n\n<p>เนี่ย ไอ้ความคิดแบบข้างบนเนี่ยอันตรายต่อ “ความเสร็จของงานตามที่ตั้งใจไว้” มาก เราเลยใช้วิธีประจานตัวเองลงโซเชียลด้วย คือทำเสร็จแค่ไหนก็ทวีตไป จะได้รู้ว่าเราควรย้ำคิดย้ำทำ ย้อนโพรเซสกลับไปแก้ไขในเรื่องที่ “ปล่อยผ่านหน่อยก็ได้มั้ง” ให้น้อยที่สุด</p>\n\n\n\n<p>นั่งทับมือไว้ ได้บ้างไม่ได้บ้าง จองคิวไว้ในบอร์ดแล้ว แต่น้องๆ พี่ๆ ที่ไฟแรงกว่า ก็ลงคิวปล่อยฟอนต์กันรัวๆ จนยาวขนาดที่ปล่อยฟอนต์ใหม่วันละ 7 ตัว ก็ยังทลายคิวไม่สำเร็จ</p>\n\n\n\n<p>สุดท้าย ฟอนต์แม่ไก่ก็เสร็จ 100% แต่ปล่อยไม่ทันเดือนพฤษภาคมอย่างที่ประกาศและประจานไว้</p>\n\n\n\n<p>3 มิถุนายน เราไปเที่ยวกับครอบครัว ไปนอนบ้านสวนของเพื่อน(วุฒิ)ที่แปดริ้ว ในห้องคือทุกคนหลับกันหมดแล้ว ไม่มีโต๊ะ ไม่มีเก้าอี้ แต่รู้สึกว่าอยากจบงานนี้แล้ว ไม่งั้นคงนอนไม่หลับ</p>\n\n\n\n<p>เราเดินออกมาจากห้อง ที่นั่นเป็นโกดังอุตสาหกรรมขนาดใหญ่และที่เก็บของเก่า เฟอร์นิเจอร์เก่า ข้างนอกมืดสนิท ไม่มีไฟ ก็เอาไฟฉายส่องหาเก้าอี้ที่พอจะมีวางไว้สักแห่ง โชคดีที่ไม่มีผี (หรือไม่เห็นก็ไม่รู้) เลยได้เก้าอี้มา ก็เอามานั่งหน้าตู้ลิ้นชัก ใช้เป็นสเตชันในการแก้ไขครั้งสุดท้าย และออกแบบมาสคอตของฟอนต์นี้ (เออ งานสำคัญของเราคือคิดมาสคอตในแต่ละฟอนต์ ถ้าคิดไม่ออกก็จะไม่ยอมปล่อย 55555)</p>\n\n\n\n<p>ได้แม่ไก่และตระกูลน้องไข่มาเป็นที่สำเร็จ</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"819\" height=\"1024\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1-819x1024.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1-819x1024.png 819w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1-240x300.png 240w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1-768x960.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1-1229x1536.png 1229w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/chicken-1.png 1600w\" /></figure>\n\n\n\n<p>ก็เอามาประกอบและทำเป็นอาร์ตเวิร์ก (ภาพบนสุด และภาพอื่นๆ ใน<a href=\"https://www.f0nt.com/release/iannnnn-hen/\" target=\"_blank\">หน้าโหลดฟอนต์แม่ไก่</a>) จึงสบายใจ และหลับได้</p>\n\n\n\n<p>แล้ววันนี้ก็ปล่อยฟอนต์นี้ เป็นอันจบงานอดิเรกที่ดูจะเป็นภาระเหลือเกิน แต่มันสนุกง่ะ เลิกไม่ได้</p>\n\n\n\n<p>ยิ่งคืนนั้นลูกสาวคนเล็กมาคุยเรื่องฟอนต์ โม้ให้ลูกฟังว่าเนี่ย พ่อก็ทำฟอนต์ด้วยนะ – ใช่ๆ ฟอนต์หมาใน Canva ที่หนูใช้นี่ลายมือพ่อเอง คุ้นไหมๆ จากนั้นลูกก็ถามชื่อฟอนต์แต่ละตัวที่ทำ เราก็อวดไปด้วยความใจฟู</p>\n\n\n\n<p>และคำถามสุดท้ายก็คือ หลังจากฟอนต์แม่ไก่แล้ว พ่อจะทำฟอนต์เป็นสัตว์อะไรต่อ</p>\n\n\n\n<p>เราบอกว่าฟอนต์แมวพ่อขอต๊ะไว้ก่อน อยากทำให้เป็นฟอนต์ที่รักสุดๆ ไม่แพ้ฟอนต์หมา แต่ตอนนี้ยังนึกไม่ออก (มาถึงวันที่พิมพ์นี่ก็พอจะนึกออกแล้วว่าอาจจะเป็นลูกผสมของ iannnnnPNG กับแม่ไก่ก็ได้ ทดไว้เท่านี้พอ)</p>\n\n\n\n<p>ลูกเลยเสนอว่า หนูขอชื่อ<strong>ฟอนต์หมู</strong></p>\n\n\n\n<p>ได้ ฟอนต์หมู เจอกัน ตัวถัดไปนี้เลย!</p>\n\n\n\n<p>––––––––––––––––––––––––––––––––</p>\n\n\n\n<p><strong>Post-credits scene</strong> : สุดท้ายนี้ ขอฝากฟอนต์แม่ไก่ในอ้อมอกอ้อมใจทุกคนที่ผ่านมาอ่านด้วยนะครับ (น่าจะประมาณ 3 คน) และฝากฟอนต์ exclusive เป็นแม่ไก่นุ่มพิเศษ 3 น้ำหนักเท่ากัน แต่มุมมน ก็จะนุ่มน่ารักขึ้นไปอีก ซึ่งเซ็ตพิเศษนี้ไม่ได้แจกฟรี ถ้าชอบก็สามารถ donate เท่าไหร่ก็ได้ เดี๋ยวผมจะส่งแม่ไก่นุ่มให้เป็นการสมน้ำหน้าคุณครับ</p>\n\n\n\n<figure>\n<figure><img loading=\"lazy\" width=\"1800\" height=\"1800\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98.png 1800w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98-300x300.png 300w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98-1024x1024.png 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98-250x250.png 250w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98-768x768.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-98-1536x1536.png 1536w\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1800\" height=\"1800\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99.png\" alt=\"\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99.png 1800w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99-300x300.png 300w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99-1024x1024.png 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99-250x250.png 250w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99-768x768.png 768w, https://iannnnn.com/wordpress/wp-content/uploads/2025/06/iannnnn-HEN-99-1536x1536.png 1536w\" /></figure>\n</figure>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"a55a5252677fdd02123cb9a02064b57de9df4ff78d634644b10db5286a08f4a7","category":"Thai"}