{"title":"ฝึกสมองให้เรียกโชค","link":"https://markpeak.net/boost-your-brain-for-luck-book/","date":1758424518000,"content":"<p>เมื่อไม่นานมานี้ หมอผิง ธิดากานต์ ส่งหนังสือเล่มใหม่ “ฝึกสมองให้เรียกโชค” มาให้อ่าน (ขอบคุณฮับ )</p>\n<p>ทุกคนคงรู้จักหมอผิง <a href=\"https://x.com/thidakarn\">@thidakarn</a> ในฐานะหมอชื่อดังบน Twitter ที่มีคนฟอลโลว์เกือบล้าน (ย้ำว่าอีกนิดนึงจะถึงล้าน) มีรายการพ็อดแคสต์และคอนเทนต์อื่นๆ มากมาย หมอผิงนั้นทั้งสวยทั้งเก่ง ความรู้แน่น สื่อสารเยี่ยม ไม่น่าแปลกใจอะไรที่คนติดตามเยอะขนาดนี้</p>\n<p>ส่วนตัวแล้ว ผมรู้จักกับหมอผิง ธิดากานต์ มานาน น่าจะเกินสิบปี ครั้งแรกที่ได้คุยคือกระแส wearable computing กำลังเริ่มมา ตอนนั้น Blognone อยากจัดงานสัมมนาเรื่องนี้ ในฐานะคนสายไอทีเลยอยากได้คนสายการแพทย์มาร่วมเวทีด้วย และมีคนแนะนำหมอผิง ในฐานะหมอดาวรุ่งที่สนใจเรื่องไอทีด้วย</p>\n<p>ครั้งแรกที่เจอหมอผิง ผมคิดในใจว่า “หมอสวยจัง” (555) แต่หลังจากนั้นก็พบว่าหมอ “เนิร์ดมาก” ในด้านการแพทย์ (555) และเมื่อหลายปีก่อนมีโอกาสได้ดูงานสาย healthtech ที่ประเทศจีนด้วยกัน เลยยิ่งพบว่าหมอตั้งใจมากๆ วันสุดท้ายก่อนเดินทางกลับไทย มีเวลาว่างนิดๆ หน่อยๆ ตอนเช้า หมอขอไปเดินตามหา “ตู้พบแพทย์ออนไลน์” ที่มหาวิทยาลัยในเซี่ยงไฮ้เพิ่มเป็นพิเศษ เราเดินตามหาตู้นั้นกันทั่วมหาวิทยาลัยจนเหนื่อย (เพราะหลงทาง ถามยามก็ไม่มีใครรู้จัก 555) แต่ก็แสดงให้เห็นว่าหมอตั้งใจจริงๆ ไปถึงถิ่นแล้วขอไปดูของจริงว่ามันหน้าตาเป็นอย่างไร</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2025/09/telemed-booth.webp\" alt=\"\" width=\"800\" height=\"600\" srcset=\"https://markpeak.net/wp-content/uploads/2025/09/telemed-booth.webp 800w, https://markpeak.net/wp-content/uploads/2025/09/telemed-booth-300x225.webp 300w, https://markpeak.net/wp-content/uploads/2025/09/telemed-booth-768x576.webp 768w, https://markpeak.net/wp-content/uploads/2025/09/telemed-booth-700x525.webp 700w\" /></p>\n<p>หนังสือเล่มใหม่ของหมอผิงมีชื่อภาษาอังกฤษว่า Boost Your Brain for Luck ชื่อเหมือนหนังสือใบ้หวย 555 แต่อย่าให้ชื่อหนังสือหลอกเอาได้ครับ เพราะจริงๆ แล้วมันเป็นหนังสือ “วิทยาศาสตร์สมอง”</p>\n<p>เนื้อหาของหนังสืออาจก้ำกึ่งไปทางหนังสือ howto แนว “ปรับ mindset แล้วชีวิตจะดีขึ้น” ที่วางขายกันแพร่หลายในทุกวันนี้ แต่เพิ่มการอธิบายหลักการทำงานของสมองในเชิงการแพทย์เข้ามา บวกกับการเล่าประสบการณ์ส่วนตัวของหมอผิงเอง ว่าเคยใช้หลักการนั้นอย่างไร แล้วเกิดผลอะไรบ้าง (ทั้งสำเร็จและล้มเหลว)</p>\n<p>แกนหลักของหนังสือคือการบอกว่า “โชค” นั้นจะวิ่งเข้าหาคนที่เตรียมตัว คนที่ขวนขวาย ถ้าอธิบายเป็นภาษาอังกฤษน่าจะเป็นคำว่า Luck Surface Area คือคนที่สร้างพื้นที่ “รับโชค” ให้ตัวเองเยอะเท่าไร ยิ่งมีโอกาสจะพบเจอโชคมากขึ้นเท่านั้น</p>\n<p>คำถามถัดมาคือ เราจะฝึกสมองของเราเองอย่างไร เพื่อให้ไปถึงจุดนั้น ตัวอย่างในหนังสือกล่าวถึงหลักการทางสมองหลายรูปแบบ เช่น</p>\n<ul>\n<li>manifestation การจินตนาการถึงเป้าหมาย เพื่อกระตุ้นให้ตัวเองมุมานะไปถึงจุดนั้น</li>\n<li>hindsight bias การกล่าวโทษตัวเองว่าเป็นต้นเหตุของความผิดพลาดในอดีต</li>\n<li>inner voice กำจัดเสียงลบออกจากหัว เพิ่มเสียงทางบวก</li>\n<li>the strength of weak ties ความสัมพันธ์แบบหลวมๆ ที่อาจนำมาซึ่งโอกาสใหม่ๆ ในชีวิต เช่น เราได้งานจากเพื่อนของรุ่นพี่ที่เคยพบกันแค่ครั้งเดียว</li>\n<li>flow state ภาวะลื่นไหลของสมอง</li>\n<li>willpower การสร้างรูทีนเพื่อเพิ่มพลังใจ</li>\n<li>การทำให้คนชอบเรา ด้วยการทำให้สมองส่วน medial prefrontal cortex (mPFC) ของเขาชอบเรา</li>\n<li>การพักสมองตามหลักของร่างกาย circadian rhythm และ ultradian rhythm</li>\n</ul>\n<p>พอมาเขียนแต่ศัพท์เทคนิคแบบนี้แล้วมันอาจดูยาก แต่จริงๆ แล้วหนังสืออ่านง่ายมากนะครับ หมอผิงมีวิธีการเล่าที่สามารถ relate กับผู้อ่านได้ดีมาก (เหมือนเรามีพี่สาวเป็นหมอใจดี แล้วมาเล่าให้น้องฟัง) และมีการย่อยประเด็นสร้างเป็น actions ที่สามารถนำไปปฏิบัติตามได้ง่ายด้วย</p>\n<p>หนังสือเล่มเล็ก ไม่ยาว อ่านง่าย ใช้เวลาไม่นาน ผมใช้เวลาอ่านก่อนนอนประมาณ 2 คืนก็จบ แล้วคิดว่าเหมาะมากสำหรับผู้อ่านในวัยเรียนมหาวิทยาลัย-เริ่มต้นทำงานใหม่ๆ เพื่อเป็นแนวทางการสร้างลักษณะนิสัยที่ดีในชีวิตต่อไป</p>\n<p>แนะนำครับ</p>The post <a href=\"https://markpeak.net/boost-your-brain-for-luck-book/\">ฝึกสมองให้เรียกโชค</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"a67718e05e58712a78f08b8c6685d051b72489490a4419666198e96914144904","category":"Thai"}