{"title":"‘We’ve got a big job to keep the standard up’ — The adventure begins as the Hincapies’ team light up their first race","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/we-ve-got-a-big-job-to-keep-the-standard-up-the-adventure-begins-as-the-hincapies-team-lights-up-their-first-race","date":1769960545000,"content":"\n      <p><span>January is the time to get to grips with all the changes that have taken place in the off season. New sponsors replace the outgoing, kit designs change, and the cyclists wearing those kits jump from one squad to another. However, often these are subtle adjustments. </span></p>\n<p><span>Brand new teams don’t come around all that often — it’s not unheard of, but it certainly isn’t the norm. So, the sight of the burgundy and gold of Modern Adventure in and amongst the peloton at their first ever race the AlUla Tour, certainly caught the eye.</span></p>\n<p><span>It was last February, out on a bike ride, when George Hincapie proposed the idea of an American based team to his friend, Bobby Julich. Initially Julich didn’t know what to make of his former teammate’s suggestion. It wasn’t that Julich wasn’t taking Hincapie seriously, but rather he didn't know whether the sport would take </span><em>them</em><span> seriously. Would they have the financial backing? Would they be invited to races? Would they be able to attract riders?</span></p>\n<p><span>However, the evidence over the past few months suggests they will not only survive but thrive in professional cycling; they have six years of backing, they have a string of top race invites, they have created a healthy environment in the team and on top of that they are already performing.</span></p>\n<p><span>On stage five to the </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-climbs-are-always-a-shock-early-season-summit-finishes-and-the-changing-landscape-of-the-cycling-calendar?tag=member\"><span>Skyviews of Harrat Uwayrid</span></a><span> the South African, Byron Munton finished second behind Jan Christen from the world’s best team, UAE Team Emirates-XRG. But the success for Modern Adventure didn’t end there — Munton’s compatriot Stefan de Bod took fourth place overall at the Saudi race. </span></p>\n<p><span>At the finish of the last stage, Munton spoke to </span><em>Rouleur</em><span>: “The team was incredible. The whole day, protecting Stefan and me. Stefan for GC and myself potentially for stage.”</span></p>\n<p><span>The final stage and overall GC result was more than the team had expected at their debut outing and the excitement around the team was palpable.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20260128ALT1004-ASO_Tony_Esnault_1_1024x1024.jpg?v=1769959752\" alt=\"\" /></div>\n<p><span></span><em>Modern Adventure had a productive start to life at the AlUla Tour (Image: ASO / Tony Esnault)</em></p>\n<p><span>“We definitely didn't come into this week being results driven,” explained Munton’s teammate, Mark Stewart at the finish. “We haven't come into this year being results driven. We're trying to set a standard for the team, through the amount of investment and support that we've received thus far — we're a month into the season. We are setting a standard for us riders and also from the management, from the sponsors, from the sports directors. The amount of support we've received has allowed us to go into the races in the right place as a team and in the right place as a professional outfit. </span></p>\n<p><span>“To top off today with second on the stage, and fourth on GC feels right for the amount of work we've put in all week,” said Stewart. The 31-year-old from Dundee explained that Hincapie and Julich have put their faith in the group and have told them to focus on the pillars of performance rather than getting bogged down in details. </span></p>\n<p><span>This includes their approach to racing. Another teammate, Riley Pickrell, 24 from Canada told </span><span><em>Rouleur</em> </span><span>that the riders have been given the freedom to learn to race and not be obliged to go into fruitless breakaways in order to get their sponsors some exposure. </span></p>\n<p><span>“We looked at how we wanted to race as a team for this first race and for the team's existence,” said Pickrell. “We didn't want to be another pro team that was just going in early breaks, and was kind of a TV team. We came in and we said ‘hey, we want to be what the other top pro teams are’. We want to be like the Q36.5, like Cofidis and we want to race like a real solid team.”</span><b></b></p>\n<p><span>They have done more than that this week at the AlUla Tour. Munton admitted that despite not expecting or relying on the results at the Saudi race, it acts as the perfect springboard for the rest of their season.</span><b></b></p>\n<p><span>“Everyday the level just gets higher. So, we've got quite a big job to keep the standard up, moving forward,” said Munton.</span><b></b></p>\n<p><span>It’s a team that is doing things a little differently and the proof is already apparent: different approaches can produce the same results. Now onto the squad’s first WorldTour race, the UAE Tour. The adventure has only just begun. </span></p>\n<p><em>Cover Image: Dario Belingheri / Getty Images</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a6d2d77051331c7798c0bda0efd4e0e6b6181e56d2fee669c2232a2cbe79bf25","category":"Cycling"}