{"title":"New Bike Day - Moots Trade-Up Program!","link":"https://moots.com/blogs/news/new-bike-day-moots-trade-up-program","date":1739344138000,"content":"\n      <figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/tradeup-header-e1713292540605.jpg?v=1762207590\" alt=\"\" /></figure>\n<p>It’s true, we build bicycles to last a lifetime. There’s no doubt that many of the beloved products we’ve produced since 1981 still make riders smile, 20 and 30 years later. And while Moots owners will tell you they absolutely love their bike, some are curious about how a new premium tubeset, a new geometry, disc brakes, more tire clearance, or an updated parts kit would bring them an entirely new riding joy!</p>\n<p>Introducing our “Trade-Up” program - a way for us at Moots to acknowledge the love you have for your bike, and to share our passion of chasing perfection with new bike designs, materials, and updated technology.</p>\n<p>We offer Moots owners an opportunity to turn their existing, rideable frame, into a $2,000 credit towards a complete bike direct from your local Moots dealer or directly from Moots.</p>\n<p>This program applies whether you’re the original owner, or not. There are no model or production year restrictions!</p>\n<p> </p>\n<h3><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/s-l1600.jpg?v=1762207609\" alt=\"\" /></h3>\n<h3>How it works:</h3>\n<ol>\n<li>\n<p>Inspect your frame - <strong>it must be free of cracked welds or large dents</strong>. (FYI - There’s a second, detailed inspection later in the process, so be diligent!)</p>\n</li>\n<li>Go into your local dealer and speak to a sales representative about the Moots tradeup program. Our dealers are dialed in on the tradeup program and will walk you down the path of your next Moots. Please see our dealer locator to identify a dealer in your area. If there is not a dealer nearby, we are always here for and you can reach us at <a href=\"mailto:tradeup@moots.com\">tradeup@moots.com</a>.</li>\n<li>\n<p>We’ll have a look and give you the thumbs up to ship us your bike. Or we’ll explain why we’re unable to offer you a credit.</p>\n</li>\n<li>\n<p>Ship us your frame (or complete bike - see FAQ below)</p>\n</li>\n<li>\n<p>We’ll communicate receipt of your bike and status of your credit via email. Once everything is inspected, we’ll apply your $2,000 credit at the close of purchase of your new bike - if your bike doesn't qualify for the program,</p>\nwe'll ship it back to you at our cost. </li>\n</ol>\n<p>Ship to:</p>\n<p> </p>\n<p>Moots - TradeUp</p>\n<p> </p>\n<p>2545 Copper Ridge Dr</p>\n<p> </p>\n<p>Steamboat Springs, CO80487</p>\n<p><strong>FAQ</strong></p>\n<p>If I send my complete bike, will I get the parts back?</p>\n<ul>\n<li>\n<p>No! If you want to keep your parts kit (wheels, drivetrain, brakes, etc.), the frame should be stripped. We will not disassemble your bike and return your parts. We will not disassemble your bike and hold your parts for you to come pick up. Whatever you send us, we're assuming you'll never want to see it again! There is no going back on this so please take time to consider your future wants!</p>\n</li>\n</ul>\n<h3>What if I’m not the original owner?</h3>\n<ul>\n<li>\n<p>Not a problem, we don’t require any receipts or paperwork to credit you towards your purchase of a new complete bike.</p>\n</li>\n</ul>\n<h3>Can I trade in my frame for cash?</h3>\n<ul>\n<li>\n<p>This program is designed to reward passionate Moots fans. The aim is to offer a credit towards an updated model for the “refresh button” on ride experiences…sorry, no cash value.</p>\n</li>\n</ul>\n<h3>Do I have to purchase a complete bike?</h3>\n<ul>\n<li>\n<p>Yeah, that’s the deal. No sugar coating here.</p>\n</li>\n</ul>\n<p>My bike is worth more than $2,000 in the used bike market - will Moots give me more credit?</p>\n<ul>\n<li>\n<p>If your bike is worth more than the $2,000 we offer, we encourage you to look to reputable 3rd-party marketplaces like TPC and Bicycle Blue Book to get the most of your bike. Also check with your local retailer to see if they have a used bike program. We can only hope you’ll put that scratch towards a new Moots!</p>\n</li>\n</ul>\n<h3>Does this program apply if I want to buy a Moots from my local shop?</h3>\n<ul>\n<li>\n<p>Yes!</p>\n<p>Moots retailers are the backbone of our 43-year heritage! If you love your local Moots dealer,</p>\n<p>they can share the program details and you can purchase your new Moots locally.</p>\n<p>They can email tradeup@moots.com, or talk to their sales rep. Regardless if you work with us directly, or your local retailer, the Moots Trade-Up program only applies to complete bike purchases.</p>\n</li>\n</ul>\n<h3>Can this credit be applied to a frame or frameset?</h3>\n<ul>\n<li>\n<p>At the moment, the $2,000 credit applies to complete bike purchases only. As this program evolves over time, we’ll explore how it might include frame and frameset purchases.</p>\n</li>\n</ul>\n<p>Am I guaranteed credit?</p>\n<ul>\n<li>\n<p>There are no guarantees in life! But if you did a good job inspecting your frame and there are no cracks or large dents….yeah, it’s pretty much a sure thing! If we communicate that we can’t offer you a credit, there will be a very clear reason why. We truly want riders on our latest and greatest bikes and will do everything we can to make that happen! And, we'll ship it back to you.</p>\n</li>\n</ul>\n<h3>Does this program apply to Express eBike models?</h3>\n<ul>\n<li>\n<p>Of course! A Moots is a Moots! The goal is to support our dedicated fan base with bikes they love and want, and we’re stoked to have two incredible ebikes to offer!</p>\n</li>\n</ul>\n<p>I see there are closeout bikes on the Moots site, can I use this credit towards the purchase of a discounted bike?</p>\n<ul>\n<li>\n<p>No, this offer only applies to new orders and is not applicable to any items that have already been discounted.</p>\n</li>\n</ul>\n<h3>What happens to my Moots once it’s been accepted for the Trade Up program?</h3>\n<ul>\n<li>\n<p>Some of the Trade Up bikes end up in our museum here in Steamboat Springs, Colorado. Others get refurbished and are placed in retail partner locations, or collaboration projects with some of our favorite companies. In short, they tell a story that can be shared across the world!</p>\n</li>\n</ul>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"a82f109b7f187d56f0bcba892f344ce54bc9304b2bbb03dbc5b16e5f10b23bd0","category":"Cycling"}