{"title":"‘Beauty and diversity’ on display: will the 2027 UK Grands Départs deliver sporting drama?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/beauty-and-diversity-on-display-but-will-the-2027-uk-grand-departs-deliver-sporting-drama","date":1768579776000,"content":"\n      <p><span>The world’s most iconic cycling race will turn its spotlight northward in what is sure to be a vibrant festival of cycling as the </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\"><span>Tour de France</span></a><span> and the </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\" target=\"_blank\"><span>Tour de France Femmes avec Zwift</span></a><span> will be coming to the UK in 2027. It will be the first time that the opening stages of both the men’s and women’s Tours have been hosted by the same country outside France.</span><b></b></p>\n<p><span>Together, these six days of British racing promise to be among the largest free sporting spectacles in UK history — a celebration of elite competition, grassroots inspiration and cycling’s outreach. There is hope <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-tour-de-france-is-coming-to-the-uk-can-the-world-s-biggest-bike-race-revive-a-dwindling-domestic-racing-scene?srsltid=AfmBOoq_7A3DtjTHsnawL9myfqVZIC2rFCLwOcbep_15xM-7hsECfAiB\" target=\"_blank\">the event can kickstart the UK racing scene once again</a>.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF27_GrandDepart_GreatBritain_1024x1024.jpg?v=1768575856\" alt=\"\" /></div>\n<p><em>The Tour de France UK Grand Départ in 2027 (Map: ASO)</em></p>\n<p><span>With fond memories of the Yorkshire <em>Grand Départ</em> in 2014, the director of the men’s race, Christian Prudhomme, said: “The UK has always welcomed the Tour with passion and pride, and the route details we are revealing today reflect the beauty and diversity of Britain’s terrain. Bringing both <em>Grands Départs</em> here is a testament to the strength of our partnership with British Cycling and the enthusiasm of the UK.”</span></p>\n<p><span>In an echo of the men's race 11 years ago, the women's race will see its early action take place in Yorkshire.</span></p>\n<p>Marion Rousse, director, Tour de France Femmes avec Zwift, said: “The United Kingdom has played an important role in the history of women’s cycling, with champions such as Lizzie Armitstead-Deignan. Starting the Tour de France Femmes avec Zwift in Leeds is a strong choice, closely linked to this heritage and to the enthusiasm of a public that knows and loves the Tour. These stages clearly reflect the race’s ambition: to continue growing women’s cycling and to inspire future generations.” </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_1_20c8892d-bf23-4140-92bf-e663d3582bcb.png?v=1768576822\" alt=\"\" /></p>\n<p><em>The Tour de France Femmes avec Zwift UK Grand Départ in 2027 (Map: ASO)</em></p>\n<p><span>Like in 2014, it’s sure to be a fantastic atmosphere at all of the six UK stages in 18 month’s time, but what of the routes themselves? </span></p>\n<h4><span>Castles and National Parks </span></h4>\n<p><span>For the men’s race, the road to Paris begins in Edinburgh on 2 July, winding across Scotland, the Lake District and northwest England, and culminating in a gruelling Welsh finale in Cardiff that showcases the UK’s diverse terrain.</span></p>\n<ul>\n<li>\n<p><span>Friday 2 July: stage one: Edinburgh to Carlisle - 184km</span></p>\n</li>\n<li>\n<p><span>Saturday 3 July: stage two: Keswick to Liverpool - 223km</span></p>\n</li>\n<li>\n<p><span>Sunday 4 July: stage three: Welshpool to Cardiff - 223km</span></p>\n</li>\n</ul>\n<p><span>When I first heard that the <em>Grand Départ</em> was to be in Edinburgh I was thrilled. As a Scot who used to live in the Scottish capital, I have spent a lot of time on bike in and around the city. I got ahead of myself and started thinking of the potential for a route starting in Edinburgh taking in Glasgow, the biggest city in the country (and also where I spent my undergraduate university days), and returning back across the Central Belt to finish for a grandstand finish up the Royal Mile to Edinburgh Castle.</span></p>\n<p><strong><em>Read more: <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/cobbles-climbs-and-corners-this-is-what-the-edinburgh-tour-de-france-stage-finish-should-be?tag=member\" target=\"_blank\">Cobbles, climbs and corners: This is what the Edinburgh Tour stage finishes should be</a></em></strong></p>\n<p>The Tour has opted for some punchy opening stages in the past five years and using Edinburgh's many steep, cobbled lanes would have provided a mouthwatering Classics-style start to the 2027, in a route not dissimilar to the Montmartre stage at last year's race, which saw <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-work-of-aert-the-tour-de-france-concludes-with-a-worthy-stage-winner?tag=member\" target=\"_blank\">Wout van Aert and Tadej Pogačar's epic duel</a>.</p>\n<p><em><strong>Read more: <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/stress-or-spectacle-should-the-montmartre-climb-be-included-in-the-tour-de-france-finale?tag=member\" target=\"_blank\">Stress or spectacle - Should the Montmartre climb be included in the Tour de France finale?</a></strong></em></p>\n<p>But alas, it was not to be. The stage will start in Scotland and finish in Carlisle in what will be a stage that will likely go to a sprinter, with only one categorised climb on the <em>parcours. </em><em></em>As much as it will be exciting to see the world's best on home roads, I feel this stage could have offered more and shown off the challenging terrain in and around Edinburgh.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF27_GrandDepart_S1_profile_1024x1024.jpg?v=1768576685\" alt=\"\" /></div>\n<p><em>The 2027 Tour de France parcours (Map: ASO)</em></p>\n<p>However, an aspect to consider is that the organisers have tried to limit long transfers for the riders. We can hardly blame them for this — in the past riders have complained of having to sit on their team buses for hours before and after stages. During the press conference, Prudhomme said it was something they took into account when designing the route.</p>\n<p>Stage two from Keswick to Liverpool welcomes in some more aggressive climbing through the Lake District and Lancashire. It could be one for a Classics-style rider, an extra strong breakaway or a sprinter with the fitness to keep up on the lumps on the route.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF27_GrandDepart_S2_profile_1024x1024.jpg?v=1768577389\" alt=\"\" /></div>\n<p><em>The 2027 Tour de France stage two parcours (Map: ASO)</em></p>\n<p>Stage three from Welshpool to Cardiff is when things really start getting tasty. The eight categorised climbs, including ascents up Rhigos and a final challenge over Caerphilly Mountain, will be a testing a nervy day for all – especially the GC contenders. I currently live in Cardiff, so I was particularly pleased to see the inclusion of some major climbing tests in the South Wales area, ascents I have suffered up on my bike myself. For me, this is where the men's race has really made the most of the landscape on offer. If the first stage from Edinburgh was a slight disappointment in terms of <em>parcours</em>, the stage in Wales has made up for it.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF27_GrandDepart_S3_profile_1024x1024.jpg?v=1768577654\" alt=\"\" /></div>\n<p><em>The 2027 Tour de France stage three parcours (Map: ASO)</em></p>\n<h4>Le Retour dans le Yorkshire</h4>\n<p>A few weeks later on July 30, the Tour de France Femmes avec Zwift will start in Leeds, heading to Manchester for a likely sprint finish, before a punchy stage from Manchester to Sheffield, before a conclusion to the UK segment in a stage in London. It’s the first visit of the women’s Tour to the UK.</p>\n<ul>\n<li>\n<p><span>Friday 30 July: stage one: Leeds to Manchester </span></p>\n</li>\n<li>\n<p><span>Saturday 31 July: stage two: Manchester to Sheffield </span></p>\n</li>\n<li>\n<p><span>Sunday 1 August: stage three: London </span></p>\n</li>\n</ul>\n<p>The specifics of the stages were not revealed, but Rousse admitted that the first stage to Manchester will likely end in a sprint and the second being a punchier affair. Then we can assume the stage in London could be another sprint finish in around the landmarks of the capital.</p>\n<p>At the end of the day, it is the riders who make the race and the fans who make the atmosphere. Cycling is unique in its appeal — free to spectate, crowds amassing to see a split second of action, all for the love of the culture and the history of the sport. Roll on 2027.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1500x1000_1_1024x1024.png?v=1768578288\" alt=\"\" /></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a93bfdd9b69244c8969a77415a8c77b506eb9ee207ecaf13efa842eb4f0f9cf5","category":"Cycling"}