{"title":"Apple Reports Record-Breaking Revenue and Profit for Q1 FY26","link":"https://www.apple.com/newsroom/2026/01/apple-reports-first-quarter-results/","date":1769803021000,"content":"\n<p>Apple Newsroom, yesterday:</p>\n\n<blockquote>\n  <p>“Today, Apple is proud to report a remarkable, record-breaking\nquarter, with revenue of $143.8 billion, up 16 percent from a year\nago and well above our expectations,” said Tim Cook, Apple’s CEO.\n“iPhone had its best-ever quarter driven by unprecedented demand,\nwith all-time records across every geographic segment, and\nServices also achieved an all-time revenue record, up 14 percent\nfrom a year ago. We are also excited to announce that our\ninstalled base now has more than 2.5 billion active devices, which\nis a testament to incredible customer satisfaction for the very\nbest products and services in the world.”</p>\n\n<p>“During the December quarter, our record business performance and\nstrong margins led to EPS growth of 19 percent, setting a new\nall-time EPS record,” said Kevan Parekh, Apple’s CFO. “These\nexceptionally strong results generated nearly $54 billion in\noperating cash flow, allowing us to return almost $32 billion to\nshareholders.”</p>\n</blockquote>\n\n<p>John Markoff, <a href=\"https://www.nytimes.com/2006/01/16/technology/michael-dell-should-eat-his-words-apple-chief-suggests.html?unlocked_article_code=1.IVA.y8q3.O6oeC_ygiktA\">writing for The New York Times 20 years ago</a>:</p>\n\n<blockquote>\n  <p>It may not be the last laugh, but on Friday afternoon, after the\nclose of the stock market, Steven P. Jobs, the chief executive of\nApple Computer, shared an e-mail chuckle with his employees at the\nexpense of Dell, a big rival.</p>\n\n<p>The message was prompted by the 12 percent surge in Apple’s stock\nprice last week, which pushed the company’s market capitalization\nto $72.13 billion, passing Dell’s value of $71.97 billion.</p>\n\n<p>In 1997, shortly after Mr. Jobs returned to Apple, the company he\nhelped start in 1976, Dell’s founder and chairman, Michael S.\nDell, was asked at a technology conference what might be done to\nfix Apple, then deeply troubled financially.</p>\n\n<p>“What would I do?” Mr. Dell said to an audience of several\nthousand information technology managers. “I’d shut it down and\ngive the money back to the shareholders.”</p>\n\n<p>On Friday, apparently savoring the moment, Mr. Jobs sent a brief\ne-mail message to Apple employees, which read: “Team, it turned\nout that Michael Dell wasn’t perfect at predicting the future.\nBased on today’s stock market close, Apple is worth more than\nDell. Stocks go up and down, and things may be different tomorrow,\nbut I thought it was worth a moment of reflection today. Steve.”</p>\n</blockquote>\n\n<p>Dell’s market cap today: $76 billion. <br />\nApple’s: $3,824 billion.</p>\n\n<p>Upton Sinclair coined the oft-cited maxim “It is difficult to get a man to understand something, when his salary depends on his not understanding it.” I propose a corollary: It is difficult to get a company to see that certain of its <a href=\"https://daringfireball.net/2026/01/resizing_windows_macos_26\">core competencies</a> are in <a href=\"https://daringfireball.net/2025/03/something_is_rotten_in_the_state_of_cupertino\">severe decline</a> when the company is making more money than ever.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/30/apple-reports-record-breaking-revenue-and-profit-for-q1-fy26\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a955bd6735a8e158229ebc81e05e10c5132dedbe1d44ed791644f7b2bade78e0","category":"Tech"}