{"title":"5 lessons from banking & finance: Why we need zero trust secrets management","link":"https://www.hashicorp.com/blog/5-lessons-from-banking-finance-why-we-need-zero-trust-secrets-management","date":1770224400000,"content":"<p>The banking industry spends about <a href=\"https://www.mckinsey.com/industries/financial-services/our-insights/global-banking-annual-review\">$600B</a> a year on technology, investing heavily in cloud, automation, and digital services. Today, mobile is the most widely used banking channel, making up <a href=\"https://www.aba.com/about-us/press-room/press-releases/consumer-survey-banking-methods-2024\">55%</a> of all banking transactions. And AI spending is expected to surge in the coming years, as business use cases are refined.</p>\n\n<p>Secrets (passwords, keys, certificates, and more) are ubiquitous in applications and services because they allow automated access to infrastructure, service communication, user access to funds, and general permissions to systems and data.</p>\n\n<p>If a secret falls into the wrong hands, it could lead to a costly breach. This is why secrets management is a business concern, not just a technical challenge.</p>\n\n<p>This post validates the emphasis on secrets management competency in the financial sector with several lessons from financial industry case studies.</p>\n\n<h2>Poor secrets management = higher risk</h2>\n\n<p>Bad actors continuously scan public repositories looking for credentials — that means you need to be <a href=\"https://www.hashicorp.com/en/products/vault/hcp-vault-radar?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_RISK_5-finance-lessons-blog_PRODUCTPAGE&amp;utm_content=intro-blog-cta&amp;utm_offer=product_page\">continuously scanning too</a>. When exposed credentials are found, they can be used for nefarious purposes such as stealing data, implanting malware, accessing unauthorized systems, performing restricted actions, and more. Poor secrets management practices are generally to blame for causing secrets to be exposed. The most common include:</p>\n\n<h3>Hard-coded credentials in code or artifacts</h3>\n\n<p>Inserting a credential directly in source code is fast and easy. When developers are under pressure (or simply working on a proof-of-concept), the quickest way to test their work is to hard-code credentials. Unfortunately, these can be easily forgotten and not removed before putting the code into production or storing an artifact in a public repository.</p>\n\n<h3>Long-living secrets</h3>\n\n<p>If credentials are valid for a long time or never rotated, the chance of a bad actor discovering and using them increases. It also means they can access the system for months or years exfiltrating data. This typically happens when lifecycle management controls break down or are nonexistent.</p>\n\n<h3>Broad access with excessive privileges</h3>\n\n<p>Some organizations lack the tooling and processes to manage secrets effectively. When this happens, they often use a shortcut by allowing many identities to access secrets and giving them excessive privileges. This can lead to significant risk. If a single developer credential is compromised, a bad actor can use those broad privileges to cause severe damage.</p>\n\n<h3>Secrets sprawl</h3>\n\n<p>Modern banks often run multiple clouds plus on-premises platforms. When secrets are stored in many places across the technology estate, they are hard to manage. This leads to governance gaps and inconsistent policies, increasing the chance that credentials can become exposed.</p>\n\n<h3>Accidental leakage</h3>\n\n<p>If not controlled, secrets can easily leak into build logs, CI/CD pipelines, messaging apps, and documentation without anyone’s knowledge.</p>\n\n<h3>Manual processes</h3>\n\n<p>If humans are involved in the management or rotation of secrets, the odds of a problem increase, both in terms of security and availability. High levels of manual rotation is error-prone and can bring down applications as well as cause exposure.</p>\n\n<p>Failure to address these issues can have severe consequences. Once a secret is compromised, attackers can operate as an authorized user, bypassing many traditional security controls. For instance, in the 2019 <a href=\"https://www.cnn.com/2019/07/29/business/capital-one-data-breach\">Capital One</a> breach, a misconfigured cloud environment allowed an attacker to obtain credentials that enabled access to sensitive data for more than 100 million customers. The 2023 data breach at <a href=\"https://cloudsecurityalliance.org/blog/2025/07/21/reflecting-on-the-2023-toyota-data-breach\">Toyota</a> was caused by human error, but it was made worse by not using the principle of least-privilege access, increasing the attack surface.</p>\n\n<h2>Lessons from the finance &amp; banking sector</h2>\n\n<p>Many banking and financial services companies have found solutions to these challenges that strengthen secrets management and adhere to strict regulatory requirements.</p>\n\n<h3>ABN AMRO</h3>\n\n<p><a href=\"https://www.hashicorp.com/en/case-studies/abn-amro\">ABN AMRO</a> uses dynamic secrets and secure integration patterns to confidently onboard applications to a container platform. By replacing static credentials with dynamic/<a href=\"https://www.hashicorp.com/en/blog/why-we-need-short-lived-credentials-and-how-to-adopt-them\">short-lived secrets</a> and integrating secrets delivery into <a href=\"https://www.hashicorp.com/en/resources/what-is-a-platform-team-and-why-do-we-need-them\">platform engineering</a>, teams no longer pass credentials manually, simplifying secrets management and reducing risk.</p>\n\n<blockquote>\n<p>“Secrets management is a business-critical element of our work because if any of the secrets are compromised, they'll have a huge downstream effect. Even a single compromised signing certificate can take an entire system offline, which means possibly losing access to online apps or exposing them to the risk of someone maliciously injecting something into the apps. There's really no room for error.”<br />— Ton van Dijk,  Agile Product Owner, ABN AMRO</p>\n</blockquote>\n\n<h3>BKB</h3>\n\n<p><a href=\"https://www.adfinis.com/en/case-studies/basler-kantonalbank\">Basler Kantonalbank</a> (BKB) moved to a centralized secrets management platform. By consolidating secrets governance into a central system and aligning controls to banking compliance needs, the company lowered risk and positioned the organization to meet ever-increasing requirements of FINMA.</p>\n\n<h3>Interac</h3>\n\n<p><a href=\"https://www.hashicorp.com/en/case-studies/interac\">Interac</a> implements infrastructure and connects microservices in a containerized development environment while automating secrets management for enhanced security across the enterprise.</p>\n\n<blockquote>\n<p>“<a href=\"https://www.hashicorp.com/en/products/vault?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_RISK_5-finance-lessons-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">HashiCorp Vault</a> is an integral part of our security posture because it helps to eliminate the possibility of mistakes in our secrets management that otherwise could occur because of even the smallest error.”<br />— Greg Kliewer, AVP of Architecture and Strategy, Interac</p>\n</blockquote>\n\n<h2>5 ways to reduce risk</h2>\n\n<h3>1. Stop hard-coding secrets</h3>\n\n<p>Revise policies and train developers on the risk of using hard-coded secrets. While this may not entirely stop the practice, it will help promote culture change. To further guard against this risk, use a <a href=\"https://www.hashicorp.com/en/products/vault/hcp-vault-radar?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_RISK_5-finance-lessons-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">secret scanning</a> tool to search repositories (public and private) on a regular basis and remove any hard-coded secrets that are found.  </p>\n\n<h3>2. Centralize secrets in a secure vault</h3>\n\n<p>Fragmented credential stores lead to distributed accountability, making secrets harder to secure and control and increasing risk. Placing secrets in a <a href=\"https://www.hashicorp.com/en/resources/5-best-practices-for-secrets-management\">centralized, secure vault</a> (such as HashiCorp Vault) allows for tighter access control, consistent policy enforcement, and easier auditing, decreasing the risk of credential exposure.</p>\n\n<h3>3. Shorten secret lifetimes and automate rotation</h3>\n\n<p>Don’t allow secrets to live long. Instead, shorten their lifetimes or TTL (time to live) and automatically rotate them. Where possible, use <a href=\"https://www.hashicorp.com/en/blog/rotated-vs-dynamic-secrets-which-should-you-use\">dynamic secrets</a> instead of static, or automated rotation that uses long timespans. Dynamic secrets are retrieved at runtime via secure API calls to lower risk even further.</p>\n\n<h3>4. Apply least privilege and separation of duties</h3>\n\n<p>Make sure to define permissions by role (developers, admins, workloads, etc.) and always grant least privilege access for the job responsibility. If a credential does become compromised, this limits the amount of damage a bad actor can actually do.</p>\n\n<h3>5. Continuously audit usage</h3>\n\n<p>Keep track of what is going on through continuous monitoring. Log secret access, alert on anomalies, and monitor compliance. This enables corrective action to be taken before a breach occurs.</p>\n\n<h1>Learn more</h1>\n\n<p>Secrets management is more than a technical concern in the banking industry; it directly affects financial risk, operational cost, and regulatory readiness. To learn more about the benefits of centralizing secrets management, read the <a href=\"https://www.hashicorp.com/en/resources/5-best-practices-for-secrets-management\">5 best practices for secrets management</a>.</p>\n\n<p>For more info info about how AI is going to affect risk management, read the business value study — <a href=\"https://www.ibm.com/thought-leadership/institute-business-value/en-us/report/banking-in-ai-era\">Banking in the AI era: The risk management of AI and with AI</a></p>\n","author":"Gene Likins","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"aa30010ff4b84911f80be8bb587ce413360b6a1a08d9c130d0b6eb06f1d3b457","category":"Tech"}