{"title":"Precision, Passion, and the Pursuit of the Perfect Ride","link":"https://moots.com/blogs/news/precision-passion-and-the-pursuit-of-the-perfect-ride","date":1762459620000,"content":"\n      <p><img src=\"https://moots.com/wp-content/uploads/2025/05/image6-1024x768.jpeg\" alt=\"\" width=\"856\" height=\"642\" /></p>\n<p>For George, the journey to Moots didn’t start with a marketing campaign or a showroom test ride—it began with a moment in his own repair stand. A Moots rolled in for service, and what caught his eye wasn’t flashy paint or radical geometry, but something far more rare: absolute precision. The welds, the fit, the finish—it was flawless. From that moment on, he knew one day he’d own a Moots.</p>\n<p>Fast forward, and George is now the proud rider of a custom Vamoots CRD finished in our stunning Groundswell anodizing, built with meticulous attention to every component. It’s a bike born from months of careful part selection, dialed for road speed, comfort, and long-haul confidence.</p>\n<p>But for George, riding a Moots is more than performance. It’s freedom. It’s connection. It’s the feeling you get when craftsmanship, community, and capability come together in a way few brands can offer. And this summer, George and his CRD are taking on the Tour de Stations, a 1000km bikepacking race across Switzerland with over 21,000 meters of climbing. In his words: <em>“It’s sure to push me and my bike to the limits—but hey, that’s what it’s all about.”</em></p>\n<p>Let’s dive into George’s story—from the spark of inspiration to the ride of a lifetime.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/image2-768x1024.jpeg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p><strong>1. What drew me to Moots… </strong></p>\n<p>It’s a collection of things really. The first time I saw a Moots was actually in my repair stand for a service - at the time I noticed the weld quality and the overall fit and finish of the bike was absolutely perfect. From then on it was always going to be the case that I would buy one.</p>\n<p><strong>2. Why did I pick the Vamoots CRD?</strong></p>\n<p>Being primarily a road rider, I prioritise speed, lightweight and comfort over long rides as well as having the rigidity needed when putting the hammer down! Having previously had a Trek Madone, I would say I was a little worried that it perhaps wouldn’t quite have the same level of performance or edge riding at speed - but having done plenty of solo 100 milers over 22 mph avg and having completed many a chaingang, I can say with confidence that box has been ticked. It could be due to the precision of the frame and how aligned everything is, or it could be that maybe aero isn’t everything and that rider comfort and fit play the biggest part to speed… who knows! The geometry is also probably the best I’ve ridden, providing a level of telepathy to the steering that while apexing a corner no other bike has given me, the feedback the frame gives you means you have absolute confidence in the line choice you take. It’s almost magic. No joke.</p>\n<p>Bottom line - I can say with confidence the reason why I picked this frame over anything else was probably the best decision I’ve made in terms of bike purchases.</p>\n<p><strong>3. How did I decide on finish?</strong></p>\n<p>Having ridden an Apex designed Routt CRD, I knew that having the frame anodised for me was the right choice - I quite like gold and deep purple/almost petrol colours, so Groundswell for me was the right choice and oh wow what a finish it is. When the sun hits it right, wow oh wow…</p>\n<p><strong>4. Did I customise the build?</strong></p>\n<p>Short answer, absolutely!</p>\n<p>Long answer, I took months finding parts for this bike, be it handlebars, bottom bracket (even down to the titanium bearing covers), cranks, seatpost… it was a long process but one that when I put everything together just worked and felt absolutely brilliant. I have a few different wheel sets for it of varying depths, each serving their purpose.</p>\n<p><strong>5. Any standout rides or adventures?</strong></p>\n<p>The first ride obviously was the one with the most excitement and anticipation, having waited a month or two for the frame and then subsequently building it up… That feeling still hasn’t really faded… Every single time I look at it I still think wow that’s a nice bike… I’m lucky to have this.</p>\n<p>The main event I’m doing on it this year is the Tour de Stations 1000km bike packing race, which you have to complete within 5 days. Over 21000 meters of climbing on some of the best cycling roads Switzerland has to offer. It’s sure to push me and my bike to the limits! But hey, that’s what it’s all about!</p>\n<p><strong>6. What does riding a Moots mean to me?</strong></p>\n<p>To answer that question, you first have to ask what does riding a bike mean to me. And to that I say Freedom. The ability to wake up at 5am and ride wherever the road takes you, to cover counties, countries or continents. Riding a bike gives you the ability to go wherever, whenever which is part of the reason we do it, right?</p>\n<p>But why on a Moots? Well, having ridden some of the world’s best bikes from the likes of Trek, Specialized and Giant. You start to look less at just the tech specs listed on a website, the weight of a frame, the aerodynamics. And more on the craftsmanship, precision and also the team of people that weld and finish the frames and the passion that they share for what they do. It’s that which I appreciate more and more. To be able to message the owner of Moots and say “Hey, when I come to Steamboat do you fancy going on a bike ride” and to get a response “Hey George, sure - let’s do it”. You don’t get that sort of response from many companies. But you do from Moots.</p>\n<p>So yes, I ride a bike for freedom, but I ride a Moots for the little things, things that over time you begin to appreciate more and more. And the team behind that, it all matters.</p>\n<p><strong>7. Three words to describe your bike. </strong></p>\n<p>Precise, comfortable, understated - just how it should be.</p>\n<p><strong>8. Tell us about your build! </strong></p>\n<ul>\n<li>Vamoots CRD Custom Geo Groundswell 53cm</li>\n<li>SRAM Red AXS E1 Groupset</li>\n<li>Reserve 42/49 or Reserve 52/63 or Cadex Max 40 depending on conditions</li>\n<li>5Dev Road/Gravel Ti Cranks in DLC Black</li>\n<li>ENVE AR One Piece Bars 38cm 130mm stem</li>\n<li>Gemini Alsak Seatpost with Fizik Argo 00 Adaptive</li>\n<li>Enduro XD15 T47 BB (DUB) with Titanium Dust Covers</li>\n<li>Titanium bolt kit from Better Bolts</li>\n<li>Moots Ti Cages (coming soon)!</li>\n</ul>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"aca818df6fc2b477d32c24958804edef2db7bbc7374843fc29ebf2c0caf505ca","category":"Cycling"}