{"title":"The Speed of Light is Constant","link":"https://markpeak.net/the-speed-of-light-is-constant/","date":1770350979000,"content":"<p>ช่วงหลังๆ เริ่มกลับมาศึกษา “ทฤษฎีสัมพัทธภาพ” (theory of relativity) ในเชิงลึกอีกครั้ง (นับจากที่เคยเรียนในวิชาฟิสิกส์) โดยเริ่มอ่านตัวข้อเสนอต้นฉบับของไอน์สไตน์ ซึ่ง<a href=\"https://bookscape.co/books/in-stock/science-of-everything/relativity\">สำนักพิมพ์ Bookscape เพิ่งนำมาแปลเป็นภาษาไทยเป็นครั้งแรก</a> และได้ อ.บัญชา ธนบุญสมบัติ เขียนบทอธิบายเป็นภาษาเข้าใจง่ายๆ ไว้ได้อย่างยอดเยี่ยมด้วย</p>\n<p>ความสำคัญของ ทฤษฎีสัมพัทธภาพ เป็นการ “กลับมุมคิด” ของแนวคิดเรื่องเวลาและอวกาศ (space and time) ซึ่งแหวกวิธีคิดแบบฟิสิกส์ดั้งเดิม (Newtonian physics) ไปอย่างมาก การพลิกวิธีคิดของไอน์สไตน์ถือว่าแหกทุกกฎดั้งเดิม แต่ช่วยให้เราสามารถอธิบายปรากฏการณ์ทางฟิสิกส์ได้อย่างถูกต้อง</p>\n<p>ในเปเปอร์ฉบับแรกของไอน์สไตน์ปี 1905 (ภายหลังเรียกกันว่า ทฤษฎีสัมพัทธภาพพิเศษ special relativity ก่อนขยายเป็น ทฤษฎีสัมพัทธภาพทั่วไป general relativity ในปี 1915) เขาได้เสนอ “มูลบท” (postulate) หรือฐานคิดแบบใหม่ ที่ขัดแย้งกับฟิสิกส์แบบดั้งเดิม 2 ข้อ คือ</p>\n<ol>\n<li>หลักสัมพัทธภาพ (principle of relativity) ที่บอกว่า กฎของฟิสิกส์จะเหมือนกัน สำหรับผู้สังเกตการณ์ใดๆ ที่เคลื่อนที่สม่ำเสมอสัมพัทธ์กัน</li>\n<li>ความเร็วแสงจะเท่ากันเสมอ ไม่ว่าจะสังเกตจากที่ไหน และไม่เกี่ยวกับการเคลื่อนที่ของผู้สังเกตด้วย</li>\n</ol>\n<p>โพสต์นี้จะสนใจเฉพาะข้อ 2 ที่ว่า ความเร็วแสงในสุญญากาศ (c) จะเท่ากันเสมอในทุกกรณี ซึ่งขัดแย้งสามัญสำนึก รวมถึงขัดแย้งกับฟิสิกส์แบบนิวตันเรื่อง “ความเร็วสัมพัทธ์” คนที่กำลังเคลื่อนที่อยู่จะสังเกตเห็นวัตถุวิ่งเร็วหรือช้ากว่าคนที่ยืนอยู่นิ่งๆ</p>\n<p>หลายคน (รวมถึงตัวผมด้วย) ก็คงสงสัยว่ามันเป็นเช่นนี้ได้อย่างไร</p>\n<p>คำอธิบายของนักฟิสิกส์ Richard Feynman ก็คือ แสง (รวมถึงคลื่นแม่เหล็กไฟฟ้าอื่นๆ) มันจะวิ่งที่ความเร็วคงที่ c หรือ 299,792,458 เมตร/วินาที เสมอ ต่อให้เราเคลื่อนที่ด้วยความเร็วสูงแค่ไหน (ที่ไม่มีทางเป็นไปได้ในทางปฏิบัติ แต่สามารถทำได้ใน thought experiment เช่น 99% ของความเร็วแสง) เราจะเห็นแสงวิ่งด้วยความเร็ว c อยู่ดี</p>\n<p>เป็นเพราะว่าแสงจะวิ่งด้วยความเร็วคงที่ แต่มิติเวลา (time) จะยืดออก (ภาษาฟิสิกส์เรียก <a href=\"https://en.wikipedia.org/wiki/Time_dilation\">time dilation</a>) และมิติอวกาศ (space) จะหดสั้นลง (<a href=\"https://en.wikipedia.org/wiki/Length_contraction\">length contraction</a>) แทน</p>\n<p>ตรงนี้จะขัดกับสามัญสำนึกและฟิสิกส์แบบดั้งเดิม ที่มองว่าเวลาและอวกาศเป็นสิ่งคงที่ ความเร็วเป็นสิ่งที่ไม่คงที่ (สัมพัทธ์ได้) แต่ฟิสิกส์แบบไอน์สไตน์กลับวิธีคิดกันอย่างสิ้นเชิง เวลาและอวกาศจะยืดหยุ่นเพื่อให้แสงยังวิ่งด้วยความเร็วเดิมอยู่ได้</p>\n<p>คลิปอธิบายจากเอกสารของ Feynman (เสียงในคลิปไม่ใช่เสียงของ Feynman จริงๆ)</p>\n<p></p>\n<p>เพราะอะไรถึงเป็นเช่นนั้น?</p>\n<p>Feynman บอกว่า “ไม่รู้” เราไม่รู้คำตอบของธรรมชาติว่าเป็นเพราะอะไร รู้แต่ว่า “แสง” คือส่วนหนึ่งของโครงสร้างของจักรวาล (the structure of universe) เป็นส่วนหนึ่งของเวลาและอวกาศ เป็นค่าคงที่ของจักรวาล (a structural constant of the universe) เป็นค่าคงที่ในการแปลงระหว่างเวลาและอวกาศ (a conversion factor of spacetime)</p>\n<p>Feynman บอกว่าวัตถุหนึ่งๆ สามารถเคลื่อนที่ผ่านมิติ กาลอวกาศ (spacetime) ได้จำกัดที่ค่าๆ หนึ่ง (ซึ่งค่านั้นคือความเร็วแสง c) หากเราเคลื่อนที่ผ่านอวกาศ (space) ด้วยความเร็วสูงเกือบเท่าแสง เราก็จะมีโควต้าสำหรับเคลื่อนที่ผ่านเวลา (time) น้อยลง ทำให้เวลาช้าลงนั่นเอง</p>\n<p>เพิ่มเติม: คลิปอธิบายเรื่อง “เวลา” ตามแต่ละยุค ตั้งแต่อดีตจนมาถึงยุคทฤษฎีสัมพัทธภาพ เล่าได้ละเอียดและอธิบายได้เห็นภาพดี แนะนำครับ</p>\n<p></p>The post <a href=\"https://markpeak.net/the-speed-of-light-is-constant/\">The Speed of Light is Constant</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"ae9c0a597859e7d2d974ea0949f89976c82b1117a566de33e452ae8e92434fe1","category":"Thai"}