{"title":"Designing For Stress And Emergency","link":"https://smashingmagazine.com/2025/11/designing-for-stress-emergency/","date":1763989200000,"content":"<p>No design exists in isolation. As designers, we often imagine specific situations in which people will use our product. It might be indeed quite common — but there will also be other — <strong>urgent, frustrating, stressful situations</strong>. And they are the ones that we rarely account for.</p>\n<p>So how do we account for such situations? How can we help people <strong>use our products while coping with stress</strong> — without adding to their cognitive load? Let’s take a closer look.</p>\nStudy Where Your Product Fits Into People’s Lives\n<p>When designing digital products, sometimes we get a bit too attached to our <strong>shiny new features and flows</strong> — often forgetting the messy reality in which these features and flows have to neatly fit. And often it means 10s of other products, 100s of other tabs, and 1000s of other emails.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-for-stress-and-emergency/1-designing-for-stress-and-emergency.jpg\" /></p>\n<p>If your customers have to use a <strong>slightly older machine</strong>, with a <em>smallish</em> 22\" screen and a lot of background noise, they might use your product differently than you might have imagined, e.g., splitting the screen into halves to see both views at the same time (as displayed above).</p>\n<p>Chances are high that our customers will use our product <strong>while doing something else</strong>, often with very little motivation, very little patience, plenty of urgent (and way more important) problems, and an unhealthy dose of stress. And that’s where our product must do its job well.</p>\nWhat Is Stress?\n<p>What exactly do we mean when we talk about “stress”? As H Locke noted, stress is the <strong>body’s response to a situation it cannot handle</strong>. There is a mismatch between what people can control, their own skills, and the challenge in front of them.</p>\n<p>If the situation seems unmanageable and the goal they want to achieve moves further away, it creates an enormous sense of <strong>failing</strong>. It can be extremely frustrating and demotivating.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-for-stress-and-emergency/2-designing-for-stress-and-emergency.jpg\" /></p>\n<p>Some failures have a local scope, but many have a <strong>far-reaching impact</strong>. Many people can’t choose the products they have to use for work, so when a tool fails repeatedly, causes frustration, or is unreliable, it affects the worker, the work, the colleagues, and processes within the organization. <strong>Fragility has a high cost</strong> — and so does frustration.</p>\nHow Stress Influences User Interactions\n<p>It’s not a big surprise: stress disrupts attention, memory, cognition, and decision-making. It makes it difficult to prioritize and draw logical conclusions. In times of stress, we <strong>rely on fast, intuitive judgments</strong>, not reasoning. Typically, it leads to instinctive responses based on established habits.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-for-stress-and-emergency/3-designing-for-stress-and-emergency.png\" /></p>\n<p>When users are in an emergency, they experience <em>cognitive tunneling</em> — it's a state when their peripheral vision narrows, reading comprehension drops, fine motor skills deteriorate, and patience drops sharply. Under pressure, people often make decisions hastily, while others get entirely paralyzed. Either way is a likely <strong>path to mistakes</strong> — often irreversible ones and often without time for extensive deliberations.</p>\n<p>Ideally, these decisions would be made way ahead of time — and then suggested when needed. But in practice, it’s not always possible. As it turns out, a good way to help people deal with stress is by <strong>providing order</strong> around how they manage it.</p>\nSingle-Tasking Instead Of Multi-Tasking\n<p><a href=\"https://consensus.app/search/how-effective-are-people-at-multi-tasking-for-work/9GEx-KC0S8-OhSEgXClnrA/\">People can’t <em>really</em> multi-task</a>, especially in very stressful situations or emergencies. Especially with a big chunk of work in front of them, people need some order to make progress, reliably. That’s why simpler pages usually work better than one big complex page.</p>\n<p>Order means giving users a <strong>clear plan of action</strong> to complete a task. No distractions, no unnecessary navigation. We ask simple questions and <strong>prompt simple actions</strong>, one after another, one thing at a time.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-for-stress-and-emergency/4-designing-for-stress-and-emergency.png\" /></p>\n<p>An example of the plan is the <a href=\"https://designnotes.blog.gov.uk/2017/04/04/weve-published-the-task-list-pattern/\">Task List Pattern</a>, invented by fine folks at Gov.uk. We break a task into a <strong>sequence of sub-tasks</strong>, describe them with actionable labels, assign statuses, and track progress.</p>\n<p>To support accuracy, we revise <strong>default settings</strong>, values, presets, and actions. Also, the <strong>order of actions</strong> and buttons matters, so we put high-priority things first to make them easier to find. Then we add built-in safeguards (e.g., Undo feature) to prevent irreversible errors.</p>\nSupporting In Emergencies\n<p>The most effective help during emergencies is to help people deal with the situation in a well-defined and effective way. That means being prepared for and designing an <strong>emergency mode</strong>, e.g., to activate instant alerts on emergency contacts, distribute pre-assigned tasks, and establish a line of communication.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-for-stress-and-emergency/5-designing-for-stress-and-emergency.jpg\" /></p>\n<p><a href=\"https://www.redcross.org.au/emergencies/prepare/get-prepared-app/\">Rediplan App</a> by Australian Red Cross is an emergency plan companion that encourages citizens to <strong>prepare their documents and belongings</strong> with a few checklists and actions — including key contracts, meeting places, and medical information, all in one place.</p>\nJust Enough Friction\n<p>Not all stress is equally harmful, though. As <a href=\"https://www.kryshiggins.com/optimal-onboarding-zone/\">Krystal Higgins points out</a>, if there is not enough friction when onboarding new users and the experience is <strong>too passive</strong> or users are hand-held even through the most basic tasks, you risk that they won’t realize the <strong>personal value</strong> they gain from the experience and, ultimately, lose interest.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-for-stress-and-emergency/6-designing-for-stress-and-emergency.png\" /></p>\nDesign And Test For Stress Cases\n<p><strong>Stress cases aren’t edge cases</strong>. We can’t predict the emotional state in which a user comes to our site or uses our product. A person looking for specific information on a hospital website or visiting a debt management website, for example, is most likely already stressed. Now, if the interface is overwhelming, it will only add to their cognitive load.</p>\n<p>Stress-testing your product is critical to prevent this from happening. It’s useful to set up an annual day to <strong>stress test your product</strong> and refine emergency responses. It could be as simple as running <a href=\"https://contentdesign.intuit.com/foundations/content-testing/\">content testing</a>, or running tests in a real, noisy, busy environment where users actually work — at peak times.</p>\n<p>And in case of emergencies, we need to check if fallbacks work as expected and if the current UX of the product helps people manage failures and exceptional situations well enough.</p>\nWrapping Up\n<p>Emergencies <em>will</em> happen eventually — it’s just a matter of time. With good design, we can help <strong>mitigate risk and control damage</strong>, and make it hard to make irreversible mistakes. At its heart, that’s what good UX is exceptionally good at.</p>\nKey Takeaways\n<p>People can’t multitask, especially in very stressful situations.</p>\n<ul>\n<li>Stress <strong>disrupts attention</strong>, memory, cognition, decision-making.</li>\n<li>Also, it’s <strong>difficult to prioritize</strong> and draw logical conclusions.</li>\n<li>Under stress, we rely on fast, intuitive judgments — not reasoning.</li>\n<li>It leads to instinctive responses based on <strong>established habits</strong>.</li>\n</ul>\n<p>Goal: Design flows that support focus and high accuracy.</p>\n<ul>\n<li>Start with better default settings, values, presets, and actions.</li>\n<li><strong>High-priority first</strong>: order of actions and buttons matters.</li>\n<li>Break complex tasks down into a series of simple steps (10s–30s each).</li>\n<li>Add built-in <strong>safeguards</strong> to prevent irreversible errors (Undo).</li>\n</ul>\n<p>Shift users to single-tasking: ask for one thing at a time.</p>\n<ul>\n<li><strong>Simpler pages</strong> might work better than one complex page.</li>\n<li>Suggest a <strong>step-by-step plan of action</strong> to follow along.</li>\n<li>Consider, design, and test flows for emergency responses ahead of time.</li>\n<li>Add emergency mode for <strong>instant alerts</strong> and task assignments.</li>\n</ul>\nMeet “How To Measure UX And Design Impact”\n<p>You can find more details on <strong>UX Strategy</strong> in 🪴 <a href=\"https://measure-ux.com/\"><strong>Measure UX &amp; Design Impact</strong></a> (8h), a practical guide for designers and UX leads to measure and show your UX impact on business. Use the code 🎟 <code>IMPACT</code> to save 20% off today. <a href=\"https://measure-ux.com/\">Jump to the details</a>.</p>\n\n\n    <a href=\"https://measure-ux.com/\">\n    <img src=\"https://files.smashing.media/articles/ux-metrics-video-course-release/measure-ux-and-design-impact-course.png\" />\n    </a>\n\n\n<div><div><ul><li><a href=\"#\">\nVideo + UX Training</a></li><li><a href=\"#\">Video only</a></li></ul><div><h3>Video + UX Training</h3>$ 495.00 $ 799.00\n<a href=\"https://smart-interface-design-patterns.thinkific.com/enroll/3081832?price_id=3951439\">\nGet Video + UX Training<div></div></a><p>25 video lessons (8h) + <a href=\"https://smashingconf.com/online-workshops/workshops/vitaly-friedman-impact-design/\">Live UX Training</a>.<br />100 days money-back-guarantee.</p></div><div><h3>Video only</h3><div>$ 250.00$ 395.00</div>\n<a href=\"https://smart-interface-design-patterns.thinkific.com/enroll/3081832?price_id=3950630\">\nGet the video course<div></div></a><p>25 video lessons (8h). Updated yearly.<br />Also available as a <a href=\"https://smart-interface-design-patterns.thinkific.com/enroll/3082557?price_id=3951421\">UX Bundle with 2 video courses.</a></p></div></div></div>\n\nUseful Resources\n<ul>\n<li>“<a href=\"https://medium.com/design-bootcamp/ux-case-study-standby-17000867133c\">Designing The SOS Emergency System</a>”, by Ritik Jayy</li>\n<li>“<a href=\"https://medium.com/net-magazine/designing-for-crisis-9cab10b4c519\">Designing For Crisis</a>”, by Eric Meyer</li>\n<li>“<a href=\"https://medium.com/designing-services/designing-for-stressed-out-users-part-1-4489793dbe41\">Designing For Stressed Out Users</a>” (Series), by H Locke</li>\n<li><a href=\"https://uxpodcast.com/293-life-death-design-katie-swindler/\">Designing For Stress</a> (Podcast), by Katie Swindler</li>\n<li><a href=\"https://www.linkedin.com/posts/vitalyfriedman_ux-design-activity-7167433494200066048-trWE\">Designing For Edge Cases and Exceptions</a>, by yours truly</li>\n<li><a href=\"https://dfrlbook.com/\"><em>Design For Real Life</em></a>, by Sara Wachter-Boettcher, Eric Mayer</li>\n<li>“<a href=\"https://www.kryshiggins.com/optimal-onboarding-zone/\">Optimal Stress Levels For Onboarding</a>, by Krystal Higgins</li>\n</ul>\n<h3>Further Reading</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2025/09/how-minimize-environmental-impact-website/\">How To Minimize The Environmental Impact Of Your Website</a>”, James Chudley</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2025/10/ai-ux-achieve-more-with-less/\">AI In UX: Achieve More With Less</a>”, Paul Boag</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2025/10/how-make-ux-research-hard-to-ignore/\">How To Make Your UX Research Hard To Ignore</a>”, Vitaly Friedman</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2025/09/from-prompt-to-partner-designing-custom-ai-assistant/\">From Prompt To Partner: Designing Your Custom AI Assistant</a>,” Lyndon Cerejo</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"afa5ab592706a61efe40178c995154a46014a2252c736ea548980c29770448ae","category":"Tech"}