{"title":"Aware of burnout, Jonas Vingegaard makes big changes: 'I have an energy I’ve not had for years'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/aware-of-burnout-jonas-vingegaard-makes-big-changes-i-have-an-energy-i-ve-not-had-for-years","date":1768328579000,"content":"\n      <p><span>As Jonas Vingegaard prepares to take on the Giro-Tour double in 2026 and become this generation’s first GC rider to claim all three Grand Tour titles, he presents himself as a rider reenergised and with a spring in his step. “I feel like I have motivation and a vibe that I’ve not had for a few years now,” he says. Which, he goes on to reveal, is in stark contrast to how he’s felt at different periods in the past few years. Referencing</span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/i-am-still-in-disbelief-simon-yates-on-the-maglia-rosa-redemption-and-what-s-next?srsltid=AfmBOopCVuw0V9TgcOqipSUhia4BTql_RAGSWUEselZNkzq8whWYUPqQ\"><span> Simon Yates</span></a><span>’s shock decision to retire, the Dane says that the Briton “lost his motivation. The sport is also very hard to be in for everyone. It’s a very demanding sport, and also for me I’ve been close to burning out. It is tough with all the altitude camps and everything. He made his decision and I have a lot of respect for him that when he felt it was enough he was going to stop.”</span><b></b></p>\n<p><span>That Vingegaard has been pushed into questioning his longevity in the sport should not come as a surprise. His wife, Trine, said that he was</span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/suck-it-up-the-harsh-reality-or-is-cycling-demanding-too-much-of-its-athletes?srsltid=AfmBOoopt4ymZR0YRWi1e058cgD59qmk5KDTzsao3aTp-Kb1smBJPwH5&amp;tag=member\"><span> “burning the candle at both ends”</span></a><span> on the eve of last year’s Tour de France, and a serious injury sustained in the spring of 2024 left the Visma-Lease a Bike star fearing for his life. It’s natural that he would have considered his future. But it’s still concerning to hear another one of the sport’s biggest figures warning that the requirements to compete at the highest echelons might just be a little too much. Tadej Pogačar</span><span>,</span><span> his eternal rival, has already spoken about the risk of burnout, as have many others. Now Vingegaard’s voice has joined the chorus.</span><b></b></p>\n<p><span>“We speak a lot about burnout at the moment in cycling,” the 29-year-old goes on, “because we push ourselves to the limit. You always need to be ready for a race. It’s not like in the past when you could come to a race to get in shape; now you come to a race and want to win it, so there’s obviously more pressure on all riders. I think for me personally it’s just about listening to who I am as a person and what I need. It’s something my wife really helps me with – to get to feel what I need and how I feel about it.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_47_1.png?v=1768328018\" alt=\"\" /><em>Vingegaard won last year's Vuelta a España ahead of his expected main rival at this season's Giro d'Italia: João Almeida.</em></span></p>\n<p><span>Focus on the topic typically tends to be centred on what teams can do to help their riders and to reduce the risk of athletes feeling overwhelmed. But Vingegaard says that it’s a two-way street. “I wouldn't give the teams the fault,” the two-time Tour de France winner says. “It’s also up to the riders to say to the team, ‘Listen, this is too much for me, I can’t handle it, we need to change something’. Obviously they are also demanding a lot from us and it’s hard to say to a team, ‘I can’t do this’, but it’s also about what Simon has done now: he’s thought about himself and what he needs to do… I’ve not always been able to [do that] and it’s why it’s been hard for me.”</span><b></b></p>\n<p><span>In an attempt to stave off a lack of motivation, Vingegaard has made significant changes to his 2026 calendar, chief among them riding the </span><a href=\"https://www.rouleur.cc/pages/giro-ditalia?srsltid=AfmBOopCAmSihFU7p9PWPx_WqIWoyCrRT6qsmnfXCSSGPM84Z91_O8z2\"><span>Giro d’Italia </span></a><span>before the</span><a href=\"https://www.rouleur.cc/pages/tour-de-france?srsltid=AfmBOorPqz5M26Gzb1pc77DzWohOQfyVsOk6TQlAI0P5N8x0LwxwB0k0\"><span> Tour de France</span></a><span>. The only other two races he’s slated to compete in are the UAE Tour and Volta a Catalunya. “I think I realised that if I keep doing that [having a similar season schedule] then I will have burnout, so obviously we needed to say, ‘OK, we have to do something differently’,” the reigning </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2025-latest-standings?srsltid=AfmBOopPGKp9xlJ8t8lwosomf9Tz8LwjQ1zFpFcLtJ9lcVY8Ns8Ud3SO\"><span>Vuelta a </span><span>España</span><span> champion </span></a><span>continues. “It’s something I spoke with the team about and it’s something that we really agreed upon. Two Grand Tours will be very demanding, but I also believe that if I did four races before the Giro then at the Tour I would be on my knees. That wouldn’t make sense so it’s why with doing the Giro and Tour I need a light program in the spring.”</span><b></b></p>\n<p><span>Sitting across from Vingegaard at his team’s media day in La Nucia, Spain, he portrays a genuine happiness and relaxed demeanour. “I’ve got more motivation because of doing this program,” he adds. “It’s keeping me motivated this way, and already it’s changed drastically. I’m not saying I was not motivated in the other years, but I feel a new energy. I believe going into the Tour I will also be more motivated as I would have done the Giro, a race I would like and wanted to do. By repeating what you do every year to get into the same role [condition - ed], it’s not that you’re not motivated, but you also need something new to increase the motivation again. What I do now, I feel on myself that I have an energy I’ve not had for years. For me personally, I really needed this change.”</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_48_1_5fb0a95b-0c3f-4b93-88e2-88042bc9d1e4.png?v=1768328019\" alt=\"\" /><em>Will Vingegaard and Pogačar occupy the top-two spots at this year's Tour, like they have done for the past five editions?</em></span></p>\n<p><span>The Giro presents opportunity, but it is also fraught with risks. While as the favourite he’ll be expected to beat </span><span>Pogačar</span><span> in claiming the Grand Tour trilogy, the Italian race has form for being cold, wet and miserable in May. “We might be unlucky with very bad weather for three weeks,” Vingegaard accepts. </span></p>\n<p><span>There’s also the annual debate about whether a rider can hold their form from the Giro to the Tour. On that matter, the Dane has little doubt what the answer will be. “We believe that I can be even better in the Tour by doing the Giro,” he says. “We’ve done some analysis of pure watts of what I’ve done when I’ve done the Tour and Vuelta, and what we see is that I at least don’t get worse, probably even the opposite. Two times I’ve done the Vuelta after the Tour and I’ve even been a bit better power-wise in the Vuelta, so we don’t believe it’s a disadvantage for me to do it.” </span><b></b></p>\n<p><span>It was at the Vuelta in 2023, just weeks after winning his second Tour title, that the fuse was lit for an attempt at the Giro-Tour double. “I finished second in that Vuelta and I could see I was maybe on a better level than I was in the Tour,” he reflects. “There I was already thinking it might be possible to do the Giro and Tour.”<br /><br /></span>Refreshed, reinvigorated, revitalised, Vingegaard is promising big things for 2026, always conscious that he isn’t immune to becoming worn out and spent. “I wouldn’t say it was always [a dream to win all three Grand Tours] because I didn't expect to be in this position to win all three,” he says. “But once I won the Tour de France once then I started to dream about winning the Vuelta and the Giro, and now the Giro is a big goal for me. It’s not about being the first man of this generation [to win all three]. We all know Tadej will do it sooner or later I guess, but it’s more about being <em>able</em> to win all three. I’m 29 now. It’s not like I have 10 years more in my career. I also need to try to do it while I’m at my peak level. Now is the moment for me to do it.”</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"afdbfa747acae33e0a269976fa70566da156d9cdb0f1fa14c4ac870a6632a52d","category":"Cycling"}