{"title":"Moots: In Me, the Tiger Sniffs the Rose","link":"https://moots.com/blogs/news/moots-in-me-the-tiger-sniffs-the-rose","date":1762458213000,"content":"\n      <p>From the moment Mr. Duan first saw a Moots outside Tsinghua University in Beijing, to riding thousands of miles on Vamoots and Routt models across Asia and beyond, Moots has been a lifelong companion. Through Granfondos, long tours, and even the challenges of the pandemic, each bike has carried him with strength, beauty, and endurance. For him, Moots is more than a bike—it’s a reminder that the journey itself is the reward.</p>\n<p>---</p>\n<p> <img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Tiger_1.jpg?v=1762458129\" alt=\"\" /><br /></p>\n<p><span>Whenever a friend with a generous budget asks me to recommend the ultimate metal bike, my answer is always the same—Moots. It has been my favorite brand for as long as I can remember. With cycling at the heart of my life for over 20 years, I have owned—and still cherish—five different Moots bikes: Vamoots, Vamoots RSL, Routt RSL, Vamoots CRD, and Routt CRD. My love for bicycles is lifelong, and I am certain that no other brand will ever surpass the place Moots holds in my heart.</span></p>\n<p><span>My journey with Moots began in 2007, during my university years, when high-performance sports bikes were still a rare sight in mainland China. Near the entrance of Tsinghua University in Beijing, a well-known bike shop had a Moots on display. The moment I saw it, I froze—it was unlike anything I had ever encountered. At the time, titanium frames were a niche choice, embraced only by a small group of devoted enthusiasts. A masterpiece like Moots, with its flawless craftsmanship, felt almost unattainable—proud, exclusive, and reserved for the few. As a university student surviving on a modest monthly allowance of less than $100, owning a Moots YBB seemed like a distant dream. Yet, that bike left an indelible mark on me—much like an ancient Chinese verse describing the love for the Lotus: a thing of beauty to be admired from afar, untouchable in its grace.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Tiger_2.jpg?v=1762458129\" alt=\"\" /></p>\n<p><span>Years later, my dream came true. For my 28th birthday in 2017, my girlfriend—now my wife—surprised me with my first Moots: a Vamoots from Taiwan Province. Although it wasn’t the brand’s top-tier model, it still showcased Moots' hallmark precision welding, timeless design, and exceptional ride quality. I was captivated. I would admire it at home, take it out for a ride whenever I could, and savor every moment in the saddle.</span></p>\n<p><span>I find it hard to put into words the unforgettable riding experience: stiff yet comfortable, soft as cotton yet as fast as lightning. From that moment on, Moots became my unwavering companion. When <a href=\"https://www.instagram.com/aitacycle/?hl=en\">AITASHOP</a> started collaborating with Moots to bring these masterpieces to Chinese cyclists, I was overjoyed. They introduced me to my first top-tier model, the Vamoots RSL, featuring custom geometry and breathtaking anodized details—a dream realized.</span></p>\n<p><span>That bike has been with me through countless adventures, including all six stages and 8,400 meters of climbing at the Granfondo Yunnan in 2019, as well as a 1,000km tour through southern Sichuan. The magic of a Moots titanium frame lies in its unique ability to combine endurance with racing performance—a rare blend. Among all my road bikes, the Vamoots RSL still holds the highest mileage. Wherever I go, it is my soul companion, giving me the confidence to tackle long distances, remote roads, and challenging climbs.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Tiger_3.jpg?v=1762458129\" alt=\"\" /></p>\n<p><span>As the popularity of gravel riding grew, I built up a Routt RSL to embrace the new discipline. This bike became my sanctuary during the challenging days of COVID-19, when physical and mental struggles affected us all. It carried me through villages, towns, and open fields, offering new perspectives on roads I thought I knew.</span></p>\n<p><span>Later, when the CRD series was introduced, I knew I had to experience them, Vamoots CRD and Routt CRD, both of them. With its fully integrated system, MOD components, and new geometry. The Vamoots CRD immediately stood out—particularly its flatter top tube, which improved both compatibility and ride feel. I spent a lot of time carefully selecting each component to ensure a perfect build. Now, for any ride over 120km, the Vamoots CRD is my only choice.</span></p>\n<p><span>Oh, I almost forgot—Granfondo Yunnan 2024. Despite some unexpected challenges, I am even more grateful for my Vamoots CRD, a bike that now holds even deeper personal significance. Looking ahead to the next five years, I wonder—will anything else accompany me during those defining moments, as the Vamoots RSL did before?</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Tiger_4.jpg?v=1762458128\" alt=\"\" /></p>\n<p><span>As I reflect on my journey with Moots, I realize that no matter how much time passes or how the market changes, Moots will always be my favourite. Like a steady companion on a lifelong ride, it has been with me through countless miles, challenges, and triumphs. As the saying goes, \"The journey is the reward\", and every ride on a Moots serves as a reminder of that truth. With each new chapter in life, I look forward to the next chapter in Moots' evolution—because, just like my passion for cycling, it’s a ride that will never end.</span></p>\n<p>Mr. Duan</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"b0a186162fb56fd1ce8d9db1ae55672133faadd9eb4c69eac1a9d63bd3d4aeb8","category":"Cycling"}