{"title":"★ App Store 2025 Top iPhone Apps in the U.S.","link":"https://daringfireball.net/2026/01/app_store_2025_top_iphone_apps_in_the_us","date":1769464185000,"content":"\n<p>I’ve been meaning since last month to link to <a href=\"https://apps.apple.com/us/iphone/story/id1847717004\">Apple’s lists of the top iPhone apps in the U.S. for 2025</a>. Here’s the list of the top 20 free iPhone apps:</p>\n\n<ol>\n<li>ChatGPT</li>\n<li>Threads</li>\n<li>Google</li>\n<li>TikTok — Videos, Shop &amp; LIVE</li>\n<li>WhatsApp Messenger</li>\n<li>Instagram</li>\n<li>YouTube</li>\n<li>Google Maps</li>\n<li>Gmail — Email by Google</li>\n<li>Google Gemini</li>\n<li>Facebook</li>\n<li>CapCut: Photo &amp; Video Editor</li>\n<li>Temu: Shop Like a Billionaire</li>\n<li>T-Life [“All things T-Mobile”]</li>\n<li>Telegram Messenger</li>\n<li>Lemon8 — Lifestyle Community</li>\n<li>Spotify: Music and Podcasts</li>\n<li>Google Chrome</li>\n<li>Snapchat</li>\n<li>rednote</li>\n</ol>\n\n<p>All app names are verbatim, except for T-Life, where I put the app’s secondary slogan in brackets. I had no idea what T-Life was, but the slogan makes it clear. Interesting to me that T-Mobile’s app is on the list but neither Verizon nor AT&amp;T’s are.<sup><a href=\"#fn1-2026-01-26\">1</a></sup></p>\n\n<p>I hope a million people sent this list to Elon Musk, to rub some salt in his severe case of butt hurt that led him to file <a href=\"https://arstechnica.com/tech-policy/2025/08/elon-musk-sues-apple-openai-to-block-exclusive-iphone-chatgpt-integration/\">an almost certainly baseless lawsuit in August</a> alleging that ChatGPT consistently tops the App Store list — and Grok does not — because Apple puts a thumb on the scale for these rankings because of its deal with OpenAI to integrate ChatGPT with Apple Intelligence. Here’s the thing. Dishonest people presume the whole world is dishonest. That you either cheat and steal, or you’re going to be cheated and robbed. If Elon Musk ran the App Store, you can be sure that he’d cook the rankings to put apps that he owns, or even just favors, on top. Elon Musk runs Twitter/X, and <a href=\"https://news.sky.com/story/the-x-effect-how-elon-musk-is-boosting-the-british-right-13464487\">that’s how the algorithm there now works</a>: it favors content he prefers, especially his own tweets. Apple doesn’t publish how its lists for top apps are computed (to keep the rankings from being gamed more than they already inevitably are), but judging by how many of these apps come from Apple’s rivals (e.g., Spotify), there’s little reason to think they’re crooked — unless you think the entire world is crooked.</p>\n\n<p>Google has 6 apps on the list, including 5 in the top 10. Meta — certainly no friend of Apple — has 4 apps on the list, including 3 in the top 10. (Slightly interesting, but unsurprising, sign of the times: the Facebook “blue app” dropped out of the top 10.) The only apps in the top 10 not from Google or Meta are ChatGPT (#1) and TikTok (#4).</p>\n\n<p>Microsoft has no apps on the list. <a href=\"https://www.macworld.com/article/162987/macbu-4.html\">Back in the day</a>, the conventional wisdom was that Microsoft made more money, on average, from each Mac sold than they did from each PC sold — despite the fact that nearly all PCs came with a licensed version of Windows — because so many Mac users paid for Microsoft Office at retail prices. I suspect something like that is true with iPhones for Google. A lot of iPhone users spend a lot of time using apps from Google. I would bet that Google makes more ad revenue from the average iPhone user (who, even if they don’t install a single one of Google’s native iOS apps, probably uses Google Search in Safari) than from the average Android user.</p>\n\n<p>Another company that has no apps on this list is Apple itself. If you look at <a href=\"https://apps.apple.com/us/iphone/charts/6007?chart=top-free\">the daily top list of apps in the Productivity category</a>, you will see a lot of apps from Google and Microsoft. But you won’t find Keynote, Pages, or Numbers, because Apple recuses its own apps from such rankings. </p>\n\n<p>Here’s the list of the top 20 <em>paid</em> iPhone apps in 2025 in the U.S.:</p>\n\n<ol>\n<li>HotSchedules</li>\n<li>Shadowrocket</li>\n<li>Procreate Pocket</li>\n<li>AnkiMobile Flashcards</li>\n<li>Paprika Recipe Manager 3</li>\n<li>SkyView®</li>\n<li>TonalEnergy Tuner &amp; Metronome</li>\n<li>AutoSleep Track Sleep on Watch</li>\n<li>Forest: Focus for Productivity</li>\n<li>RadarScope      </li>\n<li>Monash FODMAP Diet</li>\n<li>Merge Watermelon for watch</li>\n<li>Streaks</li>\n<li>Wipr 2</li>\n<li>µBrowser: Watch Web Browser</li>\n<li>PeakFinder</li>\n<li>Threema. The Secure Messenger</li>\n<li>Things 3</li>\n<li>Goblin Tools</li>\n<li>¡Verify Basic</li>\n</ol>\n\n<p>There are a couple of real gems on this list — Procreate, Paprika, Streaks (<a href=\"https://daringfireball.net/feeds/sponsors/2016/05/streaks\">multi</a>-<a href=\"https://daringfireball.net/feeds/sponsors/2024/11/streaks_and_little_streaks\">time</a> DF sponsor), and Things are all apps that I use, or have used, and would recommend. But unlike the list of top free apps, where I’d at least heard of all of them (once I figured out what T-Life was), I have never even heard of most of these paid iPhone apps. Household names these are not.</p>\n\n<p>The market for paid apps isn’t just different from the market for free apps. It’s an entirely different world.</p>\n\n<div>\n<hr />\n<ol>\n<li>\n<p>This, in turn made me wonder what the subscriber-count standings look like. I assumed T-Mobile was still in third place, but that assumption was wrong. <a href=\"https://en.wikipedia.org/wiki/List_of_mobile_network_operators_in_the_United_States\">According to Wikipedia</a>, here are the number of U.S. subscribers per carrier as of Q3 2025:</p>\n\n<ol>\n<li>Verizon — 146 million</li>\n<li>T-Mobile — 140 million</li>\n<li>AT&amp;T — 119 million</li>\n<li>Boost — 8 million</li>\n</ol>\n\n<p>I’m a Verizon man myself, and <a href=\"https://daringfireball.net/linked/2026/01/16/verizon-20-bucks\">pay handsomely for it</a>. I don’t even remember why exactly, but I despised AT&amp;T back when they were the exclusive U.S. carrier for the iPhone. <a href=\"#fnr1-2026-01-26\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"b1658d4249ef609322deca79d867ddb91dfb544637f2dcf7ba93084286d3517a","category":"Tech"}