{"title":"Terraform MCP server updates: Stacks support, new tools, and tips","link":"https://www.hashicorp.com/blog/terraform-mcp-server-updates-stacks-support-new-tools-and-tips","date":1769187600000,"content":"<p>General AI models are great, but they guess wrong when it comes to your infrastructure. They don’t know your private modules, your security rules, or your internal secrets.</p>\n\n<p>You can bridge that gap using the Terraform MCP Server. For those who are not familiar with HashiCorp’s Model Context Protocol (MCP) servers, it links generic LLMs to your actual ops environment. They give the AI the live data and documentation it needs to stop hallucinating and give better responses. </p>\n\n<p>For Terraform Enterprise users subject to strict data sovereignty requirements or limited internet connectivity, the MCP server provides an option to enable AI automation in air-gapped environments. By running a local AI model (such as a local LLM),  developers can take advantage of the MCP server without external internet access, ensuring compliance with security and sovereignty policies.</p>\n\n<p>Today, we are excited to add even more features to our Terraform MCP server and share tips on how to use all of our MCP servers. With new support for <a href=\"https://www.hashicorp.com/en/blog/terraform-stacks-explained\">Terraform Stacks</a> and <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/policy-enforcement/manage-policy-sets\">policy sets</a>, your AI assistant becomes more context-aware, secure, and ready for real enterprise work.</p>\n\n<h2>The Terraform MCP server: Smarter, safer automation</h2>\n\n<p>We’ve previously shared how the Terraform MCP server can benefit your workflow in our <a href=\"https://developer.hashicorp.com/terraform/mcp-server\">documentation</a> and <a href=\"https://www.youtube.com/watch?v=eamE18_WrW0&amp;t=119s\">video deep-dive</a>. </p>\n\n<p>Today's release further improves the experience for HCP Terraform and Terraform Enterprise users. We’ve strengthened the connection to your infrastructure with a fresh set of tools and fixes designed to eliminate friction.</p>\n\n<p>Instead of wasting time digging for internal security rules or writing repetitive boilerplate, the Terraform MCP server now has:</p>\n\n<ul>\n<li><strong>[<em>New</em>] Support for Stacks:</strong> Deploy and manage Terraform Stacks using natural language.</li>\n<li><strong>[<em>New</em>] Streamlined policy management:</strong> We’ve added a new tool called <code>attach_policy_set_to_workspaces</code>, allowing you to handle governance workflows directly via chat.</li>\n<li><strong>[<em>New</em>] Granular control:</strong> You can now choose exactly which capabilities to enable. Use the new <code>--toolsets</code> flag to toggle between public registry access, private registry access, or operations tools. You can even enable specific tools one by one with <code>--tools</code> for maximum security.</li>\n<li><strong>Security policy lookup:</strong> Intelligently look up Sentinel policies and CIS benchmarks to recommend security rules alongside your infrastructure code.</li>\n<li><strong>Access to private modules:</strong> Read private modules hosted in your internal registry to write code that matches <em>your</em> standards, not just public examples.</li>\n<li><strong>Natural language commands:</strong> Use natural language to create workspaces, update variables, and tag resources securely.</li>\n<li><strong>[<em>Updated</em>] Self-hosted improvements:</strong> We fixed an issue where the \"Skip TLS\" flag wasn't propagating correctly — a critical fix for air-gapped or self-hosted environments using custom certificates.</li>\n<li><strong>[<em>Updated</em>] Smarter error handling:</strong> Input validation errors now return as clear \"Tool Execution Errors,\" helping the LLM understand <em>why</em> it failed so it can correct itself immediately.</li>\n</ul>\n\n<p>Here’s a look at what Terraform MCP server usage looks like in an air-gapped demo environment:</p>\n<h2>The full HashiCorp MCP ecosystem: Vault &amp; Consul</h2>\n\n<p>We have MCP servers for more than just Terraform. We’re also actively developing three other MCP servers to give you AI assistance with enterprise context when working in HashiCorp Vault, HCP Vault Radar, and Consul.</p>\n\n<p><strong>The <a href=\"https://developer.hashicorp.com/vault/docs/mcp-server/overview\">Vault MCP server</a></strong>, available on GitHub and DockerHub, turns complex secret management into a conversation. If your AI spots a hard-coded secret, the MCP server can:</p>\n\n<ul>\n<li><strong>Create</strong> a secure mount in Vault</li>\n<li><strong>Write</strong> the secret securely</li>\n<li><strong>Refactor</strong> your code to fetch it dynamically</li>\n</ul>\n\n<p><strong>The <a href=\"https://developer.hashicorp.com/hcp/docs/vault-radar/mcp-server/overview\">Vault Radar MCP server</a></strong> allows you to stop digging through dashboards and just ask questions like, <em>\"What are my top security risks?\"</em> It queries GitHub, AWS, and Azure to give you an instant, prioritized list of leaks.</p>\n\n<p><strong>The <a href=\"https://hub.docker.com/r/hashicorp/consul-mcp-server\">Consul MCP server</a></strong> identifies the right API calls for service mesh by asking questions like, <em>\"Do I have any over-privileged tokens?\"</em> or <em>\"Check for secure configuration.\"</em> The server translates your questions and creates precise Consul queries.</p>\n\n<h2>How to use these tools effectively</h2>\n\n<p>To get the best results when using these MCP tools, follow these three tips:</p>\n\n<ol>\n<li><strong>Consider using specialized, self-contained packages.</strong> Some AI-powered coding environments (like Kiro) have built-in <a href=\"https://www.hashicorp.com/en/blog/hashicorp-is-a-kiro-powers-launch-partner\">extensions for HashiCorp tools</a> that bundle MCP servers and use a smaller computing footprint, which helps save on token costs. </li>\n<li><strong>Force MCP server use.</strong> Sometimes the AI guesses instead of asking the server. In editors like VS Code (using Cursor), start your prompt with #terraform or #vault. This forces the AI to check the MCP server for the real answer.</li>\n<li><strong>Set your standards.</strong> Every team works differently. Drop a markdown file (like <code>agents.md</code> into your workspace to tell the AI your preferences (e.g. whether you want CLI commands, API calls, or VCS workflows). There are some <a href=\"https://github.com/hashicorp/terraform-mcp-server/tree/main/instructions\">examples available</a> for the Terraform MCP server.</li>\n</ol>\n\n<h2>Learn more and get started today</h2>\n\n<p>Ready to give your AI assistants a fuller context for your infrastructure and secrets landscape?</p>\n\n<ul>\n<li>Install the <a href=\"http://hashi.co/terraform-mcp-server\">Terraform MCP server here</a> to get started.</li>\n<li>For example prompts, see the <a href=\"https://developer.hashicorp.com/terraform/mcp-server\">Terraform MCP server documentation</a>.</li>\n<li>For more insights into our vision for AI-driven infrastructure, check out our blog: <a href=\"https://www.youtube.com/watch?v=eamE18_WrW0\">Building intelligent infrastructure automation with HashiCorp</a>.</li>\n</ul>\n\n<p>Give our other MCP servers a try here:</p>\n\n<ul>\n<li><a href=\"http://hashi.co/vault-mcp-server\">Vault MCP server</a></li>\n<li><a href=\"http://hashi.co/vault-radar-mcp-server\">Vault Radar MCP server</a></li>\n<li><a href=\"https://hub.docker.com/r/hashicorp/consul-mcp-server\">Consul MCP server</a> (<a href=\"https://gist.github.com/srahul3/be79b7393de3bbe53b655dd82c1cea61\">readme</a>)</li>\n</ul>\n\n<p>If you don’t have access to all of the Vault and Terraform features, <a href=\"https://portal.cloud.hashicorp.com/sign-up?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q3_WW_PRAC_MULTI_mcp-tf-stacks-new-blog&amp;utm_content=end-blog-cta&amp;utm_offer=signup\">get started</a> with HashiCorp Cloud Platform (HCP), the fastest way to set up cloud-managed versions of those products.</p>\n","author":"Gautam Baghel","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"b1884ed67e2f32f3892420c3e5a3daca71dfa94e1615fe639c0d5074bc30382d","category":"Tech"}