{"title":"Have we leapt into commercial genetic testing without understanding it?","link":"https://arstechnica.com/science/2026/02/have-we-leapt-into-commercial-genetic-testing-without-understanding-it/","date":1771675256000,"content":"<p>Daphne O. Martschenko and Sam Trejo both want to make the world a better, fairer, more equitable place. But they disagree on whether studying social genomics—elucidating any potential genetic contributions to behaviors ranging from mental illnesses to educational attainment to political affiliation—can help achieve this goal.</p>\n<p>Martschenko’s argument is largely that genetic research and data have almost always been used thus far as a justification to further entrench extant social inequalities. But we know the solutions to many of the injustices in our world—trying to lift people out of poverty, for example—and we certainly don’t need more genetic research to implement them. Trejo’s point is largely that more information is generally better than less. We can’t foresee the benefits that could come from basic research, and this research is happening anyway, whether we like it or not, so we may as well try to harness it as best we can toward good and not ill.</p>\n<p>Obviously, they’re both right. In <a href=\"https://press.princeton.edu/books/hardcover/9780691237756/what-we-inherit?srsltid=AfmBOorhEUDuvnbOtnDI2SD0N9tV6PpQbM-eSWIj2n1XsL2yvOCxkm3x\"><i>What We Inherit: How New Technologies and Old Myths Are Shaping Our Genomic Future</i></a>, we get to see how their collaboration can shed light on our rapidly advancing genetic capabilities.</p><p><a href=\"https://arstechnica.com/science/2026/02/have-we-leapt-into-commercial-genetic-testing-without-understanding-it/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/science/2026/02/have-we-leapt-into-commercial-genetic-testing-without-understanding-it/#comments\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"b3ef4198b13aadef620ce029f18af0ec39726fd2778c9f1cf34f667629be815b","category":"Tech"}