{"title":"The Outsiders: Team Slipstream down the years","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-outsiders-team-slipstream-down-the-years","date":1770966002000,"content":"\n      <p><em>This article was first published in Rouleur<span> </span><a href=\"https://www.rouleur.cc/products/issue-140-copy\" target=\"_blank\">Issue 141</a></em></p>\n<p>When former pro cyclist Jonathan Vaughters and wealthy software consultant Doug Ellis combined to set up Team Slipstream with a predominantly American roster and an anti-doping stance in 2007, it’s fair to say they weren’t exactly setting the cycling world alight. The guys were competitive on the US scene but looked like they would struggle on the big stage.</p>\n<p>Yet just one year later, with Garmin stepping in as headline sponsor, they were taking stage wins at the Giro d’Italia and just missed the Tour de France podium. Subsequent seasons saw further Grand Tour successes, including victory at the Giro, memorable wins at Paris-Roubaix, Liège and Lombardia, and a whole lot more – all from a team with one of the lowest budgets in professional cycling.</p>\n<p>We look at six peak seasons from the misfits and second chancers who punched above their weight.</p>\n<h3>2008 GARMIN-CHIPOTLE</h3>\n<p>New signings Ryder Hesjedal, David Millar, Christian Vande Velde, Julian Dean and Tyler Farrar considerably bolstered the roster’s firepower. Their team time trial win at the Giro put Vande Velde in pink, albeit briefly, and the discipline became the Garmin squad’s speciality over the coming seasons.</p>\n<p>Vande Velde proved to be a handy GC contender, ending the Tour de France just off the podium once doper Bernhard Kohl had been struck from the records. The American also took the overall at the Tour of Missouri.</p>\n<p>The 21-year-old Dan Martin started to realise his potential, with wins at the Route du Sud and the Irish National Championships. All in all, a solid if unspectacular year at the races for the boys in blue.</p>\n<p><strong>Wins:</strong> 14</p>\n<p><strong>Star performers:</strong> Christian Vande Velde (Tour de France, 4th), David Zabriskie (World Championships TT, 4th), Martijn Maskant (Paris-Roubaix, 4th), David Millar (Tour of California, 2nd)</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-81856056_1024x1024.jpg?v=1770910674\" alt=\"\" /></div>\n<h3>2009 GARMIN-SLIPSTREAM</h3>\n<p>A coming of age season for the team, turning from nearly men and wacky racers into winners. With 29 victories from ten different riders, there was strength in depth, with the unlikely figure of Olympic track star and TT specialist Bradley Wiggins converting to Tour de France podium contender over the space of half a season. The Garmin fairytale was somewhat soured however, as the newly forming Team Sky swooped in and stole the future Tour champion from under their noses. Vaughters was not a happy bunny.</p>\n<p>Sprinter Tyler Farrar weighed in with 11 victories on the scoreboard, including the team’s first individual Grand Tour stage win at the Vuelta a España. In a rich vein of form in Spain, Ryder Hesjedal also won the following day, with David Millar providing the icing on the cake with his stage 20 TT win.</p>\n<p><strong>Wins:</strong> 29</p>\n<p><strong>Star performers: </strong>Bradley Wiggins (Tour de France, 4th), Tyler Farrar (Eneco Tour, 3 stages), Chris Sutton (Jayco Herald Sun Tour, 3 stages)</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-990639488_1024x1024.jpg?v=1770910679\" /></div>\n<h3>2011 GARMIN-CERVÉLO</h3>\n<p>The merger of two teams is a fraught operation: riders and staff lose their jobs, and settling in with unfamiliar processes and personalities often takes time. But there were no such problems as Cervélo jumped aboard the Garmin train and brought some solid talents with them.</p>\n<p>Cameron Meyer, Tyler Farrar and Heinrich Haussler all bagged early season wins before the big Belgian Johan Vansummeren pulled off possibly the biggest upset in the team’s history to date, beating defending champion Fabian Cancellara at Paris-Roubaix.</p>\n<p>They enjoyed a fine Tour de France, with stage two’s team time trial win putting the excellent Cervélo recruit Thor Hushovd into yellow. The Norwegian also took two solo stages, while Farrar landed one. The mercurial Dan Martin, meanwhile, contributed three wins to the 2011 tally – Toscana, Poland and the Vuelta – and a fine second at Lombardia.</p>\n<p><strong>Wins:</strong> 30</p>\n<p><strong>Star performers: </strong>Johan Vansummeren (Paris-Roubaix), Cameron Meyer (Tour Down Under), David Millar (Giro d'Italia, TT stage)</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-596594974_1024x1024.jpg?v=1770910678\" alt=\"\" /></div>\n<h3>2012 GARMIN-SHARP</h3>\n<p>Occasional victories from maverick oddballs are all well and good, but it was high time for a major upset from the Garmin crew. Enter affable Canadian Ryder Hesjedal at the Giro d’Italia. The GC battle should have, theoretically, been fought out by the big dogs – Katusha, Sky, Saxo Bank, RadioShack and home favourites Lampre and Liquigas. No Garmin rider featured in the race previews. Come stage 21’s time-trial finale, Katusha’s Joachim Rodríguez held a 31 second lead over Hesjedal. By the end, the Canadian had overturned the deficit to secure the maglia rosa by 16 seconds, the closest winning margin since Eddy Merckx in 1974.</p>\n<p>Hesjedal subsequently admitted to doping during his career, without specifying when, so retained his Giro title. He was far from the only Garmin rider from this era to later confess to drug misuse, which rather tarnished the reputation of a team first set up with the stated aim of winning major races without recourse to PEDs.</p>\n<p>On the plus side, 23-year-old Sep Vanmarcke landed the biggest win of his career at Omloop Het Nieuwsblad, outwitting Tom Boonen and Juan Antonio Flecha in a three way sprint. And Nathan Haas was belatedly awarded the Tour of Britain win once Jonathan Tier-nan-Locke had been stripped of the title for biological passport abnormalities. A sign of the times…</p>\n<p><strong>Wins:</strong> 24</p>\n<p><strong>Star performers: </strong>Ryder Hesjedal (Giro d'Italia), Sep Vanmarcke (Omloop Het Nieuwsblad), Nathan Haas (Tour of Britain)</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-532834112_1024x1024.jpg?v=1770910679\" alt=\"\" /></div>\n<h3>2023 EF EDUCATION-EASYPOST</h3>\n<p>Leap forward to 2023 and what is now the team in hot pink livery is a totally different proposition. The time trial big engines are long gone. South Americans and Brits outnumber Americans. Rigoberto Urán, their established GC hope, never returned to his fabulous 2017 Tour de France runner up form. They looked to Richard Carapaz, second at the 2022 Giro for Ineos Grenadiers, to lead the line, but an opening stage crash at the Tour de France effectively ruined his season.</p>\n<p>Two classically Garmin-esque free spirits delivered, however. The moustachioed Magnus Cort was a reliable stage bagger who targeted Grand Tours and often came away with a memorable win. This time out, it was stage ten of the Giro, the Dane outsprinting breakaway companions Derek Gee and Alessandro De Marchi in the teeming rain to complete his set of Grand Tour stage wins.</p>\n<p>The other EF Education joker in the pack was Ben Healy, the dynamic young Irishman seemingly given free rein to race with his characteristic abandon, often to great effect. Five wins – and some big near misses at Amstel Gold and Liège – proved a decent haul for the season.</p>\n<p><strong>Wins:</strong> 26</p>\n<p><strong>Star performers: </strong>Magnus Cort (Giro d'Italia, stage win), Ben Healy (Amstel Gold Race, 2nd), Simon Carr (Tour de Langkawi)</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1483246773_1024x1024.jpg?v=1770910682\" alt=\"\" /></div>\n<div><em>Images: Getty</em></div>\n<div>\n<em></em><br />\n</div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"b8d20d267ac98bfcf9eada1d504b0e9d3eb382f9554e31f074ddccc310bf4839","category":"Cycling"}