{"title":"Design System Culture: What It Is And Why It Matters (Excerpt)","link":"https://smashingmagazine.com/2025/11/design-system-culture/","date":1764093600000,"content":"<p>This article is a sponsored by <a href=\"undefined\">Maturing Design Systems</a></p>\n<p>Design systems have become an integral part of our everyday work, so much that the successful growth and maturation of a design system can make or break a product or project. <strong>Great tokens, components and organization aren’t enough</strong> — it is most often the culture and curation that creates a sustainable, widely-adopted system. It can be hard to determine where to invest our time and attention. How do we build and maintain design systems that support our teams, enhance our work, and grow along with us? </p>\n<p><img src=\"https://files.smashing.media/maturing-design-systems.png\" /></p>\nExcerpt: Design System Culture\n<p>Culture is a funny thing. We all have some intuition about how important it is—at least we know we want to work in a great culture and avoid the toxic ones. But culture is notoriously difficult to define, and changing it can feel more like magic than reality. One company culture can be inspiring for some and boring for others, a place of growth for some and stifling for others.</p>\n<p>Adding to the nuance, not only does your company have a culture as a whole, but it has many subcultures. That’s because culture is not created by any individual. Culture is something that happens when the same group of people gather together repeatedly over time. So, as a company grows, adding hierarchy and structure, the teams formed around specific goals, products, features, disciplines, and so on, <strong>all develop their own subcultures</strong>.</p>\n<p>You probably have a design subculture. You probably have a product ownership subculture. You probably even have a subculture forming around those folks who get on a Zoom call every Tuesday at lunch to knit and chat. There are hundreds or more subcultures at most good-sized organizations. It’s complicated, nuanced, and immensely important.</p>\n<p>When an individual is struggling with the way they are managed, one culture enables them to offer authentic feedback to their boss, while another leads them to look for a new job. When a company provides free lunch on Fridays, one culture creates a sense of gratitude for this benefit; another makes you feel like this free lunch comes with the expectation that you can’t ever leave work. One culture prioritizes financial results over respectful interactions. One culture encourages competition between teams, while another emphasizes collaboration with coworkers.</p>\n<h3>Why Culture?</h3>\n<p>At the beginning of 2021, my company was asked to help a large organization plan, design, and build a design system alongside the minimum viable product of a new product idea. This is the kind of work we truly love, so the team was excited to jump in.</p>\n<p>As an author of a book about design systems, I want nothing more than to tell you how amazingly this engagement went. Instead, it was a tremendous struggle. Despite this being the perfect kind of work for my team and I on paper, we had to make the hard decision to walk away from our client at the end of that year. Not because we couldn’t do the work. Not because of any technical challenges or budget concerns. The reason we gave was “cultural incompatibility.” In almost twenty years of running my own businesses, <strong>this had never happened to me</strong>. After all, our clients don’t come to us because they have everything figured out — they come because they know they need help. If we couldn’t guide them through a difficult season, why did we even exist!?</p>\n<p>Needless to say, it didn’t sit well with me. So, after following a few useless threads of fear that we just couldn’t cut it, I spent the next year diving down a rabbit hole of research on organizational culture. This next section is a summary of what I learned in that year and how I’ve been putting that to use since. To start, let’s find a common understanding of what culture is.</p>\n<h3>What Is Culture?</h3>\n<p>Over the last few decades, a lot has been said about workplace culture. From understanding why it matters and how it impacts the ways we lead, to offering methodologies for changing it. I’ve found tremendous value in the research and writings of Edgar Schein, a business theorist and psychologist. Schein offers a simple model to explain what culture is, breaking it down into three levels:</p>\n<p><img src=\"https://files.smashing.media/design-system-culture/schein-model-organization-culture.png\" /></p>\n<h3>Artifacts</h3>\n<p>Artifacts are the top level of Schein’s model. These are the things people think of when you say “culture” — the visible perks a company offers. I once worked at a place where we could expense bringing in donuts for the team. Another job I had provided a foosball table. One company encouraged us to cook lunch together each week. These kinds of things, along with the company swag, the channel in Slack where you get to brag about your peers, and the company retreat are all “artifacts” of your company culture.</p>\n<h3>Espoused Values And Beliefs</h3>\n<p>The next layer down is called “espoused values and beliefs.” This is what people inside the culture say they believe. It’s the list of values, the mission statement, the vision. It’s the content on the website and plastered on the walls. It’s the stuff you expect to get when you accept the job because it’s how people answered all your questions throughout the interview process.</p>\n<h3>Basic Underlying Assumptions</h3>\n<p>The deepest layer is called “basic underlying assumptions.” This is what people inside the organization actually believe. It’s the way the leadership and employees behave, most notably </p>\n<p>in the face of a difficult decision. This layer is the root of your culture. And no matter what you show (artifacts), no matter what you say (espoused beliefs), the things you believe (underlying assumptions) will come out eventually.</p>\n<h3>It Starts At The Bottom</h3>\n<p>As an employee, you will experience these things from the top down. On your first day, you observe what’s happening around you — you see the artifacts of the culture. Eventually, you get to know a few folks. As you have more and more conversations with them, you’ll begin to <strong>hear how they talk about the culture</strong> — their espoused beliefs. At some point, people inside your culture will be faced with some tough situations. This is where the rubber meets the road and when you’ll learn what those individuals’ basic underlying assumptions are.</p>\n<p>Unhealthy organizations don’t have a process for surfacing and valuing those underlying assumptions. Healthy organizations know that culture starts with the basic underlying assumptions of every individual at the company.</p>\n<p>Unhealthy organizations try to create culture with perks and mission statements. Healthy organizations allow the top two layers to emerge naturally from the bottom layer.</p>\n<p>When the basic underlying assumptions don’t line up with the espoused beliefs and artifacts, <strong>the disconnect is strong</strong>. It’s often hard to articulate the problem, but people will feel it. This is the company with a core value of “family first” that requires you to travel all the time with no recognition of the impact it has on your actual family. The espoused belief to prioritize family is not actively supported in the decisions being made.</p>\n<h3>Strength And Weakness</h3>\n<p>We all subconsciously know these things, and that is reflected in the language we use as we talk about the culture of an organization. We tend to use the words “strong” and “weak” to describe culture. You might say, “That company has a strong culture.” This statement is an indication that the layers are aligned, and that means the culture itself serves as a way of guiding decisions. If we all have shared values, we can trust one another’s ability to make decisions that will align with those values.</p>\n<p>Conversely, an organization with a weak culture is missing the alignment between the things they say and the decisions they make. These cultures often continually add <strong>policies and procedures</strong> in order to police the behavior of individuals. In this scenario, the culture is weak because it doesn’t offer the organic guidance a stronger culture does — the misalignment means the things we choose to do differ from the things we say.</p>\n<p>That is not to say policies and procedures are bad. As companies grow, there is a need to document the expectations for people. The proactive nature of a strong culture means these documents are often a formalization of what has emerged organically, whereas a weak culture reacts to negative situations in hopes to prevent the bad from happening again.</p>\nEditor’s Note\n<p>Do you like what you’ve read so far? This is just an excerpt of Ben’s upcoming book, <strong><em>Maturing Design Systems</em></strong>, in which he explores the anatomy of a design system, explains how culture shapes outcomes, and shares practical guidance for the challenges at each stage — from building v1 and growing healthy adoption to navigating “the teenage years” and ultimately running a stable, influential system.</p>\n<h3>Table of Contents</h3>\n<ul>\n<li><strong>Context</strong><br />An introduction to the context of design systems, understanding where they live in your organization, what feeds them, and whether you should build one.</li>\n<li><strong>Design System Culture</strong><br />A deep dive into what culture is, why it’s important for design system teams to understand, and how it unlocks the ability for you to deliver real value.</li>\n<li><strong>The Anatomy of a Design System</strong><br />An exploration of the layers and parts that make up a design system based on the evaluation of hundreds of design systems over many years.</li>\n<li><strong>Maturity</strong><br />An over view of the design system maturity model including the fours stages of maturity, origin stories, a framework for maturing in a healthy way, and a framework for creating design system stability.</li>\n<li><strong>Stage 1, Building Version One</strong><br />A dive into what it means to be in stage 1 of the design system maturity and a few mental models to keep you focused on the right things in this early stage.</li>\n<li><strong>Stage 2, Growing Adoption</strong><br />Unpacking stage 2 of the design system maturity model and a deep dive into adoption: broadening your perspective on adoption, the adoption curve, and how to create sustainable adoption.</li>\n<li><strong>Stage 3, Surviving the Teenage Years</strong><br />Understanding the relevant concerns for stage 3 of the design system maturity model and how to address the more nuanced challenges that come with this level of maturity.</li>\n<li><strong>Stage 4, Evolving a Healthy Program</strong><br />Exploring what it means to be in stage 4 of the design system maturity model, when you’ve become an influential leader in the eyes of the rest of your organization.</li>\n</ul>\n<h3>About The Author</h3>\n<div>\n<a href=\"https://bencallahan.com\"><img src=\"https://files.smashing.media/design-system-culture/ben-callahan.jpg\" /></a>\n<p><a href=\"https://bencallahan.com\">Ben Callahan</a> is an author, design system researcher, coach, and speaker. He founded <a href=\"https://bencallahan.com/redwoods\">Redwoods</a>, a design system community, and <a href=\"https://bencallahan.com/the-question\">The Question</a>, a weekly forum for collaborative learning. As a founding partner at <a href=\"https://sparkbox.com\">Sparkbox</a>, he helps organizations embed human-centered culture into their design systems. His work bridges people and systems, emphasizing sustainable growth, team alignment, and meaningful impact in technology. He believes every interaction is an opportunity to learn.</p>\n</div>\n\n<h3>Reviewers’ Testimonials</h3>\n<blockquote><img src=\"https://files.smashing.media/design-system-culture/lenora-porter.jpg\" />“This book is a clear and insightful blueprint for maturing design systems at scale. For well-supported teams, it offers strategy and clarity grounded in real examples. For smaller teams like mine, it serves as a North Star that helps you advocate for the work and find solutions that fit your team's maturity. I highly recommend it to anyone building a design system.”<br /><br />— <em>Lenora Porter, Product Designer</em></blockquote>\n\n<blockquote><img src=\"https://files.smashing.media/design-system-culture/tarunya-varma.jpg\" />“Ben draws connections between process, collaboration, and identity in ways that feel both intuitive and revelatory. Many design system books live comfortably in the tactical and technical, but this one moves beyond the how and into the why — inviting readers to reflect on their roles not just as product owners, designers or engineers, but as stewards of shared understanding within complex organisations. This book doesn’t prescribe rigid solutions. Instead, it encourages self-inquiry and alignment, asking readers to consider how they can bring intentionality, empathy, and resilience into the systems they touch.”<br /><br />— <em>Tarunya Varma, Product Design Manager, Tide</em></blockquote>\n\n<blockquote><img src=\"https://files.smashing.media/design-system-culture/ness-grixti.jpg\" />“Ben Callahan’s “Maturing Design Systems” puts language to the struggles many of us feel but can’t quite explain. It unpacks the hidden influence of culture, setup, and leadership, providing you with the clarity, tools, and frameworks to course-correct and move your system work forward, whether you’re navigating a growing startup or a scaling enterprise.”<br /><br />— <em>Ness Grixti, Design Lead, Wise, and Author of “A Practical Guide to Design System Components”</em></blockquote>\n\nDon’t Miss Out!\n<p>Through years of interviews, coaching, and consulting, Ben has discovered a model for how design systems mature. Understanding how systems tend to mature allows you to <strong>create a sustainable program around your design system</strong> — one that acknowledges the human and change-management side of this work, not just the technical and creative.</p>\n<p>This book will be a valuable resource for anyone working with design systems!</p>\nSpread The Word\n<p><a href=\"https://www.smashingmagazine.com/the-smashing-newsletter/\">Sign up to our Smashing newsletter</a> and be one of the first to know when <strong><em>Maturing Design Systems</em></strong> is available for preorder. We can’t wait to share this book with you!</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"ba0c545653904327dfe6fbb1793e3de943aa9825ae2c6643597c1bdc03e2fca5","category":"Tech"}