{"title":"เยอรมนี คนป่วยแห่งยุโรป","link":"https://markpeak.net/germany-sick-man-of-europe/","date":1763710330000,"content":"<p>นั่งดูสารคดีของ Financial Times ว่าด้วยปัญหาของเยอรมนี ซึ่งได้ชื่อว่า “<a href=\"https://markpeak.net/germany-election-2025/\">คนป่วยแห่งยุโรป</a>” (<a href=\"https://en.wikipedia.org/wiki/Sick_man_of_Europe\">Sick Man of Europe</a>) แล้วพบว่าหลายอย่างคล้ายกับไทย “คนป่วยแห่งเอเชีย” อยู่มาก</p>\n<p>เยอรมนี ซึ่งเคยเป็นเขตเศรษฐกิจใหญ่อันดับ 3 ของโลกอยู่ช่วงหนึ่ง ปัจจุบันกลับเต็มไปด้วยปัญหามากมายอย่างไม่น่าเชื่อ</p>\n<p>ตัวอย่างที่ชัดเจนที่สุดคือ ระบบรถไฟ Deutsche Bahn ที่ในอดีตเคยตรงเวลามากพอๆ กับรถไฟญี่ปุ่น กลายเป็นว่าตอนนี้ดีเลย์กระจาย จนแม้แต่คนเยอรมันกันเองยังแซวเพื่อนเวลาใครนัดแล้วมาช้าว่า “ช้าเหมือนรถไฟเยอรมัน” ไปแล้ว</p>\n<p>อีกหนึ่งความน่าอับอายของเยอรมนีในยุคหลังคือ สะพานข้ามแม่น้ำที่เมืองเดรสเดน จู่ๆ ก็พังถล่มลงมาเมื่อปีที่แล้ว 2024 และตอนนี้ก็ยังเป็นซากอยู่แบบนั้น รัฐบาลเยอรมันบอกว่าจะเริ่มซ่อมในปี 2027 โน่นเลย อะไรจะขนาดนั้น</p>\n<p>และที่เพิ่งทราบแต่น่าตกตะลึงไม่แพ้กัน สารคดีของ FT พาไปดู “โรงเรียน” ต่างๆ ในเยอรมนีที่ดูเหมือนไม่มีอะไร แต่อาคารเก่าชำรุดทรุดโทรมจนอาจถล่มลงมา รัฐบาลไม่มีเงินไปซ่อม ต้องใช้เสาเหล็กมาค้ำไว้ชั่วคราว (สภาพแย่กว่าตึกเมืองไทยอีก) บางโรงเรียนเจอปัญหาระบบฮีทเตอร์พัง ไม่มีแอร์ สภาพอากาศไม่พร้อมให้นักเรียนมานั่งเรียนได้ หรือบางโรงเรียนถึงขั้นต้องไปเรียนในตู้คอนเทนเนอร์ชั่วคราวด้วยซ้ำ</p>\n<p>นี่คือชาติมหาอำนาจอันดับ 3 ของโลก และแกนกลางของ EU จริงรึนี่</p>\n<p></p>\n<p>ปัญหาของเยอรมนีในยุคนี้เกิดจากทั้งปัจจัยภายในและปัจจัยภายนอก ที่สมัยก่อนอาจไม่เป็นประเด็นอะไร แต่พอยุคสมัยเปลี่ยน โลกเปลี่ยน แล้วปัจจัยเหล่านี้มันแย่พร้อมๆ กันหมด จนทำให้กลายเป็นปัญหาใหญ่ในทันที</p>\n<p>เริ่มจากปัจจัยภายนอกก่อน ในสารคดีของ FT อ้างความเห็นผู้เชี่ยวชาญคนหนึ่งที่สรุปไว้ดีมากว่า</p>\n<p>“เยอรมนีเอาท์ซอร์สพลังงานให้รัสเซีย เอาท์ซอร์สการบริโภคไปจีน และเอาท์ซอร์สการทหารให้อเมริกา”</p>\n<p>พอรัสเซียบุกยูเครน จีนกลายมาเป็นคู่แข่งด้านการผลิตแทนการเป็นผู้ซื้อ และอเมริกายุค Trump เลิกอุดหนุนการทหารให้ NATO ทำให้เยอรมนี “งานเข้า” ไปทุกภาคส่วน ทั้งเรื่องพลังงาน เศรษฐกิจ (ดู Volkswagen ตอนนี้สิครับ) และการทหาร</p>\n<p>ผมเพิ่งไปคุยกับมิตรสหายชาวเยอรมันท่านหนึ่งที่อาศัยอยู่ในไทย และองค์กรของเขาถูกโดนตัดงบไปด้วย ได้ข้อสรุปแบบสั้นๆ ว่า “peace money ถูกเอาไปเป็น war money”</p>\n<p>ส่วนปัจจัยภายใน ปัญหาเรื่องรถไฟช้า สะพานพัง อาคารเรียนเก่าซอมซ่อ เกิดจากการไม่ยอมลงทุนในโครงสร้างพื้นฐานในช่วงประมาณ 15 ปีที่ผ่านมา ในยุคของรัฐบาล Merkel อันยาวนาน</p>\n<p>เยอรมนีมีนโยบายที่เรียกว่า <a href=\"https://en.wikipedia.org/wiki/German_balanced_budget_amendment\">Debt Brake</a> เริ่มใช้ในปี 2009 ช่วงหลังวิกฤตการเงินโลกปี 2008 ที่ชาติยุโรปหลายแห่ง เช่น กรีซ อิตาลี สเปน ประสบปัญหาหนี้ท่วม จนต้องใช้มาตรการรัดเข็มขัดครั้งใหญ่ (austerity)</p>\n<p>รัฐบาล Merkel ในยุคนั้นกลัวเรื่องหนี้สาธารณะมาก จึงออกมาตรการจำกัดการขาดดุลงบประมาณ (deficit) ไว้ที่ 0.35% ของ GDP และถึงขั้นเขียนไว้ในรัฐธรรมนูญเลยด้วยซ้ำ เพื่อเป็นกฎเหล็กที่ไม่ถูกแก้ได้ง่ายๆ</p>\n<p>กฎ Debt Brake ส่งผลให้ช่วง 15 ปีที่ผ่านมา รัฐบาลเยอรมันไม่สามารถไปลงทุนปรับปรุง บำรุงรักษาโครงสร้างพื้นฐานเหล่านี้ได้มากนัก และผลของการไม่ลงทุนในโครงสร้างพื้นฐานมันกำลังแสดงออกมาเรื่อยๆ ผ่านรถไฟ สะพาน ถนน โรงเรียน ฯลฯ นั่นเอง</p>\n<p>มาถึงตอนนี้ มันพิสูจน์แล้วว่ามาตรการ Debt Brake มันไม่เวิร์ค เมื่อต้นปี 2025 <a href=\"https://markpeak.net/germany-election-2025/\">รัฐบาลใหม่ภายใต้การนำของ Friedrich Merz</a> เสนอแก้รัฐธรรมนูญ เพื่อเปิดทางให้รัฐบาลสามารถกู้เงินได้เพิ่ม เอาไปลงทุนในโครงสร้างพื้นฐาน + พลังงาน และไปลงทุนในการทหารรับมือรัสเซียด้วย ซึ่งก็ได้รับเสียงโหวตอย่างท่วมท้น 71.3% ของสภา</p>\n<p>รัฐบาล Merz ได้เสนอแผนลงทุนโครงสร้างพื้นฐานครั้งใหญ่ 5 แสนล้านยูโรในช่วง 12 ปีข้างหน้า เพื่ออัพเกรดโครงสร้างพื้นฐานทุกอย่างของประเทศ ไม่ว่าจะเป็นรถไฟ ปรับปรุงราง ระบบอาณัติสัญญาณใหม่ หรือด้านพลังงาน ที่พยายามเอาพลังงานความร้อนใต้ดิน (geothermal) มาใช้ทดแทนการพึ่งพาก๊าซของรัสเซีย เป็นต้น ในคลิปของ DW มีขยายประเด็นในเรื่องเหล่านี้ต่อ</p>\n<p></p>\n<p>การกู้เงิน 5 แสนล้านย่อมทำให้ประเทศเป็นหนี้มหาศาล และการปรับปรุงโครงสร้างพื้นฐานของเยอรมนีรอบใหม่คงต้องใช้เวลาอีกสักพักถึงจะเห็นผล แต่ Merz ก็ดูไม่มีทางเลือกอื่นแล้ว อยู่เฉยๆ ก็ไม่เกิดผลอะไรอยู่ดี ดังนั้นยอมกู้เงินมาทำให้ชีวิตความเป็นอยู่ของคนเยอรมันดีขึ้นบ้างบางส่วนก็น่าจะดีกว่า ในชื่อคลิปของ FT จึงใช้คำว่า Germany’s spending gamble นั่นเอง</p>\n<p>ดูเรื่องของเยอรมนีแล้วก็สะท้อนใจ เพราะประเทศไทยเองก็เป็นคนป่วยเหมือนกัน ไม่ได้ลงทุนโครงสร้างพื้นฐานมายาวนานเหมือนกัน หนี้สาธารณะก็อยู่ในระดับใกล้เคียงกัน (ประมาณ 60% GDP) แถมมีปัญหาหนักกว่าตรงที่ฐานของเราจนกว่ามาก และยังมีเรื่องคอรัปชั่นไปทุกหย่อมหญ้า ย่ำแย่กว่าเยอรมนีมากแน่ๆ</p>\n<p>ประเทศไทยไม่มีทางเลือกอื่นนอกจากลงทุนในโครงสร้างพื้นฐานครั้งใหญ่แบบเดียวกับเยอรมนี มันจะเห็นผลไม่เร็วเหมือนกัน กว่าจะสร้าง กว่าจะซ่อม ใช้เวลาอีกหลายปี แต่ก็เป็นเส้นทางอันยากลำบากที่ต้องก้าวเดินไปอยู่ดี</p>\n<p></p>The post <a href=\"https://markpeak.net/germany-sick-man-of-europe/\">เยอรมนี คนป่วยแห่งยุโรป</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"c0ec93b3bb1e507340dbdba1e07a39bc5ef916f3fd5706fd2ecce8320e7b19d8","category":"Thai"}