{"title":"Rider Spotlight: Mark DeLeon & Mely","link":"https://moots.com/blogs/news/rider-spotlight-mark-deleon-mely","date":1762459004000,"content":"\n      <p><img src=\"https://moots.com/wp-content/uploads/2025/08/Snapseed-2-1024x767.jpeg\" alt=\"\" width=\"1003\" height=\"751\" /></p>\n<p>For Mark DeLeon, it was love at first sight — a gold-accented Vamoots RSL whose flawless welds spoke of true craftsmanship. Named <em>Mely</em> after his grandmother, this bike is a tribute to resilience, strength, and grace.</p>\n<p>From city alleys to the Singapore Criterium, Mark rides with intention: “Not to impress, but to express myself.” Three words sum it up: Timeless. Craftsmanship. Resilient.</p>\n<p>---</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/TdFSG-Kay_0096-683x1024.jpeg\" alt=\"\" width=\"683\" height=\"1024\" /></p>\n<p><strong>What originally drew you to Moots? Was it the craftsmanship, the ride feel, the titanium, or something else?</strong></p>\n<p>The titanium caught my attention with its anodized detailing is perfect. I did check the brand out and saw how its built and precisely crafted; thats when I knew I found my forever bike.</p>\n<p> </p>\n<p><strong>Why did you pick your model bike?  </strong></p>\n<p>I bought it through a friend which collects Moots and the bike really has an appeal to me. love at first sight. I look on bike aesthetically and with that gold accent makes it better. Im a big fan of rim break so having it in the bike works perfectly.</p>\n<p> </p>\n<p><strong>Are there any details of the bike you are obsessed with? </strong></p>\n<p>Definitely the welds. Every time I look closely, im reminded that this frame was built by hand not in a factory.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/BE7B4A7A-A5B7-43FC-A9E4-34B1B394A73A-819x1024.jpeg\" alt=\"\" width=\"800\" height=\"1000\" /></p>\n<p><strong>Did you customize the build? Did you build this with a local shop, if so, which? </strong></p>\n<p>I got the bike already setup. I just switch some parts and want to have modern component in it. Its built full enve and i’ll keep it that way.</p>\n<p> </p>\n<p><strong>Any standout adventures, races, or moments that made you think, “This is why I bought this bike”? </strong></p>\n<p>We got invited to participate in the singapore criterium last November 2024 and I used it in the race. Using it in the street exploring singapore knowing how versatile titanium is gives me peace of mind and security that whatever happens I have a trusted bike.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/DSF8953-1024x683.jpeg\" alt=\"\" width=\"800\" height=\"534\" /></p>\n<p><strong>What does riding a Moots mean to you? </strong></p>\n<p>Riding in moots means riding with intention, not to impress but to express myself as a cyclist. I respect the craftsmanship put in the build of every bike and riding it is a work of art.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/IMG_2546-683x1024.jpeg\" alt=\"\" width=\"683\" height=\"1024\" /></p>\n<p><strong>What terrain or type of ride do you do the most on your Moots?</strong></p>\n<p>I love city rides, cruising and discovering hidden alleys from the beach to the track theres a lot of spots you can discover and makes every ride unique.</p>\n<p> </p>\n<p><strong>Tell us about a memorable ride, or trip that you took with your Moots.</strong></p>\n<p>The most memorable ride I had with my moots was in singapore where we did an alley cat race, its like having a city tour on a bike. Checking out key destination spot in singapore early in the morning with friends is by far the best experience I had.</p>\n<p> </p>\n<p><strong>If you had to describe your bike in three words, what would they be?</strong></p>\n<ul>\n<li>timeless</li>\n<li>craftsmanship</li>\n<li>resilient</li>\n</ul>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/IMG_1054-2-1024x682.jpeg\" alt=\"\" width=\"800\" height=\"533\" /></p>\n<p><strong>Did you buy your bike from a shop, if so what is the shop's name?</strong></p>\n<p>I bought it from a close friend who also collects Moots in Abu Dhabi. shout out to Cromwell!!!</p>\n<p> </p>\n<p><strong>If this bike had a name or personality, what would it be?</strong></p>\n<p>I named my moots after my grandmother - mely. Her resilience, strenght and grace continues to inspire me everyday. She taught me the value of patience, of doing things the right way, and of carrying yourself with quiet pride, all qualities I see in this bike. It’s more than just a bike; it’s a reflection of where I come from and who shaped me.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/IMG_6165-1024x768.jpeg\" alt=\"\" width=\"800\" height=\"600\" /></p>\n<p><strong>Tell us about your bike build! </strong></p>\n<ul>\n<li>my moots is a vamoots rsl with gold accent</li>\n<li>carbon ti chain ring</li>\n<li>srm power meter</li>\n<li>enve wheelset</li>\n<li>enve seatpost</li>\n<li>enve cockpit</li>\n<li>sram red</li>\n<li>chris king headset</li>\n<li>ceramic speed bottom bracket</li>\n</ul>\n<p> </p>\n<p>Mark DeLeon’s gold-accented Vamoots RSL was love at first sight — a masterpiece of titanium craftsmanship named <em>Mely</em> in honor of his grandmother. From city streets to the Singapore Criterium, it’s carried him through adventures with unmatched trust and style. We thank Mark for sharing his passion for Moots with us — riding not to impress, but to express.</p>\n<p> </p>\n<p> </p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"c3670921e6cf0fb8844310ccde6542d7366c60754b9cc3dd6a3d19b8fe96dfa6","category":"Cycling"}