{"title":"How GEICO lowered its $300M cloud spend and decoupled security from the network","link":"https://www.hashicorp.com/blog/how-geico-lowered-its-300m-cloud-spend-and-decoupled-security-from-the-network","date":1768327200000,"content":"<p>GEICO is a juggernaut in the US insurance industry, with an IT infrastructure team that has profoundly transformed its digital architecture over the past decade. Here’s a snapshot:</p>\n\n<ul>\n<li><strong>2013</strong>: 100% on-premises, the CIO decides to go all-in on public cloud</li>\n<li><strong>2020</strong>: 80% public cloud, distributed across 8 clouds, applications still have to use databases with a client-server model that's “calling back to the closet of IT in the back room”</li>\n<li><strong>2022</strong>: Cost structure is 3x higher with 200K cores of compute, 30K+ VMs; they’re spending $300M+ on infrastructure, but developer productivity is down, and they’ve lost two 9s of reliability</li>\n<li><strong>2026</strong>: Reduced cost to serve, increased portability, improved data quality for eventual AI initiatives, and simplified infrastructure through standardization and centralization</li>\n</ul>\n<img src=\"https://www.datocms-assets.com/2885/1768326574-geicos-costs.png\" alt=\"GEICO\" /><p>This is a <a href=\"https://www.hashicorp.com/en/resources/cloud-1-0-2-0-and-3-0-the-3-phases-of-cloud-adoption\">common journey</a> for enterprises: A lack of standards as you grow the surface area of your cloud for things like network access controls, user authentication, etc. isn't uncommon — just take a look at the recent <a href=\"https://www.hashicorp.com/en/cloud-complexity-report?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_MULTI_MULTI_geico-blog_CCR&amp;utm_content=intro-blog-link&amp;utm_offer=ccr\">Cloud Complexity Report</a>.</p>\n\n<blockquote>\n<p>“Every datacenter was configured differently. Every cloud provider was configured differently. And we have about 30 years of one-offs.”<br />— Ammar Zuberi, Distinguished Infrastructure Engineer, GEICO</p>\n</blockquote>\n\n<p>So how did GEICO finally set itself on a path to do cloud right and build the right foundation for AI? </p>\n\n<p>This post, <a href=\"https://www.youtube.com/watch?v=fKd5j6A7Nt0\">based on a talk from HashiConf</a>, outlines the important hybrid cloud management lessons GEICO learned and how HashiCorp Vault played a major role in building its new infrastructure platform. </p>\n\n<h2>Stop securing the network, start securing identity</h2>\n\n<p>GEICO’s Rebecca Weekly (VP, Infrastructure Engineering) and Ammar Zuberi (Distinguished Engineer, Infrastructure) explained one of their teams’ first observations: many of their woes were a result of their legacy, network-centric security model.</p>\n\n<p>For decades, GEICO — like many enterprises — used the network to enforce security. Firewalls, VLANs, and point-to-point rules dictated who could access what. That approach worked when infrastructure was static. It breaks down fast in hybrid and multi-cloud environments.</p>\n\n<p>Using the network as a comprehensive security perimeter created fragility, slow change cycles, and security blind spots. There was no single end-to-end view of access or posture, and every change required coordination across teams and vendors.</p>\n\n<p><strong><u>Their solution</u></strong>: move security up the stack and enforce policy as close to users and workloads as possible.</p>\n\n<blockquote>\n<p>“We decided that the network only has to do one job, which is move packets from point A to point B. We should do security at higher layers in our network, so we decided that we're going to make our network as simple as possible.”<br />— Ammar Zuberi, Distinguished Infrastructure Engineer, GEICO</p>\n</blockquote>\n\n<p>They started to shift away from their legacy network security model and adopted a new approach that involves:</p>\n\n<ul>\n<li>Enforcing policy at the platform and workload layers, tied to identity</li>\n<li>Certificates and identity from an IdP, enabling their new identity-first security approach</li>\n<li>Segmenting traffic at the workload level instead of the network level</li>\n</ul>\n\n<blockquote>\n<p>\"We could move these security requirements into the platform layers where you could get much more granular about what policies you were allowing and what kind of access was allowed. ... As far as security goes, as a workload owner, you're optimizing for a business process. You don't need to care as much about security.\" <br />— Ammar Zuberi, Distinguished Infrastructure Engineer, GEICO</p>\n\n<p>“Make your policy as close to your user or your workload as possible. That is the only way to scale. Period. Full stop.” <br />— Rebecca Weekly, VP, Infrastructure Engineering, GEICO</p>\n</blockquote>\n\n<p>Not only did this shift modernize their security posture, it also made the network more reliable and the workload deployment experience much better.</p>\n\n<h2><strong>Centralize identity and secrets to regain control</strong></h2>\n\n<p>Once GEICO stopped relying on the network for security, identity became the control plane.</p>\n\n<p>That meant rethinking how secrets, certificates, and workload identities were created, distributed, and governed across a sprawling hybrid cloud environment.</p>\n\n<p>Before this shift:</p>\n\n<ul>\n<li>Certificates were often handled manually</li>\n<li>There was no consistent certificate management strategy</li>\n<li>Access <a href=\"https://www.hashicorp.com/en/blog/the-pain-points-of-vpns-in-enterprise-it\">through a VPN</a> was broad and tied to network location rather than identity</li>\n</ul>\n\n<p><a href=\"https://www.hashicorp.com/en/products/vault?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_RISK_geico-blog_PRODUCTPAGE&amp;utm_content=mid-blog-cta&amp;utm_offer=product_page\">HashiCorp Vault</a> became a keystone of GEICO's new security model, providing an organizationally consistent way to manage secrets and identities across on-prem and multi-cloud environments.</p>\n\n<blockquote>\n<p>“We use workload identities, certificates, things like that that we got out of HashiCorp Vault to centralize authentication, policy enforcement, and the management of those secrets.”<br />— Ammar Zuberi, Distinguished Infrastructure Engineer, GEICO</p>\n</blockquote>\n\n<p>Just as importantly, Vault brought standardization to their security practices.</p>\n\n<blockquote>\n<p>“It forced us to standardize our access policies into a single place where we could actually reason about them.”<br />— Ammar Zuberi, Distinguished Infrastructure Engineer, GEICO</p>\n</blockquote>\n\n<h2>Build vs. buy</h2>\n\n<p>GEICO started its Vault adoption with Vault community edition, but quickly realized that spending time building more features on top of that, which they needed to meet regulations, was going to involve too much time and money spent on features that didn’t differentiate their business:</p>\n\n<blockquote>\n<p>“'We're going to build it all ourselves. We can do everything.' And then what we found in the process was that there were requirements for auditors in different domains that we could have built, but it probably would have taken us N months, and we needed to be compliant today. And that was really the outcome around controlling our own destiny and making the right decisions for us as a business. So we made the decision to move forward with HashiCorp’s version of Vault, and that allowed us to get these features out of the box versus having to build them for ourselves.” <br />— Ammar Zuberi, Distinguished Infrastructure Engineer, GEICO</p>\n</blockquote>\n\n<p>These out-of-the-box features that GEICO needed included:</p>\n\n<ul>\n<li>Integrated FIPS compliance</li>\n<li>Multi-region, high-availability Vault cluster replication</li>\n<li>Automated snapshots for disaster recovery</li>\n<li>Namespace and tenant isolation to manage secrets across multiple teams or business units</li>\n<li>Integrated HSM support for compliance-critical encryption</li>\n<li>Logging, monitoring, and security data needed for audits in one central place</li>\n</ul>\n\n<h2>Building a foundation for the AI era</h2>\n\n<p>GEICO is currently in the middle of its five-year transformation, which includes:</p>\n\n<ul>\n<li>Re-architecting six physical datacenters</li>\n<li>Overhauling 350 edge sites (regional offices and field agents)</li>\n<li>Migrating off bespoke mesh topologies without disrupting the 24/7 business</li>\n</ul>\n\n<p>Decoupling the network and most security functions made it possible to start doing this without major disruptions to the end users. The resulting efficiency so far has allowed GEICO to shift investment from ‘keeping the lights on’ to building value that makes their agents more effective and their customers' lives better.</p>\n\n<p>By standardizing identity, secrets, and access controls across environments, GEICO created the flexibility to place workloads where it made the most sense — based on cost, performance, or future needs like AI. </p>\n\n<blockquote>\n<p>“Part of getting foundational identity security and network correct is to be able to enable your AI revolution. That was a critical element: how can we reduce our cost to serve and increase our portability, improve our data quality so that we can unlock AI to make our agents that much more effective, that much more productive?” <br />— Rebecca Weekly, VP, Infrastructure Engineering, GEICO</p>\n</blockquote>\n\n<p>At HashiCorp, we’ve worked with thousands of organizations to help them through their digital transformations. Read <a href=\"https://www.hashicorp.com/en/on-demand/the-next-generation-of-cloud-security?utm_source=hashicorp.com&amp;utm_medium=internal&amp;utm_campaign=26Q1_WW_MULTI_RISK_geico-blog_WHITEPAPER&amp;utm_content=conclusion-cta&amp;utm_offer=whitepaper\">what we’ve learned about modern security</a>, and don’t hesitate to <a href=\"https://www.hashicorp.com/en/contact-sales?utm_source=hashicorp.com&amp;utm_medium=internal&amp;utm_campaign=26Q1_WW_MULTI_RISK_geico-blog_CONTACTSALES&amp;utm_content=end-of-blog-cta&amp;utm_offer=contactsales\">get in touch</a> if you’re also in need of a foundational transformation in preparation for AI development and adoption.</p>\n\n<p>Watch the full session on GEICO’s journey here:</p>\n","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"c4322180f264f3285a287e341519fd5d2d26ec5ec5ad3eaf802735c6dcd8f9b4","category":"Tech"}