{"title":"From the DF Archive: ‘Untitled Document Syndrome’","link":"https://daringfireball.net/2009/02/untitled_document_syndrome","date":1769459566000,"content":"\n<p>Yours truly back in 2009, hitting upon the same themes from <a href=\"https://daringfireball.net/linked/2026/01/26/chayka-textedit\">the item I just posted</a> about TextEdit vs. Apple Notes:</p>\n\n<blockquote>\n  <p>This, I think, explains the relative popularity of Mac OS X’s\nincluded Stickies application. For years, Stickies’s popularity\nconfounded me. Why would anyone use a note-taking utility that\nrequires you to leave every saved note open in its own window on\nscreen? The more you use it, the more cluttered it gets. But\nhere’s the thing: cluttered though it may be, <em>you never have to\nsave anything in Stickies</em>. Switch to Stickies, Command-N, type\nyour new note, and you’re done. (And, yes, if you create a new\nsticky note, then force-quit Stickies, the note you just created\nwill be there when next you launch the app. Stickies’s auto-save\nhappens while you type, not just at quit time.) It feels easy and\nit feels safe. Stickies does not offer a good long-term storage\ndesign, but it offers a frictionless short-term\njot-something-down-right-now design.</p>\n</blockquote>\n\n<p>Here we are in 2026, 17 years later, and, unsurprisingly, some things have changed. Apple Notes didn’t get a Mac version until Mac OS X 10.8 Mountain Lion in 2012. And Apple Notes didn’t really get <em>good</em> until 2016 or 2017. I still use Yojimbo, the library-based Mac app I wrote about in the above piece in 2009, but I don’t use it nearly as much as I used to. I use Apple Notes instead, for most notes, because it has good clients for iPhone and iPad (and Vision Pro and even Apple Watch).</p>\n\n<p>Other things, however, have not changed since 2009. Like the Stickies app, which is still around in MacOS 26 Tahoe, largely unchanged, except for <a href=\"https://onefoottsunami.com/2025/11/05/tahoes-terrible-icons/#:~:text=STICKIES\">a sad Liquid Glass-style icon</a>. If you still use Stickies, you should consider moving to Apple Notes. There’s even a command (File → Export All to Notes...) to import all your notes from Stickies into Apple Notes, with subfolders in Notes for each color sticky note. Apple Notes on the Mac even supports one of Stickies’s signature features: the Window → Float on Top command will keep a note’s window floating atop the windows from other apps even when Apple Notes is in the background.</p>\n\n<p>(Stickies has another cool feature that no other current app I know of does: it still supports “<a href=\"https://en.wikipedia.org/wiki/WindowShade\">window shading</a>”. Double-click the title bar of a note in Stickies and the rest of the window will “roll up”, leaving only the title bar behind. Double-click again and it rolls down. This was a built-in feature for all windows in all apps on classic Mac OS, starting with Mac OS 8, but was replaced in favor of minimizing windows into the Dock with Mac OS X. Window shading was a better feature (and could have been kept <em>alongside</em> minimizing into the Dock). With the Stickies app, window shading works particularly well with the aforementioned Float on Top feature — you can keep a floating window available, atop all other windows, but while it’s rolled up it hardly takes up any space or obscures anything underneath.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2026/01/26/from-the-df-archive-untitled-document-syndrome\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"c4bd1fd4f6d5ec42a71646de95e2ac51cbc6f7ba3416136ce78e899001917754","category":"Tech"}