{"title":"0255 | ขับเทสล่าไปเชียงใหม่…","link":"https://www.icez.net/blog/167520/tesla-model-3-lr-roadtrip-to-chiang-mai","date":1669652359000,"content":"<h1>Prelude</h1>\n<p>ซื้อ Tesla Model 3 Long Range มา(ซักพัก)แล้วครับ… จองปุ๊ปเทสล่าประกาศจดบริษัทเทสล่าในไทย… เจ็บปวดมาก 555 ข้ามเรื่องนี้ไปละกัน หรือใครอยากอ่านแบบสั้นๆ เชิญตามใน <a href=\"https://twitter.com/icez/status/1597200038223958016\">twitter</a> ได้ครับ</p>\n<h1>Planning</h1>\n<ul>\n<li>เว็บ/แอพคู่ใจคนใช้ EV ก็ต้อง <a href=\"https://www.plugshare.com\">www.plugshare.com</a> ครับ เว็บเดียวมีข้อมูลที่ชาร์จแทบจะทุกที่ในไทย มี Trip Planner ให้ใช้ด้วยนะ (แต่ไม่ค่อยเวิร์กเท่าไหร่)</li>\n<li>แนะนำให้กดหาเส้นทางจากใน PlugShare Trip Planner เทียบกับ Google Maps แล้วดูตำแหน่งที่ชาร์จคร่าวๆ ก่อน</li>\n<li>พบว่าพอ range รถเยอะมากๆ ทำให้ plan ง่ายขึ้นเยอะ ด้วยการปักตามที่ที่กะแวะกินข้าวไปเลย (ทุกๆ ระยะขับรถ 4-5 ชั่วโมงโดยประมาณ)</li>\n<li>เตรียมแผนสำรองเผื่อที่ชาร์จใช้ไม่ได้, ไม่ว่าง ไว้ด้วย</li>\n<li>แอพชาร์จรถทุกค่าย ลง+สมัครไว้ให้ครบ (ptt ev station pluz, elexa, pea volta, ea anywhere) — เดี๋ยวเขียนรีวิวแอพกับตู้ชาร์จแยกอีกอัน</li>\n</ul>\n<h1>วันเดินทางขาไป</h1>\n<ul>\n<li>ออกจากบ้านด้วยแบตเต็ม 100% ตอน 08.43 น.</li>\n<li>ตามแผนคือแวะชาร์จที่ <a href=\"https://goo.gl/maps/pyqQMhyVc4VnkYkg7\">pea volta ปั๊มบางจากคลองขลุง</a> หน้าปั๊มมีร้านข้าว, แผนสำรอง ขับเลยไปชาร์จที่ ptt ในเมืองกำแพงเพชร, แผนสำรองกว่าคือเลยไปชาร์จที่ elexa ปั๊ม PT ที่ตาก </li>\n<li>ไปถึงปั๊มบางจากแล้วหาร้านข้าวไม่เจอ (ซึ่งมันอยู่นอกปั๊ม ต้องเดินออกมานิดนึง) เลยเสียบชาร์จ เข้าห้องน้ำ ยืดเส้นยืดสายนิดหน่อยแล้วก็ออกเลย ชาร์จไป 12 นาทีได้แบตมา 11%\n<ul>\n<li>ตู้บอกว่าจ่ายไฟมา 8.814 หน่วย รถขึ้นว่าได้ไฟ 7.98 หน่วย</li>\n</ul>\n</li>\n<li>เลยขับไป <a href=\"https://goo.gl/maps/vTX3mkaR8SovEzWE8\">ptt กำแพงเพชร</a> เพื่อชาร์จอีกรอบ + ไปหาข้าวกิน (เรื่องนี้ ptt ทำได้ดีจริงๆ ไว้ใจได้ค่อนข้างมากว่าไปแล้วมีของกินแน่ๆ) ปรากฎว่าไปถึงแล้วมีคน(ทะเลาะกับตู้)ชาร์จอยู่ สาย DC ก็เลยไม่ว่าง เราก็เลยเอาสาย AC เสียบ ปรากฎว่าชาร์จไม่เข้า แอพค้างไปเลย คนข้างๆ เค้าโทรคุยกับ cc ให้ cc reset ตู้ให้ ก็เรียบร้อย เสียเวลาไป 15 นาที ชาร์จอีก 23 นาทีได้ไฟมา 5%\n<ul>\n<li>ตู้จ่ายไฟ 4.04 หน่วย รถได้ไฟ 3.91 หน่วย</li>\n</ul>\n</li>\n<li>ระหว่างกินข้าว ความที่มันเป็นชาร์จ AC ไฟเข้าแค่ 11kW ก็คือต้องวางแผนใหม่ ตอนนั้นแบตเหลือ 52% ก็เลยกะว่า ถ้าลากยาวแล้วถึง จะชาร์จที่ลำปางที่ห่างไป 250km <strong>แต่!!!</strong> ลืมไปว่าระหว่างทางมันขับขึ้นเขา</li>\n<li>ตอนเลย อ.เมือง ตาก แล้ว ลองสังเกตอัตราการใช้ไฟ กับระยะทางคงเหลือที่ขึ้นมาแล้วก็พบว่าน่าจะเฉียดฉิวเกินไป ก็เลยใช้แผนสำรอง แวะชาร์จที่ <a href=\"https://goo.gl/maps/ji5VdThBWmSTAv428\">ptt เถิน</a> แทน ไปถึงไฟเหลือ 19% ชาร์จ 33 นาที ได้ไฟมา 49% (รวมเป็น 68%)\n<ul>\n<li>ตู้จ่ายไฟ 40.6 หน่วย รถได้ไฟ 38.47 หน่วย</li>\n</ul>\n</li>\n<li>จากเถิน ชาร์จไปขนาดนี้ก็เลยวิ่งยาวถึงเชียงใหม่ 176km ถึงเชียงใหม่ 18.49 น.แบตเหลือ 36% </li>\n<li>เดินทางไป 681km รถใช้ไฟไป 100.4 หน่วย ใช้เวลาเดินทางประมาณ 10 ชั่วโมง</li>\n</ul>\n<p><img src=\"https://icez.net/files/ss/c-20221128-230017.png\" alt=\"\" /></p>\n<h1>วันเดินทางขากลับ</h1>\n<ul>\n<li>จริงๆ ต้องพูดถึงคืนก่อนหน้านั้นก่อน เพราะเอารถไปชาร์จจนแบต 80% ไว้ 5555</li>\n<li>ออกจากโรงแรม 08.52 น. วางแผนขับ 278km ไปชาร์จที่ <a href=\"https://goo.gl/maps/nSJ92of2crZSV27NA\">ptt ตาก</a> คำนวณเวลาแล้วถึงตอนเที่ยงพอดีเป๊ะ จะได้ชาร์จให้ปริ่มๆ 80-90% ปรากฎว่า แอพไม่ให้จอง slot ชาร์จตอนเที่ยง แถมไปถึงแล้วมี<a href=\"https://www.gwm.co.th/ora-good-cat/\">น้องแมว</a>ชาร์จไฟอยู่คันนึงอีกต่างหาก </li>\n<li>ก็เลยซื้อของกินเซเว่น แล้วขับเลยไปอีกนิด ไปชาร์จตู้ <a href=\"https://goo.gl/maps/i6qMD6233nfUZx1j6\">Elexa ที่ปั๊ม PT</a> แทน ถึงที่ชาร์จ แบตเหลือ 24% ชาร์จ 29 นาที ได้ไฟมา 56% (รวมเป็น 80%)\n<ul>\n<li>ตู้จ่ายไฟ 46.83 หน่วย รถได้ไฟ 43.46 หน่วย</li>\n</ul>\n</li>\n<li>หน้าจอรถขึ้นว่าวิ่งได้อีกเกือบๆ 500km แต่คำนวณเองน่าจะประมาณ 400km ระยะทางถึงบ้าน 410km ก็เลยเล็งที่ชาร์จที่ปั๊ม <a href=\"https://goo.gl/maps/9KcvHmyjziBQRgsR8\">ptt นครสวรรค์</a> ไว้อีกที่</li>\n<li>แล้วก็ลืมนึกไปอีกว่ามันขับลงเนิน ตอนเลยเมืองกำแพงเพชรก็เลยลองคำนวณระยะใหม่อีกรอบพบว่าน่าจะพอแบบพอดีมากๆ (ถึงบ้านอาจจะเหลือ 2-3%) แต่ยังสองจิตสองใจ เลยแวะที่ปั๊ม ptt นครสวรรค์เผื่อๆ ไว้ แต่ไม่ได้ชาร์จเพราะมีคนชาร์จอยู่ ก็เลยตัดสินใจว่ายิงยาวเลยละกัน ระหว่างทางก็ส่อง range รถเทียบกับระยะทางใน google maps ตลอดเลย</li>\n<li>สรุปว่าขับถึงบ้านได้จริงๆ ด้วย ตอน 17.52 น. แบตเหลือ 3% จริงๆ </li>\n<li>เดินทางไป 692km รถใช้ไฟไป 104.2 หน่วย ใช้เวลาเดินทางประมาณ 9 ชั่วโมง </li>\n</ul>\n<p><img src=\"https://icez.net/files/ss/c-20221128-231619.png\" alt=\"\" /></p>\n<h1>Conclusion</h1>\n<ul>\n<li>Range รถเยอะๆ ช่วยให้ชีวิตดีขึ้นจริงๆ ตอนวางแผนเคยลองคำนวณแบบรถแบตเต็มขับได้ 300km ก็คือแทบต้องแวะชาร์จทุก 2 ชั่วโมง แถมแทบพลาดไม่ได้เลยด้วย เพราะที่ชาร์จแต่ละที่ยังห่างกันค่อนข้างเยอะอยู่ (เฉลี่ยๆ ห่างกันทุกๆ 100km)</li>\n<li>รถ MG แอบได้เปรียบ ตรงที่สามารถชาร์จที่ศูนย์ MG ได้ด้วย ที่รถอื่นไม่มี — รอเทสลาเปิด Supercharger บ้าง</li>\n</ul>","author":"icez","siteTitle":"icez network","siteHash":"88787adba55f9deb5660f47c4b8baf580eb765815e4a6d536737656e8ab8bde4","entryHash":"c74c3bfd0d722a45ab965a924e158c97bfe3804e78d52101430d1c7d15daff66","category":"Thai"}