{"title":"Paul Magnier, cycling's next top sprinter: 'Why can't I fight for the rainbow jersey?'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/paul-magnier-cyclists-next-top-sprinter-why-cant-i-fight-for-the-rainbow-jersey","date":1768813546000,"content":"\n      <p><span>Paul Magnier only really announced himself to the cycling world last season, but he wants everyone to know that he has plans to be the best in the world. And sooner rather than later. “In three years the 2028 </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/kigali-world-championships-2025-elite-mens-road-race-contenders-and-prediction?srsltid=AfmBOoruWIXa60g_qDuNt1RfGHxvAhfIpNpZC4P6GaHPTxzvQNH2pmBs\"><span>World Championships </span></a><span>will be in Abu Dhabi, and then in Belgium and Denmark. So it’s going to be three big years to be a world champion. It’s really the biggest goal of my career.”</span><b></b></p>\n<p><span>Still only 21, Magnier has just inked a fresh contract extension with Soudal Quick-Step that will keep him with the Belgian team until the end of the 2029 season. Nineteen wins last year, in just his second season as a professional, served as merely a taster of what is to come. “In three years I will have three more seasons in the legs. I really hope I have no injuries, no sicknesses, nothing, and everything will go in a good way. If everything does go in a good way, why can I not be there fighting for this jersey?”</span><b></b></p>\n<p><span>The young boy born in Texas but raised in France to French parents is confident. And with good reason. Though none of Magnier’s wins in 2025 were taken at the truly big races, coming instead at the likes of the CRO Tour and Tour of Guangxi, he displayed an enviable level of consistency that is very difficult to train; it’s what separates the greatest sprinters from the sporadic winners. As Quick-Step begin life without <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-really-impressive-its-what-i-looking-for-remco-evenepoel-already-thriving-at-red-bull-bora-hansgrohe?tag=member\" target=\"_blank\">Remco Evenepoel</a> – “the fourth chapter,” as team boss Jurgen Foré refers to it – Magnier will become ever more important.</span><b></b></p>\n<p><span>“I think it was a normal decision [to sign the extension] after such a great season,” Magnier, speaking in fluent English, tells <em>Rouleur</em> and a smattering of other press at his team’s media day in Calpe, Spain. “The team was really confident in me and now with the departure of Remco they want to build the team back up again to be really strong in the Classics. I really believe that I can grow into the best condition possible here. It’s really the best sprint team. There are a lot of teams that try to be the best in the world, and they might be winning the GC races and others, but I really believe the Wolfpack want to keep focused on the sprints, the Classics and stage wins in the Grand Tours.”</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_45_1.png?v=1768308487\" alt=\"\" /><em>Magnier first showcased his sprinting speed in the professional ranks at the 2024 Tour of Britain. Image: Simon Wilkinon/SWPix.com.</em></span></p>\n<p><span>Reducing the 21-year-old Frenchman to that of just a pure sprinter, though, does a disservice to his repertoire of talents. Indeed, his former team manager Patrick Lefevere has already likened him to Tom Boonen. “I clearly believe that I will win more races as a sprinter, but I still really like the Classic races,” Magnier goes on. “When I won [Dwars door het] Hageland last year, racing with 10 riders 70km from the finish, that was something that I really liked. So I think it’s something that you can mix a bit. You need to make sure you don’t lose all of your speed but I will try to go for both.”</span><b></b></p>\n<p><span>He endured a tough lesson when at the Renewi Tour in August. “I saw that Mathieu [van der Poel] was really on another planet,” he says. “When he attacked with 100km [on stage three] I saw that he was really much stronger than me. But I believe I have time to one day get to his level. One day I will be ready to go for the big races.”</span><b></b></p>\n<p><span>A successful former mountain biker before committing to the road, Magnier draws on Van der Poel for inspiration, even if the Dutchman is stockier and doesn’t possess the same finishing speed that the Frenchman does. “I think he’s really an example – I really like the class he has when he’s riding his bike,” Magnier says. “He also has a profile that I like: mountain bike, cyclocross… he’s playing with his bike and really enjoying racing. This is really the type of rider that I would like to be in the future.”</span><b></b></p>\n<p><span>Cheeky, smiley, playful, Magnier exhibits fun, good vibes as well. Quick-Step see their future in him. For decades they have been the home of the best sprinters, and right now they count both Magnier and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/project-yellow-jersey?tag=member\" target=\"_blank\">Tim Merlier</a>, the most successful top-level sprinter last year. History suggests that at some point down the line – probably closer than many expect given that Quick-Step seem to have a tendency for spotting decline in performance ahead of others – Magnier will take Merlier’s place as the team’s number one sprinter. There may be a rivalry in the future, but for now there isn’t. “Tim has really tried to teach me his way of sprinting,” Magnier reveals, explaining how the Belgian has instructed his younger teammate to start his sprinting later. “We need to have space to sprint, and I’m really trying to learn that.”</span><b></b></p>\n<p><span>What 2026 will bring is probably much of the same: more Magnier wins at the smaller races against weaker fields, and more learning experiences as he takes on the biggest riders on the biggest stages. “I’m going to race Gent-Wevelgem and Dwars door Vlaanderen [in the spring]. I think Flanders and Roubaix are still really hard races. I don’t want to burn the steps and just go there to be on the startline. It’s like the Tour de France: if one day I go there, I want to be able to perform. I still believe that I need to progress and maybe get one more season in my legs to really perform in these races. But I can already perform at Omloop, Gent and Dwars, it’s going to be a super nice season.”</span></p>\n<p><em>Cover image: Getty Images</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"c95432ae9ae566c9001a38a5e0a9a8ea1364862cc598ae70091934dd184f6430","category":"Cycling"}