{"title":"Songs in the key of bike: meet Chloe Marie Aston 'the Piano Bike Girl'","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/songs-in-the-key-of-bike-meet-the-piano-bike-girl","date":1771059604000,"content":"\n      <p><em>This article was first published in Rouleur <a href=\"https://www.rouleur.cc/products/issue-140-copy\" target=\"_blank\">Issue 141</a></em></p>\n<p>It’s a chilly November day in Braunton, a small town a couple of kilometres inland from the North Devon coast. The proximity of the Saunton surf break, where the Atlantic Ocean pushes a salt breeze and consistent sets of rolling waves into wide, flat sands, has nudged the local economy towards catering for tourists and outsiders, as well as locals: independent shops, cafés, estate agents and surf hire shops line Exeter Road, the main thoroughfare through the town. Generally the pace of life here is slow, which is just as well: roadworks and a set of temporary traffic lights have reduced traffic movement to a crawl.</p>\n<p>Just outside the George Inn on Exeter Road, where proseccos are two-for-one on Mondays and Sundays see an offer where everybody is happy – kids eat free and there’s 25 per cent off gin – there is a piano. The piano is mounted on a bike.</p>\n<p>You hear Piano Bike Girl before you see her, though the sight is arresting enough, because while pianos and bikes are common enough, the combination is an unusual one. Her voice is as clear as a bell, and it is floating above the background noise of the traffic. The temporary traffic lights are on a four-way cycle, and the cars aren’t going anywhere fast, so the occupants of those at the front of the queue are winding down their windows and getting a free concert while the red lights stubbornly refuse to change. Pedestrians are stopping to listen and to take photographs on their phones. A young child wearing a Spiderman jacket is absolutely transfixed. Piano Bike Girl is singing <em>Top of the World</em> by The Carpenters, but we’re close enough to December that she’s also incorporating Christmas songs into her setlist: an effervescent rendition of <em>Winter Wonderland</em> is followed by a stripped-back and languid cover of <em>Merry Xmas Everybody</em> by Slade, which I prefer to the original because Noddy Holder gets on my nerves.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VRChloe_Marie_Aston_-_Piano_Bike_Girl_-_by_Alessandra_Bucci-28.jpg?v=1770814532\" alt=\"\" /></p>\n<p>Piano Bike Girl’s real name is Chloe Marie Aston and she is a singer and performer who grew up in Ilfracombe, just north of Braunton. The piano bike, which sits at the intersection of two things that I happen to like a great deal – cycling and pianos – is an improvised and ingenious solution to one of the most practical problems a pianist faces: the inherent unportability of their chosen instrument. It’s also just quite a cool thing. But beyond that, it’s a tangible demonstration of how worlds overlap, and a reminder that inspiration can sometimes come from unlikely places. Cycling and piano playing may be very different things – riding a bike for sport is a very physical pursuit, while playing music is more cerebral and creative. But many readers of this magazine might regard their cycling as an outlet for self-expression, while anybody who thinks playing the piano doesn’t take endurance and strength should try to play the first movement of Beethoven’s Eighth Piano Sonata. Cyclists and pianists are equally students of flow and rhythm. Perhaps we all have more in common than we think.</p>\n<p>Aston, who’d grown up singing in musical theatre groups and loved open mic nights, tried busking with a guitar aged 14, but reported back to her father Lee that her fingers got sore while playing. He suggested an alternative – if she learned to play the piano, he’d try an idea that he’d had to solve the mobility problem. Lee had a friend with two decaying and battered Raleigh bikes from the original mountain bike boom of the 1980s, with enough working parts between them to make one good bike. Lee was a former car mechanic, so his friend asked him to put together a working bike, then Lee started working out how he could adapt it to his idea.</p>\n<p>He considered something he’d seen at Disneyland – piano bikes which were more like unicycles where the rider swivelled to turn the piano. And he looked into cargo trikes, where the whole front end pivots on a bearing. He thought, since North Devon is quite a hilly place and that the bike would occasionally need to be ridden up and down hills, the cargo bike solution was a better one. He drew a piano out to scale, hacksawed the frame of the bike up, made a metal platform to stand the body on, and built the carcass of the piano to sit on the platform. (At this point, it’s necessary to point out that a real upright piano weighs 250kg or more, and that the piano bike is a wooden carcass with an electric keyboard – anybody is welcome to try putting a real piano on a bike, but it would take more than a hacksawed mountain bike to achieve, and good luck riding it up a hill… or down the other side.)</p>\n<p>Inside the body of the piano, Lee built in speakers and space for an amplifier and battery, with cupboards at the top for a mixer, along with a bit of storage, and a mic stand. All Aston has to do to perform is pedal the bike to her pitch, set out a small suitcase selling CDs (suggested donation £5) and for people to throw in money, put a water bottle into the cage mounted on the frame (more overlap between cyclists and singers: the need to stay hydrated), plug in a mic and an earphone, and turn the keyboard on.</p>\n<p>Aston has been singing and performing more or less since she can remember. She was gifted a DVD of <em>The Little Mermaid</em> when she was young, and fell in love with the songs. She attended stage school in her spare time through childhood, took a music GCSE at school and studied for a diploma in music performance and production arts at Petroc College in Barnstaple.</p>\n<p>“Dad said I was singing before I was talking,” she says. “Singing has always been something that has made me, me. When I’m singing I’m in my element. Being on stage, performing and singing, that is my happy place.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Chloe_Marie_Aston_-_Piano_Bike_Girl_-_by_Alessandra_Bucci-6.jpg?v=1770814537\" alt=\"\" /></p>\n<p>While Lee worked on the piano bike, Aston worked on learning to play. She is mainly self-taught, but she worked with a friend of the family, a piano teacher, who taught her scales and chords and how to position her hands properly, along with a bit of music theory. At first, she just went out and busked, but she performed at a steampunk event in Minehead and got inspired by the aesthetic.</p>\n<p>“I went on to Amazon and ordered a corset and a top hat with goggles and stuff, and thought I’d give it a test run. Everybody liked it, I was getting a lot of compliments and the costume finished off the look, because I think the piano is quite Victorian steampunk. I bought more outfits and it all became part of my act. I wouldn’t feel like myself if I was doing this in normal clothes,” she says.</p>\n<p>When Aston is busking, she’ll sing covers because that’s what the punters tend to like and identify with. However she also writes and records her own songs and music: <em>Traveller</em> is a nostalgic and reflective evocation of her West Country roots, <em>Coffee in Bed</em> manages to be both melancholic and uplifting, while listening to <em>Maniac,</em> made in collaboration with Nush3n, a Belgian producer of electronic dance music, made me feel like I was flying, which is what good house music is supposed to do.</p>\n<p>“When I was first getting into songwriting I was studying music theory classes and we were being taught about how to make complex chord progressions. My early songs, I was trying to make too complicated, but now I do what I think sounds nice. And my early songs weren’t really about anything in particular, because I hadn’t really gone through anything. But as my life has gone on it’s about things I’ve gone through.”</p>\n<p>Though her most regular gigs are in North Devon and the West Country, Aston has performed all over the southern half of the UK and into the Midlands. When she went to London, she rode the piano bike from Paddington to Leicester Square, inspired by a DJ who has a set of decks mounted on his bike. The video is on YouTube, and two of the most London things about it are the number of cyclists sharing the roads and bike lanes with her, and the fact that many people barely bat an eyelid at the sight of a piano on a bike, apart from the fellow cyclist who first asked if she’d fallen from the sky, and then pointed her in the direction of the longer, but more pleasant option of crossing Hyde Park, then riding past Buckingham Palace and up The Mall, rather than the more direct but crowded route through the West End.</p>\n<p>“That was the longest and craziest ride I’ve done,” she says. “London’s flat and the bike lanes are massive so I didn’t have to go on the road a lot. It was amazing riding past Buckingham Palace and Big Ben.”</p>\n<p>In October this year, Aston did, however, suffer her biggest blow since starting performing as Piano Bike Girl. While she was busking in Tamworth, her dad’s van, containing most of her costumes and spare kit, was stolen.</p>\n<p>“I finished my first set and said to dad that I was getting a bit cold, so could he go and get my cloak,” she says. “He went back to the van and then called and said the van had gone.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_67_1e69c28f-13ce-429f-9b50-55b32dc3440f.png?v=1770814602\" alt=\"\" /></p>\n<p>Lee phoned the police, but no officers were available to help. Aston and her father were stuck in the middle of Tamworth with a piano bike, nowhere to put it and an hour away from their accommodation. Eventually they saw a police van and chatted with one of the officers, who said he’d have a word with his sergeant to see about keeping the piano bike in the police station overnight. Aston had to ride it five miles to the police station, including a dual carriageway en route.</p>\n<p>“I was dressed up as a witch because it was Hallowe’en, and I was absolutely distraught, cycling the piano, with people hanging out of their windows taking photos of me as they drove past. I was thinking, this is not where I want to be right now,” Aston recalls. While Lee sorted everything out with the insurance, Aston wondered if it was time to stop. Without her costumes and spare kit, she was not quite back to square one, but an important part of her performance had been seriously compromised. However, friends and supporters urged her to set up a GoFundMe, to raise money to replace her stolen costumes.</p>\n<p>She set the target at £2,500, the cost of replacing the costumes and gear, not expecting to get anywhere near, but maybe enough to get up and running again. However, it turned out she’d inspired a few people along the way. The television and radio presenter Jeremy Vine had seen her perform in Devon, and followed Aston on Instagram – he talked about her plight on Channel 5, while the presenter Tina Daheley, who was standing in for Vine on his Radio 2 show, did a piece on her. Another friend, the TikTok celebrity Spudman, pushed her fundraiser on his channels.</p>\n<p>“I was pretty down, and didn’t know if this was all a sign to pack it all in and find a different way,” she says. “But within half an hour I had two and a half thousand pounds. Then it kept going up. Jeremy Vine was amazing. I was on lots of local radio and TV news. The amount of support was amazing and I was very grateful. I don’t think I fully realised that what I did meant so much to people, but a lot of people told me it meant a lot when I was visiting their town.”</p>\n<p>In the end, the GoFundMe raised over £10,000, while insurance covered the van. Piano Bike Girl was back on the road.</p>\n<p>Aston’s plan is to continue touring as Piano Bike Girl, to push further north and expand the number of towns in which she has performed, but also to try and develop her act and songwriting.</p>\n<p>“I’d like to take it to the next level. Not necessarily by getting a record deal and doing it that way, but to do this at a level where maybe I’m performing at more concerts and festivals, recording my own stuff and getting a bit of help making it,” she says. “That’s the dream for me. I love busking, and it gets my name out there – hopefully the right person will see me at the right time and I can take this further.</p>\n<p>“But I love it. I have a very rewarding job and I think I’m very lucky.”</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"cb4daa4b28ab564073125d596430f6d8e443cf412f7796daf72bda95059a52bb","category":"Cycling"}