{"title":"Top Stories: Apple Event on March 4, iOS 26.4 Beta, and More","link":"https://www.macrumors.com/2026/02/21/top-stories-apple-event-march-4/","date":1771682400000,"content":"It looks like our first major Apple product announcements of 2026 are right around the corner, with Apple announcing a \"special Apple Experience\" for members of the media scheduled for March 4 where we're expecting to see them get hands-on time with several newly announced products.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/top-stories-2026-02-21.jpg\" alt=\"\" width=\"1600\" height=\"900\" />\r<br />\nIn other Apple news this week, the first betas of iOS 26.4 and related updates include some new features and enhancements, while we heard a bit more about the iPhone 18 Pro and Pro Max coming later this year, so read on below for all the details on these stories and more!\r<br />\n\r<br />\n<h2>Top Stories</h2>\r<br />\n<h3>Apple Announces Special Event in New York, London, and Shanghai on March 4</h3>\r<br />\nApple this week <a href=\"https://www.macrumors.com/2026/02/16/apple-announces-special-event-in-new-york/\">invited members of the media to a \"special Apple Experience\"</a> taking place simultaneously in New York, London, and Shanghai on Wednesday, March 4.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/Apple-Announces-Special-Event-in-New-York-Feature-1.jpg\" alt=\"\" width=\"1888\" height=\"1063\" />\r<br />\nRather than a traditional Apple event, it sounds like these \"experiences\" will be opportunities for the media to get hands-on time with a variety of products being announced at the start of or slightly before the event time.\r<br />\n\r<br />\nIt actually sounds like we may be getting <a href=\"https://www.macrumors.com/2026/02/17/apple-announcements-first-week-of-march/\">several days of press release announcements</a> in the first part of the week, culminating in the media experiences on Wednesday. While we don't know exactly what products will be announced that week, there are a <a href=\"https://www.macrumors.com/2026/02/17/apple-event-march-2026-preview/\">host of new products expected in the near future</a> including the iPhone 17e, M5 Pro and M5 Max MacBook Pro models, new iPads, and more.\r<br />\n\r<br />\n<h3>Everything New in iOS 26.4 Beta 1</h3>\r<br />\nFollowing last week's release of iOS 26.3, Apple this week seeded the first betas of iOS 26.4 and related updates.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/iOS-26.4-Whats-New-Feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\nWhile it doesn't include the more personalized Siri we had been hoping for, <a href=\"https://www.macrumors.com/guide/ios-26-4-beta-features/\">there are a bunch of changes and new features</a> in the update.\r<br />\n\r<br />\nOne of the more interesting changes being prepped for in the release is support for <a href=\"https://www.macrumors.com/2026/02/18/ios-26-4-major-new-carplay-feature-revealed/\">CarPlay video over AirPlay</a>, which will allow users to stream Apple TV and other video content to their car's infotainment screen while their vehicle is parked.\r<br />\n\r<br />\n<h3>Five iPhone 18 Pro Features Revealed in New Report</h3>\r<br />\nWhile the iPhone 18 Pro and Pro Max should have very similar designs to their predecessors, they are likely to be getting an array of new features and upgrades to attract customers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2025/11/Coffee-Burgundy-and-Purple-iPhone-18-Pro-Mock.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\nResearch analyst Jeff Pu recently <a href=\"https://www.macrumors.com/2026/02/13/five-iphone-18-pro-features-revealed-in-new-report/\">outlined five upgrades he's expecting to see</a> in the new models, and we've recapped a full list of <a href=\"https://www.macrumors.com/2026/02/18/reasons-to-wait-iphone-18-pro/\">ten reasons why you might want to wait</a> for the new models if you're considering buying now.\r<br />\n\r<br />\n<h3>Apple Reveals How Many iPhones Are Running iOS 26</h3>\r<br />\nWith the transition to the controversial new Liquid Glass design in iOS 26, some users appear to have been holding off on upgrading, but new data released by Apple last week suggests the impact is relatively small.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2025/08/iOS-26-Glass-Feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\n<a href=\"https://www.macrumors.com/2026/02/13/apple-shares-ios-26-adoption-stats/\">Apple adoption data</a> shows roughly the same share of devices are running iOS 26 at this point as were running iOS 18 a year ago, although the company did wait three weeks longer to release data this year. So while it appears adoption is lagging a bit this year, it's not a massive difference.\r<br />\n\r<br />\n<h3>Toyota Rolling Out Apple Wallet Car Keys on iPhone</h3>\r<br />\nToyota, the world's largest car manufacturer, is <a href=\"https://www.macrumors.com/2026/02/17/toyota-apple-wallet-car-keys/\">finally rolling out support for Apple's digital car key feature</a>, allowing users to lock, unlock, and start compatible vehicles from the Wallet app on their iPhone or Apple Watch.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/Toyota-Rav4-Car-Key-Feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" />\r<br />\nSigns of the impending support were discovered back in December, and we've seen our first report of vehicles in the wild supporting it with the new 2026 RAV4.\r<br />\n\r<br />\n<h3>Apple Launching New 'Sales Coach' App</h3>\r<br />\nApple plans to <a href=\"https://www.macrumors.com/2026/02/13/apple-launching-sales-coach-app/\">launch a rebranded \"Sales Coach\" app</a> on the iPhone and iPad later this month, according to a source familiar with the matter.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2026/02/Apple-Sales-Coach-App.jpg\" alt=\"\" width=\"1600\" height=\"900\" />\r<br />\n\"Sales Coach\" will arrive as an update to Apple's existing \"SEED\" app, and it will continue to provide sales tips and training resources to Apple Store and Apple Authorized Reseller employees around the world. For example, there are articles and videos highlighting everything from reasons to upgrade to a newer iPhone to popular iPad features.\r<br />\n\r<br />\n<h2>MacRumors Newsletter</h2>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/feb-19-2026\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2026/02/21/top-stories-apple-event-march-4/\">Top Stories: Apple Event on March 4, iOS 26.4 Beta, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-apple-event-on-march-4-ios-26-4-beta-and-more.2478017/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"cc8ce3a362849725e08fce8899c8b900e044886bab259a31645d0737369ce309","category":"Apple"}