{"title":"At 30","link":"https://blog.whs.in.th/node/3722","date":1730213091000,"content":"<p>จำได้ว่าตอนม. 5-6 รุ่นพี่ที่รู้จักขึ้นมหาลัยแล้ว หายตัวไปจาก Twitter กันหมด ตอนนั้นรู้สึกว่าขึ้นมหาลัยเมื่อไรอยากจะหาเฉลยว่ามันเป็นยังไงที่เด็กมัธยมไม่เข้าใจ</p>\n<p>แล้วก็รู้สึกว่าเป็นสิ่งหนึ่งที่อยากทำในชีวิตคือทุกคนอยากรู้ว่าการมีอายุมากกว่ามันเป็นยังไงนะ จนกระทั่งถึงว่าตายแล้วไปไหน</p>\n<p>เนื่องในโอกาสวันเกิดปีที่ 30 แล้วเลยอยากมาเขียนหน่อยว่าอายุ 30 แล้วเป็นอย่างไร</p>\n<h2>The De-aging Population</h2>\n<p>เคยฟังผู้หญิงคุยกันน่าจะในลิฟต์ว่าสมัยก่อนบอกว่า 30 แล้วไม่มีผัวคือขึ้นคาน แต่ปัจจุบันคือใครแต่งงานก่อน 30 คือเป็น special case ไปแล้ว</p>\n<p>ส่วนตัวคิดว่าจริง สิ่งที่เกิดขึ้นคือ</p>\n<ol>\n<li>คน gen เราเป็นต้นไปเรายังเป็นเด็กอยู่นานกว่าวัยก่อนหน้าที่ถูกสังคมบังคับให้เป็นผู้ใหญ่มากขึ้น</li>\n<li>การมาของ social media ทำให้กลุ่มคนที่อยากเป็นเด็กอยู่มารวมตัวกันได้เปิดเผย แล้วก็พบว่าเป็นกลุ่มใหญ่มากจนเราไม่จำเป็นต้องเปลี่ยนตัวเองเพื่อคนอื่นก็ได้ (พวก “น้อน” “ต้าว” เนี่ย ถ้าเป็นสมัยประถมคือโดนด่าภาษาวิบัติห้ามใช้ในเว็บบอร์ดนะ)</li>\n</ol>\n<p>ตอนนี้กำลังสงสัยว่า ยุคถัดไปคือ VTuber และพวกเกม FiveM ที่ทำให้ผู้ใหญ่ปลดปล่อยด้านที่เป็นเด็กได้โดยไม่มีข้อจำกัดทางสังคม (คือ VTuber หรือการ roleplay ในเกมอาจจะใช้รูปตัวละครที่อายุไม่ถึง 18 หรือ 15 แต่ทุกคนเข้าใจว่าสังกัดค่ายน่าจะกรองคนที่อยู่หลังตัวละครนั้นมาแล้วว่าอายุมากกว่า 18 ดังนั้นคนที่เล่นก็สามารถแสดงความเป็นเด็กได้ในพื้นที่ตรงนั้น ในขณะที่คนดูก็โต้ตอบกับเค้าได้ทั้งแบบเด็กและผู้ใหญ่) แต่มันอาจจะยังเป็นกลุ่มวงจำกัดอยู่ในปัจจุบันเหมือนกับที่กลุ่มคนดูอนิเมะก็เป็นวงจำกัดเมื่อสัก 10 ปีก่อน</p>\n<p>ปัญหาสังคมที่กังวลคือพอมีลูกแล้วเราจะเกษียณกันก่อนที่ลูกจะเรียนจบ อาจจะมีปัญหาในรุ่นลูกของเราตอนก่อนถึงวัยทำงานก็ได้</p>\n<h2>You’re not getting any younger</h2>\n<p>ตอนเป็นเด็กสงสัยว่าทำไมผู้ใหญ่ชอบแอ๊บเด็ก</p>\n<p>ตอนนี้ค้นพบว่าปัญหามันเหมือนต้มกบ คือไม่ได้มีวันไหนวันหนึ่งที่ตื่นขึ้นมาแล้วบอกว่าคุณเป็นผู้ใหญ่แล้วนะ ทุกวันนี้เวลากลับไปเจอน้องมัธยมที่โรงเรียนก็ยังอยากเรียกน้อง ทั้งๆ ที่อายุต่างกัน 12-15 ปีแล้ว แล้วก็คงแทนตัวเองว่าพี่เหมือนรุ่นพี่แต่จริงๆ ก็ต้องเป็นอา (น้องของพ่อ) ได้แล้ว</p>\n<p>คือโลกมันเปลี่ยนไปแต่มันไม่มีใครบอกเราว่าทำตัวเป็นอาได้แล้ว ตั้งแต่วันนี้คุณหมดสิทธิ์ทำตัวเป็นรุ่นพี่แล้ว</p>\n<p>แล้วการเปลี่ยนสถานะเป็นอา มัน meme มาตั้งแต่โบราณว่าแก่แล้วไม่ดี เราก็ไม่อยากเข้าไปอยู่ในมีมนั้น และมันไม่ชินกับการเปลี่ยนแปลง มันก็เลยทำให้เรารู้สึกว่าไม่อยากแก่ จริงๆ มันคืออยากทำตัวเหมือนเดิมไม่อยากปรับตัวนี่แหละ</p>\n<p>เคยได้ยินว่านี่คือวิธีหนึ่งที่ Google เคยใช้ retain พนักงาน คือออฟฟิศที่มันมีสไลเดอร์ มีบ้านบอลให้ผู้ใหญ่เล่น มันก็จะรู้สึกว่าไปที่อื่นต้องโตแล้วนะ แต่ถึงจุดหนึ่งบริษัทก็ต้องโตผ่านวัยนั้นเหมือนกัน</p>\n<p>ปัญหาถัดมาคือพอกลายเป็นอา มันไม่ได้มีต้นแบบหรือถูกสอนมาว่าต้องทำตัวยังไง มันก็มีสองทางคือ default ไปว่าผู้ใหญ่ที่เราเห็นเป็นต้นแบบต้องทำตัวแบบนี้ ก็ลอกต่อๆ กันมา หรืออีกทางคือก็ทำตัวเป็นเด็กต่อไปอย่างที่เขียนไปก่อนหน้าว่าเดี๋ยวนี้มันเป็นที่ยอมรับกันง่ายขึ้น</p>\n<h2>Generation Gap</h2>\n<p>แต่ถึงบอกว่าโตแล้วก็ยังทำเหมือนไม่รู้จักโตได้ ถึงจะทำเหมือนเดิมที่เคยเป็นมา มันก็ไม่ใช่เด็กแล้วเพราะว่าเด็กสมัยใหม่ก็โตมาคนละแบบกับที่เราโตมา วัฒนธรรมมันต่างกัน และขนาดร่างกาย การแต่งกายไม่เหมือนกันมันเลยทำให้ cringe ที่เขาเรียกว่าแอ๊บเด็ก</p>\n<p>นึกภาพเหมือนผีเด็กใน Ju-on คือคนที่เล่นเป็นเด็ก 7 ขวบ แล้วเวอร์ชั่นฝรั่งเอามา remake เอาคนอายุ 15 มาเล่นก็คือมันไม่ได้ฟีลน่ากลัวเหมือนผีเด็กแล้ว</p>\n<p>อีกอย่างหนึ่งที่เราเห็นแต่เราทำไม่ได้คือความเกรียน ตอนเป็นเด็กคนจะรู้สึกว่าเราทำอะไรที่มันเก่งมาก ผู้ใหญ่ทำไม่ได้ พอโตขึ้นมาก็เริ่มเห็นบางคนที่ทำอะไรที่เราทำไม่ได้แล้วก็มี ซึ่งพอคิดดูแล้วก็คิดว่ามันมาจากว่าพอโตขึ้น มีประสบการณ์เยอะขึ้นมันทำให้เรามี checklist มากขึ้นว่าต้องทำอะไร แล้วเราข้ามไม่ได้</p>\n<p>ถ้ายกตัวอย่างที่เห็นภาพช่วงนี้คือกำลัง rewrite โค้ดที่เขียนตอนม. 6 ซึ่งมันเป็น PHP 4-5 ไฟล์ พอ rewrite ตอนนี้ 20 ไฟล์ยังไม่จบ ไม่รวม dependency ที่เดิมไม่มี ตอนนี้เพียบ เพราะว่าโตแล้วเราบอกว่าเขียนโค้ดไฟล์เดียวไม่ได้เด็ดขาด จะเขียนโค้ดแล้ว test ไม่ได้ก็ไม่ดีควรจะ test ได้ และให้ดีก็คือใช้โค้ดสำเร็จที่มันเทสมาแล้วจะได้ไม่ต้องทำเอง</p>\n<p>มันกลายเป็นว่าโค้ดเดิมที่น่าจะสร้างขึ้นใน 1 สัปดาห์ เขียนมาครึ่งเดือนก็ไม่เสร็จ ตอนนี้ให้กลับไปเร็วแบบนั้นไม่มีทางทำได้แล้วเพราะสมองถูกหล่อหลอมมาว่า bad code ห้ามเขียน untested code ห้ามเอาไปใช้จริง ถึงแม้มันจะเร็วมากก็ตาม</p>\n<p>เรื่องเกรียนๆ แบบนี้เราก็อาจจะเห็นใน field แบบอื่น แบบการทำบางอย่างที่เราต้องทำให้ดี ถูกต้อง ครบถ้วน แต่เด็กรุ่นใหม่ใช้ทางลัดหรือตัดช่องน้อยพอตัวแล้วทำเสร็จ พวกนี้รู้สึกว่าโตขึ้นมาแล้วทำไม่ได้เพราะประสบการณ์เราบอกว่าทำไปแล้วจะซวยตามหลัง โดยไม่ได้คิดว่ามันจะซวยจริงมั้ย</p>\n<p>ตอนนี้ก็เลยรู้สึกว่าทำงานกับคนรุ่นใหม่กว่า สิ่งที่ควรทำคือ</p>\n<ol>\n<li>บอกปัญหา รวมถึงถ้าคิดว่าทำแล้วจะติดตรงไหนที่เราไม่เลือก solution ไม่ดี ก็บอกไป แล้วให้เขาแก้ไขยังไงก็ได้ ไม่ต้องไป micromanage</li>\n<li>ดูผลว่าถูกต้องมั้ย มันอาจจะไม่ดีเหมือนเราทำเองแต่บางทีก็อาจจะเห็นว่ามันมีเฉลยแบบอื่นๆ</li>\n<li>ดูผลในส่วนที่เป็น edge case ว่าเขาได้จัดการ edge case ตามที่เราคิดมั้ย หรือมีมากกว่าที่เราคิดมั้ย จะได้เก็บไว้คิดต่อว่าคนนี้เรายังไว้ใจให้ทำแบบนี้ได้มั้ย</li>\n</ol>\n<p>วิธีนี้ช่วยแก้ปัญหาประสบการณ์ได้คือถ้าเราคิดเยอะก็ปล่อยให้คนคิดน้อยทำแทน แล้วเรามีหน้าที่คิดต่อว่าตรงไหนที่เราคิดเยอะแล้วต้องตึง ตรงไหนหย่อนได้ แต่มันจะใช้ได้ผลเฉพาะคนที่ยังใช้ความคิดทำงานอยู่ บางคนทำตามที่สั่งอย่างเดียวก็มีเหมือนกันต้องสั่งให้ละเอียดจนแทบจะไปทำงานแทนอยู่แล้ว</p>\n<h2>Imagination</h2>\n<p>ตอนอายุสัก 22 รู้สึกว่าสูญเสียจินตนาการไปเยอะมากๆ ยังหาสาเหตุไม่ได้ว่าเพราะอะไร คิดว่ามันอาจจะเป็นเหตุผลว่าทำไมผู้ใหญ่ไม่เล่น Roblox หรือ Minecraft เพราะว่าเราเห็นบล็อกเป็นบล็อกไม่ได้เป็นอย่างอื่น สำหรับเราแล้วเรามองเห็นบล็อกเป็นโรงงานใน Factorio ได้แค่นั้นแล้ว</p>\n<p>เรื่องการสูญเสียจินตนาการนี่คิดว่าเกม <a href=\"https://store.steampowered.com/app/337340/Finding_Paradise/\">Finding Paradise</a> ทำไว้ดีมากๆ เล่นจบแล้วร้องไห้และกลัวเพราะรู้สึกว่าจินตนาการที่เหลืออยู่มันกำลังจะหมดไป เรายังอยากเก็บมันไว้อยู่ เหมือนคนตกเหวที่คว้าอะไรได้ก็ต้องคว้าแล้ว แต่มันแทบไม่มีอะไรเหลือแล้ว</p>\n<h2>Conservative</h2>\n<p>เหมือนเคยแปลงานหนึ่งลงบล็อกนี้ว่ายิ่งโตขึ้นคุณจะ conservative มากขึ้น ซึ่งคิดว่าจริง เหตุผลน่าจะคือ</p>\n<ol>\n<li>โลกมันเปลี่ยนไปแต่เราพอใจกับสิ่งที่เป็นอยู่ในปัจจุบัน ซึ่งตอนอายุน้อยมันไม่มีภาระ มีเงื่อนไขอะไรเราก็เลือกอะไรที่มันล้ำสมัยได้ แต่ผ่านไปแล้วเราก็ยังเลือกแบบนั้นอยู่เพราะไม่อยากเสีย cost ในการเปลี่ยนแปลงหรือ retrain</li>\n<li>เรา give a fuck น้อยลงเพราะเรารู้สึกว่าบางอย่างเราเคยผลักดันมาในอดีต แล้วมันไม่ได้ผลก็ขี้เกียจไปทำอะไรกับมันแล้ว แล้วก็ไปบอกคนรุ่นใหม่ว่าอย่าไปทำเสียเวลา ซึ่งตอนนี้ก็รู้สึกว่าไม่อยากเป็นผู้ใหญ่แบบนั้น อยากเป็นคนที่บอกว่ารุ่นผมเคยทำมาแล้ว แต่ไม่สำเร็จเพราะแบบนี้ แล้วรุ่นใหม่จะไปทำก็ไปคิดเอาเอง ว่าจะไปแบบเดิมในบริบทสังคมใหม่ หรือจะแก้ปัญหากันอย่างไร</li>\n<li>แต่คุยกันด้วยเหตุผลมันเหนื่อยมาก บางทีคนรุ่นใหม่มาคุยด้วยเหตุผลแต่มันอาจจะเป็น fallacy หรือเป็นข้อมูลเท็จ แล้วเราต้องแย้งให้ได้มันเหนื่อยมาก น่าจะเป็นเหตุผลที่ทำให้ผู้ใหญ่มักจะคุยกับเด็กโดยไม่มีเหตุผล (“ปีนเกลียว” “เด็กเมื่อวานซืน” “คบเด็กสร้างบ้าน” หรือใช้อำนาจ) เพราะอาจจะไม่ได้แม่นตอบได้ทุกคำถามในทุกประเด็นแล้วอาจถูกซักจนมุมได้ทั้งๆ ที่เป็นฝ่ายถูก ซึ่งเด็กรุ่นใหม่ถนัดแบบนี้มากขึ้นเรื่อยๆ</li>\n<li>ผู้ใหญ่อยู่ในสภาพแวดล้อมที่ความเสี่ยงสูง คือในโรงเรียนตอบคำถามผิด สอบตก ก็ไม่เป็นไรหรือเสียเวลามาสอบซ่อมก็ผ่าน แต่ในการทำงานถ้าทำผิดอาจจะเสียเงินไปมาก มันเลยทำให้ไม่อยากตัดสินใจอะไรถ้าไม่มีข้อมูลครบถ้วน มีการป้องกันความเสี่ยงที่ดี ในขณะที่เด็กคิดว่า YOLO ไปก่อนแล้วค่อยมาแก้ปัญหาทีหลังก็ได้</li>\n</ol>\n<p>ตอนนี้รู้สึกว่าตอนเป็นเด็กไม่อยากโตขึ้นเป็นผู้ใหญ่ conservative แต่พบว่าเลี่ยงไม่ได้ มันเหมือนถามว่าทำไมคนถึงขี้เกียจซึ่งก็ตอบไม่ได้เหมือนกัน สิ่งที่เรายังพอทำได้คือเราต้องรู้ตัวว่าอยู่ในสถานการณ์ที่เรากำลังเป็น conservative แล้วหยุดคิดว่าเราถอยไปเลยได้มั้ยให้คนรุ่นใหม่เขาได้ลองดูบ้าง แต่ก็เช่นกันคือจะใช้ได้ถ้าเราไว้ใจคนนั้นมากพอ</p>\n<h2>Friends</h2>\n<p>เรื่องนึงที่งงคือขึ้นมหาลัยแล้วก็ไม่ค่อยได้คุยกับเพื่อนมัธยม แต่พอผ่านไปสักพักก็กลับไป reconnect กันแล้วมาคุยกันมากกว่าเพื่อนมหาลัย ทุกวันนี้ก็ตั้ง Steam Family แชร์เกมกันอยู่ คือถ้าตอนมัธยมมีเกมแท้รวมกัน 1,500 เกมแบบนี้คงเป็นสวรรค์</p>\n<p>แต่เรื่องที่คุย คิดว่าไม่ต่างกันกับตอนม. 3-5 นะ (ตอนม. 6 บรรยากาศมันอึมครึม โดยเฉพาะพอมหาลัยบนๆ เริ่มประกาศผลมันจะเริ่มทักกันว่าติดที่ไหนเพิ่มยัง) ตอนนี้คุยกับเพื่อนมหาลัยอยากคุยเหมือนเดิมแต่เหมือนเพื่อนคุยกันแต่ว่าที่บริษัทเป็นยังไง หรือกิจการส่วนตัว</p>\n<p>เวลาเจอเพื่อนก็ต่างกันคือเพื่อนมัธยมมีแต่งงานกันไปบ้างแล้ว แต่ยังไม่มีใครให้การ์ด ก็เลยต้องไปนัดเจอบ้านเพื่อน แต่เพื่อนมหาลัยเนี่ยมักจะเจอตามงานแต่ง ปีนี้ก็คือแทบจะไล่คิวกันเลยเดือนนี้คนนี้ เจอกันใหม่อีกสองเดือนเป็นคิวของใคร บางคนก็แชร์ทิปส์การจัดงานแต่งแล้วเพราะไล่เลี่ยกันมาก</p>\n<p>รุ่นพ่อก็สังเกตว่าคล้ายๆ กัน คือเพื่อนที่สนิทคือเพื่อนมัธยม แต่งานที่เจอกันถ้าไม่ใช่งานแต่งลูกก็เป็นงานศพพ่อแม่ (รุ่นปู่ของเรา) แล้ว มีเพื่อนพ่อที่มีฐานะหน่อย ก็จัดงานวันเกิดให้ปู่เชิญแขกใหญ่โต เขาให้เหตุผลว่าอยากให้มาเจอกันในงานมงคล คุยกันได้อย่างสบายใจ ดีกว่าจะได้เจอกันแต่งานศพ</p>\n<h2>Old People’s Body</h2>\n<p>สมัยก่อนมันมีรายการ “30 ยังแจ๋ว” ก็รู้สึกว่าสงสัยตอน 30 แล้วคือแก่แล้วเลยต้องหลอกตัวเองว่ายังแจ๋วอยู่</p>\n<p>ก็ยังไม่คิดว่าแก่ขนาดนั้น แต่ร่างกายมันแก่เร็วกว่าที่คิดมากๆ เพื่อนบางคนใช้คำว่าหมดเวลากินของอร่อยแล้วหลังจากเห็นผลตรวจสุขภาพ</p>\n<p>แก่ตอนแรกคิดว่าน่าจะตอนประมาณอายุ 25 ซึ่งพอทำงานออฟฟิศมาสักพักแล้วไม่ออกกำลังกาย อาการปวดหลังก็มา เหมือนมันเป็นหนักขึ้นตั้งแต่ 28 แต่ทั้งหมดทั้งปวงรู้สึกว่าแก้ได้ด้วยเก้าอี้สุขภาพ (ราคาหลักหมื่น) ไม่ต้องซื้อแพงมากแต่ไปลองนั่งแล้วจะรู้สึกเลยว่าตัวนี้ได้มั้ย</p>\n<p>สิ่งที่เก้าอี้มันทำคือมันทำให้เราไม่ต้องออกแรง แต่เราต้องนั่งถูกท่า คือ คอ-หลัง-ก้นชิดพนักพิง เพื่อให้มันรับน้ำหนัก แขนก็ต้องวางพนักพิงได้ (แต่เก้าอี้ที่รองแขนพอดีรู้สึกว่าหายากมาก) ตอนนี้ถ้าลุกไปนั่งเก้าอี้ทำงานตัวอื่นที่ไม่ใช่ ergonomics สัก 1 ชั่วโมงก็ปวดหลังแล้ว</p>\n<p>ถัดมาคือพอ COVID แล้วออกจากบ้านน้อยลง ตอนนี้วิ่ง 50 เมตรก็น่าจะเหนื่อยแล้ว คิดว่าไม่ได้เกี่ยวกับอายุมากแต่ตอนอายุน้อยมันยังพอมีกิจกรรมที่ต้องใช้แรง ปัจจุบันบางวันเดินไม่น่าจะถึง 200 เมตร</p>\n<p>อันที่ยังแก้ไม่ได้คือพออายุสัก 28 แล้วสังเกตได้ว่าสายตาปรับระดับโฟกัสช้ามากๆ เดิมมันน่าจะ 1 วินาทีกลายเป็น 2-3 วินาที แต่อันนี้กำลังสงสัยว่าอาจจะเป็นเพราะเดิมนั่งใกล้จอ ตอนนี้ใช้ขาตั้งจอซึ่งมันไกลขึ้นแต่ถูกหลักแล้วมันทำให้ใช้สายตามากขึ้น พยายามตัดแว่นต่างๆ ยังรู้สึกว่าช่วยไม่ได้ แต่คิดว่ายังไม่เจอร้านแว่นที่ถูกใจเพราะร้านแว่นมักจะเน้นราคาคนทั่วไปเข้าถึงได้ มันไม่มีอะไรบอกว่าร้านนี้ขายแว่นหลักหมื่นนอกจากว่าจะตัดโปรเกรสซีฟ ซึ่งหลายหมอที่หามาจะบอกว่าเริ่มเป็นสายตายาวตอนอายุ 40</p>","author":"whs","siteTitle":"Quietly Verbose","siteHash":"5f972a6fe70a917eb1b1aa165b3cb2be8a9465af33ab38bf05f34c55c0e40587","entryHash":"ccfc1de76fa2c6a9b9c2b524440a43aa100e19069930b6d8cfa4a647ac55c430","category":"Thai"}