{"title":"เสียงหนูหาย","link":"https://iannnnn.com/2025/3384","date":1755605937000,"content":"<p>อยู่ดีๆ ก็มีชาเลนจ์ใหม่ขึ้นมาในชีวิตแบบงงๆ<br />คือ… เพื่อความรวดเร็ว ผมตัดมาเฉลยเลยละกันนะครับ ว่าผมพูดไม่ได้<br /><br />ผมไม่มีเสียง เนื้อเสียงผมหายไปเลย! ยิ่งกว่ามดดำอีก นี่คือพูดอะไรออกมาแทบไม่ได้ยินเลยไม่ว่าจะตะโกนหรือเกร็งคอยังไง<br /><br />เรื่องมันเกิดขึ้นเมื่อวานซืนนี้ครับ<br /><br />ผมไปงานแต่งงานเพื่อนคนนึง แล้วในงานมันก็ต้องเจอคนที่ไม่ได้เจอกันนานแล้ว เราเลยเลือกตะโกนคุยกันตลอดเวลา โอเคมันอาจจะมีสาเหตุมาจากแบคทีเรียหรืออะไรก็แล้วแต่ แต่เราจะโทษการตะโกนในงานแต่งนี่แหละ มันเข้าใจง่ายดี<br /><br />เข้าวันต่อมา ผมตื่นมาคอแห้ง เสียงแหบ แบบที่พูดออกมาแล้วมีแต่ลม เนื้อเสียงเหลือประมาณ 10%<br /><br />ทีแรกคิดว่า เออ คงเพราะนอนหลับอ้าปากน้ำลายยืด เลยคอแห้ง เสียงแหบ อะไรงี้มั้ง<br /><br />แต่ปรากฏว่า จนสายก็ยังไม่หาย บ่ายก็ยังไม่หาย ไม่มีอาการไข้ใดๆ แค่เสียงหายไป<br /><br />นึกถึงโพสต์ของน้องวี ที่เพิ่งออกมาบอกว่ากำลังต่อสู้กับอาการเส้นเสียงอักเสบอยู่ คอนเสิร์ตของน้องก็ใกล้เข้ามาแล้ว แต่น้องต้องการการรักษาและฟื้นตัว อย่างด่วน เพื่อให้หายทัน<br /><br />เราไปกดไลก์ให้กำลังใจน้อง แต่ก็ไม่คิดว่าไม่กี่วันถัดมา อาการนี้จะเกิดขึ้นกับตัวเอง<br /><br />แม้เราจะไม่ได้เตรียมขึ้นคอนเสิร์ต แต่เราก็เตรียมมีสอนที่มหาลัยแห่งนึงย่านเกษตร ในอีกแค่ 2-3 วันข้างหน้านี้ มันเป็นงานที่ต้องใช้เสียง และต้องพูดตลอด ทำไงดีวะ…<br /><br />ย้อนกลับไปที่เย็นวันแรก ขณะที่เรายังไม่รู้ว่าตัวเองเป็นอะไร คิดว่ามันคงแป๊บๆ หายล่ะมั้ง ปรากฏว่า ตื่นมาวันนี้ก็ยังไม่หาย<br /><br />เราถามหมอกูเกิล มันบอกว่าคุณจะเป็นมะเร็งกล่องเสียง<br /><br />เลยไปโรงพยาบาลใกล้บ้านเพื่อตรวจมะเร็ง ถุย ไปตรวจคอ แล้วก็ไก่ส่องกล้องดูภาพข้างใน เพิ่งเคยเห็นเส้นเสียงของตัวเองเป็นครั้งแรกหลังจากคบกับมานาน 40 กว่าปี<br /><br />น้องมีอาการบวมแดงชัดเจน 1 ข้าง ส่วนอีกข้างไม่เป็นอะไรเลย เหมือนใส่รองเท้าคนละเบอร์กัน<br /><br />หมอบอกว่า ถ้าเป็นไปได้ ช่วงนี้งดใช้เสียงอย่างเด็ดขาด เป็นเวลา 7 วัน…<br /><br />แต่หมอครับ ผมต้องไปสอนในอีกแค่สองวันข้างหน้า<br /><br />หมอยิ้ม แล้วพูดว่า เรื่องของมึงเถอะ ไม่ใช่สิ บอกว่างั้นต้องดูแลตัวเองอย่างดี ถ้าอยู่บ้าน งดพูดได้ก็งด กระซิบหรือตะโกนก็ถือเป็นภาระของเจ้าเส้นเสียงของเราทั้งนั้น<br /><br />คือการกระซิบหรือตะโกน มันจะต้องเกร็งตรงนั้นมากกว่าการพูดด้วยเลเวลปกติ และทุกพยางค์ที่เอ่ยออกมา นับเป็นการทรมานคอเราทั้งสิ้น เลี่ยงได้ก็เลี่ยง<br /><br />โอ้โห กว่าจะรู้นี่คือ เมื่อวานทะเลาะกับเมียตอนเช้า แล้วก็เทศนาสอนลูกอีกยาวเหยียดในตอนเย็น แถมยังกินน้ำเย็นเจี๊ยบ ไหนจะเป๊ปซี่ ไหนจะของเผ็ดของมันของทอด บาปครบทุกประการ<br /><br />ดังนั้นวันนี้ทั้งวันที่ระดับเสียงอยู่ในสภาพที่แย่ไม่แพ้วันแรก จึงเป็นวันที่ตั้งใจปรับปรุงตัว ก่อนอื่นเลยคือบอกคนรอบตัวว่าเราขอเป็นใบ้นะ มีอะไรก็ให้แชตถามหรือให้ตอบแค่เยสกับโน เหมือนเล่นผีถ้วยแก้ว<br /><br />แน่นอนว่าเป็นความสนุกกับลูกเมียมาก พอรู้ว่าพ่อเป็นใบ้ ก็ผลัดกันบูลลี่อย่างสนุกสนาน ในขณะที่เราไม่สามารถตอบโต้อะไรได้<br /><br />หรือบางทียังปรับตัวกันไม่ทัน ตะโกนเรียกเราจากอีกห้อง ปกติเราจะตะโกนตอบ ตอนนี้คือต้องตบประตูปังๆๆ เพื่อให้ได้ยินเป็นสัญญาณว่า มีอะไรยยย เรียกทำไมยยยย<br /><br />มียาปฏิชีวนะมาหนึ่งแผง และยาอะไรสักอย่างหลังอาหารอีกหนึ่งกอง ให้เป็นหลักฐานว่าเราได้ผ่านกระบวนการการรักษาโดยแพทย์แผนปัจจุบันแล้ว<br /><br />การต่อสู้ยังไม่จบ แต่มะรืนนี้ต้องไปสอนแล้ว นี่แทนที่จะตื่นเต้นเรื่องการเตรียมการสอน เลยต้องมาลุ้นแทนว่ากูจะดีขึ้นไหม อะไรวะเนี่ยชีวิต น้องวีช่วยด้วย</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<figure><figcaption>เวอร์ชันเสียง ใช้ <a href=\"https://luvvoice.com\">luvvoice.com</a> ทำ</figcaption></figure>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"cfb24fef2da7c91fba1bbedd9fc616886e6cc7ae77af92e6d849d62f83fd6f83","category":"Thai"}