{"title":"RANCH RALLY 2025: A CELEBRATION OF GRAVEL, COMMUNITY, AND HERITAGE","link":"https://moots.com/blogs/news/ranch-rally-2025-a-celebration-of-gravel-community-and-heritage","date":1744855945000,"content":"\n      <figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2025/03/RR-2025-FLYER-1024x1024.jpg\" /></figure>\n<h2>Event Date: Saturday, July 26th, 2025Location: Steamboat Springs, Colorado</h2>\n<p>Well howdy, partner! We’re mighty excited to invite y’all to the Moots Ranch Rally 2025, a one-of-a-kind gravel cycling event that brings together world-class riding, Western roots, and a whole lotta heart. This year’s route rolls right out our front doors here in Steamboat Springs, covering the same gravel roads and sweeping mountain views that have inspired our work at Moots Cycles for over four decades. Whether you’re a seasoned gravel grinder or a newcomer to backroad bliss, this is a ride built for connection — to the land, the bike, and the community.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/moots_ranch_rally_2022_02-copy-2-1024x683.jpg?v=1762207229\" alt=\"\" /></p>\n<h2>Gravel Riding, Steamboat Style</h2>\n<p>Home to the well known SBT Gravel and tucked in the heart of Colorado's Yampa Valley, Steamboat Springs is a gravel riding paradise. Known for its expansive ranch lands, alpine vistas, and smooth-as-butter dirt roads, this area offers some of the finest and most scenic gravel routes in t<strong>he country. The Ranch Rally is built</strong> on these very roads — not just as a course, but as a tribute. Riders will pedal through open landscapes framed by the Flat Tops, past working ranches, aspen groves, and winding rivers, all while enjoying the kind of serene solitude and unspoiled terrain that makes gravel riding so special.</p>\n<h2>BUCKAROO ROUTE</h2>\n<p>39 miles | 2,500 ft of climbing. View the route: <em>[<a href=\"https://ridewithgps.com/routes/49928806\">Click here to see on RidewithGPS</a>]</em></p>\n<p>Expect a well-marked course, support vehicles, and roaming medical assistance to keep everyone safe and smiling. This is a <strong>non-competitive ride</strong>, so leave the race face at home and come ride for the experience.</p>\n<p> </p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/DSC2550-copy-2-1024x684.jpg?v=1762207221\" alt=\"\" /></figure>\n<p> </p>\n<h2>40 Years of Moots Magic</h2>\n<p>Since 1981, Moots has been hand-building titanium bikes right here in Steamboat Springs. Our shop is more than a factory — it’s a workshop of passion, precision, and purpose. For over 40 years, we've been crafting bikes that reflect this place: durable, elegant, and built to ride for a lifetime. Hosting the Ranch Rally on our home turf is more than just convenient — it’s personal. These are the roads that shaped our bikes, and this event is our way of sharing that magic with you. Whether you’re rollin’ in on a Moots or just curious about what makes this place so special, the Ranch Rally is more than just a ride — it’s a celebration. Of gravel. Of craftsmanship. Of community. And of the Colorado ranching spirit that grounds us all.</p>\n<h2>Rooted in Ranching</h2>\n<p>The Ranch Rally isn’t just a ride — it’s a community fundraiser that supports the<a href=\"https://communityagalliance.org\"> <strong>Community Agriculture Alliance (CAA)</strong></a>, a local nonprofit dedicated to preserving and promoting the agricultural heritage of the Yampa Valley. This land has been cared for by ranching families for generations, and their stewardship has helped preserve the open spaces we ride through today. We’re proud to partner with the CAA to honor that legacy and help keep our community connected to the food and land that sustains it.</p>\n<p> </p>\n<figure><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/moots_ranch_rally_2022_08-copy-2-1024x683.jpg?v=1762207229\" alt=\"\" /></figure>\n<p>Spots are limited to just 200 riders, so grab your spot before they’re gone.</p>\n<p>Each rider gets:✔️ Limited edition Ranch Rally swag✔️ A spot on the ride with aid station support✔️ Post-ride lunch at Moots HQ✔️ Western-style cookout with local ranch fare, cold beverages, live music✔️ Raffle entry for a Moots Routt gravel frame</p>\n<p>Click here to register: <a href=\"https://checkout.moots.com/products/ranch-rally-registration-2025\">2025 Ranch Rally Registration</a></p>\n<p>Rain or shine, we ride. See y’all out there.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"d2703294737ce834a34cae530f735a760a55fbca1229e6cee791cc3fc0ed9922","category":"Cycling"}