{"title":"Designing A Streak System: The UX And Psychology Of Streaks","link":"https://smashingmagazine.com/2026/02/designing-streak-system-ux-psychology/","date":1771426800000,"content":"<p>I’m sure you’ve heard of streaks or used an app with one. But ever wondered why streaks are so popular and powerful? Well, there is the obvious one that apps want as much of your attention as possible, but aside from that, did you know that when the popular learning app Duolingo introduced iOS widgets to display streaks, <a href=\"https://www.orizon.co/blog/duolingos-gamification-secrets#:~:text=When%20Duolingo%20introduced%20an%20iOS%20widget%20displaying%20streaks%2C%20user%20commitment%20increased%20by%2060%25!\">user commitment surged by 60%</a>. Sixty percent is a massive shift in behaviour and demonstrates how “streak” patterns can be used to increase engagement and drive usage.</p>\n<p>At its most basic, <strong>a streak is the number of consecutive days that a user completes a specific activity</strong>. Some people also define it as a “gamified” habit or a metric designed to encourage consistent usage.</p>\n<p>But streaks transcend beyond being a metric or a record in an app; it is more psychological than that. Human instincts are easy to influence with the right factors. Look at these three factors: <strong>progress</strong>, <strong>pride</strong>, and fear of missing out (commonly called <a href=\"https://www.smashingmagazine.com/2019/11/fomo-increase-conversions/\">FOMO</a>). What do all these have in common? <em>Effort</em>. The more effort you put into something, the more it shapes your identity, and that is how streaks crosses into the world of behavioural psychology.</p>\n<p>Now, with great power comes great responsibility, and because of that, there’s a dark side to streaks.</p>\n<p>In this article, we’ll be going into the psychology, UX, and design principles behind building an effective streak system. We’ll look at (1) why our brains almost instinctively respond to streak activity, (2) how to design streaks in ways that genuinely help users, and (3) the technical work involved in building a streak pattern.</p>\nThe Psychology Behind Streaks\n<p>To design and build an effective streak system, we need to understand how it aligns with how our brains are wired. Like, what makes it so effective to the extent that we feel so much intense dedication to protect our streaks?</p>\n<p>There are three interesting, well-documented psychology principles that support what makes streaks so powerful and addictive.</p>\n<h3>Loss Aversion</h3>\n<p>This is probably the strongest force behind streaks. I say this because most times, you almost can’t avoid this in life.</p>\n<p>Think of it this way: If a friend gives you $100, you’d be happy. But if you lost $100 from your wallet, that would hurt way more. The emotional weight of those situations isn’t equal. Loss hurts way more than gain feels good.</p>\n<p>Let’s take it further and say that I give you $100 and ask you to play a gamble. There’s a 50% chance you win another $100 and a 50% chance you lose the original $100. Would you take it? I wouldn’t. Most people wouldn’t. That’s loss aversion.</p>\n<p>If you think about it, it is logical, it is understandable, it is human.</p>\n<p>The concept behind loss aversion is that we feel the pain of losing something twice as much as the pleasure of gaining something of equal value. In psychological terms, loss lingers more than gains do.</p>\n<p>You probably see how this relates to streaks. To build a noticeable streak, it requires effort; as a streak grows, the motivation behind it begins to fade; or more accurately, it starts to become secondary.</p>\n<p>Here’s an example: Say your friend has a three-day streak closing their <a href=\"https://www.apple.com/watch/close-your-rings/\">“Move Rings” on their Apple Watch</a>. They have almost nothing to lose beyond wanting to achieve their goal and be consistent. At the same time, you have an impressive 219-day streak going. Chances are that you are trapped by the <em>fear of losing it</em>. You most likely aren’t thinking about the achievement at this point; it’s more about protecting your invested effort, and that is loss aversion.</p>\n<p><a href=\"https://blog.duolingo.com/how-duolingo-streak-builds-habit/#:~:text=This%20is%20when%20we%20tap%20into%20%22loss%20aversion%2C%22%20an%20internal%20bias%20in%20your%20brain%20that%20makes%20you%20particularly%20averse%20to%20losing%20something%2C%20like%20a%20learning%20streak.\">Duolingo explains how loss aversion contributes to a user’s reluctance to break a long streak</a>, even on their laziest days. In a way, a streak can turn into a habit when loss aversion settles in.</p>\n<h3>The Fogg Behaviour Model (B = MAP)</h3>\n<p>Now that we understand the fear of losing the effort invested in longer streaks, another question is: <em>What makes us do the thing in the first place, day after day, even before the streak gets big?</em></p>\n<p>That’s what the <a href=\"https://www.behaviormodel.org\">Fogg Behaviour Model</a> is about. It is relatively simple. A behaviour (B) only occurs when three factors — Motivation (M), Ability (A), and Prompt (P) — align at the same moment. Thus, the equation B=MAP.</p>\n<p>If any of these factors, even one, is missing at that moment, the behaviour won’t happen.</p>\n<p>So, for a streak system to be efficient and recurring, all three factors must be present:</p>\n<p><strong>Motivation</strong><br />This is fragile and not something that is consistently present. There are days when you’re pumped to learn Spanish, and days you don’t even feel an iota of willpower to learn the language. <strong>Motivation</strong> by itself to build a habit is unreliable and a losing battle from day one.</p>\n<p><strong>Ability</strong><br />To compensate for the limitations of motivation, <strong>ability</strong> is critical. In this context, ability means the ease of action, i.e, the effort is so easy that it’s unrealistic to say it isn’t possible. Most apps intentionally use this. Apple Fitness just needs you to stand for one minute in an hour to earn a tick towards your Stand goal. Duolingo only needs one completed lesson. These tasks do not require all that much effort. The barrier is so low that even on your worst days, you can do it. But the combined effort of an ongoing streak is where the idea of losing that streak kicks in.</p>\n<p><strong>Prompt</strong><br />This is what completes the equation. Humans are naturally forgetful, so yes, ability can get us 90% there. But a <strong>prompt</strong> reminds us to act. Streaks are persistent by design, so users need to be constantly reminded to act. To see how powerful a prompt can be, <a href=\"https://review.firstround.com/the-tenets-of-a-b-testing-from-duolingos-master-growth-hacker/#:~:text=Gina%20Gotthilf%2C%20VP,DAUs%2C%E2%80%9D%20she%20says.\">Duolingo did an A/B test</a> to see if a little red badge on the app’s icon increased consistent usage. It produced a 6% increase in daily active users. <em>Just a red badge.</em></p>\n<h4>Model Limitations</h4>\n<p>All this being said, there is a limitation to the Fogg model whereby critics and modern research have noticed that a design that relies too heavily on prompts, like aggressive notifications, risks creating mental fatigue. Constant notifications and overtime could cause users to churn. So, watch out for that.</p>\n<h3>The Zeigarnik Effect</h3>\n<p>How do you feel when you leave a task of project half-done? That irritates many people because unfinished tasks occupy more mental space than the things we complete. When something is done and gone, we tend to forget it. When something is left undone, it tends to weigh on our minds.</p>\n<p>This is exactly why digital products use artificial progress indicators, like Upwork's profile completion bar, to let a user know that their profile is only “60% complete”. It nudges the user to finish what they started.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-streak-system-ux-psychology/1-upwork-profile-completion-progress-bar.png\" /></p>\n<p>Let’s look at another example. You have five tasks in a to-do list app, and at the end of the day, you only check four of them as completed. Many of us will feel unaccomplished because of that one unfinished task. That, right there, is the <strong>Zeigarnik effect</strong>.</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Zeigarnik_effect\">The Zeigarnik effect</a><a href=\"https://en.wikipedia.org/wiki/Zeigarnik_effect\">he</a> was demonstrated by psychologist Bluma Zeigarnik, who described that we tend to keep incomplete tasks active in our memory longer than completed tasks.</p>\n<p>A streak pattern naturally taps into this in UX design. Let’s say you are on day 63 of a learning streak. At that point, you’re in an ongoing pattern of unfinished business. Your brain would rarely forget about it as it sits in the back of your mind. At this point, your brain becomes the one sending you notifications.</p>\n<p>When you put these psychological forces together, you begin to truly understand why streaks aren’t just a regular app feature; they are capable of reshaping human behaviour.</p>\n<p>But somewhere along the line — I can’t say exactly when, as it differs for everyone — things reach a point where a streak shifts from “fun” to something you feel you can’t afford to lose. You don’t want 58 days of effort to go to waste, do you? That is what makes a streak system effective. If done right, <strong>streaks help users build astounding habits that accomplish a goal</strong>. It could be reading daily or hitting the gym consistently.</p>\n<p>These repeated actions (sometimes small) compound over time and become evident in our daily lives. But there are two sides to every coin.</p>\nThe Thin Line Between Habit And Compulsion\n<p>If you have been following along, you can already tell there’s a dark side to streak systems. Habit formation is about consistency with a repeated goal. Compulsion, however, is the consistency of working on a goal that is no longer needed but held onto out of fear or pressure. It is a razor-thin line.</p>\n<p>You brush your teeth every morning without thinking; it is automatic and instinctive, with a clear goal of having good breath. That’s a streak that forms a good habit. An ethical streak system gives users space to breathe. If, for some reason, you don’t brush in the morning, you can brush at noon. Imperfection is allowed without fear of losing a long effort.</p>\n<p>Compulsion takes the opposite route, whereby a streak makes you anxious, you feel guilty or even exhausted, and sometimes, it feels like you haven’t accomplished anything, despite all your work. You act not because you want to, but because you’re subconsciously terrified of seeing your progress reset to zero.</p>\n<p>Someone even described this perfectly, “<a href=\"https://www.thecut.com/2019/04/why-breaking-a-streak-feels-so-awful.html#:~:text=Callie%20Beusman%2C%20the,day%20151%20now.%E2%80%9D\"><em>I felt that I was cheating, but simply did not care. I am nothing without my streak</em></a>”. This shows the extreme hold streaks can have on an individual. To the extent that users begin to tie their self-worth to an arbitrary metric rather than the original goal or reason they started the streak in the first place. The streak becomes who they are, not just what they do.</p>\n<p>A well-designed <strong>ethical</strong> streak system should feel like <strong>encouragement</strong> to the user, not pressure or obligation. This relates to the balance of intrinsic and extrinsic motivation. Extrinsic motivation (external rewards, avoiding punishment) might get users started, but intrinsic motivation (doing the task for a personal goal like learning Spanish because you genuinely want to communicate with a loved one) is stronger for long-term engagement. </p>\n<p>A good system should gravitate towards intrinsic motivation with careful use of extrinsic elements, i.e., remind users of how far they have come, not threaten them with what they might lose. Again, it is a fine line.</p>\n<p>A simple test when designing a streak system is to actually take some time and think whether your products make money by selling solutions to anxiety that your product created. If yes, there’s a high chance you are exploiting users.</p>\n<p>So the next question becomes, <em>If I choose to use streak, how do I design it in a way that genuinely helps users achieve their goals?</em></p>\n<h3>The UX of Good Streak System Design</h3>\n<p>I believe this is where most projects either nail an effective streak system or completely mess it up. Let’s go through some UX principles of a good streak design.</p>\n<h3>Keep It Effortless</h3>\n<p>You’ve probably heard this before, maybe from books like <a href=\"https://jamesclear.com/atomic-habits\"><em>Atomic Habits</em></a>, but it’s worth mentioning that one of the easiest ways habits can be formed is by making the action tiny and easy. This is similar to the <em>ability</em> factor we discussed from the Fogg Behaviour Model.</p>\n<p>The first rule of any streak design should be making the required action as small as humanly possible while still achieving progress.</p>\n<p>If a daily action requires willpower to complete, that action won’t make it past five days. Why? You can’t be motivated five days in a row.</p>\n<p>Case in point: If you run a meditation app, you don’t need to make users go through a 20-minute session just to maintain the streak. Try a single minute, maybe even something as small as thirty seconds, instead.</p>\n<p>As the saying goes, <a href=\"https://en.wikipedia.org/wiki/Little_Things_(poem\"><em>little drops of water make the mighty ocean</em></a>). Small efforts compile into big achievements with time. That should be the goal: remove friction, especially when the moment might be difficult. When users are stressed or overwhelmed, let them know that simply showing up, even for a few seconds, counts as effort.</p>\n<h3>Provide Clear Visual Feedback</h3>\n<p>Humans are visual by nature. Most times, we need to see something to believe; there’s this need to visualize things to understand them better and put things into perspective.</p>\n<p>This is why streak patterns often use visual elements, like graphs, checkmarks, progress rings, and grids, to visualize effort. Look at GitHub’s contribution graph. It is a simple visualization of consistency. Yet developers breathe it in like oxygen.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-streak-system-ux-psychology/2-contributions-graph.png\" /></p>\n<p><strong>The key is not to make a streak system feel abstract.</strong> It should feel real and earned. For instance, Duolingo and Apple’s Fitness activity rings use clean animation designs on completion of a streak, and GitHub shows historical data of a user’s consistency over time.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-streak-system-ux-psychology/3-apple-watch-fitness.png\" /></p>\n<h3>Use Good Timing</h3>\n<p>I mentioned earlierthat  humans are generally forgetful by nature, and that prompts can help maintain forward momentum. Without prompts, most <em>new</em> users forget to keep going. Life can get busy, motivation disappears, and things happen. Even long-time users benefit from prompts, though most times, they are already locked inside the habit loop. Nevertheless, even the most committed person can accidentally miss a day.</p>\n<p>Your streak system most definitely needs reminders. The most-used prompt reminders are <a href=\"https://www.smashingmagazine.com/2022/04/guide-push-notifications-developers/\">push notifications</a>. Timing really matters when working with push notifications. The type of app matters, too. Sending a notification at 9 a.m. saying <em>“You haven’t practiced today”</em> is just weird for a learning app because many have things to do in the day before they even think about completing a lesson. If we’re talking about a fitness app, though, it is reasonable and maybe even expected to be reminded earlier in the day.</p>\n<p><a href=\"https://clevertap.com/blog/best-time-to-send-push-notifications/#:~:text=Need%20to%20Know!-,Industry%2DSpecific%20Timing%3A%20Tailor%20Your%20Approach,-Different%20industries%20have\">Push notifications vary significantly by app category</a>. Fitness apps, for instance, see higher engagement with early morning notifications (7–8 AM), while productivity apps might perform better in early noon. The key is to A/B test your app’s timing based on your users' behaviours rather than assuming things are one-size-fits-all. What works for a meditation app might not work for a coding tracker.</p>\n<p>Other prompt methods are red dots on the app icon and even app widgets. Studies vary, but <a href=\"https://www.nber.org/system/files/working_papers/w28936/w28936.pdf?utm_campaign=PAN%5B…%5Dtm_medium=PANTHEON_STRIPPED&amp;%3Butm_source=PANTHEON_STRIPPEDhttps://www.nber.org/system/files/working_papers/w28936/w28936.pdf?utm_campaign=PAN%5B…%5Dtm_medium=PANTHEON_STRIPPED&amp;%3Butm_source=PANTHEON_STRIPPED\">the average person unlocks their device between 50-150 times a day</a> (PDF). If a user sees a red dot on an app or a widget that indicates a current streak every time they unlock their phone, it increases commitment.</p>\n<p>Just don’t overdo it; the prompt should serve as a reminder, not a nag.</p>\n<h3>Celebrate Milestones</h3>\n<p>A streak system should try to celebrate milestones to reignite emotions, especially for users deep into a streak.</p>\n<p>When a user hits Day 7, Day 30, Day 50, Day 100, Day 365, you should make a big deal out of it. Acknowledge achievements — especially for long-time users.</p>\n<p><img src=\"https://files.smashing.media/articles/designing-streak-system-ux-psychology/4-apple-animated-badges.jpg\" /></p>\n<p>As we saw earlier, Duolingo figured this out and implemented an animated graphic that celebrates milestones with confetti. Some platforms even give substantial bonus rewards that validate users’ efforts. And this can be beneficial to apps, such that users tend to share their milestones publicly on social media.</p>\n<p>Another benefit is the anticipation that comes before reaching milestones. It isn’t just keeping the streak alive endlessly; users have something to look forward to.</p>\n<h3>Use Grace Mechanisms</h3>\n<p>Life is unpredictable. People get distracted. Any good streak system should expect imperfection. One of the biggest psychological threats to a streak system is the hard reset to zero after just a single missed day.</p>\n<p>An “ethical” streak system should provide the user with some slack. Let’s say you have a 90-day chess learning streak. You have been consistent for three good months, and one day, your phone dies while traveling, and just like that, 90 becomes 0 — everything, all that effort, is erased, and progress vanishes. The user might be completely devastated. The thought of rebuilding it from scratch is so demoralizing that the effort isn’t worth it. At worst, a user might abandon the app after feeling like a failure.</p>\n<p>Consider adding a “grace” mechanism to your streak system:</p>\n<ul>\n<li><strong>Streak Freeze</strong><br />Allow users to intentionally miss a day without penalties.</li>\n<li><strong>Extra Time</strong><br />Allow a few hours (2–3) past the usual deadline before triggering a reset.</li>\n<li><strong>Decay Models</strong><br />Instead of a hard reset, the streak decreases by a small amount, e.g., 10 days is deducted from the streak per missed day.</li>\n</ul>\n<h3>Use An Encouraging Tone</h3>\n<p>Let’s compare two messages shown to users when a streak breaks:</p>\n<ol>\n<li>“You lost your 42-day streak. Start over.”</li>\n<li>“You showed up for 42 days straight. That’s incredible progress! Wanna give it another try?”</li>\n</ol>\n<p>Both convey the same information, but the emotional impact is different. The first message would most likely make a user feel demoralized and cause them to quit. The second message celebrates what has already been achieved and gently encourages the user to try again.</p>\nStreak Systems Design Challenges\n<p>Before we go into the technical specifics of building a streak system, you should be aware of the challenges that you might face. Things can get complicated, as you might expect.</p>\n<h3>Handling Timezones</h3>\n<p>There is a reason why handling time and date is among the most difficult concepts developers deal with. There’s formatting, internationalization, and much more to consider.</p>\n<p>Let me ask you this: <em>What counts as a day?</em></p>\n<p>We know the world runs on different time zones, and as if that is not enough, some regions have Daylight Saving Time (DST) that happens twice a year. Where do you even begin handling these edge cases? What counts as the “start” of tomorrow?</p>\n<p>Some developers try to avoid this by using one central timezone, like UTC. For some users, this would yield correct results, but for some, it could be off by an hour, two hours, or more. This inconsistency ruins the user experience. Users care less how you handle the time behind the scenes; all they expect is that if they perform a streak action at 11:40 p.m., then it should register at that exact time, in their context. You should define “one day” based on the user’s local timezone, not the server time.</p>\n<p>Sure, you can take the easy route and reset streaks globally for all users at midnight UTC, but you are very much creating unfairness. Someone in California always has eight extra hours to complete their task than someone living in London. That’s an unjust design flaw that punishes certain users because of their location. And what if that person in London is only visiting, completes a task, then returns to another timezone?</p>\n<p>One effective solution to all these is to ask users to explicitly set their timezone during onboarding (preferably after first authentication). It’s a good idea to include a subtle note that providing timezone information is only used for the app to accurately track progress, rather than being used as personally identifiable data. And it’s another good idea to make that a changeable setting.</p>\n<p>I suggest that anyone avoid directly handling timezone logic in an app. Use tried-and-true date libraries, like <a href=\"https://momentjs.com\">Moment.js</a> or <a href=\"https://pypi.org/project/pytz/\">pytz</a> (Python), etc. There’s no need to reinvent the wheel for something as complex as this.</p>\n<h3>Missed Days And Edge Cases</h3>\n<p>Another challenge you should worry about is uncontrollable edge cases like users oversleeping, server downtime, lag, network failures, and so on. Using the idea of <strong>grace mechanisms</strong>, like the ones we discussed earlier, can help.</p>\n<p>A grace window of two hours might help both user and developer, in the sense that users are not rigidly punished for uncontrollable life circumstances. For developers, grace windows are helpful in those uncontrollable moments when the server goes down in the middle of the night.</p>\n<p>Above all, never trust the client. Always validate on the server-side. The server should be the single source of truth.</p>\n<h3>Cheating Prevention</h3>\n<p>Again, I cannot stress this enough: <strong>Make sure to validate everything server-side.</strong> Users are humans, and humans might cheat if given the opportunity. It is unavoidable.</p>\n<p>You might try:</p>\n<ul>\n<li><strong>Storing all actions with UTC timestamps.</strong><br />The client can send their local time, but the server can immediately convert that to UTC and validate against the server time. That way, if the client's timestamp is suspiciously far, the system can reject it as an error, and the UI can respond accordingly.</li>\n<li><strong>Using event-based tracking.</strong><br />In other words, store a record of each action with metadata including information like the user’s ID, the type of action performed, and the timestamp and timezone. This helps with validation.</li>\n</ul>\nBuilding A Streak System Engine\n<p>This isn’t a code tutorial, so I will avoid dumping a bunch of code on you. I’ll keep this practical and describe how things generally operate a streak system engine as far as architecture, flow, and reliability.</p>\n<h3>Core Architecture</h3>\n<p>As I’ve said several times, make the serverthe single source of truth for streak data. The architecture can go something like this on the server:</p>\n<ul>\n<li>Store each user’s data in a database.</li>\n<li>Store the current streak store (default as 0) as an integer.</li>\n<li>Store the timezone preference, i.e., IANA Timezone string (either implicitly from local timestamp or explicitly by asking user to select their timezone). For example, “America/New_York”.</li>\n<li>Handle all logic to determine if the streak continues or breaks, with a timezone check that is relative to the user’s local timezone.</li>\n</ul>\n<p>Meanwhile, on the client-side:</p>\n<ul>\n<li>Display the current streak, normally fetched from the server.</li>\n<li>Send action done in the form of metadata to the server to validate whether the user actually completed a qualifying streak action.</li>\n<li>Provide visual feedback based on the server responses.</li>\n</ul>\n<p>So, in short, the brain is on the server, and the client is for display purposes and submitting events. This saves you a lot of failures and edge cases, plus makes updates and fixes easier.</p>\n<h3>The Logical Flow</h3>\n<p>Let’s simulate a walkthrough of how a minimal efficient streak system engine would go when a user completes an action:</p>\n<ol>\n<li>The user completes a qualifying streak action.</li>\n<li>The client sends an event to the server as metadata. This could be “User X completed action Y at timestamp Z”.</li>\n<li>The server receives this event and does basic validation. Is this a real user? Are they authenticated? Is the action valid? Is the timezone consistent?</li>\n<li>If this passes, the server retrieves the user’s streak data from the database.</li>\n<li>Then, convert the received action timestamp to the user’s local timezone.</li>\n<li>Let the server compare the calendar dates (not timestamps) in the user's local timezone:<ul>\n<li>If it is the same day, then the action is redundant and there is no change in the streak.</li>\n<li>If it is the next day, then the streak extends and increments by 1.</li>\n<li>If there is a gap of more than one day, the streak breaks. However, this is where you might apply grace mechanics.</li>\n<li>If the grace mechanism is missed, then reset the streak to 1.</li>\n</ul>\n</li>\n<li>If you choose to save historical data for milestone achievements, then update variables like “longest streak” or “total active days”.</li>\n<li>The server then updates the database and responds to the client. Something like this:</li>\n</ol>\n<pre><code>{\n  \"current_streak\": 48,\n  \"longest_streak\": 50,\n  \"total_active_days\": 120,\n  \"streak_extended\": true,\n}\n</code></pre>\n\n<p>As a further measure, the server should either retry or reject and notify the client when anything fails during the process.</p>\n<h3>Building For Resilience</h3>\n<p>As mentioned before, users losing a streak due to bugs or server downtime is terrible UX, and users don’t expect to take the fall for it. Thus, your streak system should have safeguards for those scenarios.</p>\n<p>If the server is down for maintenance (or whatever reason), consider allowing a temporary window of additional hours to get it fixed so actions can be submitted late and still count. You can also choose to notify users, especially if the situation is capable of affecting an ongoing streak.</p>\n<p><strong>Note</strong>: Establish an admin backdoor where data can be manually restored. Bugs are inevitable, and some users would call your app out or reach out to support that their streak broke for a reason they could not control. You should be able to manually restore the streaks if, after investigation, the user is right.</p>\nConclusion\n<p>One thing remains clear: Streaks are really powerful because of how human psychology works on a fundamental level.</p>\n<p>The best streak system out there is the one that users don’t think about consciously. It has become a routine of immediate results or visible progress, like brushing teeth, which becomes a regular habit.</p>\n<p>And I’m just gonna say it: Not all products need a streak system. Should you really force consistency just because you want daily active users? The answer may very well be “no”.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"d3f06587020a77c46d7dfa498f195f89da7dcf3cb8ad3bdf4b686137dc3013ff","category":"Tech"}