{"title":"Hobbling on a broken ankle, but dreaming of the Classics and yellow: Wout van Aert continues to amaze","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/hobbling-on-a-broken-ankle-but-dreaming-of-the-classics-and-yellow-wout-van-aert-continues-to-amaze","date":1768460404000,"content":"\n      <p><span>Wout van Aert hobbles into the room wearing a protective boot. He has a broken ankle and a torn ligament, suffered at the Zilvermeercross on January 2. It’s January 13 when he meets the assembled press and he’s already riding his bike outside. “He’s been pretty dramatic,” his Visma-Lease a Bike teammate Matteo Jorgenson quips. “He looked pretty alright today on the bike.”</span><b></b></p>\n<p><span>For most people, an ankle fracture and subsequent surgery means at least one month, probably 10 weeks, off the bike. But Van Aert isn't like most people. The spring Classics start in less than two months and he wants to be winning them. “It probably looks worse than it is,” the 31-year-old Belgian says. “Walking is still painful sometimes, and I have to be careful with taking too many steps, but luckily I’m already riding a little bit and on the bike it’s pretty good.”</span><span><br /></span></p>\n<p><span>It should be reiterated that Van Aert has done serious damage to his foot. Images posted to his Instagram account show just how swollen, bruised – and, yep, fractured – his right foot is. But his recovery is already remarkable. “I also had fractures in my foot and the day after [the crash] I had surgery,” he goes on. “The fracture is locked with a screw and the ligaments need to recover, but I can do more than just keep the foot in a safe position. Since then it’s actually gone pretty smoothly. I’ve had some pain, but within a week I could start riding on the rollers. I can’t do any intensity yet but once the foot is locked in the shoe I can pedal quite good.” He can even clip in and out of his cleats. “I wouldn’t say it’s smooth but I’m able to.”</span><b></b></p>\n<p><span>All of this is not to suggest that Van Aert will be on the start line of Omloop Het Nieuwsblad at the end of February in race-winning condition. Excusing the pun, he understands “I will be on the back foot.” Asked if he will be in tip-top shape for the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\" target=\"_blank\">Tour of Flanders</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\" target=\"_blank\">Paris-Roubaix</a>, he says. “I”m not fully confident, of course not. It’s a complicated injury: it's fractured and I’ve also ripped off the ligament. If I was a runner or anything else I’d be out for months. Hopefully as a cyclist it will be good enough but at this point I cannot say.”</span><b></b></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_48_1_652ffe34-4ac4-4119-a0ae-483a859279f2.png?v=1768387674\" alt=\"\" /><em>More memorable days: Van Aert took a fine stage win at last year's Giro d'Italia. Image: Zac Williams/SWPix.com.</em></span></p>\n<p><span>Ending his cyclocross season after just six races was “mentally pretty shit as I was improving.” But already being outside on his bike gives him optimism for the spring calendar. “The fact that I’m not losing too much fitness up until this point makes me look ahead. Since I am riding I am confident I will heal up quickly. For sure it messed up my cyclocross season as I was still ambitious for the races to come and that’s a big blow for me personally, but I hope in a few months I can tell you that it didn’t mess up anything for the [road] season that’s still ahead. We’ve just started a new year and I hope time will be on my side.”</span><b></b></p>\n<p><span>For the first time since 2019, Van Aert didn’t win any of the Italian, Belgian or Dutch Classics last year. He came close – two seconds and three fourths – but he never put his hands in the air. That frustration is driving him, especially as he heads back to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\" target=\"_blank\">Strade Bianche</a> for the first time since 2021. “It was always the plan to go back to a traditional schedule and fight for Strade Bianche and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2024-everything-you-need-to-know\" target=\"_blank\">Milan-Sanremo</a>,” he says of the two races he won back in 2020. “My chances there are also pretty good so I would be afraid to skip them.”</span></p>\n<p><span>In recent seasons Visma have targeted victories at Flanders and Roubaix, but they have adjusted their ambitions slightly for 2026: instead of full focus on those two races, their aim is to win any one of the five Monuments. “I am someone who really loves one day races, so the more it’s part of our goals the better I think,” Van Aert adds. “I’m completely on the same page that maybe in recent years we were not focused enough on all of the big races. I think this is a good change and from my personal side also lining up again in Sanremo, next to Flanders and Roubaix, is a big goal…. These races are all beautiful and cool to win.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_47_1_49ba4633-04c3-4431-b5db-1aec07f07712.png?v=1768387677\" alt=\"\" /></span><em>Rejoice: the Belgian won the final stage of the 2025 Tour de France; this year he wants to win the first stage. Image: Zac Williams/SWPix.com.</em></p>\n<p><span>Beyond the spring Van Aert will once again ride two Grand Tours: this time around it’ll be the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>. As well as his usual super-domestique role for Jonas Vingegaard at the Tour, he’ll also be afforded his own opportunities. And they don’t come much bigger than taking the lead of the Tour on day one. “This year it’s maybe hard to say up front where real chances will pop up for riders like me, but my main focus will be on the opening week with the team time trial [in Barcelona]. That’s a huge goal for the team. We’re all together that it should be for the GC, and in my head I’m dreaming of wearing yellow.”</span></p>\n<p>Grand ambitions as ever, and even as he deals with his latest setback – injuries, misfortunes and bad luck follow his career around as much as the success – Van Aert only needs to reflect on his <a href=\"https://www.rouleur.cc/pages/giro-ditalia\" target=\"_blank\">Giro d’Italia</a> stage win on the gravel roads of Strade Bianche last year, as well as his memorable<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-work-of-aert-the-tour-de-france-concludes-with-a-worthy-stage-winner?srsltid=AfmBOoqPuAEaSwoUcjFyjaaDKTF74bNNpSXjnRF4i2OluCOGRg0XUe1O&amp;tag=member\"> victory on the Champs-Élysées in Paris,</a> to remind himself of his enduring class. “Last season I was not as consistent as I want, but these moments really help me to believe that even when everything is not going well, like now for example, that I am one of the best bike riders in the world and there will be moments where I can show that off.”<br /><br /><em>Cover image: Getty Images</em></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d4822a2ef29367898c5b12de3d856af3d5e9d593cfb4e47de6cc5f1793904322","category":"Cycling"}