{"title":"Fly's new Sprites.dev addresses both developer sandboxes and API sandboxes at the same time","link":"https://simonwillison.net/2026/Jan/9/sprites-dev/#atom-entries","date":1768003032000,"content":"<p>New from Fly.io today: <a href=\"https://sprites.dev\">Sprites.dev</a>. Here's their <a href=\"https://fly.io/blog/code-and-let-live/\">blog post</a> and <a href=\"https://www.youtube.com/watch?v=7BfTLlwO4hw\">YouTube demo</a>. It's an interesting new product that's quite difficult to explain - Fly call it \"Stateful sandbox environments with checkpoint &amp; restore\" but I see it as hitting two of my current favorite problems: a safe development environment for running coding agents <em>and</em> an API for running untrusted code in a secure sandbox.</p>\r\n<p><em>Disclosure: Fly sponsor some of my work. They did not ask me to write about Sprites and I didn't get preview access prior to the launch. My enthusiasm here is genuine.</em></p>\r\n\r\n<ul>\r\n  <li><a href=\"https://simonwillison.net/2026/Jan/9/sprites-dev/#developer-sandboxes\">Developer sandboxes</a></li>\r\n  <li><a href=\"https://simonwillison.net/2026/Jan/9/sprites-dev/#storage-and-checkpoints\">Storage and checkpoints</a></li>\r\n  <li><a href=\"https://simonwillison.net/2026/Jan/9/sprites-dev/#really-clever-use-of-claude-skills\">Really clever use of Claude Skills</a></li>\r\n  <li><a href=\"https://simonwillison.net/2026/Jan/9/sprites-dev/#a-sandbox-api\">A sandbox API</a></li>\r\n  <li><a href=\"https://simonwillison.net/2026/Jan/9/sprites-dev/#scale-to-zero-billing\">Scale-to-zero billing</a></li>\r\n  <li><a href=\"https://simonwillison.net/2026/Jan/9/sprites-dev/#two-of-my-favorite-problems-at-once\">Two of my favorite problems at once</a></li>\r\n</ul>\r\n\r\n<h4>Developer sandboxes</h4>\r\n<p>I predicted earlier this week that <a href=\"https://simonwillison.net/2026/Jan/8/llm-predictions-for-2026/#1-year-a-challenger-disaster-for-coding-agent-security\">\"we’re due a Challenger disaster with respect to coding agent security\"</a> due to the terrifying way most of us are using coding agents like Claude Code and Codex CLI. Running them in <code>--dangerously-skip-permissions</code> mode (aka YOLO mode, where the agent acts without constantly seeking approval first) unlocks so much more power, but also means that a mistake or a malicious prompt injection can cause all sorts of damage to your system and data.</p>\r\n<p>The safe way to run YOLO mode is in a robust sandbox, where the worst thing that can happen is the sandbox gets messed up and you have to throw it away and get another one.</p>\r\n<p>That's the first problem Sprites solves:</p>\r\n<div><pre>curl https://sprites.dev/install.sh <span>|</span> bash\r\n\r\nsprite login\r\nsprite create my-dev-environment\r\nsprite console -s my-dev-environment</pre></div>\r\n<p>That's all it takes to get SSH connected to a fresh environment, running in an ~8GB RAM, 8 CPU server. And... Claude Code and Codex and Gemini CLI and Python 3.13 and Node.js 22.20 and a bunch of other tools are already installed.</p>\r\n<p>The first time you run <code>claude</code> it neatly signs you in to your existing account with Anthropic. The Sprites VM is persistent so future runs of <code>sprite console -s</code> will get you back to where you were before.</p>\r\n<p>... and it automatically sets up port forwarding, so you can run a localhost server on your Sprite and access it from <code>localhost:8080</code> on your machine.</p>\r\n<p>There's also a command you can run to assign a public URL to your Sprite, so anyone else can access it if they know the secret URL.</p>\r\n<h4>Storage and checkpoints</h4>\r\n<p>In <a href=\"https://fly.io/blog/code-and-let-live/\">the blog post</a> Kurt Mackey argues that ephemeral, disposable sandboxes are not the best fit for coding agents:</p>\r\n<blockquote>\r\n<p>The state of the art in agent isolation is a read-only sandbox. At Fly.io, we’ve been selling that story for years, and we’re calling it: ephemeral sandboxes are obsolete. Stop killing your sandboxes every time you use them. [...]</p>\r\n<p>If you force an agent to, it’ll work around containerization and do work . But you’re not helping the agent in any way by doing that. They don’t want containers. They don’t want “sandboxes”. They want computers.</p>\r\n<p>[...] with an actual computer, Claude doesn’t have to rebuild my entire development environment every time I pick up a PR.</p>\r\n</blockquote>\r\n<p>Each Sprite gets a proper filesystem which persists in between sessions, even while the Sprite itself shuts down after inactivity. It sounds like they're doing some clever filesystem tricks here, I'm looking forward to learning more about those in the future.</p>\r\n<p>There are some clues on <a href=\"https://sprites.dev/\">the homepage</a>:</p>\r\n<blockquote>\r\n<p>You read and write to fast, directly attached NVMe storage. Your data then gets written to durable, external object storage. [...]</p>\r\n<p>You don't pay for allocated filesystem space, just the blocks you write. And it's all TRIM friendly, so your bill goes down when you delete things.</p>\r\n</blockquote>\r\n<p>The really clever feature is checkpoints. You (or your coding agent) can trigger a checkpoint which takes around 300ms. This captures the entire disk state and can then be rolled back to later.</p>\r\n<p>For more on how that works, run this in a Sprite:</p>\r\n<pre><code>cat /.sprite/docs/agent-context.md\r\n</code></pre>\r\n<p>Here's the relevant section:</p>\r\n<pre><code>## Checkpoints\r\n- Point-in-time checkpoints and restores available\r\n- Copy-on-write implementation for storage efficiency\r\n- Last 5 checkpoints mounted at `/.sprite/checkpoints`\r\n- Checkpoints capture only the writable overlay, not the base image\r\n</code></pre>\r\n<p>Or run this to see the <code>--help</code> for the command used to manage them:</p>\r\n<div><pre>sprite-env checkpoints --help</pre></div>\r\n<p>Which looks like this:</p>\r\n<pre><code>sprite-env checkpoints - Manage environment checkpoints\r\n\r\nUSAGE:\r\n    sprite-env checkpoints &lt;subcommand&gt; [options]\r\n\r\nSUBCOMMANDS:\r\n    list [--history &lt;ver&gt;]  List all checkpoints (optionally filter by history version)\r\n    get &lt;id&gt;                Get checkpoint details (e.g., v0, v1, v2)\r\n    create                  Create a new checkpoint (auto-versioned)\r\n    restore &lt;id&gt;            Restore from a checkpoint (e.g., v1)\r\n\r\nNOTE:\r\n    Checkpoints are versioned as v0, v1, v2, etc.\r\n    Restore returns immediately and triggers an async restore that restarts the environment.\r\n    The last 5 checkpoints are mounted at /.sprite/checkpoints for direct file access.\r\n\r\nEXAMPLES:\r\n    sprite-env checkpoints list\r\n    sprite-env checkpoints list --history v1.2.3\r\n    sprite-env checkpoints get v2\r\n    sprite-env checkpoints create\r\n    sprite-env checkpoints restore v1\r\n</code></pre>\r\n<h4>Really clever use of Claude Skills</h4>\r\n<p>I'm <a href=\"https://simonwillison.net/2025/Oct/16/claude-skills/\">a big fan of Skills</a>, the mechanism whereby Claude Code (and increasingly other agents too) can be given additional capabilities by describing them in Markdown files in a specific directory structure.</p>\r\n<p>In a smart piece of design, Sprites uses pre-installed skills to teach Claude how Sprites itself works. This means you can ask Claude on the machine how to do things like open up ports and it will talk you through the process.</p>\r\n<p>There's all sorts of interesting stuff in the <code>/.sprite</code> folder on that machine - digging in there is a great way to learn more about how Sprites works.</p>\r\n<h4>A sandbox API</h4>\r\n<p>Also from my predictions post earlier this week: <a href=\"https://simonwillison.net/2026/Jan/8/llm-predictions-for-2026/#1-year-we-re-finally-going-to-solve-sandboxing\">\"We’re finally going to solve sandboxing\"</a>. I am obsessed with this problem: I want to be able to run untrusted code safely, both on my personal devices and in the context of web services I'm building for other people to use.</p>\r\n<p>I have <em>so many things</em> I want to build that depend on being able to take untrusted code - from users or from LLMs or from LLMs-driven-by-users - and run that code in a sandbox where I can be confident that the blast radius if something goes wrong is tightly contained.</p>\r\n<p>Sprites offers a clean <a href=\"https://sprites.dev/api\">JSON API</a> for doing exactly that, plus client libraries in <a href=\"https://github.com/superfly/sprites-go\">Go</a> and <a href=\"https://github.com/superfly/sprites-js\">TypeScript</a> and coming-soon <a href=\"https://github.com/superfly/sprites-py\">Python</a> and <a href=\"https://github.com/superfly/sprites-ex\">Elixir</a>.</p>\r\n<p>From their quick start:</p>\r\n<pre><code># Create a new sprite\r\ncurl -X PUT https://api.sprites.dev/v1/sprites/my-sprite \\\r\n-H \"Authorization: Bearer $SPRITES_TOKEN\"\r\n\r\n# Execute a command\r\ncurl -X POST https://api.sprites.dev/v1/sprites/my-sprite/exec \\\r\n-H \"Authorization: Bearer $SPRITES_TOKEN\" \\\r\n-d '{\"command\": \"echo hello\"}'\r\n</code></pre>\r\n<p>You can also checkpoint and rollback via the API, so you can get your environment exactly how you like it, checkpoint it, run a bunch of untrusted code, then roll back to the clean checkpoint when you're done.</p>\r\n<p>Managing network access is an important part of maintaining a good sandbox. The Sprites API lets you <a href=\"https://sprites.dev/api/sprites/policies\">configure network access policies</a> using a DNS-based allow/deny list like this:</p>\r\n<div><pre>curl -X POST \\\r\n  <span><span>\"</span>https://api.sprites.dev/v1/sprites/{name}/policy/network<span>\"</span></span> \\\r\n  -H <span><span>\"</span>Authorization: Bearer <span>$SPRITES_TOKEN</span><span>\"</span></span> \\\r\n  -H <span><span>\"</span>Content-Type: application/json<span>\"</span></span> \\\r\n  -d <span><span>'</span>{</span>\r\n<span>    \"rules\": [</span>\r\n<span>      {</span>\r\n<span>        \"action\": \"allow\",</span>\r\n<span>        \"domain\": \"github.com\"</span>\r\n<span>      },</span>\r\n<span>      {</span>\r\n<span>        \"action\": \"allow\",</span>\r\n<span>        \"domain\": \"*.npmjs.org\"</span>\r\n<span>      }</span>\r\n<span>    ]</span>\r\n<span>  }<span>'</span></span></pre></div>\r\n\r\n<h4>Scale-to-zero billing</h4>\r\n<p>Sprites have scale-to-zero baked into the architecture. They go to sleep after 30 seconds of inactivity, wake up quickly when needed and bill you for just the CPU hours, RAM hours and GB-hours of storage you use while the Sprite is awake.</p>\r\n<p>Fly <a href=\"https://sprites.dev/#billing\">estimate</a> a 4 hour intensive coding session as costing around 46 cents, and a low traffic web app with 30 hours of wake time per month at ~$4.</p>\r\n<p>(I calculate that a web app that consumes all 8 CPUs and all 8GBs of RAM 24/7 for a month would cost ((7 cents * 8 * 24 * 30) + (4.375 cents * 8 * 24 * 30)) / 100  = $655.2 per month, so don't necessarily use these as your primary web hosting solution for an app that soaks up all available CPU and RAM!)</p>\r\n<h4>Two of my favorite problems at once</h4>\r\n<p>I was hopeful that Fly would enter the developer-friendly sandbox API market, especially given other entrants from companies like <a href=\"https://sandbox.cloudflare.com/\">Cloudflare</a> and <a href=\"https://modal.com/docs/guide/sandboxes\">Modal</a> and <a href=\"https://e2b.dev/\">E2B</a>.</p>\r\n<p>I did not expect that they'd tackle the developer sandbox problem at the same time, and with the same product!</p>\r\n<p>My one concern here is that it makes the product itself a little harder to explain.</p>\r\n<p>I'm already spinning up some prototypes of sandbox-adjacent things I've always wanted to build, and early signs are very promising. I'll write more about these as they turn into useful projects.</p>\r\n\r\n\r\n<p><strong>Update</strong>: Here's some <a href=\"https://news.ycombinator.com/item?id=46557825#46560748\">additional colour</a> from Thomas Ptacek on Hacker News:</p>\r\n<blockquote>\r\n<p>This has been in the works for quite awhile here. We put a long bet on \"slow create fast start/stop\" --- which is a really interesting and useful shape for execution environments --- but it didn't make sense to sandboxers, so \"fast create\" has been the White Whale at Fly.io for over a year.</p>\r\n</blockquote><p><em>You are only seeing the long-form articles from my blog. Subscribe to <a href=\"https://simonwillison.net/atom/everything/\">/atom/everything/</a> to get all of my posts, or take a look at my <a href=\"https://simonwillison.net/about/#subscribe\">other subscription options</a>.</em></p>","author":"Simon Willison","siteTitle":"Simon Willison’s Weblog","siteHash":"1b599216bd27a00f15d67a3ed9719c64148630c70244b6dd8e743f17cb45527e","entryHash":"d6a32b6a319dbf43a84c8d09e8c6912e5fb45debd6ddd5314c547e98859d11d7","category":"Tech"}