{"title":"Sliding Scales: Weight, performance and pressure in women’s cycling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/sliding-scales","date":1767618093000,"content":"\n      <p><em>This article was first published in<span> </span><a href=\"https://www.rouleur.cc/products/issue-140\" target=\"_blank\">Rouleur Issue 140</a></em></p>\n<p>Pauline Ferrand-Prévot hadn’t even left the cosy Alpine resort town of Châtel, the place where she made sure of her dominant Tour de France Femmes victory, when a fervent debate about her weight threatened to overshadow her latest career triumph.</p>\n<p>“We secretly hoped that she wouldn’t be successful,” said Marlen Reusser – a rival who had hoped to challenge for the yellow jersey only to abandon on day one due to illness. “Ferrand-Prévot has set a new standard,” Reusser continued. “When riders are this successful by becoming so thin, it puts pressure on all of us. What’s the takeaway for a 17-year-old without a nutritionist seeing this kind of body ideal being celebrated?” Demi Vollering, who finished second to Ferrand-Prévot, added: “I just really hope that young girls don’t now think they need to be super skinny to ride in the mountains.”</p>\n<p>The ‘crime’ was that Ferrand-Prévot, perhaps the greatest multidisciplinarian in the sport’s history, had lost four kilograms of weight between winning Paris-Roubaix in April and triumphing on her debut at the Tour in August. The Frenchwoman herself said, “I don’t want to stay like this – I know it’s not 100 per cent healthy”, but defended her practice, stating that her weight loss was a calculated and controlled short-term reduction to help her in the high mountains to win the Tour and that it was not something she planned to maintain long term.</p>\n<p>But the discussion around weight and disordered eating in the sport has not gone away – instead, the conversation surrounding Ferrand-Prévot has served to highlight the issue and bring it into sharper focus. Many are now asking openly: how many athletes in the men’s and women’s pelotons struggle with their weight? Was what Ferrand-Prévot did really as damaging to her own body as some made out, and did it set a dangerous precedent to both her fellow competitors and impressionable followers of the sport? Or is it just an unavoidable part of trying to win a Grand Tour in professional cycling?</p>\n<h4>Weighty issues</h4>\n<p>Grace Brown, the 2024 Olympic time trial champion, is the president of The Cyclists’ Alliance, an independent body that advocates for better opportunities and working conditions in womens’ cycling. She says that in large thanks to the widespread deployment of nutritional apps, greater access to nutritionists and more teams promoting scientifically-backed approaches, “the majority of the peloton has a healthy approach to their weight”.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rouleur_140_SlidingScales_GozdeEyce_1_2_1024x1024.jpg?v=1767617026\" alt=\"Sliding scales\" /></div>\n<p><em>Artwork by Gozde Eyce</em></p>\n<p>Ingrained habits, though, allow some to slip through the net. “Individuals can still be influenced outside the team setting to take a different path,” she admits. And among some teams, there are concerning and alarming tales.</p>\n<p>“There are still some teams in the Women’s WorldTour who have quite old-school practices, where riders have been told that they’re underperforming because they’re overweight, and that the only way to manage that is to train while fasted, which has been scientifically proven to not be beneficial,” Brown says. “In other cases riders are told that once their job is done they can’t eat anymore of the food they’ve packed in their pockets as they’re not putting in intense efforts anymore, and they should therefore focus on going into deficit for the rest of the ride. This behaviour is completely outdated.”</p>\n<p>But sadly it’s not uncommon. “There’s still an old-school mentality that I’ve experienced first-hand,” echoes Clara Koppenburg, a German rider who rode for Cofidis in 2025 and who in 2018 while at university wrote a scientific study into eating disorders in female cycling, to date the only one of its kind. “You get cases where girls are super skinny and performing well because their power to weight is amazing, but when the team is questioned if they know that the rider is going to the toilet [to vomit] after every meal, the team say: ‘We know, but we can’t help her because she’s performing so well’. We tell them that in two years she won’t be able to compete because her body will be so broken, but the team responds: ‘As long as she is performing for us, that’s good enough, and then we can replace her’. You hear so many stories like this where management and owners treat riders like material objects which is heartbreaking. We are humans, too.”</p>\n<h4>Disorderly conduct</h4>\n<p>When most people think of eating disorders, their minds are immediately drawn to anorexia and bulimia. But in cycling, just like in other endurance sports, the most common issue is RED-S – relative energy deficiency in sport. It’s characterised by the person not eating as much food as their energy demands require. But, sports dietitian Renee McGregor points out, RED-S “is not a clear cut energy alone issue.” She explains: “It’s much more about the overall stress in the body. That could be the result of underfuelling, a sufficient lack of recovery, overtraining, and anxiety over body composition.” RED-S, she adds, is often a consequence of an eating disorder, dispelling some beliefs that RED-S isn’t as severe.</p>\n<p>A major problem with RED-S is that it’s so hard to spot with the naked eye – it’s not like anorexia where a lack of weight is visually apparent; in fact, riders with RED-S can even appear slightly overweight. What makes RED-S so hard to get on top of is that initial weight loss often comes with improved condition. “As soon as you lose a bit of weight your performance increases drastically, so your head says: ‘Why change anything?’” says Koppenburg; she struggled with the condition for many years. “It’s so typical for a RED-S sufferer to see the positives from the weight loss so they train more and spend more energy. It’s a negative spiral that happens to a lot of riders.”</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1_1fc1b76b-62d8-4bc1-88b3-3235a7b5963b_1024x1024.png?v=1767617205\" alt=\"\" /></div>\n<p><em>Artwork by Gozde Eyce</em></p>\n<p>There is also a lack of understanding and appreciation about the different body compositions among female riders. It’s something Vollering alluded to post-Tour, when she said, “I really hope in the future I can win climbing races again with my heavy weight” to prove to people “that if you have the power [and] you train hard, you can make it, even if you’re heavier.” Brown issues an important reminder: “Women can be really high performing with a variety of body shapes and sizes,” the Australian says. “It’s a fact of life that women need extra body fat to function, and it’s much more important for female athletes to build power, rather than trying to make themselves lighter, because eventually your body won’t be able to sustain it any longer.”</p>\n<h4>Double standards</h4>\n<p>To frame this as a women’s-only issue would be misleading and incorrect. “The problem is way bigger than we think: many riders have an unhealthy relationship with their body, and it affects men as much as women,” says ex-Slovenian pro Jani Brajkovič. The winner of the 2010 Critérium du Dauphiné raced professionally for 17 years with bulimia, and now as performance coach helps a number of current pros. “It’s pretty obvious there are double standards in this conversation,” he says. “In men’s cycling, we don’t talk about a rider only having 3 per cent body fat, but if we do we maybe praise it as a sign of discipline and sacrifice. But women are still viewed through the lens of how they should look and not what they’re doing and capable of.”</p>\n<p>Indeed, for decades male cyclists have been shedding weight prior to Grand Tours to enable them to climb better. What Ferrand-Prèvot did was exactly what Greg LeMond, Jan Ullrich and Geraint Thomas have done at various points in their career, embarking on stricter diets and training regimes to lower their weight. So why was Ferrand-Prévot subject to criticism when her male counterparts weren’t? The inconsistent stance in the debate is both unfair and hypocritical, but is probably partly explained by the speed at which women’s cycling is professionalising, and such marginal techniques never before having been commonplace in the women’s peloton; what for decades has been the norm in men’s cycling, is still a new concept in women’s cycling.</p>\n<p>The danger of underfuelling, however, cannot be overstated. Brajkovič says that almost two decades of disordered eating has left him with permanent scars and complications. “Everything riders do today – counting calories, being extremely strict with their diet, and constantly weighing themselves – I was doing ahead of my time in 2006, and I know what the final result was for me,” he says. “The body can sustain this behaviour for a while, but sooner or later you’ll develop an eating disorder, anxiety and/or depression. I can’t say I haven’t done any damage to myself and to my body from all the self-destruction.”</p>\n<p>For women, disordered eating brings specific challenges, with irregularities in the menstrual cycle, including missed periods, something that ought to be corrected as soon as it flares up. “The menstrual cycle is a barometer of health,” McGregor says. “It’s telling us that the body can reproduce and maintain life, and if all of a sudden you’re not having a menstrual cycle it’s a sign that the body is stressed and not fit to make life. It also affects all the other hormones, the person’s metabolism, the digestive system, appetite, body composition, ability to perform, cognition, balance, and the reproduction of cholesterol. And we know missing three consecutive menstrual cycles has a very negative consequence on bone health which is really critical to everyone but especially athletes.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2_052aade3-d003-4ef6-9631-b3868f7b52a2.png?v=1767617205\" alt=\"\" /></p>\n<p><em>Artwork by Gozde Eyce</em></p>\n<h4>Normalisation</h4>\n<p>In the immediate aftermath of her Tour glory, Ferrand-Prévot pleaded for an understanding of why she lost 4kg. “Parents should educate their kids and say to them, ‘Pauline is like this because she’s preparing for the Tour de France – it’s not forever’,” she said. No one doubted, too, that the Frenchwoman, supported by Visma-Lease a Bike nutritionists and scientists, would be able to return to her previous normal weight. The issue many raised is that most athletes, even many of Ferrand-Prévot’s direct competitors, don’t have that same expert access, nor the experience to resist the temptation to keep the weight off for longer.</p>\n<p>“If other riders did what Pauline did, they might gain a bit of weight a week after the Tour, but then be tempted to go back to the lighter weight because they equate losing 5kg with their best ever performance,” Brajkovič says. “This then becomes the default state and this is when things go very wrong. Losing that weight is forcing the body to do something it doesn’t want to do, and if that abuse becomes chronic then you have a huge problem.”</p>\n<p>Koppenburg admits that Ferrand-Prévot’s weight loss “was really emotional for me” as it triggered memories of her own struggles, but she doesn’t agree that the Frenchwoman has set a worrying new standard. “It’s not healthy nor super cool to make those big weight changes all the time, but anyone who watches more than the Tour will see that riders of different sizes and weights win races,” the German says. “I don’t think people will have been too influenced by Pauline and I honestly don’t think she gave such a negative example because next year you will probably see her at Roubaix with her normal weight.”</p>\n<h4>Metrics and mandates</h4>\n<p>That said, cycling does have a problem to combat. “Too many girls are on their absolute limit and it’s dangerous, so we need to help them,” Koppenburg says. “You can’t recommend an ideal weight because everyone’s bodies are different, and BMI [Body Mass Index] doesn’t work for sportspeople, but maybe we could say a rider has to have a certain percentage of body fat to start a race.” Regular medical monitoring and easier access to experts would also help those struggling, Koppenburg suggests. “It’s great to have nutritionists, but ultimately it’s the athlete’s head who decides their approach to food. If they don’t have mental specialists to explain why they need that amount of food, and what happens if they don’t build their body right, they’ll struggle. We need more psychologists and mental coaches helping athletes.”</p>\n<p>The Cyclists’ Alliance has repeatedly called on the UCI, the sport’s governing body, to introduce RED-S screening as part of a rider’s annual medical checkup. “There is no test that can be done to give a real and complete picture of all the warning signs, but monitoring bone density alongside tracking the female menstrual cycle would go some way, because hormonal blood markers can give a bit of an indication if something is going in the wrong direction,” Brown says. “More can definitely be done to flag problems when they’re starting out before they become so bad that a rider has to take a year out to get better. We need best practice guidelines.”</p>\n<p>McGregor agrees that more trained personnel are required to guide athletes, but she cautions against setting metric limits. “Some athletes will function at 17 per cent body fat, and some at 22 per cent, and both will be able to maintain a menstrual cycle and have good hormonal health. Everyone is different,” the dietitian says. “Body composition can’t be the metric to judge by – it has to be a collective of assessments to make sure you’ve got a proper picture. One athlete I’m currently working with has a normal body fat percentage and a normal BMI so she would pass a physical test, but her hormonal blood tests are completely down, so in reality she’s absolutely not fit to be racing. That’s the problem with having metrics. What is needed is an independent group of qualified practitioners who can carry out assessments and educate athletes across the board.”</p>\n<p>The UCI has committed to introducing educational programs (though none have yet materialised) but have refused to adhere to requests to intervene with rules. “They are resistant to having any formal mandate because it’s not black and white for them – there are too many grey areas,” Brown reveals. “Part of me also suspects that they just don’t take it seriously.”</p>\n<p>The debate that emerged at the Tour and then erupted post-race will continue. The reality is cyclists will always be at greater risk of having eating disorder tendencies, but only by continuing the discussion can things improve. “There’s been a lot of noise around this topic – some of it negative – but in general I think it’s good that we’re talking about it, especially for fans and the general public so they can understand a little bit more the requirements of women in sport,” Brown says. “At the Cyclists’ Alliance we’ve also had so many people contacting us offering their help and services, including people conducting scientific research, which historically has rarely happened. I’m optimistic that things will get better because there’s so much attention on this issue now.”</p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"d81efca40aa35575b951ac75b428a219623a0bd118d2bd9a759da041a9d4e94f","category":"Cycling"}