{"title":"MEET THE MAKER: RICHARD JARA","link":"https://moots.com/blogs/news/meet-the-maker-richard-jara","date":1763664507000,"content":"\n      <h3><em>The Creative Force Behind California Dreamin’ &amp; the Topo Scrambler</em></h3>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-11-20_at_11.48.50_AM_d4a87dc8-3987-4a43-a5fc-b6bb2e0a2641.png?v=1763664705\" alt=\"\" /></p>\n<p>Every special edition finish that leaves our factory carries a story and this one belongs to Richard Jara, the artist and visionary behind both our California Dreamin’ and <a href=\"https://moots.com/products/scrambler\" target=\"_blank\"><strong>Topo Scrambler</strong></a> designs.</p>\n<p>This year, a cycling injury kept Richard off the bike for three months.<br />Instead of slowing down, he turned all of that restless, ride-longing energy into design.<br />The result: two finishes infused with movement, meaning, and miles.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-11-20_at_11.49.44_AM.png?v=1763664704\" alt=\"\" /></p>\n<p>With over a decade of self-propelled exploration from racing the Tour Divide, to logging more than 2,000 miles on the Colorado Trail, to countless long days spent exploring the backroads of Routt County Richard’s work is rooted in place, experience, and the culture of adventure.</p>\n<p>For the Scrambler’s topo finish, he leaned into that connection even deeper. Inside the Moots factory hangs a giant topo map of Routt County the same map we gather around after weekends out, tracing lines, sharing stories, and planning the next ride. Those lines became the foundation of the design: a tribute to terrain, movement, and the freedom of deciding where the trail will take you next.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2025-11-20_at_11.50.18_AM.png?v=1763664700\" alt=\"\" /></p>\n<p>“I wanted this bike to evoke a sense of exploration,” Richard says. “My hope is that it becomes an outlet for adventure every time you load it up and head out.”</p>\n<p>From setback to artwork, from map lines to titanium. Richard’s finishes are more than paint. They’re reminders that the ride always finds its way back.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"d8dc284c07f1096f2a32e32cdde7776f1b0d76054329a4d9d666a5a5aba300ff","category":"Cycling"}