{"title":"The retro iPod that never was","link":"https://www.macworld.com/article/3066316/the-retro-ipod-that-never-was.html","date":1771589700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple is known for being secretive about what goes on inside its offices, whether it’s about upcoming products or things from the past. Still, from time to time, we get a glimpse into internal projects that were never meant to see the light of day. What if we told you that Apple once considered launching a “retro iPod”?</p>\n\n\n\n<p>Thanks to newly published material by former Apple designer Jon Stoa, we now have a fascinating glimpse into never-before-seen marketing concepts. They not only show scrapped plans for the <a href=\"https://www.macworld.com/article/186335/original-iphone-review-2.html\">2007 iPhone launch</a>, but also concepts for what would have been a special edition iPod classic.</p>\n\n\n\n<h2>An iPod inspired by the 1984 Macintosh</h2>\n\n\n\n<p>On his <a href=\"https://www.jonstoa.com/resume\">resume webpage</a>, which includes several images for ads, packaging elements, and marketing images created while working at Apple, Stoa shares some of the unreleased projects he worked on at Apple between 2006 and 2008. The most intriguing is the concept for a limited edition “retro iPod,” which would be designed to look like it came straight out of 1984.</p>\n\n\n\n<p>The idea was heavily based on a growing trend of nostalgia, even 20 years ago. The material imagines an iPod based on the design of the original Macintosh with a beige finish, classic typography, and the rainbow Apple logo on the back. He writes that the device “would draw from both the present and the past to make a statement about the role of Apple and the iPod in culture, both now and then.”</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/02/iPod-retro-names.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPod retro names\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>Apple proposed a series of names for its retro “1984” iPod.</p></figcaption></figure><p>Jon Stoa</p></div>\n\n\n\n<p>Suggested names included iPod retro, iPod rewind, iPod beta, and iPod backspace, all rendered in Apple Garamond, the typography used in Apple’s marketing materials at the time.</p>\n\n\n\n<p>The concept went far beyond a vintage design. The marketing material proposed preloading the iPod with some music videos from the 1980s and even classic arcade games such as Pac-Man. Distribution would have been limited, with the retro iPod only available at Apple Stores and selected boutique partners.</p>\n\n\n\n<p>There’s no evidence Apple ever developed prototypes for the retro iPod. The materials appear to be unused design and marketing explorations rather than a cancelled product.</p>\n\n\n\n<p>Still, the fact that someone inside Apple considered making a vintage edition of the iPod (which was at its peak in 2006) is fascinating.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/02/iPod-touch.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPod touch\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>A retro iPod is unlikely to happen now, but it would make an intriguing device.</p></figcaption></figure><p>Jon Stoa</p></div>\n\n\n\n<h2>Could a retro iPod happen in 2026?</h2>\n\n\n\n<p>Apple officially killed the iPod brand in 2022 when it discontinued the iPod touch, but the more classic iPod nano and iPod shuffle disappeared years earlier. Even so, some people are still calling for the return of the iPod in some form.</p>\n\n\n\n<p>Some fans would instantly buy an iPod classic, while others would like a reimagined version of the iPod that blends today’s technologies with the essence of the original iPod.</p>\n\n\n\n<p>If Apple were to revisit the idea today, it likely wouldn’t be a straight reissue. Instead, we could imagine a compact device the size of the iPod classic, but built with today’s materials and components. A modern OLED or mini-LED display, haptic feedback to simulate the tactile feel of the Click Wheel, expanded storage options, Wi-Fi and Bluetooth support, and deep integration with Apple Music.</p>\n\n\n\n<p>Whether Apple would embrace this idea of looking back at its hardware is another question. The company typically prefers to move forward and rarely celebrates milestones such as product anniversaries. But it’s hard to imagine a limited-edition device like this not selling out instantly.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/02/Apple-Store-NYC-cube-with-iphone-projections.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Store 5th Avenue with light prjections for the original iPhone\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>The Apple Store cube on 5th Avenue in New York City could have had a light projection show ahead of the iPhone’s launch.</p></figcaption></figure><p>Jon Stoa</p></div>\n\n\n\n<h2>The canceled iPhone event</h2>\n\n\n\n<p>Stoa’s material also sheds light on Apple’s pre-launch strategy for the original iPhone.</p>\n\n\n\n<p>According to the documents, Apple had considered hosting another press event on June 26, 2007, just three days before the iPhone officially went on sale. The event was to be held at The California Theatre in San Jose. Attendees would have received an iPhone-shaped gift card to spend on the iTunes Store.</p>\n\n\n\n<p>However, the event never happened.</p>\n\n\n\n<p>By that point, Apple had already revealed the iPhone in January and provided significant updates during WWDC 2007 in June. A third event may have felt redundant or strategically unnecessary. Stoa’s site also shows a unique light projection on Apple’s 5th Avenue cube </p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2026/02/2007-Apple-event-iPhone.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple iPhone poster from a canceled 2007 event\" width=\"1200\" height=\"800\" loading=\"lazy\" />\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t<figcaption><p>The iPhone proably didn’t need any extra promotion in 2007.</p></figcaption></figure><p>Jon Stoa</p></div>\n\n\n\n<p>Still, thanks to Stoa, we can now take a look at all the banners, emails, and other marketing materials created for this iPhone pre-launch.</p>\n\n\n\n<p>The theater lobby would have multiple posters highlighting key iPhone technologies such as the multi-touch display, accelerometer, wireless connectivity, Visual Voicemail, proximity sensor, and OS X. (Yes, Apple used to call the iPhone’s operating system OS X before naming it iPhone OS and then iOS.)</p>\n\n\n\n<p>Taken together, these materials offer a rare look at Apple’s parallel universe with products and events that almost happened. They also serve as a reminder that even a company as big and successful as Apple explores many ideas that may never reach the public.</p>\n\n\n\n<p>And sometimes, those unseen ideas are just as fascinating as the products that made it to store shelves.</p>\n\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"db476fedb93ec02c4834073877f08f70c045fdd768c8ee85d0930a66599d2595","category":"Apple"}