{"title":"Breaking Out of the Box","link":"https://alistapart.com/article/breaking-out-of-the-box/","date":1639062000000,"content":"\n<p>CSS is about styling boxes. In fact, the whole web is made of boxes, from the browser viewport to elements on a page. But every once in a while a new feature comes along that makes us rethink our design approach.</p>\n\n\n\n<p><a href=\"https://www.w3.org/TR/css-round-display-1/\">Round displays</a>, for example, make it fun to play with circular clip areas. <a href=\"https://css-tricks.com/the-notch-and-css/\">Mobile screen notches</a> and <a href=\"https://www.w3.org/TR/virtual-keyboard/\">virtual keyboards</a> offer challenges to best organize content that stays clear of them. And <a href=\"https://blogs.windows.com/msedgedev/2020/09/14/introducing-dual-screen-foldable-web-apis/\">dual screen or foldable devices</a> make us rethink how to best use available space in a number of different <a href=\"https://w3c.github.io/device-posture/\">device postures</a>.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/12/fig1-1024x482.png\" alt=\"\" /><figcaption><em>Sketches of a round display, a common rectangular mobile display, and a device with a foldable display.</em></figcaption></figure>\n\n\n\n<p>These recent evolutions of the web platform made it both more challenging and more interesting to design products. They’re great opportunities for us to break out of our rectangular boxes.</p>\n\n\n\n<p>I’d like to talk about a new feature similar to the above: the Window Controls Overlay for Progressive Web Apps (PWAs).</p>\n\n\n\n<p><a href=\"https://alistapart.com/article/yes-that-web-project-should-be-a-pwa/\">Progressive Web Apps</a> are blurring the lines between apps and websites. They combine the best of both worlds. On one hand, they’re stable, linkable, searchable, and responsive just like websites. On the other hand, they provide additional powerful capabilities, work offline, and read files just like native apps.</p>\n\n\n\n<p>As a design surface, PWAs are really interesting because they challenge us to think about what mixing web and device-native user interfaces can be. On desktop devices in particular, we have more than <a href=\"https://en.wikipedia.org/wiki/History_of_the_graphical_user_interface\">40 years of history</a> telling us what applications should look like, and it can be hard to break out of this mental model.</p>\n\n\n\n<p>At the end of the day though, PWAs on desktop are constrained to the window they appear in: a rectangle with a title bar at the top.</p>\n\n\n\n<p>Here’s what a typical desktop PWA app looks like:</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/12/fig2-1024x323.png\" alt=\"\" /><figcaption><em>Sketches of two rectangular user interfaces representing the desktop Progressive Web App status quo on the macOS and Windows operating systems, respectively. </em></figcaption></figure>\n\n\n\n<p>Sure, as the author of a PWA, you get to choose the color of the title bar (using the Web Application Manifest <a href=\"https://developer.mozilla.org/en-US/docs/Web/Manifest/theme_color\"><strong>theme_color</strong></a> property), but that’s about it.</p>\n\n\n\n<p>What if we could think outside this box, and reclaim the real estate of the app’s entire window? Doing so would give us a chance to make our apps more beautiful and feel more integrated in the operating system.</p>\n\n\n\n<p>This is exactly what the <a href=\"https://web.dev/window-controls-overlay/\">Window Controls Overlay</a> offers. This new PWA functionality makes it possible to take advantage of the full surface area of the app, including where the title bar normally appears.</p>\n\n\n\n<h2>About the title bar and window controls</h2>\n\n\n\n<p>Let’s start with an explanation of what the title bar and window controls are.</p>\n\n\n\n<p>The <em>title bar</em> is the area displayed at the top of an app window, which usually contains the app’s name. <em>Window controls</em> are the affordances, or buttons, that make it possible to minimize, maximize, or close the app’s window, and are also displayed at the top.</p>\n\n\n\n<figure><img src=\"https://lh5.googleusercontent.com/1s_lFmqiRm6Fv3wzeELtsDDiDvOkEJuSRH5K9YIrZZ8rh8rYCxUqbSnfd-f7YrsRvcDzF67fexnEJFlDtw53SKKmOgVk8sv_VUyCQveoR18HkNgACPxcQTtEOb6SmEuRIDlX3EcI\" alt=\"\" /><figcaption><em>A sketch of a rectangular application user interface highlighting the title bar area and window control buttons.</em></figcaption></figure>\n\n\n\n<p>Window Controls Overlay removes the physical constraint of the title bar and window controls areas. It frees up the full height of the app window, enabling the title bar and window control buttons to be overlaid on top of the application’s web content. </p>\n\n\n\n<figure><img src=\"https://lh6.googleusercontent.com/k_6o1fBePhbjvtmxoTW3tG1134Gvbo31r2fy7zxmOB39d_eKpjThbh7QL8pVXrA1aLvEWzkoJ_rY4af451BU9XyKZXbSouCTvDJMnRKGlcOhcEpXw_rjQAR8_SFjhrm_-22OxKiR\" alt=\"\" /><figcaption><em>A sketch of a rectangular application user interface using Window Controls Overlay. The title bar and window controls are no longer in an area separated from the app’s content.</em></figcaption></figure>\n\n\n\n<p>If you are reading this article on a desktop computer, take a quick look at other apps. Chances are they’re already doing something similar to this. In fact, the very web browser you are using to read this uses the top area to display tabs.</p>\n\n\n\n<figure><img src=\"https://lh6.googleusercontent.com/BLL9Rc5othPsw6xYApyyNOZ73j32wi4XkyoZpl4QOv0OL4MnxMe3bl1xLR0O7WSoAvi3KhyeP83hUh4-EezTmGg2axN4RiOVtgiF5ZiapcjUL6gtLqExZOHGCtkOBbthMTgh5Tmr\" alt=\"\" /><figcaption><em>A screenshot of the top area of a browser’s user interface showing a group of tabs that share the same horizontal space as the app window controls.</em></figcaption></figure>\n\n\n\n<p>Spotify displays album artwork all the way to the top edge of the application window.</p>\n\n\n\n<figure><img src=\"https://lh3.googleusercontent.com/SzPcq94_7Yu_ARf13Z6dRD0tpdlPM_MdrY-7CA_mv4Yu3fBIL3pJnXirP83cCDVoQxnnIEwDoBwbGzfftHmZ3PZZUfsw_oP-m4QLkB2SqekX8JupR9_xmI0tG1q65IfNFbnXIHUh\" alt=\"\" /><figcaption><em>A screenshot of an album in Spotify’s desktop application. Album artwork spans the entire width of the main content area, all the way to the top and right edges of the window, and the right edge of the main navigation area on the left side. The application and album navigation controls are overlaid directly on top of the album artwork.</em></figcaption></figure>\n\n\n\n<p>Microsoft Word uses the available title bar space to display the auto-save and search functionalities, and more.</p>\n\n\n\n<figure><img src=\"https://lh6.googleusercontent.com/VdREVwFFjYHxHF0Gg3l079hxsa8WKPEWiuvuL7cWbGnEDJ2yc3JiOWQK5lUyaeEgzpd1Przji0cNLeooPD7riPKbcMixa6IkXanprdqPJVkQrYSerxSaNmzbJPd1YsA55mlYd9xt\" alt=\"\" /><figcaption><em>A screenshot of Microsoft Word’s toolbar interface. Document file information, search, and other functionality appear at the top of the window, sharing the same horizontal space as the app’s window controls.</em></figcaption></figure>\n\n\n\n<p>The whole point of this feature is to allow you to make use of this space with your own content while providing a way to account for the window control buttons. And it enables you to offer this modified experience on a range of platforms while not adversely affecting the experience on browsers or devices that don’t support Window Controls Overlay. After all, PWAs are all about <a href=\"https://alistapart.com/article/understandingprogressiveenhancement/\">progressive enhancement</a>, so this feature is a chance to enhance your app to use this extra space when it’s available.</p>\n\n\n\n<h2>Let’s use the feature</h2>\n\n\n\n<p>For the rest of this article, we’ll be working on a demo app to learn more about using the feature.</p>\n\n\n\n<p>The demo app is called <a href=\"https://stupefied-edison-a4ee55.netlify.app/\">1DIV</a>. It’s a simple CSS playground where users can create designs using CSS and a single HTML element.</p>\n\n\n\n<p>The app has two pages. The first lists the existing CSS designs you’ve created:</p>\n\n\n\n<figure><img src=\"https://lh3.googleusercontent.com/pW2iUTucKfwMJZrAlPGK19vVnEPaHjYT4N-18P-vm9qkhAdGJcRBMexOCu1q9nN9BAfZ7MH6itNP__kY4HPl9uVPucXkbmSX-E9g6AdVAI_uu6TyEsEdH0LUCXdN1f4kqZNgDr30\" alt=\"\" /><figcaption><em>A screenshot of the 1DIV app displaying a thumbnail grid of CSS designs a user created.</em></figcaption></figure>\n\n\n\n<p>The second page enables you to create and edit CSS designs:</p>\n\n\n\n<figure><img src=\"https://lh5.googleusercontent.com/faaJ3uHbzXg-TFinvOqR_7gyjVPvlk7fuVWuN4aIH6IUxXNAp4GXtIcuVPpo6bd1IOKO1_EMDt4pUgErUh_X2_2r3WnkQ4PzovPp6Zjg0l98W9NBrHA0xAuTNf0uNVBatRsMJzEm\" alt=\"\" /><figcaption><em>A screenshot of the 1DIV app editor page. The top half of the window displays a rendered CSS design, and a text editor on the bottom half of the window displays the CSS used to create it.</em></figcaption></figure>\n\n\n\n<p>Since I’ve added a simple web manifest and service worker, we can install the app as a PWA on desktop. Here is what it looks like on macOS:</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/12/fig10-1024x497.png\" alt=\"\" /><figcaption><em>Screenshots of the 1DIV app thumbnail view and CSS editor view on macOS. This version of the app’s window has a separate control bar at the top for the app name and window control buttons.</em></figcaption></figure>\n\n\n\n<p>And on Windows:</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/12/fig11-1024x534.png\" alt=\"\" /><figcaption><em>Screenshots of the 1DIV app thumbnail view and CSS editor view on the Windows operating system. This version of the app’s window also has a separate control bar at the top for the app name and window control buttons.</em></figcaption></figure>\n\n\n\n<p>Our app is looking good, but the white title bar in the first page is wasted space. In the second page, it would be really nice if the design area went all the way to the top of the app window.</p>\n\n\n\n<p>Let’s use the Window Controls Overlay feature to improve this.</p>\n\n\n\n<h2>Enabling Window Controls Overlay</h2>\n\n\n\n<p>The feature is still experimental at the moment. To try it, you need to enable it in one of the supported browsers.</p>\n\n\n\n<p>As of now, it has been implemented in Chromium, as a collaboration between Microsoft and Google. We can therefore use it in Chrome or Edge by going to the internal <strong>about://flags</strong> page, and enabling the <strong>Desktop PWA Window Controls Overlay</strong> flag.</p>\n\n\n\n<h2>Using Window Controls Overlay</h2>\n\n\n\n<p>To use the feature, we need to add the following <strong>display_override</strong> member to our web app’s manifest file:</p>\n\n\n\n<pre><code>{\n  \"name\": \"1DIV\",\n  \"description\": \"1DIV is a mini CSS playground\",\n  \"lang\": \"en-US\",\n  \"start_url\": \"/\",\n  \"theme_color\": \"#ffffff\",\n  \"background_color\": \"#ffffff\",\n  \"display_override\": [\n    \"window-controls-overlay\"\n  ],\n  \"icons\": [\n    ...\n  ]\n}\n</code></pre>\n\n\n\n<p>On the surface, the feature is really simple to use. This manifest change is the only thing we need to make the title bar disappear and turn the window controls into an overlay.</p>\n\n\n\n<p>However, to provide a great experience for all users regardless of what device or browser they use, and to make the most of the title bar area in our design, we’ll need a bit of CSS and JavaScript code.</p>\n\n\n\n<p>Here is what the app looks like now:</p>\n\n\n\n<figure><img src=\"https://lh6.googleusercontent.com/YbSJ4vMtrc88Jr8sh7F8uWED-9OVFvLkXNT3xVP9gdmQt9XwC-wGHPmaspcKnfSpPMjSotYzRISGPag1Ugq3mxWTslaVhPK9iP8IHLjFnE_FcIkM0y3olJ4Gzw5ejrZFTRbz9avF\" alt=\"\" /><figcaption><em>Screenshot of the 1DIV app thumbnail view using Window Controls Overlay on macOS. The separate top bar area is gone, but the window controls are now blocking some of the app’s interface</em></figcaption></figure>\n\n\n\n<p>The title bar is gone, which is what we wanted, but our logo, search field, and <strong>NEW</strong> button are partially covered by the window controls because now our layout starts at the top of the window.</p>\n\n\n\n<p>It’s similar on Windows, with the difference that the close, maximize, and minimize buttons appear on the right side, grouped together with the PWA control buttons:</p>\n\n\n\n<figure><img src=\"https://lh6.googleusercontent.com/ytqSauTsKKNI6N7YzxlIqhNatK7LwaPw6yY74jq2egOsBIHbzl2vFGPMRK6dqx6tE-UqSCCWS8f1YftsXZygxEB6KALUYfGU9XW4poE1NPpjYKV66bk1k6dy91rh6TMZ1qb3Rph-\" alt=\"\" /><figcaption><em>Screenshot of the 1DIV app thumbnail display using Window Controls Overlay on the Windows operating system. The separate top bar area is gone, but the window controls are now blocking some of the app’s content.</em></figcaption></figure>\n\n\n\n<h2>Using CSS to keep clear of the window controls</h2>\n\n\n\n<p>Along with the feature, new CSS environment variables have been introduced:</p>\n\n\n\n<ul><li><strong><code>titlebar-area-x</code></strong></li><li><code><strong>titlebar-area-y</strong></code></li><li><code><strong>titlebar-area-width</strong></code></li><li><strong><code>titlebar-area-height</code></strong></li></ul>\n\n\n\n<p>You use these variables with the CSS <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/env()\"><strong>env()</strong></a> function to position your content where the title bar would have been while ensuring it won’t overlap with the window controls. In our case, we’ll use two of the variables to position our header, which contains the logo, search bar, and <strong>NEW</strong> button. </p>\n\n\n\n<pre><code>header {\n  position: absolute;\n  left: env(titlebar-area-x, 0);\n  width: env(titlebar-area-width, 100%);\n  height: var(--toolbar-height);\n}\n</code></pre>\n\n\n\n<p>The <code><strong>titlebar-area-x</strong> </code>variable gives us the distance from the left of the viewport to where the title bar would appear, and <strong><code>titlebar-area-width</code></strong> is its width. (Remember, this is not equivalent to the width of the entire viewport, just the title bar portion, which as noted earlier, doesn’t include the window controls.)</p>\n\n\n\n<p>By doing this, we make sure our content remains fully visible. We’re also defining fallback values (the second parameter in the <strong><code>env()</code></strong> function) for when the variables are not defined (such as on non-supporting browsers, or when the Windows Control Overlay feature is disabled).</p>\n\n\n\n<figure><img src=\"https://lh5.googleusercontent.com/AYZ7D2ZqvPLip8FtF6IzI6XSAEoajjviCG5fo40_ynrksUesFQBjZVEN6dsTOA8F9CCqXbFWb32ZYUN73hEAkMlyzKnX_1Qzjy7kR6jl42TyyJOeg1FWK7A9WeWn-_7SD57-EOdt\" alt=\"\" /><figcaption><em>Screenshot of the 1DIV app thumbnail view on macOS with Window Controls Overlay and our CSS updated. The app content that the window controls had been blocking has been repositioned.</em></figcaption></figure>\n\n\n\n<figure><img src=\"https://lh6.googleusercontent.com/ZxtH5F4v2io8ntHHi8V0YhqgBc_GD5pcq4g52zZy4_bEhbtjC3G7WdyZqQmwc6-D_NIp7Z8dvjsG8qz42DIg7RDhC6HbPHThXEFsknbOgcEfkF7d_cqx45T9vTi6z23pVe0-1nxA\" alt=\"\" /><figcaption><em>Screenshot of the 1DIV app thumbnail view on the Windows operating system with Window Controls Overlay and our updated CSS. The app content that the window controls had been blocking has been repositioned.</em></figcaption></figure>\n\n\n\n<p>Now our header adapts to its surroundings, and it doesn’t feel like the window control buttons have been added as an afterthought. The app looks a lot more like a native app.</p>\n\n\n\n<h2>Changing the window controls background color so it blends in</h2>\n\n\n\n<p>Now let’s take a closer look at our second page: the CSS playground editor.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2021/12/fig16-1024x518.png\" alt=\"\" /><figcaption><em>Screenshots of the 1DIV app CSS editor view with Window Controls Overlay in macOS and Windows, respectively. The window controls overlay areas have a solid white background color, which contrasts with the hot pink color of the example CSS design displayed in the editor.</em></figcaption></figure>\n\n\n\n<p>Not great. Our CSS demo area does go all the way to the top, which is what we wanted, but the way the window controls appear as white rectangles on top of it is quite jarring.</p>\n\n\n\n<p>We can fix this by changing the app’s theme color. There are a couple of ways to define it:</p>\n\n\n\n<ul><li>PWAs can define a theme color in the web app manifest file using the <a href=\"https://developer.mozilla.org/en-US/docs/Web/Manifest/theme_color\"><strong>theme_color</strong></a> manifest member. This color is then used by the OS in different ways. On desktop platforms, it is used to provide a background color to the title bar and window controls.</li><li>Websites can use the <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Element/meta/name/theme-color\"><strong>theme-color</strong> meta tag</a> as well. It’s used by browsers to customize the color of the UI around the web page. For PWAs, this color can override the manifest <strong><code>theme_color</code></strong>.</li></ul>\n\n\n\n<p>In our case, we can set the manifest <strong><code>theme_color</code></strong> to white to provide the right default color for our app. The OS will read this color value when the app is installed and use it to make the window controls background color white. This color works great for our main page with the list of demos.</p>\n\n\n\n<p>The <strong><code>theme-color</code></strong> meta tag can be changed at runtime, using JavaScript. So we can do that to override the white with the right demo background color when one is opened.</p>\n\n\n\n<p>Here is the function we’ll use:</p>\n\n\n\n<pre><code>function themeWindow(bgColor) {\n  document.querySelector(\"meta[name=theme-color]\").setAttribute('content', bgColor);\n}</code></pre>\n\n\n\n<p>With this in place, we can imagine how using color and CSS transitions can produce a smooth change from the list page to the demo page, and enable the window control buttons to blend in with the rest of the app’s interface.</p>\n\n\n\n<figure><img src=\"https://lh4.googleusercontent.com/YVYktaP8CkIQJFlCtWlwVU4dequS4MutbDJfm-vS8kGx_nedIgzziuHeZICeJ-vsu33VR0rydqwKH0JVIFKjWjlrvbWPYssNvxr7rBsCKKdag7PHMhA_NLV3w0nzBuBzurk1fr1i\" alt=\"\" /><figcaption><em>Screenshot of the 1DIV app CSS editor view on the Windows operating system with Window Controls Overlay and updated CSS demonstrating how the window control buttons blend in with the rest of the app’s interface.</em></figcaption></figure>\n\n\n\n<h2>Dragging the window</h2>\n\n\n\n<p>Now, getting rid of the title bar entirely does have an important accessibility consequence: it’s much more difficult to move the application window around.</p>\n\n\n\n<p>The title bar provides a sizable area for users to click and drag, but by using the Window Controls Overlay feature, this area becomes limited to where the control buttons are, and users have to very precisely aim between these buttons to move the window.</p>\n\n\n\n<p>Fortunately, this can be fixed using CSS with the <strong><code>app-region</code></strong> property. This property is, for now, only supported in Chromium-based browsers and needs the <strong><code>-webkit-</code></strong> vendor prefix. </p>\n\n\n\n<p>To make any element of the app become a dragging target for the window, we can use the following: </p>\n\n\n\n<p><strong><code>-webkit-app-region: drag;</code></strong></p>\n\n\n\n<p>It is also possible to explicitly make an element non-draggable: </p>\n\n\n\n<p><code>-<strong>webkit-app-region: no-drag;</strong> </code></p>\n\n\n\n<p>These options can be useful for us. We can make the entire header a dragging target, but make the search field and <strong>NEW</strong> button within it non-draggable so they can still be used as normal.</p>\n\n\n\n<p>However, because the editor page doesn’t display the header, users wouldn’t be able to drag the window while editing code. So let's use a different approach. We’ll create another element before our header, also absolutely positioned, and dedicated to dragging the window.</p>\n\n\n\n<pre><code>&lt;div class=\"drag\"&gt;&lt;/div&gt;\n&lt;header&gt;...&lt;/header&gt;</code></pre>\n\n\n\n<pre><code>.drag {\n  position: absolute;\n  top: 0;\n  width: 100%;\n  height: env(titlebar-area-height, 0);\n  -webkit-app-region: drag;\n}</code></pre>\n\n\n\n<p>With the above code, we’re making the draggable area span the entire viewport width, and using the <strong><code>titlebar-area-height</code></strong> variable to make it as tall as what the title bar would have been. This way, our draggable area is aligned with the window control buttons as shown below.</p>\n\n\n\n<p>And, now, to make sure our search field and button remain usable:</p>\n\n\n\n<pre><code>header .search,\nheader .new {\n  -webkit-app-region: no-drag;\n}</code></pre>\n\n\n\n<p>With the above code, users can click and drag where the title bar used to be. It is an area that users expect to be able to use to move windows on desktop, and we’re not breaking this expectation, which is good.</p>\n\n\n\n<figure><img src=\"https://lh5.googleusercontent.com/sU0QjlT2R7SrF91GI--WcdHRy0shD7CfnKpfzvgXGz5VptZY6hyoDX_SYFqxFG85dxMgbLidjb8cwJOcnqzd4OAWeNjIVgSiKpaz68orEZEU7DgKHHLkM3NXU5rkALkpUrEl7Pp_\" alt=\"\" /><figcaption><em>An animated view of the 1DIV app being dragged across a Windows desktop with the mouse.</em></figcaption></figure>\n\n\n\n<h2>Adapting to window resize</h2>\n\n\n\n<p>It may be useful for an app to know both whether the window controls overlay is visible and when its size changes. In our case, if the user made the window very narrow, there wouldn’t be enough space for the search field, logo, and button to fit, so we’d want to push them down a bit.</p>\n\n\n\n<p>The Window Controls Overlay feature comes with a JavaScript API we can use to do this: <strong><code>navigator.windowControlsOverlay</code></strong>.</p>\n\n\n\n<p>The API provides three interesting things:</p>\n\n\n\n<ul><li><strong><code>navigator.windowControlsOverlay.visible</code></strong> lets us know whether the overlay is visible.</li><li><strong><code>navigator.windowControlsOverlay.getBoundingClientRect()</code></strong> lets us know the position and size of the title bar area.</li><li><strong><code>navigator.windowControlsOverlay.ongeometrychange</code></strong> lets us know when the size or visibility changes.</li></ul>\n\n\n\n<p>Let’s use this to be aware of the size of the title bar area and move the header down if it’s too narrow.</p>\n\n\n\n<pre><code>if (navigator.windowControlsOverlay) {\n  navigator.windowControlsOverlay.addEventListener('geometrychange', () =&gt; {\n    const { width } = navigator.windowControlsOverlay.getBoundingClientRect();\n    document.body.classList.toggle('narrow', width &lt; 250);\n  });\n}</code></pre>\n\n\n\n<p>In the example above, we set the <strong><code>narrow</code></strong> class on the <strong><code>body</code></strong> of the app if the title bar area is narrower than 250px. We could do something similar with a media query, but using the <strong><code>windowControlsOverlay</code></strong> API has two advantages for our use case:</p>\n\n\n\n<ul><li>It’s only fired when the feature is supported and used; we don’t want to adapt the design otherwise.</li><li>We get the size of the title bar area across operating systems, which is great because the size of the window controls is different on Mac and Windows. Using a media query wouldn’t make it possible for us to know exactly how much space remains.</li></ul>\n\n\n\n<pre><code>.narrow header {\n  top: env(titlebar-area-height, 0);\n  left: 0;\n  width: 100%;\n}</code></pre>\n\n\n\n<p>Using the above CSS code, we can move our header down to stay clear of the window control buttons when the window is too narrow, and move the thumbnails down accordingly.</p>\n\n\n\n<figure><img src=\"https://lh5.googleusercontent.com/e4oVs-No9pSWdYyfqTJ0QKcKrDzlv11bsoTwSVvFBhi1bUo9dP2ub71MlWa90QLEFUc5C9e81mQtg3xwGpB5Kkfvu1dNqdBVhqetz74N_0TSWh7_RfZ5NkDNJEuhv5_ZVvw-vpDG\" alt=\"\" /><figcaption><em>A screenshot of the 1DIV app on Windows showing the app’s content adjusted for a much narrower viewport.</em></figcaption></figure>\n\n\n\n<h2>Thirty pixels of exciting design opportunities</h2>\n\n\n\n<p><br />Using the Window Controls Overlay feature, we were able to take our simple demo app and turn it into something that feels so much more integrated on desktop devices. Something that reaches out of the usual window constraints and provides a custom experience for its users.</p>\n\n\n\n<p>In reality, this feature only gives us about 30 pixels of extra room and comes with challenges on how to deal with the window controls. And yet, this extra room and those challenges can be turned into exciting design opportunities.</p>\n\n\n\n<p>More devices of all shapes and forms get invented all the time, and the web keeps on evolving to adapt to them. New features get added to the web platform to allow us, web authors, to integrate more and more deeply with those devices. From watches or foldable devices to desktop computers, we need to evolve our design approach for the web. Building for the web now lets us think outside the rectangular box.</p>\n\n\n\n<p>So let’s embrace this. Let’s use the standard technologies already at our disposal, and experiment with new ideas to provide tailored experiences for all devices, all from a single codebase!</p>\n\n\n\n<p><br />If you get a chance to try the Window Controls Overlay feature and have feedback about it, you can <a href=\"https://github.com/WICG/window-controls-overlay/issues\">open issues on the spec’s repository</a>. It’s still early in the development of this feature, and you can help make it even better. Or, you can take a look at the <a href=\"https://docs.microsoft.com/en-us/microsoft-edge/progressive-web-apps-chromium/how-to/window-controls-overlay\">feature’s existing documentation</a>, or this <a href=\"https://stupefied-edison-a4ee55.netlify.app/\">demo app</a> and its <a href=\"https://github.com/captainbrosset/1DIV\">source code</a>. </p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"dd1666dc783db568f58937ea27e6b077390363455409263a01e5d3f81fe4ee87","category":"Tech"}