{"title":"User Research Is Storytelling","link":"https://alistapart.com/article/user-research-is-storytelling/","date":1717092283000,"content":"\n<p>Ever since I was a boy, I’ve been fascinated with movies. I loved the characters and the excitement—but most of all the stories. I wanted to be an actor. And I believed that I’d get to do the things that Indiana Jones did and go on exciting adventures. I even dreamed up ideas for movies that my friends and I could make and star in. But they never went any further. I did, however, end up working in user experience (UX). Now, I realize that there’s an element of theater to UX—I hadn’t really considered it before, but user research is storytelling. And to get the most out of user research, you need to tell a good story where you bring stakeholders—the product team and decision makers—along and get them interested in learning more.</p>\n\n\n\n<p>Think of your favorite movie. More than likely it follows a <a href=\"https://www.studiobinder.com/blog/three-act-structure/\">three-act structure</a> that’s commonly seen in storytelling: the setup, the conflict, and the resolution. The first act shows what exists today, and it helps you get to know the characters and the challenges and problems that they face. Act two introduces the conflict, where the action is. Here, problems grow or get worse. And the third and final act is the resolution. This is where the issues are resolved and the characters learn and change. I believe that this structure is also a great way to think about user research, and I think that it can be especially helpful in explaining user research to others.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/05/user-research-is-storytelling-1-1024x391.png\" alt=\"A detailed graph that shows the narrative structure of The Godfather and The Dark Knight across three acts. The graph is divided into segments labeled “Act 1,” “Act 2,” and “Act 3” for each film. The purple line represents narrative elements, pacing, and rise in tension and excitement within the movies. For The Godfather, in Act 1, the line rises and then dips slightly before entering Act 2. Act 2 sees the line rise, before reaching a crescendo in Act 3. The line then declines steadily until the end of Act 3. For The Dark Knight, in Act 1, the line rises and then dips slightly before entering Act 2. Act 2 the line rises and dips slightly before entering Act 3. The line then rises again and peaks, which is followed by decline until the end of Act 3.\" /><figcaption>Three-act structure in movies (© 2024 <a href=\"https://www.studiobinder.com/\">StudioBinder</a>. Image used with permission from StudioBinder.).</figcaption></figure>\n\n\n\n<h2><strong>Use storytelling as a structure to do research</strong></h2>\n\n\n\n<p>It’s sad to say, but many have come to see research as being expendable. If budgets or timelines are tight, research tends to be one of the first things to go. Instead of investing in research, some product managers rely on designers or—worse—their own opinion to make the “right” choices for users based on their experience or accepted best practices. That may get teams some of the way, but that approach can so easily miss out on solving users’ real problems. To remain user-centered, this is something we should avoid. User research elevates design. It keeps it on track, pointing to problems and opportunities. Being aware of the issues with your product and reacting to them can help you stay ahead of your competitors.</p>\n\n\n\n<p>In the three-act structure, each act corresponds to a part of the process, and each part is critical to telling the whole story. Let’s look at the different acts and how they align with user research.</p>\n\n\n\n<h3>Act one: setup</h3>\n\n\n\n<p>The setup is all about understanding the background, and that’s where foundational research comes in. <em>Foundational research</em> (also called <em>generative</em>, <em>discovery</em>, or <em>initial</em> research) helps you understand users and identify their problems. You’re learning about what exists today, the challenges users have, and how the challenges affect them—just like in the movies. To do foundational research, you can conduct <a href=\"https://www.nngroup.com/videos/what-are-contextual-inquiries/\">contextual inquiries</a> or <a href=\"https://uxdesign.cc/diary-studies-cd65a61a4f89\">diary studies </a>(or both!), which can help you start to identify problems as well as opportunities. It doesn’t need to be a huge investment in time or money.</p>\n\n\n\n<p>Erika Hall writes about<a href=\"https://medium.com/mule-design/minimum-viable-ethnography-a047e9358df0\"> minimum viable ethnography</a>, which can be as simple as spending 15 minutes with a user and asking them one thing: “‘Walk me through your day yesterday.’ That’s it. Present that one request. Shut up and listen to them for 15 minutes. Do your damndest to keep yourself and your interests out of it. Bam, you’re doing ethnography.” According to Hall, <em>“</em>[This] will probably prove quite illuminating. In the highly unlikely case that you didn’t learn anything new or useful, carry on with enhanced confidence in your direction.”  </p>\n\n\n\n<p>This makes total sense to me. And I love that this makes user research so accessible. You don’t need to prepare a lot of documentation; you can just recruit participants and do it! This can yield a wealth of information about your users, and it’ll help you better understand them and what’s going on in their lives. That’s really what act one is all about: understanding where users are coming from. </p>\n\n\n\n<p><a href=\"https://www.looppanel.com/blog/strategic-ux-research-is-the-future-with-jared-spool\">Jared Spool talks about the importance of foundational research</a> and how it should form the bulk of your research. If you can draw from any additional user data that you can get your hands on, such as surveys or analytics, that can supplement what you’ve heard in the foundational studies or even point to areas that need further investigation. Together, all this data paints a clearer picture of the state of things and all its shortcomings. And that’s the beginning of a compelling story. It’s the point in the plot where you realize that the main characters—or the users in this case—are facing challenges that they need to overcome. Like in the movies, this is where you start to build empathy for the characters and root for them to succeed. And hopefully stakeholders are now doing the same. Their sympathy may be with their business, which could be losing money because users can’t complete certain tasks. Or maybe they do empathize with users’ struggles. Either way, act one is your initial hook to get the stakeholders interested and invested.</p>\n\n\n\n<p>Once stakeholders begin to understand the value of foundational research, that can open doors to more opportunities that involve users in the decision-making process. And that can guide product teams toward being more user-centered. This benefits everyone—users, the product, and stakeholders. It’s like winning an Oscar in movie terms—it often leads to your product being well received and successful. And this can be an incentive for stakeholders to repeat this process with other products. Storytelling is the key to this process, and knowing how to tell a good story is the only way to get stakeholders to really care about doing more research. </p>\n\n\n\n<p>This brings us to act two, where you iteratively evaluate a design or concept to see whether it addresses the issues.</p>\n\n\n\n<h3>Act two: conflict</h3>\n\n\n\n<p>Act two is all about digging deeper into the problems that you identified in act one. This usually involves <em>directional research</em>, such as usability tests, where you assess a potential solution (such as a design) to see whether it addresses the issues that you found. The issues could include unmet needs or problems with a flow or process that’s tripping users up. Like act two in a movie, more issues will crop up along the way. It’s here that you learn more about the characters as they grow and develop through this act. </p>\n\n\n\n<p>Usability tests <a href=\"https://www.nngroup.com/articles/why-you-only-need-to-test-with-5-users/\">should typically include around five participants</a> according to Jakob Nielsen, who found that that number of users can usually identify most of the problems: “As you add more and more users, you learn less and less because you will keep seeing the same things again and again… After the fifth user, you are wasting your time by observing the same findings repeatedly but not learning much new.” </p>\n\n\n\n<p>There are parallels with storytelling here too; if you try to tell a story with too many characters, the plot may get lost. Having fewer participants means that each user’s struggles will be more memorable and easier to relay to other stakeholders when talking about the research. This can help convey the issues that need to be addressed while also highlighting the value of doing the research in the first place.</p>\n\n\n\n<p>Researchers have run usability tests in person for decades, but you can also <a href=\"https://www.nngroup.com/articles/moderated-remote-usability-test/\">conduct usability tests remotely</a> using tools like Microsoft Teams, Zoom, or other teleconferencing software. This approach has become increasingly popular since the beginning of the pandemic, and it works well. You can think of in-person usability tests like going to a play and remote sessions as more like watching a movie. There are advantages and disadvantages to each. In-person usability research is a much richer experience. Stakeholders can experience the sessions with other stakeholders. You also get real-time reactions—including surprise, agreement, disagreement, and discussions about what they’re seeing. Much like going to a play, where audiences get to take in the stage, the costumes, the lighting, and the actors’ interactions, in-person research lets you see users up close, including their body language, how they interact with the moderator, and how the scene is set up.</p>\n\n\n\n<p>If in-person usability testing is like watching a play—staged and controlled—then conducting usability testing in the field is like <a href=\"https://en.wikipedia.org/wiki/Immersive_theater\">immersive theater</a> where any two sessions might be very different from one another. You can take usability testing into the field by <a href=\"https://boxesandarrows.com/taking-research-out-of-the-lab/\">creating a replica of the space where users interact</a> with the product and then conduct your research there. Or you can go out to meet users at their location to do your research. With either option, you get to see how things work in context, things come up that wouldn’t have in a lab environment—and conversion can shift in entirely different directions. As researchers, you have less control over how these sessions go, but this can sometimes help you understand users even better. Meeting users where they are can provide clues to the external forces that could be affecting how they use your product. In-person usability tests provide another level of detail that’s often missing from remote usability tests. </p>\n\n\n\n<p>That’s not to say that the “movies”—remote sessions—aren’t a good option. Remote sessions can reach a wider audience. They allow a lot more stakeholders to be involved in the research and to see what’s going on. And they open the doors to a much wider geographical pool of users. But with any remote session there is the potential of time wasted if participants can’t log in or get their microphone working. </p>\n\n\n\n<p>The benefit of <a href=\"https://boxesandarrows.com/usability-testing-guide/\">usability testing, whether remote or in person</a>, is that you get to see real users interact with the designs in real time, and you can ask them questions to understand their thought processes and grasp of the solution. This can help you not only identify problems but also glean why they’re problems in the first place. Furthermore, you can test hypotheses and gauge whether your thinking is correct. By the end of the sessions, you’ll have a much clearer picture of how usable the designs are and whether they work for their intended purposes. Act two is the heart of the story—where the excitement is—but there can be surprises too. This is equally true of usability tests. <a href=\"https://articles.centercentre.com/three_hund_million_button/\">Often, participants will say unexpected things</a>, which change the way that you look at things—and these twists in the story can move things in new directions. </p>\n\n\n\n<p>Unfortunately, user research is sometimes seen as expendable. And too often usability testing is the only research process that some stakeholders think that they ever need. In fact, if the designs that you’re evaluating in the usability test aren’t grounded in a solid understanding of your users (foundational research), there’s not much to be gained by doing usability testing in the first place. That’s because you’re narrowing the focus of what you’re getting feedback on, without understanding the users' needs. As a result, there’s no way of knowing whether the designs might solve a problem that users have. It’s only feedback on a particular design in the context of a usability test.  </p>\n\n\n\n<p>On the other hand, if you only do foundational research, while you might have set out to solve the right problem, you won’t know whether the thing that you’re building will actually solve that. This illustrates the importance of doing both foundational and directional research. </p>\n\n\n\n<p>In act two, stakeholders will—hopefully—get to watch the story unfold in the user sessions, which creates the conflict and tension in the current design by surfacing their highs and lows. And in turn, this can help motivate stakeholders to address the issues that come up.</p>\n\n\n\n<h3>Act three: resolution</h3>\n\n\n\n<p>While the first two acts are about understanding the background and the tensions that can propel stakeholders into action, the third part is about resolving the problems from the first two acts. While it’s important to have an audience for the first two acts, it’s crucial that they stick around for the final act. That means the whole product team, including developers, UX practitioners, business analysts, delivery managers, product managers, and any other stakeholders that have a say in the next steps. It allows the whole team to hear users’ feedback together, ask questions, and discuss what’s possible within the project’s constraints. And it lets the UX research and design teams clarify, suggest alternatives, or give more context behind their decisions. So you can get everyone on the same page and get agreement on the way forward.</p>\n\n\n\n<p>This act is mostly told in voiceover with some audience participation. The researcher is the narrator, who paints a picture of the issues and what the future of the product could look like given the things that the team has learned. They give the stakeholders their recommendations and their guidance on creating this vision.</p>\n\n\n\n<p>Nancy Duarte in the <em>Harvard Business Review</em> offers an approach to <a href=\"https://hbr.org/2012/10/structure-your-presentation-li\">structuring presentations that follow a persuasive story</a>. “The <a href=\"http://en.wikipedia.org/wiki/I_Have_a_Dream\">most effective presenters </a>use the same techniques as great storytellers: By reminding people of the status quo and then revealing the path to a better way, they set up a conflict that needs to be resolved,” writes Duarte. “That tension helps them persuade the audience to adopt a new mindset or behave differently.”</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/05/user-research-is-storytelling-2-1024x280.jpg\" alt=\"A diagram, depicting a persuasive story pattern, segmented into distinct sections that outline a narrative flow. Starting with “Beginning,” followed by “Middle,” and concluding with “End.” The “Beginning” starts with a box labeled “What is.” A line rises up to the box labeled “What could be.” A line goes from this box into “Middle” and back down to “What is” and then back up to “What could be.” This repeats one more time in “Middle,” before a line goes from “What could be” up to a box labeled “Vision of the future” in “End.” “'Call to action” is written below the “Vision of the future” box to signify that the vision is a call to action.\" /><figcaption>A persuasive story pattern.</figcaption></figure>\n\n\n\n<p>This type of structure aligns well with research results, and particularly results from usability tests. It provides evidence for “what is”—the problems that you’ve identified. And “what could be”—your recommendations on how to address them. And so on and so forth.</p>\n\n\n\n<p>You can reinforce your recommendations with examples of things that competitors are doing that could address these issues or with examples where competitors are gaining an edge. Or they can be visual, like quick mockups of how a new design could look that solves a problem. These can help generate conversation and momentum. And this continues until the end of the session when you’ve wrapped everything up in the conclusion by summarizing the main issues and suggesting a way forward. This is the part where you reiterate the main themes or problems and what they mean for the product—the denouement of the story. This stage gives stakeholders the next steps and hopefully the momentum to take those steps!</p>\n\n\n\n<p>While we are nearly at the end of this story, let’s reflect on the idea that user research is storytelling. All the elements of a good story are there in the three-act structure of user research: </p>\n\n\n\n<ul>\n<li><strong>Act one</strong>: You meet the protagonists (the users) and the antagonists (the problems affecting users). This is the beginning of the plot. In act one, researchers might use methods including contextual inquiry, ethnography, diary studies, surveys, and analytics. The output of these methods can include personas, empathy maps, user journeys, and analytics dashboards.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Act two</strong>: Next, there’s character development. There’s conflict and tension as the protagonists encounter problems and challenges, which they must overcome. In act two, researchers might use methods including usability testing, competitive benchmarking, and heuristics evaluation. The output of these can include usability findings reports, UX strategy documents, usability guidelines, and best practices.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Act three</strong>: The protagonists triumph and you see what a better future looks like. In act three, researchers may use methods including presentation decks, storytelling, and digital media. The output of these can be: presentation decks, video clips, audio clips, and pictures. </li>\n</ul>\n\n\n\n<p>The researcher has multiple roles: they’re the storyteller, the director, and the producer. The participants have a small role, but they are significant characters (in the research). And the stakeholders are the audience. But the most important thing is to get the story right and to use storytelling to tell users’ stories through research. By the end, the stakeholders should walk away with a purpose and an eagerness to resolve the product’s ills. </p>\n\n\n\n<p>So the next time that you’re planning research with clients or you’re speaking to stakeholders about research that you’ve done, think about how you can weave in some storytelling. Ultimately, user research is a win-win for everyone, and you just need to get stakeholders interested in how the story ends.</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"e029ae4c8dac1deef7143abcccc7d602ed217908ab00f349140bcd2b829f5468","category":"Tech"}