{"title":"Smashing Animations Part 8: Theming Animations Using CSS Relative Colour","link":"https://smashingmagazine.com/2026/01/smashing-animations-part-8-css-relative-colour/","date":1768384800000,"content":"<p>I’ve recently refreshed the animated graphics on <a href=\"https://stuffandnonsense.co.uk/\">my website</a> with a new theme and a group of pioneering characters, putting into practice plenty of the techniques I shared in <a href=\"https://www.smashingmagazine.com/author/andy-clarke/\">this series</a>. A few of my animations change appearance when someone interacts with them or at different times of day.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/1-andy-website-animated-graphics.png\" /></p>\n<p>The colours in the graphic atop <a href=\"https://stuffandnonsense.co.uk/blog\">my blog pages</a> change from morning until night every day. Then, there’s the <a href=\"https://stuffandnonsense.co.uk/blog/let-it-snow\">snow mode</a>, which adds chilly colours and a wintery theme, courtesy of an overlay layer and a blending mode.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/2-snow-mode.png\" /></p>\n<p>While working on this, I started to wonder whether CSS relative colour values could give me more control while also simplifying the process.</p>\n<p><strong>Note</strong>: <em>In this tutorial, I’ll focus on relative colour values and the OKLCH colour space for theming graphics and animations. If you want to dive deep into relative colour, Ahmad Shadeed created a superb <a href=\"https://ishadeed.com/article/css-relative-colors/\">interactive guide</a>. As for colour spaces, gamuts, and OKLCH, our own Geoff Graham <a href=\"https://www.smashingmagazine.com/2023/08/oklch-color-spaces-gamuts-css/\">wrote</a> about them.</em></p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/3-yogi-bear-show.png\" /></p>\n<p>Repeated use of elements was key. Backgrounds were reused whenever possible, with zooms and overlays helping construct new scenes from the same artwork. It was born of necessity, but it also encouraged thinking in terms of series rather than individual scenes.</p>\nThe problem With Manually Updating Colour Palettes\n<p>Let’s get straight to my challenge. In Toon Titles like this one — based on the 1959 Yogi Bear Show episode “Lullabye-Bye Bear” — and my work generally, palettes are limited to a select few colours.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/4-yogi-bear.png\" /></p>\n<p>I create shades and tints from what I call my “foundation” colour to expand the palette without adding more hues.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/5-colour-palette.png\" /></p>\n<p>In <a href=\"https://www.sketch.com\">Sketch</a>, I work in the <a href=\"https://www.smashingmagazine.com/2021/07/hsl-colors-css/\">HSL colour space</a>, so this process involves increasing or decreasing the lightness value of my foundation colour. Honestly, it’s not an arduous task — but choosing a different foundation colour requires creating a whole new set of shades and tints. Doing that manually, again and again, quickly becomes laborious.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/6-foundation-colour.png\" /></p>\n<p>I mentioned the HSL — <strong>H</strong> (hue), S (saturation), and <strong>L</strong> (lightness) — colour space, but that’s just one of several ways to describe colour.</p>\n<p>RGB — <strong>R</strong> (red), <strong>G</strong> (green), <strong>B</strong> (blue) — is probably the most familiar, at least in its Hex form.</p>\n<p>There’s also LAB — <strong>L</strong> (lightness), <strong>A</strong> (green–red), <strong>B</strong> (blue–yellow) — and the newer, but now widely supported LCH — <strong>L</strong> (lightness), <strong>C</strong> (chroma), <strong>H</strong> (hue) — model in its OKLCH form. With LCH — specifically OKLCH in CSS — I can adjust the lightness value of my foundation colour.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/7-lightness-change-foundation-colour.png\" /></p>\n<p>Or I can alter its <em>chroma</em>. LCH chroma and HSL saturation both describe the intensity or richness of a colour, but they do so in different ways. LCH gives me a wider range and more predictable blending between colours.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/8-chroma-changes-foundation-colour.png\" /></p>\n<p>I can also alter the hue to create a palette of colours that share the same lightness and chroma values. In both HSL and LCH, the hue spectrum starts at red, moves through green and blue, and returns to red.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/9-hue-changes-foundation-colour.png\" /></p>\nWhy OKLCH Changed How I Think About Colour\n<p>Browser support for the OKLCH colour space <a href=\"https://caniuse.com/wf-oklab\">is now widespread</a>, even if design tools — including Sketch — haven’t caught up. Fortunately, that shouldn’t stop you from using OKLCH. Browsers will happily convert Hex, HSL, LAB, and RGB values into OKLCH for you. You can define a CSS custom property with a foundation colour in any space, including Hex:</p>\n<pre><code>/* Foundation colour */\n--foundation: #5accd6;\n</code></pre>\n\n<p>Any colours derived from it will be converted into OKLCH automatically:</p>\n<pre><code>--foundation-light: oklch(from var(--foundation) [...]; }\n--foundation-mid: oklch(from var(--foundation) [...]; }\n--foundation-dark: oklch(from var(--foundation) [...]; }\n</code></pre>\n\nRelative Colour As A Design System\n<p>Think of relative colour as saying: <em>“Take this colour, tweak it, then give me the result.”</em> There are two ways to adjust a colour: absolute changes and proportional changes. They look similar in code, but behave very differently once you start swapping foundation colours. Understanding that difference is what can turn using relative colour into a system.</p>\n<pre><code>/* Foundation colour */\n--foundation: #5accd6;\n</code></pre>\n\n<p>For example, the lightness value of my foundation colour is <code>0.7837</code>, while a darker version has a value of <code>0.5837</code>. To calculate the difference, I subtract the lower value from the higher one and apply the result using a <code>calc()</code> function:</p>\n<pre><code>--foundation-dark: \n  oklch(from var(--foundation)\n  calc(l - 0.20) c h);\n</code></pre>\n\n<p>To achieve a lighter colour, I add the difference instead:</p>\n<pre><code>--foundation-light:\n  oklch(from var(--foundation)\n  calc(l + 0.10) c h);\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/10-calculating-colour-difference.png\" /></p>\n<p>Chroma adjustments follow the same process. To reduce the intensity of my foundation colour from <code>0.1035</code> to <code>0.0035</code>, I subtract one value from the other:</p>\n<pre><code>oklch(from var(--foundation)\nl calc(c - 0.10) h);\n</code></pre>\n\n<p>To create a palette of hues, I calculate the difference between the hue value of my foundation colour (<code>200</code>) and my new hue (<code>260</code>):</p>\n<pre><code>oklch(from var(--foundation)\nl c calc(h + 60));\n</code></pre>\n\n<p>Those calculations are absolute. When I subtract a fixed amount, I’m effectively saying, <em>“Always subtract this much.”</em> The same applies when adding fixed values:</p>\n<pre><code>calc(c - 0.10)\ncalc(c + 0.10)\n</code></pre>\n\n<p>I learned the limits of this approach the hard way. When I relied on subtracting fixed chroma values, colours collapsed towards grey as soon as I changed the foundation. A palette that worked for one colour fell apart for another.</p>\n<p>Multiplication behaves differently. When I multiply chroma, I’m telling the browser: <em>“Reduce this colour’s intensity by a proportion.”</em> The relationship between colours remains intact, even when the foundation changes:</p>\n<pre><code>calc(c * 0.10)\n</code></pre>\n\n\n\nMy Move It, Scale It, Rotate It Rules\n<ul>\n<li><strong>Move</strong> lightness (add or subtract),</li>\n<li><strong>Scale</strong> chroma (multiply),</li>\n<li><strong>Rotate</strong> hue (add or subtract degrees).</li>\n</ul>\n<p>I scale chroma because I want intensity changes to stay proportional to the base colour. Hue relationships are rotational, so multiplying hue makes no sense. Lightness is perceptual and absolute — multiplying it often produces odd results.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/11-move-scale-rotate.png\" /></p>\nFrom One Colour To An Entire Theme\n<p>Relative colour allows me to define a foundation colour and generate every other colour I need — fills, strokes, gradient stops, shadows — from it. At that point, colour stops being a palette and starts being a system.</p>\n<blockquote>SVG illustrations tend to reuse the same few colours across fills, strokes, and gradients. Relative colour lets you define those relationships once and reuse them everywhere — much like animators reused backgrounds to create new scenes.</blockquote>\n\n<p>Change the foundation colour once, and every derived colour updates automatically, without recalculating anything by hand. Outside of animated graphics, I could use this same approach to define colours for the states of interactive elements such as buttons and links.</p>\n<p>The foundation colour I used in my “Lullabye-Bye Bear” Toon Title is a cyan-looking blue. The background is a radial gradient between my foundation and a darker version.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/12-toon-titles-website.png\" /></p>\n<p>To create alternative versions with entirely different moods, I only need to change the foundation colour:</p>\n<pre><code>--foundation: #5accd6;\n--grad-end: var(--foundation);\n--grad-start: oklch(from var(--foundation)\n  calc(l - 0.2357) calc(c * 0.833) h);\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/13-toon-titles-website.png\" /></p>\n<p>To bind those custom properties to my SVG gradient without duplicating colour values, I replaced hard-coded <code>stop-color</code> values with inline styles:</p>\n<div>\n<pre><code>&lt;defs&gt;\n  &lt;radialGradient id=\"bg-grad\" […]&gt;\n    &lt;stop offset=\"0%\" style=\"stop-color: var(--grad-end);\" /&gt;\n    &lt;stop offset=\"100%\" style=\"stop-color: var(--grad-start);\" /&gt;\n  &lt;/radialGradient&gt;\n&lt;/defs&gt;\n</code></pre>\n</div>\n\n<pre><code>&lt;path fill=\"url(#bg-grad)\" fill=\"#5DCDD8\" d=\"[...]\"/&gt;\n</code></pre>\n\n<p>Next, I needed to ensure that my <a href=\"https://stuffandnonsense.co.uk/toon-text/index.html\">Toon Text</a> always contrasts with whatever foundation colour I choose. A <code>180deg</code> hue rotation produces a complementary colour that certainly pops — but can vibrate uncomfortably:</p>\n<pre><code>.text-light {\n  fill: oklch(from var(--foundation)\n    l c calc(h + 180));\n}\n</code></pre>\n\n<p>A <code>90°</code> shift produces a vivid secondary colour without being fully complementary:</p>\n<pre><code>.text-light {\n  fill: oklch(from var(--foundation)\n    l c calc(h - 90));\n}\n</code></pre>\n\n<p>My recreation of Quick Draw McGraw’s 1959 Toon Title “El Kabong“ uses the same techniques but with a more varied palette. For example, there’s another radial gradient between the foundation colour and a darker shade.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/14-quick-draw-mcgraw.png\" /></p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/15-quick-draw-mcgraw-toon-titles.png\" /></p>\n<p>The building and tree in the background are simply different shades of the same foundation colour. For those paths, I needed two additional <code>fill</code> colours:</p>\n<pre><code>.bg-mid {\n  fill: oklch(from var(--foundation)\n    calc(l - 0.04) calc(c * 0.91) h);\n}\n\n.bg-dark {\n  fill: oklch(from var(--foundation)\n    calc(l - 0.12) calc(c * 0.64) h);\n}\n</code></pre>\n\nWhen The Foundations Start To Move\n<p>So far, everything I’ve shown has been static. Even when someone uses a colour picker to change the foundation colour, that change happens instantly. But animated graphics rarely stand still — the clue is in the name. So, if colour is part of the system, there’s no reason it can’t animate, too.</p>\n<p>To animate the foundation colour, I first need to split it into its OKLCH channels — lightness, chroma, and hue. But there’s an important extra step: I need to register those values as <em>typed</em> custom properties. But what does that mean?</p>\n<p>By default, a browser doesn’t know whether a CSS custom property value represents a colour, length, number, or something else entirely. That often means <a href=\"https://css-tricks.com/what-you-need-to-know-about-css-color-interpolation/\">they can’t be interpolated smoothly during animation</a>, and jump from one value to the next.</p>\n<p>Registering a custom property tells the browser the type of value it represents and how it should behave over time. In this case, I want the browser to treat my colour channels as numbers so they can be animated smoothly.</p>\n<pre><code>@property --f-l {\n  syntax: \"&lt;number&gt;\";\n  inherits: true;\n  initial-value: 0.40;\n}\n\n@property --f-c {\n  syntax: \"&lt;number&gt;\";\n  inherits: true;\n  initial-value: 0.11;\n}\n\n@property --f-h {\n  syntax: \"&lt;number&gt;\";\n  inherits: true;\n  initial-value: 305;\n}\n</code></pre>\n\n<p>Once registered, these custom properties behave like native CSS. The browser can interpolate them frame-by-frame. I then rebuild the foundation colour from those channels:</p>\n<pre><code>--foundation: oklch(var(--f-l) var(--f-c) var(--f-h));\n</code></pre>\n\n<p>This makes the foundation colour become animatable, just like any other numeric value. Here’s a simple “breathing” animation that gently shifts lightness over time:</p>\n<pre><code>@keyframes breathe {\n  0%, 100% { --f-l: 0.36; }\n  50% { --f-l: 0.46; }\n}\n\n.toon-title {\n  animation: breathe 10s ease-in-out infinite;\n}\n</code></pre>\n\n<p>Because every other colour in fills, gradients, and strokes is derived from <code>--foundation</code>, they all animate together, and nothing needs to be updated manually.</p>\nOne Animated Colour, Many Effects\n<p>At the start of this process, I wondered whether CSS relative colour values could offer more possibilities while also making them simpler to implement. I recently added a new gold mine background to my website’s <a href=\"https://stuffandnonsense.co.uk/contact\">contact page</a>, and the first iteration included oil lamps that glow and swing.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/16-gold-mine-scene.png\" /></p>\n<p>I wanted to explore how animating CSS relative colours could make the mine interior more realistic by tinting it with colours from the lamps. I wanted them to affect the world around them, the way real light does. So, rather than animating multiple colours, I built a tiny lighting system that animates just one colour.</p>\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/17-overlay-layer-svg.png\" /></p>\n<p>My first task was to slot an overlay layer between the background and my lamps:</p>\n<pre><code>&lt;path \n  id=\"overlay\"\n  fill=\"var(--overlay-tint)\" \n  [...] \n  style=\"mix-blend-mode: color\"\n/&gt;\n</code></pre>\n\n<p>I used <code>mix-blend-mode: color</code> because that tints what’s beneath it while preserving the underlying luminance. As I only want the overlay to be visible when animations are turned on, I made the overlay opt-in:</p>\n<pre><code>.svg-mine #overlay {\n  display: none;\n}\n\n@media (prefers-reduced-motion: no-preference) {\n  .svg-mine[data-animations=on] #overlay {\n    display: block;\n    opacity: 0.5;\n  }\n}\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/18-overlay-gold-mine-scene.png\" /></p>\n<p>The overlay was in place, but not yet connected to the lamps. I needed a light source. My lamps are simple, and each one contains a <code>circle</code> element that I blurred with a filter. The <code>filter</code> produces a very soft blur over the entire circle.</p>\n<div>\n<pre><code>&lt;filter id=\"lamp-glow-1\" x=\"-120%\" y=\"-120%\" width=\"340%\" height=\"340%\"&gt;\n  &lt;feGaussianBlur in=\"SourceGraphic\" stdDeviation=\"56\"/&gt;\n&lt;/filter&gt;\n</code></pre>\n</div>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/19-oil-lamps.png\" /></p>\n<p>Instead of animating the overlay and lamps separately, I animate a single “flame” colour token and derive everything else from that. First, I register three typed custom properties for OKLCH channels:</p>\n<pre><code>@property --fl-l {\n  syntax: \"&lt;number&gt;\"; \n  inherits: true;\n  initial-value: 0.86;\n}\n@property --fl-c {\n  syntax: \"&lt;number&gt;\";\n  inherits: true;\n  initial-value: 0.12;\n}\n@property --fl-h {\n  syntax: \"&lt;number&gt;\";\n  inherits: true;\n  initial-value: 95;\n}\n</code></pre>\n\n<p>I animated those channels, deliberately pushing a few frames towards orange so the flicker reads clearly as firelight:</p>\n<div>\n<pre><code>@keyframes flame {\n  0%, 100% { --fl-l: 0.86; --fl-c: 0.12; --fl-h: 95; }\n  6% { --fl-l: 0.91; --fl-c: 0.10; --fl-h: 92; }\n  12% { --fl-l: 0.83; --fl-c: 0.14; --fl-h: 100; }\n  18% { --fl-l: 0.88; --fl-c: 0.11; --fl-h: 94; }\n  24% { --fl-l: 0.82; --fl-c: 0.16; --fl-h: 82; }\n  30% { --fl-l: 0.90; --fl-c: 0.12; --fl-h: 90; }\n  36% { --fl-l: 0.79; --fl-c: 0.17; --fl-h: 76; }\n  44% { --fl-l: 0.87; --fl-c: 0.12; --fl-h: 96; }\n  52% { --fl-l: 0.81; --fl-c: 0.15; --fl-h: 102; }\n  60% { --fl-l: 0.89; --fl-c: 0.11; --fl-h: 93; }\n  68% { --fl-l: 0.83; --fl-c: 0.16; --fl-h: 85; }\n  76% { --fl-l: 0.91; --fl-c: 0.10; --fl-h: 91; }\n  84% { --fl-l: 0.85; --fl-c: 0.14; --fl-h: 98; }\n  92% { --fl-l: 0.80; --fl-c: 0.17; --fl-h: 74; }\n}\n</code></pre>\n</div>\n\n<p>Then I scoped that animation to the SVG, so the shared variables are available to both the lamps and my overlay:</p>\n<div>\n<pre><code>@media (prefers-reduced-motion: no-preference) {\n  .svg-mine[data-animations=on] {\n    animation: flame 3.6s infinite linear;\n    isolation: isolate;\n\n    /* Build a flame colour from animated channels */\n    --flame: oklch(var(--fl-l) var(--fl-c) var(--fl-h));\n\n    /* Lamp colour derived from flame */\n    --lamp-core: oklch(from var(--flame) calc(l + 0.05) calc(c * 0.70) h);\n\n    /* Overlay tint derived from the same flame */\n    --overlay-tint: oklch(from var(--flame)\n      calc(l + 0.06) calc(c * 0.65) calc(h - 10));\n  }\n}\n</code></pre>\n</div>\n\n<p>Finally, I applied those derived colours to the glowing lamps and the overlay they affect:</p>\n<pre><code>@media (prefers-reduced-motion: no-preference) {\n  .svg-mine[data-animations=on] #mine-lamp-1 &gt; circle,\n  .svg-mine[data-animations=on] #mine-lamp-2 &gt; circle {\n    fill: var(--lamp-core);\n  }\n\n  .svg-mine[data-animations=on] #overlay {\n    display: block;\n    fill: var(--overlay-tint);\n    opacity: 0.5;\n  }\n}\n</code></pre>\n\n<p><img src=\"https://files.smashing.media/articles/smashing-animations-part-8-css-relative-colour/20-lamps-overlay-connected.png\" /></p>\n<p>When the flame shifts toward orange, the lamps warm up, and the scene warms with them. When the flame cools, everything settles together. The best part is that nothing is written manually. If I change the foundation colour or tweak the flame animation ranges, the entire lighting system updates simultaneously.</p>\n<p>You can see <a href=\"https://stuffandnonsense.co.uk/contact\">the final result on my website</a>.</p>\nReuse, Repurpose, Revisited\n<p>Those Hanna-Barbera animators were forced to repurpose elements out of necessity, but I reuse colours because it makes my work <strong>more consistent</strong> and <strong>easier to maintain</strong>. CSS relative colour values allow me to:</p>\n<ul>\n<li>Define a single foundation colour,</li>\n<li>Describe how other colours relate to it,</li>\n<li>Reuse those relationships everywhere, and</li>\n<li>Animate the system by changing one value.</li>\n</ul>\n<p>Relative colour doesn’t just make theming easier. It encourages a way of thinking where colour, like motion, is intentional — and where changing one value can transform an entire scene without rewriting the work beneath it.</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"e14e9bbbf35fee3b01ac83515388ff85cf780faaee386af987588cfaa62ce1c1","category":"Tech"}