{"title":"MEET THE MAKER: KELSEY HUTCHINSON","link":"https://moots.com/blogs/news/meet-the-maker-kelsey-hutchinson","date":1770940805000,"content":"\n      <h3>From Fashion to Frames</h3>\n<p>Kelsey’s path to Moots began far from a welding bench. After stepping away from a career in fashion journalism in New York City, she returned to her hometown of Omaha, Nebraska, looking for something more hands-on. A job at a local bike and coffee shop sparked a growing interest in cycling, but everything changed after visiting Co-Motion Cycles in Oregon. Watching a frame being welded made the direction clear. Two days later, she quit her classes and enrolled in welding school with one goal in mind: to build bicycle frames.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2026-02-02_at_10.08.22_AM.png?v=1770052117\" alt=\"\" width=\"300\" height=\"543\" /></p>\n<h3>Betting on the Craft</h3>\n<p>Welding school in the Midwest focused on structural welding, not bikes. The idea of becoming a framebuilder earned skeptical looks and advice about taking a long, traditional path. Moots saw her focus and commitment and hired her before she even graduated.</p>\n<blockquote>\n<p><strong>“I went to welding school with the sole purpose of building bicycle frames.”</strong></p>\n</blockquote>\n<h3>The Reality of Building a Moots</h3>\n<p><span>While Moots bikes travel the world, Kelsey works within an intentionally small team of makers behind the scenes. Every frame is built by hand, with pride taken in each step of the process and the details that define a Moots.</span></p>\n<h3>Challenges and Wins</h3>\n<p>Most bike welds are smooth curves, which makes the occasional straight-line weld surprisingly difficult. For Kelsey, welding binders onto steerer blanks can be the most challenging. The most satisfying moments come when everything lines up, especially nailing the drive-side front triangle welds.</p>\n<h3>No Compromises</h3>\n<p>Kelsey credits much of her growth to the people around her. Teammates who have been welding for years continue to push her to refine her craft and show up striving for that extra one percent. For her, “No Compromises” means honoring the trust riders place in Moots by delivering nothing short of perfect.</p>\n<h3><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2026-02-02_at_10.09.32_AM.png?v=1770052214\" alt=\"\" /></h3>\n<h3>Forever Bikes</h3>\n<p>Bikes are memory makers. Even if a bike eventually changes hands, the rides, adventures, and everyday moments tied to it stay with the rider. Knowing she had a hand in creating something that meaningful is what keeps Kelsey invested in every weld.</p>\n<h3>Why Titanium</h3>\n<p>Steel is fine. Aluminum is less forgiving. Titanium is different. Smooth, precise, and endlessly satisfying to weld, it’s the material that keeps her inspired at the bench.</p>\n<h3>Life Beyond the Bench</h3>\n<p>Kelsey rides a Routt 45, RCS, Womble, and a Routt CRD. Outside the shop, she stays active year-round with workouts, dance classes, boot packing with her dogs in the winter, and riding or gardening when the snow melts. Her go-to coffee is a light roast with a splash of cream, unless she’s feeling sassy, then it’s a cortado. While others tune into music, she listens to true crime podcasts.</p>\n<p> </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0049/1612/files/Screenshot_2026-02-02_at_10.11.46_AM.png?v=1770052319\" alt=\"\" width=\"315\" height=\"565\" /></p>\n<h3>The People</h3>\n<p>Ask Kelsey her favorite part of Moots, and the answer is simple: the people. The factory feels like family, and that sense of trust runs deep. Being asked by a coworker to weld their frame is still one of the highest honors.</p>\n<h3>Dream Ride</h3>\n<p>If she could take any Moots anywhere, she knows exactly where she’d go. Spain, on two wheels, is high on the list.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"e1bd6adcda00f38b06c7b6299f336d6db61558e12e6a613bba6a85c627b25d95","category":"Cycling"}