{"title":"Supreme Court: Trump’s Tariffs Unconstitutional – Kyle Klain","link":"https://theradavist.com/supreme-court-trumps-tariffs-unconstitutional","date":1771605024000,"content":"<p><img loading=\"lazy\" src=\"https://images.theradavist.com/uploads/2025/10/Fuck-These-Tariffs.jpg?w=1400&amp;quality=75\" srcset=\"https://images.theradavist.com/uploads/2025/10/Fuck-These-Tariffs.jpg?w=650&amp;quality=75 640w, https://images.theradavist.com/uploads/2025/10/Fuck-These-Tariffs.jpg?w=1400&amp;quality=75 1800w, https://images.theradavist.com/uploads/2025/10/Fuck-These-Tariffs.jpg?w=2000&amp;quality=75\" /></p>\n<p><em>We covered <a href=\"https://theradavist.com/tag/tariffs\" target=\"_blank\">tariffs extensively last year</a> and their impact on the cycling industry. Today, <a href=\"https://theradavist.com/tag/kyle-klain\" target=\"_blank\">Kyle Klain</a> offers up some perspective on <a href=\"https://www.theguardian.com/us-news/2026/feb/20/trump-supreme-court-tariffs-ruling\" target=\"_blank\">today’s Supreme Court ruling</a> that tariffs are unconstitutional…</em><span></span></p>\n<p>The one-two punch rippling across the bike industry, starting with oversupply from post-COVID inventory challenges followed shortly by increased costs of doing business due to President Trump’s ‘reciprocal’ tariffs, has caused chaos, hardship, and confusion across the country. Challenges are felt directly by most cycling companies importing into the United States.</p>\n<p>This morning, the Supreme Court of the United States ruled 6–3 that the administration overstepped its authority by using the International Emergency Economic Powers Act to impose those broad tariffs. The majority opinion makes a direct point: Congress has the power to levy tariffs, not the president, and this law didn’t grant that authority.</p>\n<p>What that means in practice is less black-and-white. The ruling knocks out the legal foundation for those duties under IEEPA. It does not instantly erase every tariff or guarantee refunds for the billions already collected. There will be a long process (oh god) and likely more legal maneuvering. The administration has already signaled it may pursue other trade mechanisms to achieve its trade goals.</p>\n<p>Still, for companies importing bikes and parts, this is a possible reprieve. If the ruling holds, future shipments could land without that added political surcharge baked into the cost. It does not fix oversupply or demand issues, but it removes one variable that has been distorting prices across the industry. Let’s hope this helps address some of the pricing fatigue.</p>\n<p><em>On a personal note, I ordered a set of <a href=\"https://fern-bicycles.myshopify.com/en-us/products/allygn-diamond-rack\" target=\"_blank\">Allygn racks from Germany</a> ($198) last month, and FedEx collected a $140 customs bill at my door. Annoying at consumer scale, even more brutal at container scale.</em></p>\n<p>In the next couple of weeks, we are sure to see cycling’s major importers address this with their dealers…</p>\n<p>The post <a href=\"https://theradavist.com/supreme-court-trumps-tariffs-unconstitutional\">Supreme Court: Trump’s Tariffs Unconstitutional</a> appeared first on <a href=\"https://cms.theradavist.com\">The Radavist</a>.</p>","author":"John Watson","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"e3a036066dede18bf6c43ca679ee8d00c40ad14bd9367d4d23530476f04ebb9e","category":"Cycling"}