{"title":"\"Million-year-old\" fossil skulls from China are far older—and not Denisovans","link":"https://arstechnica.com/science/2026/02/new-dates-on-chinese-fossils-raise-question-of-how-many-times-we-left-africa/","date":1771606986000,"content":"<p>Two skulls from Yunxian, in northern China, aren’t ancestors of Denisovans after all; they’re actually the oldest known <i>Homo erectus</i> fossils in eastern Asia.</p>\n<p>A recent study has re-dated the skulls to about 1.77 million years old, which makes them the oldest hominin remains found so far in East Asia. Their age means that <i>Homo erectus</i> (an extinct common ancestor of our species, Neanderthals, and Denisovans) must have spread across the continent much earlier and much faster than we’d previously given them credit for. It also sheds new light on who was making stone tools at some even older archaeological sites in China.</p>\n<h2><b><i>Homo erectus</i> spread like wildfire</b></h2>\n<p>Yunxian is an important—and occasionally contentious—archaeological site on the banks of central China’s Han River. Along with hundreds of stone tools and animal bones, the layers of river sediment have yielded three nearly complete hominin skulls (only two of which have been described in a publication so far). Shantou University paleoanthropologist Hua Tu and his colleagues measured the ratio of two isotopes, aluminum-26 and beryllium-10, in grains of quartz from the sediment layer that once held the skulls. The results suggest that <i>Homo erectus</i> lived and died along the Han River 1.77 million years ago. That's just 130,000 years after the species first appeared in Africa.</p><p><a href=\"https://arstechnica.com/science/2026/02/new-dates-on-chinese-fossils-raise-question-of-how-many-times-we-left-africa/\">Read full article</a></p>\n<p><a href=\"https://arstechnica.com/science/2026/02/new-dates-on-chinese-fossils-raise-question-of-how-many-times-we-left-africa/#comments\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"e3be8e61d280dc9da12696b228eda148428635310882d2af084293b024d62d55","category":"Tech"}