{"title":"Summer Self-Propelled, by Kyle Richardson","link":"https://moots.com/blogs/news/summer-self-propelled-by-kyle-richardson","date":1762459130000,"content":"\n      <div><img src=\"https://moots.com/wp-content/uploads/2025/07/IMG_8725-576x1024.jpg\" alt=\"\" width=\"576\" height=\"1024\" /></div>\n<div> </div>\n<div>\n<a href=\"https://www.instagram.com/kylerichardson/\"><strong>Kyle Richardson</strong></a><span>— is a force to be wreckoned with: elite mountain runner, endurance athlete, and the newest addition to our Moots ambassador family. Known for his speed on foot and deep connection to the terrain under his shoes, Kyle brings the same energy, focus, and love for the long haul to two wheels. As he expands his adventures beyond trail running and into the world of titanium, we’re proud to welcome him to the Moots crew. This partnership is all about shared passion—for movement, for the mountains, and for the pursuit of pure performance.</span>\n</div>\n<div>\n<p>----</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/07/202506_GoldHill_Cycling_Woodson_154-683x1024.jpg\" alt=\"\" width=\"683\" height=\"1024\" /></p>\n<p>The adventure is simple: start from your front door, travel under your own power to a compelling destination, have an experience, and return. There are many tools for traveling in the mountains. Instinctively, my background as a runner compels me to seek things out on foot—getting a closer look at a place by running through the terrain. It’s intimate and personal, feeling the rocks and landscape underfoot.</p>\n<p>But what if you could expand on that experience and feel the full spectrum of mountain movement? Insert the bike.</p>\n[caption id=\"attachment_53559\" align=\"aligncenter\" width=\"767\"]<img src=\"https://moots.com/wp-content/uploads/2025/07/IMG_9137_VSCO-767x1024.jpg\" alt=\"\" width=\"767\" height=\"1024\" />Processed with VSCO with k1 preset[/caption]\n<p>Traveling on two wheels introduces a new element: a clean, efficient, logical, and beautiful way to move from the bottom of the foothills to the summits of peaks—experiencing everything the area has to offer. It’s a multi-disciplinary mountain style where endurance, technique, and vision unlock new ways around a landscape. It’s not about the fastest way, but the most aesthetic and challenging route. In return, you’re rewarded with a comprehensive and fulfilling day out in the hills. Don’t ask me about watts or numbers—I’m here for the experience, the surfaces, the views, and the reward of traveling somewhere untethered and free.</p>\n<p>From my front doorstep in Boulder, we have access to the Continental Divide, some 20 to 30 miles away. This alluring stretch of jagged, inspiring peaks has been my stomping ground for the past decade. I certainly haven’t climbed every peak in the area, but I’ve spent enough time there to feel familiar and comfortable. Introducing the bike as a means of transportation to the trailheads has opened up a new level of efficiency. I’ve started to think outside the box—searching for new ways to link up these different mountains right from my doorstep. It’s an ongoing project, or maybe just a lifestyle. By no means do I have it figured out. There are no rules—just the idea of doing it yourself.</p>\n[caption id=\"attachment_53560\" align=\"aligncenter\" width=\"768\"]<img src=\"https://moots.com/wp-content/uploads/2025/07/IMG_9179_VSCO-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" />Processed with VSCO with ss1 preset[/caption]\n<p>The setup is pretty simple: strap your running shoes to your handlebars, toss in some snacks and a water filter, and start pedaling. No matter where you live—big city or small village—I believe it’s universal that there’s something worth exploring in your own backyard. It might take some creativity, but there’s probably something tall, historical, or interesting to go check out.</p>\n<p>I’m inspired to take the road less traveled—to get off the tarmac and onto technical backroads. This is where the Moots Routt ESC really shines. At its core, it’s an adventure bike—capable on any surface or terrain. Having a tool like this is critical for me; it supports the vision I have for these big mountain days.</p>\n[caption id=\"attachment_53556\" align=\"aligncenter\" width=\"768\"]<img src=\"https://moots.com/wp-content/uploads/2025/07/IMG_8902_VSCO-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" />Processed with VSCO with ss1 preset[/caption]\n<p>In Boulder, we’re fortunate to have every style of road and riding imaginable. Want smooth and fast pavement in the mountains? Ride up Lefthand Canyon to Brainard Lake. Looking for rough, chunky, gnarly riding? Go up Kingston Peak or Rollins Pass. Gravel? No problem—head up Fourmile Canyon to Gold Hill.The point is, there’s a full spectrum of terrain. That makes route planning both exciting and challenging. It’s part of the fun—digging into the maps, linking together routes, and exploring every nook and cranny of my backyard. The bike unlocks a new way to travel. Having a bike that can handle anything lets me focus on the movement itself. Instead of worrying about gear or setup, I’m free to dive deep into the experience and feel everything the landscape has to offer. It helps that the titanium frame makes all the rough stuff feel like smooth butter, yet stiff and responsive enough for all the climbing at hand. When you boil it down, for me I go uphill for a long time, I need a bike that climbs really well, the Routt ESC checks that box! So light and snappy. It is an absolute joy to pedal.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/07/202506_GoldHill_Cycling_Woodson_78-1024x683.jpg\" alt=\"\" width=\"800\" height=\"534\" /></p>\n<p>This self-propelled way of travel is romantic. Sure, I still use a car now and then. The point of this isn’t to make anyone feel bad about driving to the trailhead. It’s about showcasing the beauty and style of creating your own adventures—right from your doorstep.The bike is the ultimate freedom tool and a perfect companion for long days in the mountains. It opens new pathways of movement, and when paired with a run or a hike, it just might open your eyes to a whole new kind of adventure.</p>\n<p>Happy summer—hope you’re enjoying your trails, mountains, and open spaces!</p>\n</div>\n<p>Kyle <span><span>Richardson</span></span></p>\n<p>You can read more about Kyle's adventures on his substack: <a href=\"https://substack.com/home/post/p-158319612)\">https://substack.com/home/post/p-158319612)</a>KR Self </p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"ec3ef3bb41b7b33cb78c9ea757bcd296b4ccaf15d2817b6927b9d16a8e1ff3cb","category":"Cycling"}