{"title":"How World Bank manages hybrid cloud complexity with Terraform","link":"https://www.hashicorp.com/blog/how-world-bank-manages-hybrid-cloud-complexity-with-terraform","date":1770742800000,"content":"<blockquote>\n<p>\"Developers always take easy path. So if you make the easiest way the right way, then you have the right outcome.”<br />— Suneer Pallitharammal Mukkolakal, Lead Platform Engineer, World Bank</p>\n</blockquote>\n\n<p>That’s the philosophy that drove the World Bank's platform engineering transformation as they went from 5-day infrastructure provisioning timelines filled with manual processes and configuration drift, to a 30-minute self-service platform that manages 27,000 cloud resources and supports 1,700 applications across Azure, AWS, and GCP.</p>\n\n<p>The backbone of this new strategy was HCP Terraform, which World Bank’s platform team used to build golden paths that make security, compliance, and best practices the default.</p>\n\n<p>Learn how they turned their hybrid, “snowflake” infrastructure pipelines into standardized platform products.</p>\n\n<p><em>This blog post is based on a <a href=\"https://www.youtube.com/watch?v=luYygRtBWRo\">HashiConf session</a> from Suneer Pallitharammal Mukkolakal, a Lead Platform Engineer at the World Bank.</em></p>\n\n<h2>Hybrid cloud challenges</h2>\n\n<p>There were five categories of complexity challenges that World Bank was facing:</p>\n\n<h3>Manual processes</h3>\n\n<ul>\n<li>Click ops and ticket ops everywhere</li>\n<li>Configurations done by hand across multiple cloud subscriptions</li>\n<li>Manual processes leave fingerprints that become technical debt you manage forever</li>\n</ul>\n\n<h3>Configuration drift</h3>\n\n<ul>\n<li>Inconsistent dev environments that looked nothing like production</li>\n<li>Lack of standard workflows to prevent drift</li>\n</ul>\n\n<h3>Compliance</h3>\n\n<ul>\n<li>New cyber threats and regulations emerging every day</li>\n<li>Cloud vendors improving products constantly, everyone playing catch-up</li>\n<li>Keeping up with compliance requirements in a fragmented environment</li>\n</ul>\n\n<h3>Bespoke apps</h3>\n\n<ul>\n<li>Every app treated as a special case requiring custom care</li>\n<li>Data teams needed handcrafted data platforms</li>\n<li>App teams needed custom application hosting environments</li>\n<li>Each request meant: gather requirements → sit with the team → design specifically for them → build and manage forever</li>\n<li>Hundreds or thousands of these one-off platforms running across their estate</li>\n</ul>\n\n<h3>Cognitive load</h3>\n\n<ul>\n<li>Platform teams were managing unique snowflakes</li>\n<li>Developers, data engineers, and data scientists had to deal with complex, inconsistent setups</li>\n</ul>\n\n<p><strong>The turning point:</strong> The CIO put forward a transformative digital transformation plan that focused on building a strong platform engineering strategy.</p>\n\n<h2>Platform engineering strategy</h2>\n\n<p>Their platform engineering strategy is built on four pillars:</p>\n\n<h3><strong>Developer experience</strong></h3>\n\n<ul>\n<li>Internal developer portal for self-service capabilities</li>\n<li><a href=\"https://developers.redhat.com/articles/2025/01/29/how-golden-paths-improve-developer-productivity\">Golden paths</a> for apps, data, and AI applications</li>\n<li>Scorecards to track platform quality and usage</li>\n</ul>\n\n<h3><strong>Security by design</strong></h3>\n\n<ul>\n<li>Security policies <a href=\"https://www.hashicorp.com/en/tao-of-hashicorp#:%7E:text=Versioning%20through%20Codification-,Codification,-is%20the%20belief\">converted to code</a> instead of sitting in Word documents</li>\n<li>Version control, auditing, and automated, pre-deploy enforcement for all security policies</li>\n<li>Strong secrets management strategy</li>\n<li>Security scorecards for visibility</li>\n</ul>\n\n<h3><strong>Unified platform standards</strong></h3>\n\n<ul>\n<li>Reusable, composable Terraform <a href=\"https://developer.hashicorp.com/terraform/language/modules\">modules</a> as the foundation</li>\n<li>Modules published in an internal <a href=\"https://www.hashicorp.com/en/blog/scalable-secure-infrastructure-code-the-right-way-use-a-private-module-registry\">private registry</a> in the HashiCorp Cloud Platform (HCP) version of Terraform</li>\n<li>Standard governance: changes happen through code with a proper pull request process</li>\n<li>Standards can be changed and applied in a versioned manner</li>\n</ul>\n\n<h3><strong>AI embedded workflow</strong></h3>\n\n<ul>\n<li>Coding assistance for all developers</li>\n<li>AI-assisted policy checks</li>\n<li>Strategy for AI-generated test cases, intelligent observability, and AI ops</li>\n<li>Automated documentation (not just for humans; also for prompt libraries to guide AI coders)</li>\n</ul>\n\n<h2>Platform engineering framework</h2>\n\n<p>To implement their platform strategy, World Bank planned their framework from the bottom up, using a pyramid approach:</p>\n<img src=\"https://www.datocms-assets.com/2885/1770671616-world-bank-platform-eng-framework.png\" alt=\"Platform\" /><ol>\n<li>Build all the necessary infrastructure components as Terraform modules that have security hardening and best practices built in.</li>\n<li> Build module bundles or “templates” that provide complete, usable deployments for developers <em>(HashiCorp note: <a href=\"https://www.hashicorp.com/en/blog/terraform-stacks-explained\">Terraform Stacks</a> can help with this)</em>.</li>\n<li>Provide workflows to developers that orchestrate <a href=\"https://www.hashicorp.com/en/blog/day-2-infrastructure-management-with-terraform-actions\">Day 1 and Day 2</a> functions with Terraform and other tools.</li>\n<li>After building layers 1-3, observe the common patterns that emerge and encode those workflows with best practices and controls built-in. Those workflows will be options in a golden path, available through the <a href=\"https://www.hashicorp.com/en/blog/why-you-should-run-your-platform-team-like-a-product-team\">platform-as-a-product</a>.</li>\n<li>Finally, build a ‘storefront’ for the platforms — an internal developer portal.</li>\n</ol>\n\n<h2><strong>The Terraform self-service workflow</strong></h2>\n\n<p>After World Bank built out their framework, they were able to provide developers with a secure, streamlined way to start using a pre-built application deployment stack. The process follows these steps:</p>\n\n<ol>\n<li>Developer requests a golden path product in the IDP</li>\n<li>This triggers a platform management pipeline that:\n\n<ol>\n<li>Deploys HCP Terraform workspaces</li>\n<li>Prefills all variables</li>\n<li>Connects to the agent that will execute</li>\n<li>Configures the Git repository with golden path definitions</li>\n</ol></li>\n<li>HCP Terraform runs plan and execute to deploy golden path patterns</li>\n</ol>\n\n<p>Within this setup, platform engineers can manage their operations at the Git-repository level, keeping maintenance simple for everyone.</p>\n\n<p>The other half of this workflow is the <a href=\"https://www.hashicorp.com/en/blog/fix-the-developers-vs-security-conflict-by-shifting-further-left\">shift-left</a> security functions in the workflow.</p>\n\n<h3><strong>Security embedded in the flow</strong></h3>\n\n<p>It’s a fairly mainstream practice now to embed security in the software design and delivery workflow, not bolt it on at the end. This shift-left workflow reduces redevelopment costs and results in better security — so really, it’s better in every way.</p>\n\n<p>Here’s how World Bank weaves security into their self-service workflow:</p>\n\n<ul>\n<li>When Terraform plan execution completes, the plan gets sent to World Bank’s security scanning tools using a Terraform <a href=\"https://developer.hashicorp.com/terraform/cloud-docs/workspaces/settings/run-tasks\">run task</a> integration.</li>\n<li>Security scans happen right at the gateway to provisioning</li>\n<li>Infrastructure only deploys if it's in compliance with security standards</li>\n<li>Policy as code checks also happen at this stage and they are enforced automatically</li>\n<li>If everything passes, the infrastructure is deployed to World Bank’s hybrid cloud environment: <strong>Azure, AWS, on-prem, and GCP, all in one unified workflow</strong></li>\n</ul>\n\n<p>You can see a diagram of the overall self-service workflow below:</p>\n<img src=\"https://www.datocms-assets.com/2885/1770671803-world-bank-platform-self-service-workflow.png\" alt=\"Platform\" /><h2><strong>The architecture view</strong></h2>\n\n<p>From an architect’s point of view, each standard template was built with the intention of striking a balance between flexibility and standardized consolidation. This is what the typical logical architecture looks like for World Bank’s platform deployments:</p>\n<img src=\"https://www.datocms-assets.com/2885/1770672022-world-bank-platform-space-architecture.png\" alt=\"Platform\" /><p>Each deployment has a resource plane, a platform plane, and a developer plane:</p>\n\n<h3><strong>Resource plane (bottom layer)</strong></h3>\n\n<ul>\n<li>Includes services consumed from Azure, AWS, GCP, and on-prem</li>\n<li>Engineers have an array of choices under compute, network, services, data</li>\n</ul>\n\n<h3><strong>Platform plane (middle layer)</strong></h3>\n\n<ul>\n<li>World Bank extensively uses Terraform, <a href=\"https://www.redhat.com/en/technologies/management/ansible\">Ansible</a>, and <a href=\"https://argoproj.github.io/cd/\">ArgoCD</a> for platform delivery pipelines</li>\n<li>Their two platform products — Application and Data — are delivered as a service</li>\n</ul>\n\n<h3><strong>Developer plane (top layer)</strong></h3>\n\n<ul>\n<li>Developers, data engineers, and data scientists have the most flexibility at this layer, which supports their use of IDEs, MCP servers, and AI tools like Copilot</li>\n<li>Users also have the internal developer portal (the “storefront”) available through a simple web interface.</li>\n</ul>\n\n<h2><strong>Platform products: Application and data</strong></h2>\n\n<p>Suneer described World Bank’s two main platform products from the platform team’s point of view. These platforms show where they thought flexibility and options were needed, and where certain capabilities were non-negotiable.</p>\n\n<h3><strong>Application platform</strong></h3>\n\n<p><strong>Core stack:</strong></p>\n\n<ul>\n<li>VNet with network security controls</li>\n<li>User interface, API, and database capabilities</li>\n<li>Standardized on NodeJS, Java, and .NET (not top-down—looked at what was most used in their estate)</li>\n<li>Multiple database options including PostgreSQL, MySQL, and Cosmos DB (NoSQL)</li>\n</ul>\n\n<p><strong>Optional capabilities (toggle on/off):</strong></p>\n\n<ul>\n<li>Serverless functions (Azure Functions, Lambda-style)</li>\n<li>Caching (Redis standardized with security controls baked in)</li>\n<li>Object storage for videos and files</li>\n</ul>\n\n<p><strong>Security and authentication (non-negotiable):</strong></p>\n\n<ul>\n<li>Authentication enabled everywhere</li>\n<li>Native authentication wherever possible</li>\n<li>Managed identity for most use cases</li>\n</ul>\n\n<p><strong>Standard components (always included):</strong></p>\n\n<ul>\n<li>Monitoring, logging, key management, DNS, managed identity</li>\n</ul>\n\n<p>These standard security and monitoring components were embraced by developers, because now they don’t have to think about how they want to add these things into their deployments. Security and observability are now built-in for every deployment.</p>\n\n<p>The toggle approach is also beneficial because applications can start small, with most optional capabilities toggled off, and then add more capabilities later if their needs expand.</p>\n\n<p>Suneer also described the data platform component for their work on data products and AI products.</p>\n\n<h3><strong>Data platform components</strong></h3>\n\n<p><strong>Compute options:</strong></p>\n\n<ul>\n<li>Analytical platforms: large compute clusters like Databricks, AWS EMR</li>\n<li>Data movement: data integration platforms like Data Factory, AWS Glue</li>\n<li>Protected with private endpoints</li>\n</ul>\n\n<p><strong>Storage options:</strong></p>\n\n<ul>\n<li>Data lake</li>\n<li>Relational databases</li>\n<li>NoSQL databases</li>\n</ul>\n\n<p><strong>AI capabilities:</strong></p>\n\n<ul>\n<li>Vector databases for retrieval augmented generation (RAG)</li>\n<li>LLM APIs: Azure, OpenAI, Claude, etc.</li>\n</ul>\n\n<p><strong>Security:</strong></p>\n\n<ul>\n<li>Entire platform integrated with private endpoints/private links (whichever cloud vendor)</li>\n<li>Strong key management system for database connections</li>\n</ul>\n\n<p>The best part of the toggle approach is that no one has to ask the platform team for support when they want to add capabilities. The toggles and flexibility of the platform products make these actions self-service.</p>\n\n<h2><strong>Day 2 operations for platform engineers</strong></h2>\n\n<p>Platform teams became much more productive as they developed these platform products. Instead of maintaining dozens of bespoke processes and fielding tickets for every single change request, they could do a lot more management and maintenance tasks in bulk and at scale. For example:</p>\n\n<ul>\n<li>The platform products are completely managed in GitHub and codified in Terraform code</li>\n<li>Version changes can be made quickly at scale - example: security vulnerability found in cloud vendor product → change Terraform module → release new version</li>\n<li>Security and compliance stakeholders can also make changes to checks and policy code in a scalable, versioned way</li>\n</ul>\n\n<h2><strong>Key results: From days to minutes</strong></h2>\n\n<p>Here were the major impact metrics that World Bank saw through the implementation of their platform strategy:</p>\n\n<h3><strong>Greater delivery velocity</strong></h3>\n\n<ul>\n<li>Reduced infrastructure provisioning from 5 days to 30 minutes</li>\n<li>The 30 minutes is just execution time</li>\n</ul>\n\n<h3><strong>Standardized infrastructure across the org</strong></h3>\n\n<ul>\n<li>70% of teams now use the standardized platform offerings</li>\n<li>Built optionality within golden paths so everyone consumes the same services</li>\n<li>Organic increase in standardization across the organization</li>\n</ul>\n\n<h3><strong>Scale and reach</strong></h3>\n\n<ul>\n<li>Deployed 27,000 cloud resources in record time</li>\n<li>Supporting 1,700 applications with just these patterns alone</li>\n<li>All while keeping infrastructure secure, consistent, and compliant</li>\n</ul>\n\n<h2><strong>Lessons learned</strong></h2>\n\n<p>There were six major lessons that World Bank learned during this transition:</p>\n\n<p><strong>Start small, standardize, and automate relentlessly</strong></p>\n\n<ul>\n<li>Start with one bottleneck</li>\n<li>Automate as much as possible from start to finish</li>\n</ul>\n\n<p><strong>Adopt modular, flexible architectures</strong></p>\n\n<ul>\n<li>Don't overengineer your Terraform modules</li>\n<li>Don't make them over-configurable</li>\n<li>Build the minimum viable module for your templates to function, then evolve accordingly</li>\n</ul>\n\n<p><strong>Apply team topologies and agile ways of working</strong></p>\n\n<ul>\n<li>Critical when dealing with multiple teams: security, dev, data science, compliance</li>\n<li>All teams (security, dev, data science, compliance) have to work together for incremental progress</li>\n<li><a href=\"https://teamtopologies.com/\">Team topologies</a> helped streamline teams and create clarity</li>\n</ul>\n\n<p><strong>Have clarity on the patterns that serve a majority of use cases</strong></p>\n\n<ul>\n<li>You'll never succeed if you try to standardize workflows for 100% of all enterprise use cases</li>\n<li>You will still have bespoke “snowflakes” — deal with those separately</li>\n</ul>\n\n<p><strong>Embed AI in platform engineering workflows effectively</strong></p>\n\n<ul>\n<li>Policy checks</li>\n<li>Coding assistance</li>\n<li>AI-powered automation throughout</li>\n</ul>\n\n<p><strong>Make the easy path the right path</strong></p>\n\n<p>Developers want to be secure and compliant, but it’s the platform team’s job to make that path easy. If it’s too hard, developers will find a way around it and you’ll have shadow IT. The less time developers spend handling the operational aspects of their development workflow, the more time they’ll have for creativity and bringing value to the business.</p>\n\n<blockquote>\n<p>\"Your developers' creative work truly begins where their wait time ends.\" <br />— Suneer Pallitharammal Mukkolakal, Lead Platform Engineer, World Bank</p>\n</blockquote>\n\n<p>To learn more about how we can help your company navigate the complexities of hybrid infrastructure for more secure, automated operations, read our <a href=\"https://www.hashicorp.com/en/infrastructure-cloud?utm_source=hashicorp&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_SPEED_world-bank-blog_WEBSITE&amp;utm_content=end-blog-cta&amp;utm_offer=website\">guide to navigating cloud complexity</a> and <a href=\"https://www.hashicorp.com/en/contact-sales?utm_source=hashicorp.com&amp;utm_medium=internal-blog&amp;utm_campaign=26Q1_WW_TDM_SPEED_world-bank-blog_CONTACTSALES&amp;utm_content=end-of-blog-cta&amp;utm_offer=contactsales\">drop us a line</a> to talk about your unique IT challenges.  </p>\n\n<p>Watch the full session from HashiConf below:</p>\n","author":"Mitch Pronschinske","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"ecd0a9707e758be84dc1c8f3b32bd107158e80b69ab881fb8fd780df8ddc2cb7","category":"Tech"}