{"title":"Joker: Folie à Deux (2024)","link":"https://neizod.dev/2024/10/16/joker-folie-a-deux.html","date":1729097280000,"content":"<p>ส่วนตัวผมไม่ใช่แฟนค่าย DC เลยไม่รู้ว่าโจ๊กเกอร์ในจักรวาลนั้นเนี่ยพื้นฐานธรรมชาติแล้วเป็นตัวละครแบบไหน แต่ถ้าพูดถึงโจ๊กเกอร์ในช่วงสิบกว่าปีให้หลังมานี้ ก็คงปฎิเสธไม่ได้ว่าภาพจำของใครหลายๆ คนคือโจ๊กเกอร์เวอร์ชันโนแลนด์จากไตรภาคอัศวินรัตติกาล</p>\n\n<p>โจ๊กเกอร์ที่ทั้งจิต ทั้งฉลาด มาพร้อมแผนซ้อนแผน(ซ้อนแผน(ซ้อนแผน)) ไม่โดนใครหักหลังเอาได้ง่ายๆ แถมแฝงไว้ด้วยปรัชญาและการตั้งคำถามถึงเส้นแบ่งศิลธรรมความชั่วดีของมนุษย์</p>\n\n<p>เรียกว่าทำออกมาได้ “เรียลสมจริง” จนกลายเป็นตำนานที่ไม่มีใครโค่นลงได้</p>\n\n<p>ซึ่งถ้าคุณจะไปดูหนังภาคนี้ด้วยกรอบแนวคิดที่ว่า อยากเห็นโจ๊กเกอร์ที่ฉลาดเป็นกรดแบบนั้นอีก หรือไม่ต้องฉลาดมากก็ได้ขอแค่ให้จิตป่วงสุดใจก็พอ … ผมว่ากำเงินไปกินชาบูดีกว่า</p>\n\n<p>เพราะว่าหนังเรื่องนี้ (เอาจริงๆ ก็ตั้งแต่ภาค 2019) ไม่ได้นำเสนอช่วงที่รุ่งโรจน์แสบสันที่สุดในชีวิตโจ๊กเกอร์ แต่กลับเล่าย้อนไปถึงปฐมบทจุดเริ่มต้นที่ตัวละครนี้ถือกำเนิดขึ้นมา</p>\n\n<p>จุดที่โจ๊กเกอร์— หรือถ้าจะเรียกให้ถูกก็คือ อาเธอร์ เฟล็ก —อยู่ในช่วงที่เปราะบางที่สุดในชีวิต</p>\n\n<p>จากภาคก่อนที่อาเธอร์สติแตกกลายร่างเป็นโจ๊กเกอร์ ควักปืนออกมาเป่าสมองพิธีกรกลางไลฟ์สดที่มีคนดูทั้งประเทศ จนกลายเป็นไอดอลของเหล่าหัวรุนแรงที่อยากเห็นการเปลี่ยนแปลงในสังคม … จุดนี้จะว่าไปก็โทษตัวโจ๊กเกอร์เองไม่ได้ทั้งหมด เพราะพิธีกรรายการทีวีก็กวนส้นตีนด้วย อีกทั้งยังเกิดและเติบโตมาในสังคมที่กดดันกดทับ ไม่ได้เหลือช่องให้คนชายขอบได้ลืมตาอ้าปากเท่าไหร่</p>\n\n<p>หนังภาคนี้เล่าถึงเหตุการณ์ต่อมาที่โจ๊กเกอร์ต้องต่อสู้ในศาล ซึ่งทางฝั่งทนายจำเลยก็จะพยายามแสดงให้เห็นว่า เค้าก็เป็นเพียงแค่ผู้ป่วยจิตเวชคนหนึ่งก็เท่านั้น คือเป็นผู้ป่วยโรคหลายบุคลิก โดยบุคลิกแรกคือ อาเธอร์ เฟล็ก ชายหนุ่มผู้อ่อนโยนเป็นมิตรกับเพื่อนบ้าน กับบุคลิกโจ๊กเกอร์ที่ทำอะไรหุนหันพันแล่นนิยมความรุนแรง และเขาควรได้รับการเข้ารักษาเพื่อกำจัดบุคลิกโจ๊กเกอร์ทิ้งไป</p>\n\n<p>จุดเปลี่ยนสำคัญก็คือ ฮาร์ลีย์ ควินน์ สมาชิกฝั่งหัวรุนแรงที่เข้ามาปั่นหัวโจ๊กเกอร์ให้หลงรักหัวปักหัวปำ และหลอกลวงให้ละทิ้งตัวตนอาเธอร์ เพื่อให้เขาขึ้นนำเป็นสัญลักษณ์ (ในจุดหนึ่งหนังใช้คำว่า martyr อารมณ์ประมาณผู้พลีชีพเพื่ออุดมการ (โทษทีอ่านซับไทยไม่ทัน)) แด่การปฏิวัติ</p>\n\n<p>คือใจความของหนังมันไม่ได้ขี้เหร่อะไรเลยนะ แถมยังทิ้งอาหารสมองชั้นดีไว้ให้ขบคิดไม่ด้อยไปกว่าโจ๊กเกอร์เวอร์ชันก่อนด้วยซ้ำ</p>\n\n<blockquote>\n  <p><img src=\"https://neizod.dev/images/poster/joker-folie-a-deux.jpg\" alt=\"\" /></p>\n</blockquote>\n\n<p>แต่ความเป็น “สื่อบันเทิง” ของหนังเรื่องนี้ถือว่าแย่มาก แย่แบบให้อภัยไม่ได้ หลักๆ เลยคือหนังพยายามจะเป็นละครเพลง (musical) ที่เล่าเรื่อง “ในหัว” ของตัวละครผ่านการร้องเล่นเต้นรำ ซึ่งตรงนี้เข้าใจได้นะถ้าคนอื่นจะไม่โอเคกับการแทรกฉากร้องเพลงไปด้วยวิ่งข้ามภูเขาไปด้วยเหมือนหนังอินเดียอย่างนี้ (เห็นคนลุกออกจากโรงแล้วหายไปเลยหลายคน) แต่ส่วนตัวไม่ได้ติดอะไร กลายเป็นชอบด้วยซ้ำเพราะก็เสพละครเพลงมาเยอะ</p>\n\n<p>แต่ว่าเพลงประกอบแต่ละเพลงที่เอามาใช้นี่แม่งไม่เพราะเลยหว่ะครับ คือไม่ใช่ว่าต้นฉบับไม่เพราะนะ แต่การตัดเอามาใส่ในหนังนี่มันไม่ถูกต้องเลยอะ มาแบบเป็นท่อนสั้นๆ แบบบทพูดโมโนโทนไม่มีดนตรีประกอบงี้ หรือเพลงที่ดีหน่อยก็มาแค่เสี้ยวนึงของเพลงงี้ ยังไม่ทันได้ฟังเต็มอิ่มเลยก็ตัดไปใส่ดราม่าประกอบ(ที่สะดุดอารมณ์จากตัวเพลง)ไปแล้ว</p>\n\n<p>แต่จุดที่สำคัญที่สุดในเรื่องนี้คือ วาคีน ฟีนิกซ์ นักแสดงบทโจ๊กเกอร์นี่ร้องเพลงห่วยแตกโคตรๆ … คือถ้าหนังมันร้องเพลงประกอบนิดๆหน่อยๆ พอหอมแก้มหอมคอนี่จะไม่ว่าอะไรเลย แต่นี่คือหนังจะเอาเพลงแบกเรื่องไว้ไง แล้วนักแสดงดันเส้นเสียงไม่ถึง</p>\n\n<p>เอาอย่างง่ายๆ เลยก็เพลงสุดคลาสสิก [To Love Somebody][] ของ Bee Gees โอ้โหเลดี้กากา (ผู้รับบทฮาร์ลีย์ ควินน์) ร้องได้เพราะมาก แต่วาคีนกลับร้องผิดคีย์ซะงั้น (ทำเอานึกถึงแคสท์ รัสเซล โครว์ ใน<a href=\"//en.wikipedia.org/wiki/Les_Mis%C3%A9rables\">เลอมิซ</a>เลย)</p>\n\n<p>to be fair คือหนังต้องการถ่ายทอดชีวิตบัดซบของคนที่ร่วงหล่นจากสังคม เลยตั้งใจให้นักแสดงร้องเพลงแย่ตั้งแต่แรก … แต่แบบนี้มันทำให้เรามีความสุนทรีย์ได้ยังไงในความเป็น “ละครเพลง” ที่เค้าต้องการนำเสนอ?</p>\n\n<p>แต่ก็โอเคแหล่ะมั้ง ฉากก่อนหน้านั้นแอบโปรยเศษขนมปัง (foreshadowing) ผ่านตัวละครตัวอื่นไว้แล้วว่าเค้าร้องเพลงในคีย์นี้ไม่ได้ เลยขอให้นักดนตรีปรับคีย์ให้ก่อนที่ตัวละครตัวนั้นจะเริ่มร้อง</p>\n\n<p>เพราะงั้นการที่โจ๊กเกอร์ร้องเพลงคนละคีย์กับฮาร์ลีย์ ก็คงเป็นการโปรยขนมปังเหมือนกันว่าสองคนนี้ปรับตัวเข้าหากันไม่ได้ สุดท้ายไปกันไม่รอดแน่นอน</p>\n\n<p>(แล้วก็ไอ้การ foreshadowing เนี่ยมันจะเยอะจนเกร่อไปหน่อยมั้ย อย่างฉากเซ็กซ์ที่ชวนอึดอัดในสถานที่แสนสกปรก เพื่อปูทางไปเล่นประเด็นสุดคลาสสิกว่า “กูท้องลูกกับมึงนะ” …)</p>\n\n<p>แต่ก็นั่นแหล่ะ แบบนี้แล้วแม่งหนังไปไม่สุดซักทางไง จะเป็นหนังเพลงก็เป็นได้ไม่สุด หรือจะไปทางดราม่าหนักๆ ก็สะดุดเพราะเพลงประกอบตัดอารมณ์จนเยอะเกิน</p>\n\n<p>ก็คงเหมือนกับตัวละครในเรื่องนั่นแหล่ะมั้ง ที่คิดไม่ออกซักทีว่าตัวเองจะเป็น “อาเธอร์” หรือจะเป็น “โจ๊กเกอร์” กันแน่ … (ตรงตามชื่อหนัง <a href=\"//en.wikipedia.org/wiki/Folie_%C3%A0_deux\">Folie à Deux</a> ไอ้งั่งสองคน ที่อีกคนไม่ได้หมายถึงฮาร์ลีย์ ควินน์)</p>\n\n<p>ซึ่งถ้าเป็นแบบนั้นจริง ก็ต้องขอซูฮกให้เลยว่าหนังแม่งยอมถ่ายทอดความ “สองจิตสองใจ” แบบนี้ออกมาตั้งแต่แนวทางการกำกับเลย ไม่ใช่แค่เล่าความสองจิตสองใจผ่านตัวละครเท่านั้น</p>\n\n<p>คือยอมพลีชีพเป็นหนังห่วยนั่นเอง</p>\n\n<p>(หึ ก็บอกแล้วไงว่า<a href=\"/2019/10/08/joker-vs-nightcrawler.html\">หนังเรื่องนี้มันไม่ดาร์ค</a>เลยซักนิด มันก็แค่หนังคนบ้าที่เดินไปข้างหน้าอย่างสะเปะสะปะก็เท่านั้น)</p>","author":"","siteTitle":"neizod's speculation","siteHash":"939338c5557b1743f2c128736c6006e145dcabc81da9970f1c0dc8ae2feb0830","entryHash":"ed4e5d993c44c623b5b8bffe0d721d55276653d11a04ef083987eb0fd4efc6d1","category":"Thai"}