{"title":"Apacheria Gravel: A First-Year Cycling Adventure with the Moots Routt RSL","link":"https://moots.com/blogs/news/apacheria-gravel-a-first-year-cycling-adventure-with-the-moots-routt-rsl","date":1739839543000,"content":"\n      <figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2025/02/IMG_4616.jpg\" /></figure>\n<p>There's something special about supporting a first-year cycling event-it's a testament to people's love and passion for this sport. On November 16, I participated in the inaugural Apacheria Gravel event in Douglas, Arizona. Organized with heart and grit, this event embodied the spirit of adventure that makes gravel cycling unique.</p>\n<figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2025/02/ApacheriaGravel-Nov.162024-191.jpg\" /></figure>\n<p><strong>A Fresh Start with a New Companion</strong></p>\n<p>The <a href=\"https://www.exploredouglas.org/Apacheria-Gravel/#:~:text=This%20thrilling%20event%20invites%20cyclists%20of%20all,by%20the%20beauty%20of%20the%20Arizona%20countryside.\">Apacheria Gravel </a>event was only the second time I'd ridden my new <a href=\"https://moots.com/bikes/gravel/routt-rsl/\">Moots Routt RSL. </a>I picked it up in Steamboat Springs back in early October, greeted by the golden hues of changing leaves and the warm hospitality of the Moots family. Nate gave me a thorough rundown of the bike's features, and I left Steamboat with excitement and anticipation for the adventures ahead. Life and work kept me busy, leaving little time to bond with the bike before the event. But as soon as I threw my leg over the Routt for the 66-mile distance, all concerns melted away. The bike is a masterpiece-responsive yet forgiving, with geometry that perfectly balances a racy feel and all-day comfort. The 44mm WTB tires were a game-changer, soaking up the rough terrain and providing a smooth, comfortable ride that kept me fresh all day.</p>\n<figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2025/02/ApacheriaGravel-Nov.162024-63.jpg\" /></figure>\n<p><strong>A Day to Remember</strong></p>\n<p>The route was challenging and beautiful, showcasing the rugged landscapes of southern Arizona and a stout headwind on the way home. Surrounded by friends from the Tucson cycling community, the day was filled with camaraderie, laughter, and a shared passion for the sport. To top it all off, I stood on the podium's top step- a sweet bonus to an already unforgettable experience.</p>\n<figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2025/02/ApacheriaGravel-Nov.162024-203.jpg\" /></figure>\n<p><strong>Gratitude for the Moots Family</strong></p>\n<p>Reflecting on the day, I couldn't be more grateful for my Routt RSL and the Moots family. They've created a bike that performs and connects me to the adventures I hold dear. Since Apacheria, the Routt has been my partner for more rides and new explorations, and I'm excited to see where it will take me next. Thank you to everyone who poured their heart into making Apacheria Gravel a success. And to my Moots family, your support means the world to me. Here's to more first-year events, unforgettable rides, and new memories on bikes.</p>\n<figure><img alt=\"\" src=\"https://moots.com/wp-content/uploads/2025/02/ApacheriaGravel-Nov.162024-290.jpg\" /></figure>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"efd0deabfe4b0b2f1287351247ee8824ff670370c3bca254cf73f61d73b25a6c","category":"Cycling"}