{"title":"How to control session routing for multi-IP hosts in Boundary","link":"https://www.hashicorp.com/blog/how-to-control-session-routing-for-multi-ip-hosts-in-boundary","date":1770316200000,"content":"<p>In Boundary, a <a href=\"https://developer.hashicorp.com/boundary/docs/hosts#dynamic-host-catalogs\">dynamic host catalog</a> is like an automated inventory system that discovers and manages infrastructure targets by syncing directly with cloud providers (such as AWS, Azure, or Google Cloud) rather than relying on manual entry. Instead of an administrator statically defining IP addresses, the catalog uses plugins to query your infrastructure based on tags (e.g. \"all EC2 instances tagged <code>Environment=Prod</code>\"). As VMs are provisioned or terminated, the catalog updates in near real-time, ensuring that the list of connectable hosts in Boundary always matches the actual state of your dynamic infrastructure without human intervention.</p>\n\n<p>Managing such a dynamic infrastructure often means dealing with hosts that have multiple network interfaces and IP addresses. If you are running resources in AWS, Azure or GCP, you know that a single instance can have a public IP, a private IP, and potentially others assigned to different subnets. For Boundary administrators, ensuring that sessions connect to the right IP address, specifically the one reachable by your Boundary worker, is critical for connectivity and security.</p>\n\n<p>In this post, we will cover why multi-homed hosts pose a challenge, how preferred endpoints solve it, and how to configure it using Terraform and the CLI.</p>\n\n<h2>The challenge of hosts with multiple IP addresses</h2>\n\n<p>In modern cloud environments, resources are rarely simple. A host is an EC2 instance or an Azure VM, which often possesses multiple IP addresses. For example, an AWS EC2 instance might have a primary Elastic Network Interface (ENI) address, a secondary private IP, and a public-facing IP.</p>\n\n<p>When Boundary creates a session, it needs to select one of these addresses to establish the connection. Without a clear priority, when users initiate a connection to a target host, Boundary might attempt to connect via an IP address that is unreachable from the specific Boundary worker handling the session (e.g. trying to use a public IP when the worker is inside a private VPC). This may lead to failed connection attempts and frustration for end users.</p>\n\n<h2>Preferred endpoints</h2>\n\n<p>To address this, Boundary utilizes the <strong>Preferred Endpoint</strong> field within the dynamic host catalog. This field allows you to define an ordered list of criteria to determine which address Boundary should prioritize when creating a session.</p>\n<img src=\"https://www.datocms-assets.com/2885/1770232639-preferred-endpoints-boundary.png\" alt=\"preferred\" /><p>By default, Boundary uses the following prioritization for selecting IP addresses to establish a connection with: </p>\n\n<ol>\n<li>Private IPv4</li>\n<li>Public IPv4</li>\n<li>DNS</li>\n<li>Private IPv6</li>\n<li>Public IPv6</li>\n</ol>\n\n<p>However, in complex network topologies, you often need more granular control. Preferred endpoints allow you to map a preference to specific network ranges or specific IPs. </p>\n\n<h2>Configuring preferred endpoints</h2>\n\n<p>You can configure preferred endpoints using CIDR blocks or DNS values. This flexibility ensures you can target addresses based on subnet structure or naming conventions.</p>\n\n<h3>Syntax overview</h3>\n\n<p>The field accepts a list of selector strings in the following formats:</p>\n\n<ul>\n<li><strong>CIDR</strong>: cidr:<code>&lt;valid IPv4/6 CIDR&gt;</code> (e.g. <code>cidr:10.0.0.0/16</code>)</li>\n<li><strong>DNS</strong>: dns:<code>&lt;globbed name&gt;</code>(e.g. <code>dns:*.internal</code>)</li>\n</ul>\n\n<p>You can configure this via the Boundary UI, CLI, or Terraform.</p>\n\n<h3>Terraform configuration</h3>\n\n<p>For those managing Boundary with infrastructure as code, the <code>boundary_host_set_plugin</code> resource supports the <code>preferred_endpoints</code> argument. </p>\n<pre><code>resource \"boundary_host_set_plugin\" \"aws_set\" {\n  name            = \"aws-prod-set\"\n  host_catalog_id = boundary_host_catalog_plugin.aws_catalog.id\n  attributes_json = jsonencode({ \"filters\" = [\"tag:Env=Prod\"] })\n\n  # Prioritize private subnet IPs first, then internal DNS names\n  preferred_endpoints = [\n    \"cidr:10.0.0.0/8\", \n    \"dns:*.internal\"\n  ]\n}</code></pre><h2>See it in action: Pinning a secondary IP</h2>\n\n<p>To illustrate why this matters, consider a recent scenario involving an AWS EC2 target configured with two Network Interface Cards (NICs) and four distinct IP addresses: <code>10.0.112.123</code> (primary), <code>10.0.112.216</code>, <code>10.0.112.126</code>, and <code>10.0.112.74</code> (secondary).</p>\n\n<h3>The problem:</h3>\n\n<p>The administrator wanted Boundary to connect specifically to the secondary IP 10.0.112.74. However, because the dynamic host catalog ingests all available IPs, Boundary defaulted to the instance's primary IP (10.0.112.123). Even though the target was correctly discovered, the connection flow was routing through the wrong interface.</p>\n\n<h3>The solution:</h3>\n\n<p>The administrator can apply a specific CIDR filter to the host set to force the selection of the secondary IP:</p>\n<pre><code>-preferred-endpoint=\"cidr:10.0.112.74/32\"</code></pre><h3>Verification:</h3>\n\n<p>After applying the preferred endpoint, the administrator verified the connection on the target machine using <code>netstat -tanlp</code>. The output confirmed that the active SSH session was established on 10.0.112.74, bypassing the default primary IP and satisfying the network requirement.</p>\n\n<h3>Improved documentation</h3>\n\n<p>We heard your feedback that the previous documentation for the Preferred Endpoint field was inadequate, so we have significantly expanded the resources available to help you configure this correctly.</p>\n\n<ul>\n<li><strong>Boundary documentation:</strong> The <a href=\"https://developer.hashicorp.com/boundary/docs/hosts\">official docs</a> now include <a href=\"https://developer.hashicorp.com/boundary/docs/domain-model/host-sets#preferred_endpoints\">detailed</a> <a href=\"https://developer.hashicorp.com/boundary/docs/commands/host-sets/create#preferred-endpoint\">definitions</a> and syntax guides for the Preferred Endpoint field.</li>\n<li><strong>Terraform Registry:</strong> The <code>boundary_host_set_plugin</code> documentation in the <a href=\"https://registry.terraform.io/providers/hashicorp/boundary/latest/docs/resources/host_set_plugin\">Terraform Registry</a> now links to these definitions and includes concrete examples of syntax for both CIDR and DNS values.</li>\n</ul>\n\n<p>These updates ensure that whether you are troubleshooting a connection issue or setting up a new environment, you have the reference material needed to configure host priority correctly.</p>\n\n<h3>Next steps</h3>\n\n<p>If you are running multiple interface environments in AWS, Azure or GCP, we recommend reviewing your current host set configurations. Explicitly defining your preferred endpoints can reduce connection latency and prevent reachability errors.</p>\n\n<p>Check out the updated <a href=\"https://developer.hashicorp.com/boundary/tutorials/host-management/aws-host-catalogs\">Configure host catalog in AWS</a> and the <a href=\"https://registry.terraform.io/providers/hashicorp/boundary/latest/docs/resources/host_set_plugin\">Boundary Terraform provider documentation</a> to see the full details and examples.</p>\n","author":"Rachana Badekar","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"f01051a9eba293cb9d83cd7e61d1294ab44e5e5b770c551d719c65be67e46d3e","category":"Tech"}