{"title":"บันทึกการแบ่งปันความรู้พื้นฐานเรื่อง AI ในการ coding","link":"https://www.somkiat.cc/sharing-ai-agent-for-coding/","date":1770004473000,"content":"<p><img width=\"150\" height=\"150\" src=\"https://www.somkiat.cc/wp-content/uploads/2026/02/ai-agent-for-coding-150x150.jpg\" alt=\"\" loading=\"lazy\" srcset=\"https://www.somkiat.cc/wp-content/uploads/2026/02/ai-agent-for-coding-150x150.jpg 150w, https://www.somkiat.cc/wp-content/uploads/2026/02/ai-agent-for-coding-75x75.jpg 75w\" /></p>\n<figure><a href=\"https://www.somkiat.cc/wp-content/uploads/2026/02/ai-agent-for-coding.jpg\"><img src=\"https://www.somkiat.cc/wp-content/uploads/2026/02/ai-agent-for-coding.jpg\" alt=\"\" width=\"602\" height=\"342\" /></a></figure>\n\n\n\n<p>มีโอกาสได้แบ่งปันความรู้และประสบการณ์พื้นฐาน<br />เกี่ยวกับการนำ AI มาใช้ในการ coding (AI Agent for coding)<br />โดยได้แบ่งปันคร่าว ๆ ดังนี้</p>\n\n\n\n<ul>\n<li>ทำความเข้าใจเกี่ยวกับรูปแบบของการนำ AI มาใช้งาน</li>\n\n\n\n<li>ทำความรู้จักกับส่วนต่าง ๆ ของ AI Agent for coding</li>\n\n\n\n<li>ทำความเข้าใจกับเครื่องมือที่นำมาใช้ว่าเป็นอย่างไร เพื่อให้ต่อยอดได้ง่าย</li>\n\n\n\n<li>แนะนำเรื่องของ Spec-driven development (SDD)</li>\n</ul>\n\n\n\n<p>มาเริ่มกันเลย</p>\n\n\n\n<span></span>\n\n\n\n<p><strong>เรื่องแรกคือ รูปแบบของการ AI มาใช้ในการ coding</strong></p>\n\n\n\n<p>หรือนิยมเรียกว่า vibe coding <br />โดย vibe coding จะมี 2 แบบหลัก ๆ คือ</p>\n\n\n\n<ul>\n<li>รูปแบบที่ 1 คือ pure vibe coding (ไม่จำเป็นต้องรู้หรือเข้าใจ code)</li>\n\n\n\n<li>รูปแบบที่ 2 คือ responsible ai-assist coding (มีความรู้และประสบการณ์เกี่ยวกับ code)</li>\n</ul>\n\n\n\n<p>ทั้งสองรูปแบบจะมีขั้นตอนที่แตกต่างกันพอสมควร<br />นั่นคืออยู่ที่เราต้องการนั่นเอง<br />แต่สิ่งที่ผมเน้นย้ำคือ การรู้และเข้าใจในสิ่งที่ต้องการ<br />รวมทั้งสิ่งที่ AI สร้างขึ้นมา<br />เพราะว่างานส่วนใหญ่มันคือ <strong><em>การดูแลรักษานั่นเอง</em></strong></p>\n\n\n\n<p><strong>ส่วนสิ่งที่ AI ช่วยได้มาก ๆ คือ การขึ้น prototype หรือ PoC</strong> (Proof of Concept)<br />เพื่อให้เราเห็นภาพรวมได้ดี และ รวดเร็วมากขึ้น<br />จากนั้นค่อยว่ากันว่าจะทำอย่างไรต่อไป<br />เช่นการสร้าง Web UI จาก superdesign, v0 และ lovable เป็นต้น</p>\n\n\n\n<p><strong><em>และสุดท้ายเรายังคงต้อง test และ validate อยู่เสมอ</em></strong></p>\n\n\n\n<p>รูปแบบการทำงานจะเป็นเหมือนการทำ pair programming แบบ driver-navigator<br />คือ เราเป็นคนนำทาง ส่วน AI เป็นผู้ขับ<br />ดังนั้นคนนำทางที่ดี ก็ควรเคยขับมาเช่นกัน !!</p>\n\n\n\n<p><strong>เรื่องที่สองคือ การทำงานของ AI Agent แบบพื้นฐาน</strong></p>\n\n\n\n<p>โดยจะเน้นที่ AI Agent เพียงตัวเดียวก่อน ว่าประกอบไปด้วย</p>\n\n\n\n<ul>\n<li><strong>LLM model</strong> เป็นเหมือนสมอง ซึ่งเลือกให้เหมาะกับงาน ทั้ง plan และ coding/implement</li>\n\n\n\n<li><strong>Memory และ context management</strong> เป็นส่วนที่ต้องจัดการให้ดี เพื่อไม่ให้ไม่ลืม หรือ ไม่ทำงานซ้ำ ๆ ที่สำคัญเพื่อลดการใช้งาน token ลงไป ก็คือการเพิ่มความเร็ว และ ลดค่าใช้จ่ายลงไป</li>\n\n\n\n<li><strong>Tools ต่าง ๆ</strong> ที่สามารถใช้งานได้ เพื่อเพิ่มความสามารถ เช่นการเชื่อมต่อระบบต่าง ๆ ผ่าน MCP (Model Context Protocol) เป็นต้น</li>\n</ul>\n\n\n\n<p>ยกตัวอย่างเช่น การจัดการ memory และ context นั้น<br />จะพอใช้งาน memory แบบ local file <br />และ remote เช่น memory database, vector/graph database <br />รวมทั้งใช้งานผ่าน MCP </p>\n\n\n\n<p><strong>สิ่งที่อยากให้รู้และเข้าใจ คือ AI Agent ก็เหมือนตัวเราเอง</strong><br />ต้องจดและจำสิ่งที่เคยทำมา ทั้งถูกและผิด<br />เพื่อให้การทำงานไหลลื่อ และ ถูกต้องตามที่ต้องการเสมอ<br />จึงได้แนะนำเรื่องพื้นฐานผ่าน <a href=\"https://docs.cline.bot/prompting/cline-memory-bank\" target=\"_blank\">Cline Memory Bank</a><br />ซึ่งน่าจะเป็นจุดเริ่มต้นที่ดี</p>\n\n\n\n<p>และส่วนอื่น ๆ จะเริ่มลงรายละเอียดทั้งเรื่องของ</p>\n\n\n\n<ul>\n<li>Instruction, Rule, Prompt, Command หรือ workflow ต่าง ๆ ที่จะเป็น memory แบบ static</li>\n\n\n\n<li>Custom agent และ sub-agent เพื่อแบ่งความรู้เป็นส่วน ๆ ให้ง่ายต่อการจัดการ และ ลดขนาดของสิ่งที่ต้องทำลงไป</li>\n\n\n\n<li><a href=\"https://agentskills.io/home\" target=\"_blank\">Agent Skils</a> ที่จะ load เข้ามาแบบ dynamic ตามการ conversation หรือการทำงานมากยิ่งขึ้น</li>\n</ul>\n\n\n\n<p><strong>เรื่องที่สามคือ การใช้งานเครื่องมือ AI Agent for coding</strong></p>\n\n\n\n<p>เนื่องจากเครื่องมือมีเยอะมาก ๆ<br />ดังนั้นในแต่ละ workshop จึงเน้นเป็นเรื่อง ๆ เป็น เช่น</p>\n\n\n\n<ul>\n<li>Claude code ใน CLI รวมทั้ง <a href=\"https://github.com/ruvnet/claude-flow\" target=\"_blank\">Claude flow</a></li>\n\n\n\n<li>GitHub Copilot Chat ใน VS Code</li>\n\n\n\n<li>Cline ใน VS Code</li>\n</ul>\n\n\n\n<p><strong>โดยแต่ละเครื่องมือแต่ละตัว สามารถใช้ความรู้พื้นฐานเดียวกันได้</strong><br />แต่ก็ต้องไปปรับให้เข้าแต่ละเครื่องมืออีกที<br />ดังนั้นการเรียนรู็และทำความเข้าใจเครื่องมือจึงสำคัญ<br />เพื่อรีดความสามารถออกมาได้ดียิ่งขึ้น<br />ในส่วนนี้เลยพาลงทำ workshop ทั้ง frontend และ backend<br />รวมทั้งการออกแบบ workflow การทำงานของ AI Agent, Custom Agent และ sub-agent ด้วย</p>\n\n\n\n<figure><a href=\"https://www.somkiat.cc/wp-content/uploads/2026/02/sub-agents-architecture.png\"><img src=\"https://www.somkiat.cc/wp-content/uploads/2026/02/sub-agents-architecture-851x1024.png\" alt=\"\" width=\"406\" height=\"488\" /></a></figure>\n\n\n\n<p><strong>เรื่องที่สี่ น่าจะเป็นเรื่องสุดท้าย คือ Spec-Driven Development (SDD)</strong></p>\n\n\n\n<p>เป็นอีกแนวทางที่ได้รับความนิยมคือ Documentation-First<br />อธิบายสิ่งที่ต้องการให้ชัดเจนในระดับหนึ่ง<br />จากนั้นก็ break down ออกมา เช่น</p>\n\n\n\n<ul>\n<li>ระบุความต้องการ (requirement)</li>\n\n\n\n<li>ทำการเขียน specification ออกมา</li>\n\n\n\n<li>ทำการ plan การทำงานออกมา ไปจนเถึงการแตก task ออกมาว่าต้องทำอะไรบ้าง</li>\n\n\n\n<li>ลงมือ implement หรือ coding</li>\n\n\n\n<li>ทำการตรวจสอบ</li>\n\n\n\n<li>วนไป</li>\n</ul>\n\n\n\n<p><strong>โดยแนวทางนั้นมีหลากหลาย อยู่ที่เราจะวางแผนและออกแบบ</strong><br />เราสามารถทำเองก็ได้ เช่นสร้าง Sub-agent หรือ Custom agent มาใช้เอง<br />หรือจะใช้เครื่องมือสำเร็จรูปก็ได้ เช่น</p>\n\n\n\n<ul>\n<li>Spec-kit</li>\n\n\n\n<li>Kiro</li>\n\n\n\n<li>OpenSpec</li>\n</ul>\n\n\n\n<p><strong>แต่สิ่งที่สำคัญมาก ๆ คือ การเขียนความต้องการของเรา</strong><br />ยิ่งละเอียดก็ยิ่งดี เพื่อไม่ให้มันออกนอกกรอบที่เราควบคุมได้มากนัก<br />แต่บางคน หรือ บางสถานการณ์ ก็เขียนกว้าง ๆ แล้วรอดูผลก็ได้ ไม่ว่ากัน<br />แต่ผมชอบใช้แบบแรก</p>\n\n\n\n<p><strong>โดยมักจะเขียนเป็นรูปแบบของ diagram as code มาก ๆ เช่น</strong></p>\n\n\n\n<ul>\n<li>Architecture diagram</li>\n\n\n\n<li>Mermaid diagram</li>\n\n\n\n<li>Database Markup Language</li>\n</ul>\n\n\n\n<p><strong>รวมทั้งก็ modeling สิ่งต่าง ๆ ออกมาในรูปแบบที่เป็นมาตรฐานมาก เช่น</strong></p>\n\n\n\n<ul>\n<li>API spec เช่น OpenAPI/Swagger และ AsyncAPI</li>\n\n\n\n<li>UML diagram</li>\n\n\n\n<li>Acceptance criteria</li>\n\n\n\n<li>User Interface Design, Design guideline</li>\n\n\n\n<li>Best practices ต่าง ๆ ทั้ง Do and Don't</li>\n</ul>\n\n\n\n<p>ซึ่งผลที่ได้นั้น จะช่วยปรับปรุงสิ่งที่ AI Agent สร้างขึ้นมา<br />ให้ตรงตามที่เราต้องการ และ มีคุณภาพมากยิ่งขึ้น<br />และในแต่ละขั้นตอนเราต้องทำการตรวจสอบก่อนเสมอ !!</p>\n\n\n\n<p><strong><em>แต่สุดท้ายก็อย่างเชื่อ แต่ให้ลองด้วยตัวเอง<br />เพื่อค้นหาแนวทางที่เหมาะสมกับตัวเราเอง กับทีม และ บริษัทต่อไป</em></strong></p>\n\n\n\n<p>ขอให้สนุกกับการ coding ครับ</p>\n","author":"somkiat","siteTitle":"cc :: somkiat","siteHash":"3a23a5a4389e1e40c6fbb16520a8cc20df5b3591c25145ce72aaa18b19e48201","entryHash":"f07e2b454d188654521d1d6c89c6fb06d6e7ef95ce97ebaaafeef68807f638fc","category":"Thai"}