{"title":"M1 MacBook Air Out of Stock at Walmart as Lower-Cost MacBook Nears","link":"https://www.macrumors.com/2026/02/19/m1-macbook-air-out-of-stock-at-walmart/","date":1771544149000,"content":"Apple's older MacBook Air with the M1 chip is now out of stock on Walmart's website in the U.S., amid rumors of a new lower-cost MacBook coming soon.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2026/02/Multicolored-Low-Cost-A18-Pro-MacBook-Feature.jpg\" alt=\"\" width=\"2500\" height=\"1406\" /><em>A colorful MacBook (concept)</em></div>\r<br />\nWalmart first began selling the MacBook Air with the M1 chip <a href=\"https://www.macrumors.com/2024/03/15/walmart-selling-macbook-air-with-m1-chip/\">for $699 in March 2024</a>. The price later dropped to <a href=\"https://www.macrumors.com/2024/07/08/walmart-m1-macbook-air-for-649/\">$649</a>, <a href=\"https://www.macrumors.com/2025/08/13/macbook-air-with-m1-chip-599-at-walmart/\">then to $599</a>, and briefly to <a href=\"https://www.macrumors.com/2025/11/25/walmart-selling-m1-macbook-air-for-549/\">as low as $549</a> during a Black Friday sale last year. However, we just noticed that it has been out of stock <a href=\"https://www.pcmag.com/opinions/the-m1-macbook-air-is-missing-but-why?taid=69907569e03fbc000101899e\">for a while now</a>, and there is no indication if it will ever be returning.\r<br />\n\r<br />\nApple first released the MacBook Air with the M1 chip in November 2020, as one of the first Macs with an Apple silicon chip, instead of an Intel processor. The configuration being sold by Walmart for as low as $549 included 256GB of storage and 8GB of RAM. They were new-in-box units, not refurbished or open-box models. Walmart's website continues to offer refurbished units from \"trusted sellers\" for as low as $449.\r<br />\n\r<br />\nApple <a href=\"https://www.macrumors.com/2024/03/04/apple-discontinues-m1-macbook-air/\">discontinued the MacBook Air with the M1 chip</a> in 2024, after it launched models with the M3 chip, and it has since updated the MacBook Air with the M4 chip. Prior to being discontinued, the model with the M1 chip was being sold for a starting price of $999 brand new, but Amazon sometimes offered it on sale for $749 to $899.\r<br />\n\r<br />\nThe laptop going out of stock at Walmart could be a hint.\r<br />\n\r<br />\nApple <a href=\"https://www.macrumors.com/2025/06/30/apple-to-launch-low-cost-macbook/\">plans to release a lower-priced MacBook</a> with a version of the iPhone 16 Pro's A18 Pro chip <a href=\"https://www.macrumors.com/2026/02/18/low-cost-macbook-expected-on-march-4/\">as early as the first week of March</a>, according to several reports and leakers. This would be an all-new model positioned below the MacBook Air in the Mac lineup, and it would mark a revival of the \"MacBook\" brand (with no \"Air\" or \"Pro\" designation).\r<br />\n\r<br />\nApple supply chain analyst Ming-Chi Kuo was first to reveal that Apple is allegedly planning a more affordable MacBook. Last year, he said the laptop would have around a 13-inch display and come in fun colors, like <a href=\"https://www.macrumors.com/2026/02/16/low-cost-macbook-yellow-green-blue-pink/\">green, blue, pink, and/or yellow</a>. A few rumors have specifically said it will have a 12.9-inch screen.\r<br />\n\r<br />\nThe lower-cost MacBook could have a lot in common with the <a href=\"https://www.macrumors.com/2019/07/09/apple-discontinues-12-inch-macbook/\">discontinued 12-inch MacBook</a>, including an ultra-thin and lightweight design. However, that model was powered by Intel processors. Apple stopped selling the 12-inch MacBook in July 2019, so there has been a long wait for a similar model powered by Apple silicon.\r<br />\n\r<br />\nIn the iPhone 16 Pro, the A18 Pro chip has a 6-core CPU and a 6-core GPU. The chip's multi-core performance is similar to the M1 chip, so this new MacBook could effectively be a replacement for the MacBook Air with the M1 chip, and that could explain why it is finally out of stock at Walmart ahead of the lower-cost MacBook launching.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/2026/01/29/apple-responds-to-rising-memory-chip-prices/\">Skyrocketing DRAM and NAND storage chip prices</a> may have been a factor too, though.\r<br />\n\r<br />\nWith the A18 Pro chip, the lower-cost MacBook might have only 8GB of RAM, whereas all current MacBook Air and MacBook Pro models start with at least 16GB of RAM. The chip also lacks Thunderbolt support, so the new MacBook would likely be equipped with regular USB-C ports, with slower data transfer speeds and external display limitations.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/macbook-a18-pro/\">MacBook (A18 Pro)</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Air\">13\" MacBook Air (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-air.122\">MacBook Air</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2026/02/19/m1-macbook-air-out-of-stock-at-walmart/\">M1 MacBook Air Out of Stock at Walmart as Lower-Cost MacBook Nears</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/m1-macbook-air-out-of-stock-at-walmart-as-lower-cost-macbook-nears.2477960/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"f1785c3b1e9730c68ba330a8cd8e3978aa8b284aabd10122eff92c373dbff638","category":"Apple"}