{"title":"First impressions of Claude Cowork, Anthropic's general agent","link":"https://simonwillison.net/2026/Jan/12/claude-cowork/#atom-entries","date":1768254373000,"content":"<p>New from Anthropic today is <a href=\"https://claude.com/blog/cowork-research-preview\">Claude Cowork</a>, a \"research preview\" that they describe as \"Claude Code for the rest of your work\". It's currently available only to Max subscribers ($100 or $200 per month plans) as part of the updated Claude Desktop macOS application. <strong>Update 16th January 2026</strong>: it's now also available to $20/month Claude Pro subscribers.</p>\r\n<p>I've been saying for a while now that Claude Code is a \"general agent\" disguised as a developer tool. It can help you with any computer task that can be achieved by executing code or running terminal commands... which covers almost anything, provided you know what you're doing with it! What it really needs is a UI that doesn't involve the terminal and a name that doesn't scare away non-developers.</p>\r\n<p>\"Cowork\" is a pretty solid choice on the name front!</p>\r\n<h4>What it looks like</h4>\r\n<p>The interface for Cowork is a new tab in the Claude desktop app, called Cowork. It sits next to the existing Chat and Code tabs.</p>\r\n<p>It looks very similar to the desktop interface for regular Claude Code. You start with a prompt, optionally attaching a folder of files. It then starts work.</p>\r\n<p>I tried it out against my perpetually growing \"blog-drafts\" folder with the following prompt:</p>\r\n<blockquote>\r\n<p>Look at my drafts that were started within the last three months and then check that I didn't publish them on simonwillison.net using a search against content on that site and then suggest the ones that are most close to being ready</p>\r\n</blockquote>\r\n<p><img src=\"https://static.simonwillison.net/static/2026/claude-cowork.jpg\" alt=\"Screenshot of Claude AI desktop application showing a &quot;Cowork&quot; task interface. Left sidebar shows tabs for &quot;Chat&quot;, &quot;Code&quot;, and &quot;Cowork&quot; (selected), with &quot;+ New task&quot; button and a task titled &quot;Review unpublished drafts for pu...&quot; listed below. Text reads &quot;These tasks run locally and aren't synced across devices&quot;. Main panel header shows &quot;Review unpublished drafts for publication&quot;. User message in green bubble reads: &quot;Look at my drafts that were started within the last three months and then check that I didn't publish them on simonwillison.net using a search against content on that site and then suggest the ones that are most close to being ready&quot;. Claude responds: &quot;I'll help you find drafts from the last three months and check if they've been published. Let me start by looking at your drafts folder.&quot; Below is an expanded &quot;Running command&quot; section showing Request JSON with command: find /sessions/zealous-bold-ramanujan/mnt/blog-drafts -type f \\\\( -name \\&quot;*.md\\&quot; -o -name \\&quot;*.txt\\&quot; -o -name \\&quot;*.html\\&quot; \\\\) -mtime -90 -exec ls -la {} \\\\;, description: Find draft files modified in the last 90 days. Response text begins: &quot;Found 46 draft files. Next let me read the content of each to get their titles/topics, then&quot;. Right sidebar shows Progress section with three circular indicators (two checked, one pending) and text &quot;Steps will show as the task unfolds.&quot;, Artifacts section listing &quot;publish-encouragement.html&quot;, Context section with &quot;Selected folders&quot; showing &quot;blog-drafts&quot; folder, Connectors showing &quot;Web search&quot;, and Working files listing &quot;llm-digest-october-2025.md&quot;, &quot;tests-not-optional-coding-agen...&quot;, and &quot;digest-november-2025.md&quot;. Bottom shows reply input field, &quot;Opus 4.5&quot; model selector, user &quot;Simon Willison&quot; with &quot;Max plan&quot;, and disclaimer &quot;Claude is AI and can make mistakes. Please double-check responses.&quot;\" /></p>\r\n<p>It started by running this command:</p>\r\n<div><pre>find /sessions/zealous-bold-ramanujan/mnt/blog-drafts \\\r\n  -type f <span>\\(</span> -name <span><span>\"</span>*.md<span>\"</span></span> -o -name <span><span>\"</span>*.txt<span>\"</span></span> -o -name <span><span>\"</span>*.html<span>\"</span></span> <span>\\)</span> \\\r\n  -mtime -90 -exec ls -la {} <span>\\;</span></pre></div>\r\n<p>That <code>/sessions/zealous-bold-ramanujan/mnt/blog-drafts</code> path instantly caught my eye. Anthropic say that Cowork can only access files you grant it access to - it looks to me like they're mounting those files into a containerized environment, which should mean we can trust Cowork not to be able to access anything outside of that sandbox.</p>\r\n<p>It turns out I have 46 draft files from the past three months. Claude then went to work with its search tool, running 44 individual searches against <code>site:simonwillison.net</code> to figure out which of my drafts had already been published.</p>\r\n<p>Here's the eventual reply:</p>\r\n<blockquote>\r\n<p>Based on my analysis, here are <strong>your unpublished drafts that appear closest to being ready for publication</strong>:</p>\r\n<hr />\r\n<p><strong>🔥 Most Ready to Publish (substantial content, not yet published)</strong></p>\r\n<ol>\r\n<li>\r\n<strong><code>freq-argued-llms.md</code></strong> - \"Frequently Argued Questions about LLMs\" (22,602 bytes)\r\n<ul>\r\n<li>This is a meaty piece documenting common arguments about LLMs with your counterpoints</li>\r\n<li>Well-structured with a TL;DR and multiple sections</li>\r\n<li>No matching published article found on your site</li>\r\n<li>\r\n<strong>Very close to ready</strong> - just needs a final review pass</li>\r\n</ul>\r\n</li>\r\n<li>\r\n<strong><code>claude-code-timeline.md</code></strong> - \"Claude Code Timeline and Codex Timeline\" (3,075 bytes)\r\n<ul>\r\n<li>About viewing JSONL session logs from Claude Code and Codex</li>\r\n<li>You published <code>claude-code-transcripts</code> on Dec 25, but this appears to be a different/earlier piece about timeline viewing tools</li>\r\n<li>Shorter but seems complete</li>\r\n</ul>\r\n</li>\r\n<li>\r\n<strong><code>datasette-1a20-upgrade-instructions.md</code></strong> - Plugin Upgrade Guide (3,147 bytes)\r\n<ul>\r\n<li>Technical guide for plugin authors</li>\r\n<li>You published the main 1.0a20 announcement but this companion upgrade guide appears unpublished</li>\r\n<li>Would be valuable for plugin maintainers</li>\r\n</ul>\r\n</li>\r\n</ol>\r\n</blockquote>\r\n<p>That's a good response! It found exactly what I needed to see, although those upgrade instructions are actually published elsewhere now (<a href=\"https://docs.datasette.io/en/latest/upgrade_guide.html\">in the Datasette docs</a>) and weren't actually intended for my blog.</p>\r\n<p>Just for fun, and because I <a href=\"https://simonwillison.net/2024/Oct/21/claude-artifacts/\">really like artifacts</a>, I asked for a follow-up:</p>\r\n<blockquote>\r\n<p>Make me an artifact with exciting animated encouragements to get me to do it</p>\r\n</blockquote>\r\n<p>Here's what I got:</p>\r\n<p><img src=\"https://static.simonwillison.net/static/2026/claude-cowork-artifact.jpg\" alt=\"Screenshot of the same Claude AI desktop application Cowork interface, now showing completed task results. Left panel shows &quot;1 step &gt;&quot; with link &quot;View your animated encouragement page&quot;. Claude's response reads: &quot;I created an over-the-top animated encouragement page with:&quot; followed by bullet points: &quot;🚀 Pulsing rockets and bouncing stats&quot;, &quot;✨ Falling emoji rain and confetti&quot;, &quot;🔥 Dancing fire emojis around your draft title&quot;, &quot;💫 Sparkles that follow your mouse&quot;, &quot;📊 An animated '95% ready' progress bar&quot;, &quot;💬 Rotating motivational quotes&quot;, &quot;🎉 A 'I'M GONNA DO IT!' button that triggers an explosion of confetti when clicked&quot;. Center shows an artifact preview of the generated HTML page with dark background featuring animated rocket emojis, large white text &quot;PUBLISH TIME!&quot;, stats showing &quot;22,602 bytes of wisdom waiting&quot;, &quot;95% ready to ship&quot;, infinity symbol with &quot;future arguments saved&quot;, and a fire emoji with yellow text &quot;Frequently&quot; (partially visible). Top toolbar shows &quot;Open in Firefox&quot; button. Right sidebar displays Progress section with checkmarks, Artifacts section with &quot;publish-encouragement.html&quot; selected, Context section showing &quot;blog-drafts&quot; folder, &quot;Web search&quot; connector, and Working files listing &quot;llm-digest-october-2025.md&quot;, &quot;tests-not-optional-coding-agen...&quot;, and &quot;digest-november-2025.md&quot;. Bottom shows reply input, &quot;Opus 4.5&quot; model selector, and disclaimer text.\" /></p>\r\n<p>I couldn't figure out how to close the right sidebar so the artifact ended up cramped into a thin column but it did work. I expect Anthropic will fix that display bug pretty quickly.</p>\r\n<h4>Isn't this just Claude Code?</h4>\r\n<p>I've seen a few people ask what the difference between this and regular Claude Code is. The answer is <em>not a lot</em>. As far as I can tell Claude Cowork is regular Claude Code wrapped in a less intimidating default interface and with a filesystem sandbox configured for you without you needing to know what a \"filesystem sandbox\" is.</p>\r\n<p><strong>Update</strong>: It's more than just a filesystem sandbox - I had Claude Code reverse engineer the Claude app and <a href=\"https://gist.github.com/simonw/35732f187edbe4fbd0bf976d013f22c8\">it found out</a> that Claude uses VZVirtualMachine - the Apple Virtualization Framework - and downloads and boots a custom Linux root filesystem.</p>\r\n<p>I think that's a really smart product. Claude Code has an enormous amount of value that hasn't yet been unlocked for a general audience, and this seems like a pragmatic approach.</p>\r\n\r\n<h4>The ever-present threat of prompt injection</h4>\r\n<p>With a feature like this, my first thought always jumps straight to security. How big is the risk that someone using this might be hit by hidden malicious instruction somewhere that break their computer or steal their data?</p>\r\n<p>Anthropic touch on that directly in the announcement:</p>\r\n<blockquote>\r\n<p>You should also be aware of the risk of \"<a href=\"https://www.anthropic.com/research/prompt-injection-defenses\">prompt injections</a>\": attempts by attackers to alter Claude's plans through content it might encounter on the internet. We've built sophisticated defenses against prompt injections, but agent safety---that is, the task of securing Claude's real-world actions---is still an active area of development in the industry.</p>\r\n<p>These risks aren't new with Cowork, but it might be the first time you're using a more advanced tool that moves beyond a simple conversation. We recommend taking precautions, particularly while you learn how it works. We provide more detail in our <a href=\"https://support.claude.com/en/articles/13364135-using-cowork-safely\">Help Center</a>.</p>\r\n</blockquote>\r\n<p>That help page includes the following tips:</p>\r\n<blockquote>\r\n<p>To minimize risks:</p>\r\n<ul>\r\n<li>Avoid granting access to local files with sensitive information, like financial documents.</li>\r\n<li>When using the Claude in Chrome extension, limit access to trusted sites.</li>\r\n<li>If you chose to extend Claude’s default internet access settings, be careful to only extend internet access to sites you trust.</li>\r\n<li>Monitor Claude for suspicious actions that may indicate prompt injection.</li>\r\n</ul>\r\n</blockquote>\r\n<p>I do not think it is fair to tell regular non-programmer users to watch out for \"suspicious actions that may indicate prompt injection\"!</p>\r\n<p>I'm sure they have some impressive mitigations going on behind the scenes. I recently learned that the summarization applied by the WebFetch function in Claude Code and now in Cowork is partly intended as a prompt injection protection layer via <a href=\"https://x.com/bcherny/status/1989025306980860226\">this tweet</a> from Claude Code creator Boris Cherny:</p>\r\n<blockquote>\r\n<p>Summarization is one thing we do to reduce prompt injection risk. Are you running into specific issues with it?</p>\r\n</blockquote>\r\n<p>But Anthropic are being honest here with their warnings: they can attempt to filter out potential attacks all they like but the one thing they can't provide is guarantees that no future attack will be found that sneaks through their defenses and steals your data (see <a href=\"https://simonwillison.net/2025/Jun/16/the-lethal-trifecta/\">the lethal trifecta</a> for more on this.)</p>\r\n<p>The problem with prompt injection remains that until there's a high profile incident it's really hard to get people to take it seriously. I myself have all sorts of Claude Code usage that could cause havoc if a malicious injection got in. Cowork does at least run in a filesystem sandbox by default, which is more than can be said for my <code>claude --dangerously-skip-permissions</code> habit!</p>\r\n<p>I wrote more about this in my 2025 round-up: <a href=\"https://simonwillison.net/2025/Dec/31/the-year-in-llms/#the-year-of-yolo-and-the-normalization-of-deviance\">The year of YOLO and the Normalization of Deviance</a>.</p>\r\n<h4>This is still a strong signal of the future</h4>\r\n<p>Security worries aside, Cowork represents something really interesting. This is a general agent that looks well positioned to bring the wildly powerful capabilities of Claude Code to a wider audience.</p>\r\n<p>I would be very surprised if Gemini and OpenAI don't follow suit with their own offerings in this category.</p>\r\n<p>I imagine OpenAI are already regretting burning the name \"ChatGPT Agent\" on their janky, experimental and mostly forgotten browser automation tool <a href=\"https://simonwillison.net/2025/Aug/4/chatgpt-agents-user-agent/\">back in August</a>!</p>\r\n<h4>Bonus: and a silly logo</h4>\r\n<p>bashtoni <a href=\"https://news.ycombinator.com/item?id=46593022#46593553\">on Hacker News</a>:</p>\r\n<blockquote>\r\n<p>Simple suggestion: logo should be a cow and and orc to match how I originally read the product name.</p>\r\n</blockquote>\r\n<p>I couldn't resist <a href=\"https://gist.github.com/simonw/d06dec3d62dee28f2bd993eb78beb2ce\">throwing that one at Nano Banana</a>:</p>\r\n<p><img src=\"https://static.simonwillison.net/static/2026/cow-ork.jpg\" alt=\"An anthropic style logo with a cow and an ork on it\" /></p><p><em>You are only seeing the long-form articles from my blog. Subscribe to <a href=\"https://simonwillison.net/atom/everything/\">/atom/everything/</a> to get all of my posts, or take a look at my <a href=\"https://simonwillison.net/about/#subscribe\">other subscription options</a>.</em></p>","author":"Simon Willison","siteTitle":"Simon Willison’s Weblog","siteHash":"1b599216bd27a00f15d67a3ed9719c64148630c70244b6dd8e743f17cb45527e","entryHash":"f3092b63852b21abe6238e517fd4d68433598451718b8656f8b804b8cf7a0932","category":"Tech"}