{"title":"Obsession, loyalty, and savviness: how former mechanic Ralph Denk became modern cycling’s blueprint manager","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/obsession-loyalty-and-savviness-how-former-mechanic-ralph-denk-became-modern-cycling-s-blueprint-manager","date":1771578002000,"content":"\n      <p><span>Patrick Lefevere recently claimed that “I hate Ralph Denk”, a statement entirely in keeping with Lefevere’s boisterous, opinionated tendencies that made him this century’s most recognisable (and controversial, as well as successful) cycling manager before his retirement just over a year ago. Within that heavy-hitting statement there was something far more meaningful and significant than one man’s dislike of a peer: it was an acceptance that a former ski racing junior whose first job was getting his hands dirty cleaning mountain bikes is now established as one of sport’s most instrumental and influential figures. </span></p>\n<p><span>Lefevere’s comments were in relation to how Denk managed to persuade </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/remco-evenepoel-wants-to-break-the-hour-record-at-some-point-will-he-smash-filippo-gannas-time?tag=member\"><span>Remco Evenepoel</span></a><span> – the last great prodigy out of the long Lefevere lineage – to leave his Soudal Quick-Step contract prematurely to join Denk’s </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-ineos-exodus-and-the-attraction-of-red-bull-why-cycling-s-best-minds-are-all-making-the-same-move?tag=member\"><span>growing project at Red Bull-Bora-Hansgrohe</span></a><span>, a venture that has its roots in a small mountain bike team that became the best in the world, and then reinvented itself into as a start-up Continental team that a decade-and-a-half later attracted the interest of the sporting world’s most marketable company. </span></p>\n<p><span>The Lefevere era has departed, and a new era marked by Denk and his contemporaries is promising to change the structure of cycling forever. “My dream is to win the </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\"><span>Tour de France</span></a><span>, but my other dream is to make the cake bigger, to create a time when the 49% share that I now own becomes real value,” says Denk, 52.</span><b></b></p>\n<p><strong>Racing dreams</strong><b></b></p>\n<p><span>That Denk would go on to lead one of modern cycling’s most ambitious enterprises could not have been predicted in his early years, for his childhood was all about skiing. “My family was very sporty and we did lots of downhill skiing,” Denk, sporting his trademark moustache that sits above a cheeky, charming smile, tells </span><em>Rouleur</em><span> in Mallorca. He was born and raised as the oldest of three siblings by his accountant mother and metal worker father in Rosenheim, a small city 55km south of Munich. “My parents had an average income,” he says. Any disposable money they had went on skiing.</span><b></b></p>\n<p><span>Until 14, a young Denk would be spotted tearing down the Bavarian mountains for half-a-year, in pursuit of a ski racing dream. Then a knee injury changed everything. “My mother had an old celeste Bianchi road bike and I used it for rehabilitation,” Denk says. “At first I did 20k laps, then 30k, then 40k, and when I rode over 100k for the first time I asked my Dad if I could do some bike races.” His father, as mad about skiing as his son was, was not best pleased. “‘Come on, focus more on skiing’, he said to me, ‘it’s better to come back to skiing after your knee injury’. But in the end he gave me the green light for some local races and I said to him, ‘Let’s change the sport we do’.” </span><b></b></p>\n<p><span>A week later a young Denk arrived home to see that his Dad had been on a buying-and-selling spree. “The whole cellar that had tons of ski equipment in it was empty,” Denk says, chuckling at the reminder. “He had sold everything and invested all the money into bikes. From one day to the next the whole family were cyclists, totally addicted to cycling.” A new passion was born, one that would consume Denk for the rest of his life.<br /><br /></span><span></span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_65_1_de155512-9647-49a9-b5bd-e3be947331d0_1024x1024.png?v=1770708515\" alt=\"\" /></div>\n<p><span><em>Denk sits down with the author of this article in Mallorca.<br /></em><br /></span><span>Almost immediately after getting started in bike racing, Denk reached a decent level – “Maybe top-10 in Germany,” he says – but his junior days coincided with the unification of West and East Germany, and that meant competition from Jan Ullrich and Andreas Klöden. “They were the same age as me, and they grabbed the limited places in the national team,” Denk rues. He raced as an amateur until he was 24, the biggest stage being the Tour of Bavaria, but he wasn’t naive enough to believe that he’d ever become a pro. “I was super motivated but I wasn't so talented.”</span></p>\n<p><strong>Doors open</strong></p>\n<p><span>When he hung up his racing wheels, he secured his first job: a mechanic at SRAM’s European headquarters in the Netherlands. “Back in the day SRAM was super small, and they only really had the GripShift mountain bike shifters,” he remembers. It was another event that would change the course of his life: over the following four years, Denk went from fixing bikes at the Mountain Bike World Championships to being promoted to technical representative, and then working in the sales department. It was here where his interest in business was piqued and moulded.</span><b></b></p>\n<p><span>“The four years at SRAM were better than any studies I ever did,” he says, citing how he had “zero interest” in the chemical industry course he did from the age of 15 to 18. “I learned so much at SRAM, and I am still super, super thankful to them because they gave me a chance.” Loyalty is important to Denk, and SRAM supplies the equipment for his WorldTour team today. “I learned so much from a very modern company with a very modern approach that helped me take my next step to opening up my own bike shop in 2000.”<br /><br /></span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_62_2_1024x1024.png?v=1770708515\" alt=\"\" /></div>\n<p><span></span><em><span>Olympic champion Remco Evenepoel is the latest rider to buy into Denk's project.</span></em></p>\n<p><span>That shop, located in Raubling, the next town south of Rosenheim, was “something outstanding, totally out of the box,” Denk says. It was the basement of a carpenter friend’s store in front of a busy road. That friend was called Willi Bruckbauer, the founder of Bora – 26 years on, Bruckbauer continues to help Denk out; Bora has sponsored Denk’s cycling team since 2015. “We immediately had success and sold lots of bikes,” Denk recalls of the shop. “I learned how to sell bikes and found that running a business was hard, but I was missing the racing.” So to indulge his racing urges and to promote his shop he set up a small eponymous mountain bike team. Six years later they won the UCI World Cup.</span><b></b><b></b></p>\n<p><span>But that wasn’t enough for the zealous Denk. By now he was a successful businessman, but he wasn’t satisfied; he always wanted more. German cycling was being rocked by a succession of historic and current doping cases involving the country’s biggest stars, but Denk sighted “so much potential” in road cycling because “I’m in love with this sport.” “Obsession in the word,” he goes on. “I saw the good and the bad times, and I really believed that with the right setup you could turn it around again and bring the good times back.”</span><b></b></p>\n<p><strong>Foundations for success</strong><b></b></p>\n<p><span>His first venture was small: a junior outfit that began its name as QUEST before becoming Team Auto Eder. Sound familiar? It might: 19 years later it remains the feeder team to Denk’s professional team. There are those same defining traits in the Denk story again: honouring loyalty and allegiance. </span><b></b></p>\n<p><span>In 2010 – the same year as Team Sky formed, quickly enacting on their promise to disrupt and dominate the sport – Denk took a more modest step forward, launching a Continental team with the backing of a data company called NetApp. “It was the first contract of over a million and it was really nice. Really nice. A great feeling.” Addictive? “Oh yes.” It created the foundations for the current €50m budget team. </span><b></b></p>\n<p><span>A Grand Tour debut at the 2012 <a href=\"https://www.rouleur.cc/pages/giro-ditalia\" target=\"_blank\">Giro d’Italia</a> accelerated Denk’s project, and in 2017 they were awarded a WorldTour licence. The arrival of Peter Sagan, then a two-time world champion about to win his third rainbow bands, emboldened the operation. As his team has evolved, winning their first Grand Tour in 2022 through Jai Hindley at the Giro that led to the arrivals of Roglič and Evenepoel, Denk has remained a “hands-on businessman\". </span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_64_2_1024x1024.png?v=1770708514\" alt=\"\" /></div>\n<p><span><em>Australian Jai Hindley en-route to winning the 2022 Giro d'Italia, the first Grand Tour victory for Denk's team. Image: Zac Williams/SWPix.com.</em><br /><br /></span><span>He elaborates: “I’m hands-on and help to find solutions when challenges are complicated. And I have a hands-on feeling for money and budget, which are so important when making deals. For me, selling is very strategic and it’s hard to learn that at university. I get a lot of opportunities to test my skills, and I think how we sold bikes in my shop helps me today.” (As an aside, he sold his bike shop to an employee in 2015. “I buy my bikes and my kids’ bikes there today,” he reveals. Same pattern: loyalty.)</span></p>\n<p><strong>Changing his team and the sport forever</strong></p>\n<p><span>That last part is crucial in understanding Denk. He’s obsessed by racing, a trait that can be traced back to his own skiing and bike racing days, but nowadays he’s equally as obsessed by business. “Cycling really has the potential to become much bigger than what it is now,” he pronounces. “It’s already a global sport, and you bring people to the Tour de France and they say, ‘Woah, this is so exciting’, but you can make it so much bigger.”</span><b></b></p>\n<p><span>He has already been pivotal in marking a fundamental change in the sport’s structure. “10 years ago it was one man shows: Denk against Lefevere against Iwan Spekenbrink (owner of Picnic PostNL),” he highlights. “Now more and more big companies are changing the ownership model: Red Bull, Lidl, Decathlon, Ineos all own the teams now. In the past we had one goal – to survive – but now it’s different. One single person owning a team is definitely not the best business model because if something happens to that person the whole team is dead. Now we’re on the right track, but it takes time and understanding.”<br /><br />What Denk most wants to see is cycling competing with the bigger sports. “Red Bull joined the project. I gave away 51%, and now own 49%. I don’t do this because of money, but if you sell a cycling team it’s a completely different price tag to selling a Formula One team. Toto Wolff sold 5% of Mercedes F1 for £230m. If we could do that, that would be proof that cycling becomes bigger. To have race areas that celebrities want to come to. This is the potential. Some sports, all winter sports for example, don’t have the potential, but cycling does.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Untitled_design_66_1_c873313e-7611-49f5-b8fa-642f1e7cf3b5_1024x1024.png?v=1770708514\" alt=\"\" /></div>\n<p><span></span><b></b><span>Just recently, aware of team owners clubbing together to conjure up a new business plan designed to change cycling’s model, the sport’s governing body, the UCI, announced plans to consult all stakeholders on the best way forward to overhaul the economic structure of the sport. Denk and Red Bull will be active participants. </span><b></b></p>\n<p><span>At the same time, though, the affable German will continue steering his team towards the top of the sport. “I’m not a money-driven guy; I'm a success-driven guy,” he adds. “With Red Bull we’ve got the base for success and it’s up to us now to take this opportunity and make the team successful. But you should know it’s not just the success – our vision for the mid- and long-term is to be the most attractive cycling team in the world.” </span><b></b></p>\n<p><span>Alongside Evenepoel, there are burgeoning superstars, including Florian Lipowitz, the first German rider to podium at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\" target=\"_blank\">Tour de France</a> since the succession of doping cases almost two decades ago. “Our talent development is so exciting,” Denk says. “We have Lipo, </span><span>Giulio Pellizzari, </span><span>Lorenzo Finn, and many other young guys who are coming up.”</span><b></b></p>\n<p><span>The ski-racing-junior-cum-bike-mechanic wants to leave an indelible legacy on professional cycling – just like Lefevere did, but only in a very different manner. “Passion is not enough – you have to be obsessed,” he says. “I was never in love with a girl like I am with cycling.”</span></p>\n<p> </p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f540ec4ea369ca997d2e577245e5bd90fce27e5487a0f7d0f061ad774f60dcef","category":"Cycling"}