{"title":"Design Dialects: Breaking the Rules, Not the System","link":"https://alistapart.com/article/design-dialects-breaking-the-rules-not-the-system/","date":1758905292000,"content":"\n<p><em>\"Language is not merely a set of unrelated sounds, clauses, rules, and meanings; it is a totally coherent system bound to context and behavior.\"</em> — Kenneth L. Pike</p>\n\n\n\n<p>The web has accents. So should our design systems.</p>\n\n\n\n<h2><strong>Design Systems as Living Languages</strong></h2>\n\n\n\n<p>Design systems aren't component libraries—they’re living languages. <a href=\"https://m3.material.io/foundations/design-tokens/overview\"><strong>Tokens</strong></a> are phonemes, <a href=\"https://atlassian.design/components\"><strong>components</strong></a> are words, <a href=\"https://designsystem.university/glossary#pattern\"><strong>patterns</strong></a> are phrases, <a href=\"https://www.figma.com/blog/design-systems-102-how-to-build-your-design-system/#use-layout-grids-and-spacing-to-create-visual\"><strong>layouts</strong></a> are sentences. The conversations we build with users become the stories our products tell.</p>\n\n\n\n<p>But here’s what we've forgotten: the more fluently a language is spoken, the more accents it can support without losing meaning. English in Scotland differs from English in Sydney, yet both are unmistakably English. The language adapts to context while preserving core meaning. This couldn’t be more obvious to me, a Brazilian Portuguese speaker, who learned English with an American accent, and lives in Sydney.</p>\n\n\n\n<p>Our design systems must work the same way. Rigid adherence to visual rules creates brittle systems that break under contextual pressure. Fluent systems bend without breaking.</p>\n\n\n\n<p><strong>Consistency becomes a prison</strong></p>\n\n\n\n<p>The promise of design systems was simple: consistent components would accelerate development and unify experiences. But as systems matured and products grew more complex, that promise has become a prison. <a href=\"https://adobe.design/stories/design-for-scale/designing-design-systems-supporting-implementation-and-adoption\">Teams file “exception” requests by the hundreds</a>. Products launch with workarounds instead of system components. Designers spend more time defending consistency than solving user problems.</p>\n\n\n\n<p>Our design systems must learn to speak <strong>dialects</strong>.</p>\n\n\n\n<p><strong>A design dialect is a systematic adaptation of a design system that maintains core principles while developing new patterns for specific contexts.</strong> Unlike one-off customizations or brand themes, dialects preserve the system’s essential grammar while expanding its vocabulary to serve different users, environments, or constraints.</p>\n\n\n\n<h2><strong>When Perfect Consistency Fails</strong></h2>\n\n\n\n<p>At <a href=\"https://booking.com\">Booking.com</a>, I learned this lesson the hard way. We A/B-tested everything—color, copy, button shapes, even logo colors. As a professional with a graphic design education and experience building brand style guides, I found this shocking. While everyone fell in love with Airbnb’s pristine design system, Booking grew into a giant without ever considering visual consistency.  </p>\n\n\n\n<p>The chaos taught me something profound: <strong>consistency isn’t ROI; solved problems are.</strong></p>\n\n\n\n<p>At Shopify. Polaris (<a href=\"https://polaris-react.shopify.com/\">https://polaris-react.shopify.com/</a>) was our crown jewel—a mature design language perfect for merchants on laptops. As a product team, we were expected to adopt Polaris as-is. Then my fulfillment team hit an “Oh, Ship!” moment, as we faced the challenge of building an app for warehouse pickers using our interface on shared, battered Android scanners in dim aisles, wearing thick gloves, scanning dozens of items per minute, many with limited levels of English understanding.</p>\n\n\n\n<p>Task completion with standard Polaris: <strong>0%</strong>.</p>\n\n\n\n<p>Every component that worked beautifully for merchants failed completely for pickers. White backgrounds created glare. 44px tap targets were invisible to gloved fingers. Sentence-case labels took too long to parse. Multi-step flows confused non-native speakers.</p>\n\n\n\n<p>We faced a choice: abandon Polaris entirely, or <em>teach it to speak warehouse</em>.</p>\n\n\n\n<h2><strong>The Birth of a Dialect</strong></h2>\n\n\n\n<p>We chose evolution over revolution. Working within Polaris’s core principles—clarity, efficiency, consistency—we developed what we now call a <strong>design dialect</strong>:</p>\n\n\n\n<figure><table><tbody><tr><td><strong>Constraint</strong></td><td><strong>Fluent Move</strong></td><td><strong>Rationale</strong></td></tr><tr><td>Glare &amp; low light</td><td>Dark surfaces + light text</td><td>Reduce glare on low-DPI screens</td></tr><tr><td>Gloves &amp; haste</td><td>90px tap targets (~2cm)</td><td>Accommodate thick gloves</td></tr><tr><td>Multilingual</td><td>Single-task screens, plain language</td><td>Reduce cognitive load</td></tr></tbody></table></figure>\n\n\n\n<p><strong>Result:</strong> Task completion jumped from <strong>0% to 100%</strong>. Onboarding time dropped from three weeks to one shift.</p>\n\n\n\n<p>This wasn’t customization or theming—this was a <strong>dialect</strong>: a systematic adaptation that maintained Polaris’s core grammar while developing new vocabulary for a specific context. Polaris hadn’t failed; it had learned to speak warehouse.</p>\n\n\n\n<h2><strong>The Flexibility Framework</strong></h2>\n\n\n\n<p>At <a href=\"http://www.atlassian.com\">Atlassian</a>, working on the Jira platform—itself a system within the larger Atlassian system—I pushed for formalizing this insight. With dozens of products sharing a design language across different codebases, we needed systematic flexibility so we built directly into our ways of working. The old model—exception requests and special approvals—was failing at scale.</p>\n\n\n\n<p>We developed the <strong>Flexibility Framework</strong> to help designers define how flexible they wanted their components to be:</p>\n\n\n\n<figure><table><tbody><tr><td><strong>Tier</strong></td><td><strong>Action</strong></td><td><strong>Ownership</strong></td></tr><tr><td><strong>Consistent</strong></td><td>Adopt unchanged</td><td>Platform locks design + code</td></tr><tr><td><strong>Opinionated</strong></td><td>Adapt within bounds</td><td>Platform provides smart defaults, products customize</td></tr><tr><td><strong>Flexible</strong></td><td>Extend freely</td><td>Platform defines behavior, products own presentation</td></tr></tbody></table></figure>\n\n\n\n<p>During a navigation redesign, we tiered every element. Logo and global search stayed Consistent. Breadcrumbs and contextual actions became Flexible. Product teams could immediately see where innovation was welcome and where consistency mattered.</p>\n\n\n\n<h2><strong>The Decision Ladder</strong></h2>\n\n\n\n<p>Flexibility needs boundaries. We created a simple ladder for evaluating when rules should bend:</p>\n\n\n\n<p><strong>Good:</strong> Ship with existing system components. Fast, consistent, proven.</p>\n\n\n\n<p><strong>Better:</strong> Stretch a component slightly. Document the change. Contribute improvements back to the system for all to use.</p>\n\n\n\n<p><strong>Best:</strong> Prototype the ideal experience first. If user testing validates the benefit, update the system to support it.</p>\n\n\n\n<p>The key question: “Which option lets users succeed fastest?”</p>\n\n\n\n<p>Rules are tools, not relics.</p>\n\n\n\n<h2><strong>Unity Beats Uniformity</strong></h2>\n\n\n\n<p>Gmail, Drive, and Maps are unmistakably Google—yet each speaks with its own accent. They achieve unity through shared principles, not cloned components. One extra week of debate over button color costs roughly $30K in engineer time.</p>\n\n\n\n<p>Unity is a brand outcome; <strong>fluency is a user outcome.</strong> When the two clash, side with the user.</p>\n\n\n\n<h2><strong>Governance Without Gates</strong></h2>\n\n\n\n<p>How do you maintain coherence while enabling dialects? Treat your system like a living vocabulary:</p>\n\n\n\n<p><strong>Document every deviation</strong> – e.g., dialects/warehouse.md with before/after screenshots and rationale.</p>\n\n\n\n<p><strong>Promote shared patterns</strong> – when three teams adopt a dialect independently, review it for core inclusion.</p>\n\n\n\n<p><strong>Deprecate with context</strong> – retire old idioms via flags and migration notes, never a big-bang purge.</p>\n\n\n\n<p>A living dictionary scales better than a frozen rulebook.</p>\n\n\n\n<h2><strong>Start Small: Your First Dialect</strong></h2>\n\n\n\n<p>Ready to introduce dialects? Start with one broken experience:</p>\n\n\n\n<p><strong>This week:</strong> Find one user flow where perfect consistency blocks task completion. Could be mobile users struggling with desktop-sized components, or accessibility needs your standard patterns don’t address.</p>\n\n\n\n<p><strong>Document the context:</strong> What makes standard patterns fail here? Environmental constraints? User capabilities? Task urgency?</p>\n\n\n\n<p><strong>Design one systematic change:</strong> Focus on behavior over aesthetics. If gloves are the problem, bigger targets aren’t “\"breaking the system”\"—they’re serving the user. Earn the variations and make them intentional.</p>\n\n\n\n<p><strong>Test and measure:</strong> Does the change improve task completion? Time to productivity? User satisfaction?</p>\n\n\n\n<p><strong>Show the savings:</strong> If that dialect frees even half a sprint, fluency has paid for itself.</p>\n\n\n\n<h2><strong>Beyond the Component Library</strong></h2>\n\n\n\n<p>We’re not managing design systems anymore—<strong>we’re cultivating design languages.</strong> Languages that grow with their speakers. Languages that develop accents without losing meaning. Languages that serve human needs over aesthetic ideals.</p>\n\n\n\n<p>The warehouse workers who went from 0% to 100% task completion didn’t care that our buttons broke the style guide. They cared that the buttons finally worked.</p>\n\n\n\n<p>Your users feel the same way. Give your system permission to speak their language.</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"f586c63e45383e110e0b2b151047b80722393d8da106630b7f1979842b7bb6f0","category":"Tech"}