{"title":"‘I feel like I’ve gone to places where other people haven’t’ – Georgia Hunter Bell on pressure, perspective, and pedalling to perform","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-feel-like-i-ve-gone-to-places-where-other-people-haven-t-georgia-hunter-bell-on-pressure-perspective-and-pedalling-to-perform","date":1771398002000,"content":"\n      <p><span>A lot can happen in two minutes. </span><b></b></p>\n<p><span>Guéret, July 2026. The road kicks up slightly as a front group of seven riders take the final climb of the Tour de France Femmes’s longest stage at ferocious pace. Anna van der Breggen squeezes through on the left to attack, before Kim Le Court surges 250 metres before the line, winning the stage by half a wheel ahead of Demi Vollering and reclaiming the GC lead.</span><b></b></p>\n<p><span>Tokyo, September 2026. The gun sounds. Great Britain’s Georgia Hunter Bell closes in from lane seven, hugging the curb in fourth as the pack jostles until Switzerland’s Audrey Werro slips behind with 300 metres to go. Holding position until the final stretch, she finds enough to kick centimetres ahead of reigning Olympic champion Keely Hodgkinson. Hunter Bell dips to a lifetime best, taking 800m silver at the World Athletics Championships in a time of 1:54.90.</span><b></b></p>\n<p><span>Epic pursuits of pain and glory – in about the same time it takes for the kettle to boil. </span><b></b></p>\n<p><span>There is nothing remotely easy about the final sprint of a four-hour 165km tour stage. There is also nothing easy about running 800m in under 1 minute 55 seconds, a feat which only eleven women in the history of the sport have achieved. But Hunter Bell, the Olympic middle-distance medallist who rides five days a week to supplement her running performance, humbly attests that to ride is to endure an entirely new sufferfest. </span><b></b></p>\n<p><span>“Riding gives me a perspective. This is a different kind of pain, and so it kind of repositions what I’m doing on the track. It gives me an edge. It’s like, ‘how many women on the start line have actually felt that kind of pain?’” says Hunter Bell, who has proved her class at both the 800m and 1500m on the world stage over the last two years. “I feel like I’ve gone to places where other people haven’t, which makes me a more well rounded athlete.</span><b></b></p>\n<p><span>“Climbing Mont Ventoux for two hours in my living room – my back was killing, my legs were just burning. It was on an eight percent incline for ages. And I was just thinking, like, ‘okay, 800 metres, that’s less than two minutes, I can get through this’. This is better than that.” </span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/10-georgia-h-main-book-forte-talent-group_1024x1024.jpg?v=1771004578\" alt=\"\" /></div>\n<p><em>Hunter Bell has found cycling to have been integral to her track comeback (Image: Matt Stone / Stonevisuals)</em></p>\n<p><span>This claim is hard to believe. The image of an elite athlete swearing at the screen mid-Zwift workout is always reassuring for the rest of us who do the same. But her statement also provides a fascinating, if boggling insight into the mentality of a professional endurance athlete. Sprinting flat out at an average of 25km/h for almost a kilometre – without the help of two wheels – is far from a walk in the park. </span><b></b></p>\n<p><span>“When the gun goes off, it’s very instinctive, very reactive. On the startline, you’re telling yourself ‘I can do this’, or ‘let’s go’ – coherent thoughts. But as the race goes on, it’s literally just ‘gap, go, position, move,' \" explains the European 1500m silver medallist. “They’re not even full sentences. It’s really different to feeling every emotion, everything that pops into your mind when you’re doing a two-hour ride.” </span><b></b></p>\n<p><span>Cross-training is, of course, not unusual. But snaps of Demi Vollering or Mathieu van der Poel eschewing power numbers for pavement-pounding on social media seem to be more of an off-season occurrence rather than an integral training tool. Conversely, pictures of Hunter Bell atop her Canyon Aeroad CF SLX on location, including descending the winding Sa Colabra in Mallorca, seem to feature as often as her distinctive running stride on Instagram.</span><b></b></p>\n<p><span>“Around the Paris Olympics, I was averaging something like 30 miles of running and 100 miles of cycling per week. Now it's probably closer to 35 miles running, and maybe 80 miles of cycling. That includes one long ride, which will be two-to-three hours, and then lots of evening recovery rides after a session day,” says the 32-year-old Nike sponsored athlete, who announced her partnership with Canyon in September 2025.</span><b></b></p>\n<p><span>However, if the sheer volume of cycling Hunter Bell undertakes seems unique or unexpected, it’s also entirely in keeping with an athlete whose path to success has been of the same idiosyncratic ilk. </span><b></b></p>\n<p><span>Two years ago, Hunter Bell was working in an office – or, as her LinkedIn profile states, as “an ambitious and hard-working cyber security enthusiast / running nerd”. A fabulous understatement in dire need of updating, the bio omits some minor detail: the fact that she was on sabbatical from her day job to focus on reaching the podium at the Paris 2024 Olympics. She did just that, smashing the British 1500m record by running 3:52.61 seconds and winning a bronze medal. A successful first season to say the least.</span><b></b></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/14-georgia-h-main-book-forte-talent-group_1024x1024.jpg?v=1771004578\" alt=\"\" /></div>\n<p><span>But behind Hunter Bell’s feel-good story is years of frustration and injury which she suffered during her time as a student-athlete at Berkley in the US. In 2017, she was ultimately forced to step away from competitive athletics for five years. Then came lockdown, when she took to the saddle. </span><b></b></p>\n<p><span>“I had been running a bit more during Covid, but I'd started to get some injuries popping up. I'd had a history of stress fractures and stress responses that had put me on crutches and a boot and stuff, and I really didn't want to go through all that again,” she says. </span><b></b></p>\n<p><span>“My then-boyfriend, now-husband, who is a big cyclist, said ‘you should just get on the bike, and we can do stuff on the bike if you can't run, or if you're in pain.’”</span><b></b></p>\n<p><span>Hunter Bell might’ve come to realise, as one does, that a bike can solve everything. But unlike the rest of us, her duck-to-water trajectory landed her a spot at the Duathlon World Championships in 2023. Naturally, she won the 30-34 age group. That medal would soon come to hang alongside four others upon her subsequent  return to middle distance – the event in which she had grown up competing as a talented junior. The GB kit was clearly here to stay. </span><b></b></p>\n<p><span>“I'm now kind of five or six years in, and touch wood I haven't had any kind of injuries that I'd had consistently as a runner. Now it's fully part of my programme,” she says. </span><b></b></p>\n<p><span>The physiological evidence of transferable fitness between cycling and running is plain to see: </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/anne-knijnenburg-the-champion-runner-who-became-cyclings-new-entertainer?srsltid=AfmBOoonHF5YCI4W6GghkbQzN9urHtcO_ok0vpX4Bj5RJ6o3-kKP-h4s&amp;tag=member\"><span>Anne Knijenburg</span></a><span>’s case, for example, the Dutch 1500m champion who now races for VolkerWessels. But the psychological benefits of switching things up are perhaps less obvious. Joyless racing and loss of motivation touches a zeitgeisty nerve in cycling, where discussions of </span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/aware-of-burnout-jonas-vingegaard-makes-big-changes-i-have-an-energy-i-ve-not-had-for-years?srsltid=AfmBOop7-gmQtSpc5wLuORg9Djf2MAZcBpYJerqHKLn8sBTX7Wj5guuW&amp;tag=member\"><span>burnout </span></a><span> prevail across both the men’s and women’s pelotons. For Hunter Bell and her friend, teammate, and 800m rival 23-year-old Hodgkinson, the bike saves the track from turning to toil.  </span><b></b></p>\n<p><span>“I've been running since I was ten, so cycling felt really interesting. I really do feel like that's what keeps it fresh, and Keely’s got the bug as well. </span><b></b></p>\n<p><span>“We're debating with our coach whether she should be getting into it as much as I have. She got an Olympic medal when she was 19 years-old. She's turning 24 and has been doing the same programme – it's obviously working, but we have to find ways to keep training fresh. This has given the group a new energy.” </span><b></b></p>\n\n<p><span>The smile on Hunter Bell’s face as she says this betrays a genuine, buoyant enthusiasm, especially when she recalls days out on the bike with teammates during a recent training camp in Stellenbosch, South Africa.</span><b></b></p>\n<p><span>“Usually everyone would just be doing it in the gym on the Wattbike, but now we've got these social rides. And so it's just made it so much more enjoyable. You're obviously out in the sunshine, with a nice coffee stop – it’s so social.” </span><b></b></p>\n<p><span>The plan is clearly working. Earlier this month, Hunter Bell opened her indoor season with a world-leading 4:00.04 in the women’s 1500m, which stands her in phenomenal stead for the indoor World Championships in March. She hints that this summer’s Commonwealth Games and European Championships could serve as a testing ground for a double-gold attempt at the 2028 Olympics, a challenge set by her coach Dame Kelly Holmes during the 2004 games in Athens.</span><b></b></p>\n<p><span>“I’m gonna see how this summer goes as to whether I'm going to do the 800 or the 1500m.  I would love to double and do both, and some of the schedules do accommodate it, at Europeans in Birmingham and at the games in Glasgow. </span><b></b></p>\n<p><span>“Just trying to stay healthy will be important as we get to the summer, so cycling will continue to be in the plans. I think that will be the case for the rest of time.” </span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"f6540808edf85d5cd4bd173139a3173b283a0205ad30f6ea1aa0e812edb5545a","category":"Cycling"}