{"title":"Strava’s New Instant Workouts Feature: Does it actually work?","link":"https://www.dcrainmaker.com/2026/01/stravas-instant-workouts-actually.html","date":1768318998000,"content":"<p><span>﻿</span></p>\n<p>Last week Strava launched their new ‘Instant Workouts’ feature, which leans on Strava’s acquisition of Runna (and probably also their acquisition of The Breakaway, too). The app is for subscribers only, but it aims to give the user a weekly set of five workouts, in each of four categories. But more than that, it will also automatically give the user a suggested route for each workout.</p>\n<p>In concept, this sounds super interesting, and would be the first logical steps towards true Runna integration (the company has repeatedly stated, though, that they plan to keep Runna separate). Still, at the end of the day, the overwhelming majority of their users are within the Strava platform, not the Runna platform. And with this feature being subscriber-only, the goal is clearly to keep users signed up, or convert them.</p>\n<p>Except, the problem is that the feature, as currently implemented, is proper dumpster-fire level. Sadly, I didn’t have my Dumpser Fire t-shirt when I filmed this. It’s in a moving box somewhere, and I’m not sure where. <a href=\"https://www.amazon.com/s?k=dumpster+fire+t-shirt&amp;crid=2B13BE61GU1T5&amp;sprefix=dumpster+fire+t-shi%2Caps%2C216&amp;linkCode=ll2&amp;tag=dcr07-20&amp;linkId=61d802b338a23a71e7d3d5196dd18613&amp;language=en_US&amp;ref_=as_li_ss_tl\">Probably time for a new one</a>, the previous one was perhaps a bit too subtle anyway.</p>\n<p>In any case, in the video, I walk through it all properly, but I want to highlight some of the aspects here. First up, it’ll show up at the top of your app when logged in, and the recommendations get refreshed each Monday. Within this, there’s a set of four core areas: Maintain, Build, Explore, and Recover.</p>\n<p><img title=\"Maintain.png\" src=\"https://media.dcrainmaker.com/images/2026/01/Maintain.png\" alt=\"\" width=\"177\" height=\"385\" srcset=\"https://media.dcrainmaker.com/images/2026/01/Maintain.png 354w, https://media.dcrainmaker.com/images/2026/01/Maintain-200x435.png 200w\" /><img title=\"Build.png\" src=\"https://media.dcrainmaker.com/images/2026/01/Build.png\" alt=\"\" width=\"177\" height=\"385\" srcset=\"https://media.dcrainmaker.com/images/2026/01/Build.png 354w, https://media.dcrainmaker.com/images/2026/01/Build-200x435.png 200w\" /><img title=\"Explore.png\" src=\"https://media.dcrainmaker.com/images/2026/01/Explore.png\" alt=\"\" width=\"177\" height=\"385\" srcset=\"https://media.dcrainmaker.com/images/2026/01/Explore.png 354w, https://media.dcrainmaker.com/images/2026/01/Explore-200x435.png 200w\" /><img title=\"Recover.png\" src=\"https://media.dcrainmaker.com/images/2026/01/Recover.png\" alt=\"\" width=\"177\" height=\"385\" srcset=\"https://media.dcrainmaker.com/images/2026/01/Recover.png 354w, https://media.dcrainmaker.com/images/2026/01/Recover-200x435.png 200w\" /></p>\n<p>The categories are relatively self-explanatory, except that ‘Explore’ is meant to be more than just exploring routes, but rather other sport types too. Each of these four areas gets five workouts, mostly a mix of run and ride (at least for me). Perhaps if someone didn’t run/ride, they’d get a more skewed selection of other types.</p>\n<p>The very first workout I got offered was this 500m madness one. Which was pure madness. It was telling me to go throw-down 500m intervals at “my 5K pace”, which it somehow identified at a 16-minute 5K time. These intervals are bonkers fast, at 3:21/km (5:24/mi). And we’ll set aside all the nomenclature wonkiness in how this was written in the instructions.</p>\n<p><img title=\"500mMadness.png\" src=\"https://media.dcrainmaker.com/images/2026/01/500mMadness.png\" alt=\"\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/500mMadness.png 470w, https://media.dcrainmaker.com/images/2026/01/500mMadness-200x435.png 200w\" /> <img title=\"500Madness2.png\" src=\"https://media.dcrainmaker.com/images/2026/01/500Madness2.png\" alt=\"\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/500Madness2.png 470w, https://media.dcrainmaker.com/images/2026/01/500Madness2-200x435.png 200w\" /></p>\n<p>I tried to figure out where the heck it was pulling a 16-minute 5KM time from, and after some digging, it seems like a run with the Oura ring in late October might be the culprit. That run had some pretty wonky GPS tracks, which heavily increased the distance, making it look like I ran faster than I did.</p>\n<p><img title=\"OuraRingRunFail3Arrows.png\" src=\"https://media.dcrainmaker.com/images/2026/01/OuraRingRunFail3Arrows.png\" alt=\"\" width=\"719\" height=\"395\" srcset=\"https://media.dcrainmaker.com/images/2026/01/OuraRingRunFail3Arrows.png 1438w, https://media.dcrainmaker.com/images/2026/01/OuraRingRunFail3Arrows-200x110.png 200w, https://media.dcrainmaker.com/images/2026/01/OuraRingRunFail3Arrows-720x396.png 720w, https://media.dcrainmaker.com/images/2026/01/OuraRingRunFail3Arrows-768x422.png 768w\" /></p>\n<p>But critically, removing that run (and waiting a few days) hasn’t caused the algorithm to adjust (as other platforms do). And more notably, that single run happened nearly 3 months ago, with no other runs to support that time standard. Surely all my other recent run data (putting me probably in the 19-minute 5KM range) would have fixed things by now anyway, right?</p>\n<p><img title=\"Madness3.png\" src=\"https://media.dcrainmaker.com/images/2026/01/Madness3.png\" alt=\"\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/Madness3.png 470w, https://media.dcrainmaker.com/images/2026/01/Madness3-200x435.png 200w\" /> <img title=\"Madness4.png\" src=\"https://media.dcrainmaker.com/images/2026/01/Madness4.png\" alt=\"\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/Madness4.png 470w, https://media.dcrainmaker.com/images/2026/01/Madness4-200x435.png 200w\" /></p>\n<p>But honestly, that’s not the biggest issue here – we’ll get to that. First, we’ve got the route suggestions included with all outdoor workouts. These are downright horrific. For these VO2Max 500m efforts, it recommended a fairly technical trail run as my route (including ravines). For some of the 2hr+ rides, it recommended literally doing loops around the block. Like, not kidding, simply doing loops of my street.</p>\n<p><img title=\"TrailRun1.png\" src=\"https://media.dcrainmaker.com/images/2026/01/TrailRun1.png\" alt=\"\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/TrailRun1.png 470w, https://media.dcrainmaker.com/images/2026/01/TrailRun1-200x435.png 200w\" /> <img title=\"TrialRun2.png\" src=\"https://media.dcrainmaker.com/images/2026/01/TrialRun2.png\" alt=\"\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/TrialRun2.png 470w, https://media.dcrainmaker.com/images/2026/01/TrialRun2-200x435.png 200w\" /></p>\n<p>Now, before we talk about the true single biggest issue, let’s briefly touch on cycling. From a workout suggestion standpoint, these aren’t too bad. Mostly. For the Build ones, these seemed on the upper end of spicy, but most of them are probably doable (though, the routes, still horrific neighborhood loops – ironic given I literally live in a cycling mecca with amazing routes).</p>\n<p><img title=\"vlcsnap-2026-01-13-16h33m12s588.png\" src=\"https://media.dcrainmaker.com/images/2026/01/vlcsnap-2026-01-13-16h33m12s588.png\" alt=\"Vlcsnap 2026 01 13 16h33m12s588.\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/vlcsnap-2026-01-13-16h33m12s588.png 470w, https://media.dcrainmaker.com/images/2026/01/vlcsnap-2026-01-13-16h33m12s588-200x435.png 200w\" /> <img title=\"vlcsnap-2026-01-13-16h33m38s878.png\" src=\"https://media.dcrainmaker.com/images/2026/01/vlcsnap-2026-01-13-16h33m38s878.png\" alt=\"Vlcsnap 2026 01 13 16h33m38s878.\" width=\"235\" height=\"511\" srcset=\"https://media.dcrainmaker.com/images/2026/01/vlcsnap-2026-01-13-16h33m38s878.png 470w, https://media.dcrainmaker.com/images/2026/01/vlcsnap-2026-01-13-16h33m38s878-200x435.png 200w\" /></p>\n<p>The one route that seemed most side-eye-worthy was a ‘Recovery Ride’ that was 2.5 hours long (one titled “Steady Endurance Ride”), and included “tempo” sections, seen above. Those seem to be at odds with each other.</p>\n<p>What’s most baffling to me here is that I’d argue Strava is the king of making generally quite good routes. Really good routes in most cases. I use it near-daily for route generation, and it is the core reason I pay for Strava. Sure, every once in a while on longer routes you get a bit of random Uncle Strava Spice mixed in, but that’s (usually) part of the fun.</p>\n<p>However, the biggest problem is that you can’t actually push the workout to any GPS watch. Or, for that matter, you can’t even see the darn workout in the app once you start the workout. I’m not kidding. It gives you an immensely complex workout (with wonky non-standard wording), but the only way to see it once in the workout is if you screenshot it before you started. Or, perhaps printed it out, old-school style.</p>\n<p>The company said in a Reddit post that pushing workout integration to Garmin &amp; Apple devices is upcoming soon, though I question how realistic that “soon” piece is. After all, everything I’ve heard indicates the relationship between Garmin &amp; Strava remains icy at best right now, <a href=\"https://www.dcrainmaker.com/2025/10/strava-drops-voluntarily-lawsuit-against.html\">following this past fall’s lawsuit fiasco</a>. There’s no reason Garmin would need to move fast on implementing this, merely to make Strava’s investors happier.</p>\n<p>Look, I actually think this type of feature could be a game-changer for the Strava subscription longer term, but how they’ve implemented it here is nothing more than media fodder to try and boost interest ahead of their IPO. This feature should have absolutely launched with ‘push workout to device’ included, as well as workouts that actually made sense, with wording that actually makes sense. Right now, none of those things appear to be present in most cases.</p>\n<p>Strava has the potential here to lean heavily on their routing portions. Something virtually none of the upstart AI competitors can do, since they lack the literal billions of historical route/activity data that Strava has. And, as I’ve said – it’s one of the most valuable and best pieces of the Strava platform. Hopefully, at some point they can combine those elements together correctly, and I’ll be the first to give them kudos for it.</p>\n<p>With that – thanks for reading (or watching!).</p>","author":"Ray Maker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"f7cdaa24177ae4413e2f69c6781b30618ea1a334c4d0d74823b7c294e0d91719","category":"Cycling"}