{"title":"To Ignite a Personalization Practice, Run this Prepersonalization Workshop","link":"https://alistapart.com/article/prepersonalization-workshop/","date":1713297094000,"content":"\n<p>Picture this. You’ve joined a squad at your company that’s designing new product features with an emphasis on automation or AI. Or your company has just implemented a <a href=\"https://en.wikipedia.org/wiki/Personalization_management_system\">personalization engine</a>. Either way, you’re designing with data. Now what? When it comes to <a href=\"https://alistapart.com/article/personalization-pyramid/\">designing for personalization</a>, there are many cautionary tales, no overnight successes, and few guides for the perplexed. </p>\n\n\n\n<p>Between the fantasy of getting it right and the fear of it going wrong—like when we encounter “<a href=\"https://visit.bucketbriga.de/c/personalization-failure-persofail/\">persofails</a>” in the vein of a company <a href=\"https://twitter.com/jeffmacintyre/status/1505878250937061378\">repeatedly imploring everyday consumers to buy additional toilet seats</a>—the personalization gap is real. It’s an especially confounding place to be a digital professional without a map, a compass, or a plan.</p>\n\n\n\n<p>For those of you venturing into personalization, there’s no <em>Lonely Planet</em> and few tour guides because effective personalization is so specific to each organization’s talent, technology, and market position. </p>\n\n\n\n<p>But you can ensure that your team has packed its bags sensibly.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/suggested-vistas-1024x684.jpg\" alt=\"A sign at a mountain scene says “People who liked this also liked,” which is followed by photographs of other scenic landscapes. Satirical art installation by Scott Kelly and Ben Polkinghome.\" /><figcaption><em>Designing for personalization makes for strange bedfellows. A savvy art-installation satire on the challenges of humane design in the era of the algorithm. Credit:</em><a href=\"https://www.scottconradkelly.com/signs-of-the-times\"><em> Signs of the Times</em></a><em>,</em> <em>Scott Kelly and Ben Polkinghome.</em></figcaption></figure>\n\n\n\n<p>There’s a DIY formula to increase your chances for success. At minimum, you’ll defuse your boss’s irrational exuberance. Before the party you’ll need to effectively prepare.</p>\n\n\n\n<p>We call it <strong>prepersonalization</strong>.</p>\n\n\n\n<h2><strong>Behind the music</strong></h2>\n\n\n\n<p>Consider Spotify’s DJ feature, which debuted this past year.</p>\n\n\n\n<figure><div>\nhttps://www.youtube.com/watch?v=ok-aNnc0Dko\n</div></figure>\n\n\n\n<p>We’re used to seeing the polished final result of a personalization feature. Before <a href=\"https://www.linkedin.com/posts/daniel-ek-1b52093a_spotify-dj-the-200-best-inventions-of-2023-activity-7122612194923483137-rRNc/\">the year-end award</a>, the <a href=\"https://newsroom.spotify.com/2023-10-18/how-spotify-uses-design-to-make-personalization-features-delightful/\">making-of backstory</a>, or the behind-the-scenes <a href=\"https://newsroom.spotify.com/2023-03-08/spotify-new-personalized-ai-dj-how-it-works/\">victory lap</a>, a personalized feature had to be conceived, budgeted, and prioritized. Before any personalization feature goes live in your product or service, it lives amid a backlog of worthy ideas for expressing customer experiences more dynamically.</p>\n\n\n\n<p>So how do you know where to place your personalization bets? How do you design consistent interactions that won’t trip up users or—worse—breed mistrust? We’ve found that for many budgeted programs to justify their ongoing investments, they first needed one or more workshops to convene key stakeholders and internal customers of the technology. Make yours count.</p>\n\n\n\n<p>​From <a href=\"https://en.wikipedia.org/wiki/Big_Tech#:~:text=Alphabet%2C%20the%20parent%20company%20of,Amazon%2C%20Netflix%2C%20and%20Google.\">Big Tech</a> to fledgling startups, we’ve seen the same evolution up close with our clients. In our experiences with working on small and large personalization efforts, a program’s ultimate track record—and its ability to weather tough questions, work steadily toward shared answers, and organize its design and technology efforts—turns on how effectively these prepersonalization activities play out.</p>\n\n\n\n<p>Time and again, we’ve seen effective workshops separate future success stories from unsuccessful efforts, saving countless time, resources, and collective well-being in the process.</p>\n\n\n\n<p>A personalization practice involves a multiyear effort of testing and feature development. It’s not a switch-flip moment in your tech stack. It’s best managed as a backlog that often evolves through three steps: </p>\n\n\n\n<ol>\n<li>customer experience optimization (CXO, also known as A/B testing or experimentation)</li>\n\n\n\n<li>always-on automations (whether rules-based or machine-generated)</li>\n\n\n\n<li>mature features or standalone product development (such as Spotify’s DJ experience)</li>\n</ol>\n\n\n\n<p>This is why we created our progressive personalization framework and why we’re field-testing an accompanying <a href=\"http://progressivepersonalization.com/\">deck of cards</a>: we believe that <em>there’s a base grammar, a set of “nouns and verbs” that your organization can use to design experiences that are customized, personalized, or automated</em>. You won’t need these cards. But we strongly recommend that you create something similar, whether that might be digital or physical.</p>\n\n\n\n<h2>Set your kitchen timer</h2>\n\n\n\n<p>How long does it take to cook up a prepersonalization workshop? The surrounding assessment activities that we recommend including can (and often do) span weeks. For the core workshop, we recommend aiming for two to three days. Here’s a summary of our broader approach along with details on the essential first-day activities.</p>\n\n\n\n<p>The full arc of the wider workshop is threefold:</p>\n\n\n\n<ol>\n<li><strong>Kickstart:</strong> This sets the terms of engagement as you focus on the opportunity as well as the readiness and drive of your team and your leadership. .</li>\n\n\n\n<li><strong>Plan your work:</strong> This is the heart of the card-based workshop activities where you specify a plan of attack and the scope of work.</li>\n\n\n\n<li><strong>Work your plan:</strong> This phase is all about creating a competitive environment for team participants to individually pitch their own pilots that each contain a proof-of-concept project, its business case, and its operating model.</li>\n</ol>\n\n\n\n<p>Give yourself at least a day, split into two large time blocks, to power through a concentrated version of those first two phases.</p>\n\n\n\n<h2>Kickstart: Whet your appetite</h2>\n\n\n\n<p>We call the first lesson the “landscape of connected experience.” It explores the personalization possibilities in your organization. A <strong>connected experience</strong>, in our parlance, is <em>any UX requiring the orchestration of multiple systems of record</em> on the backend. This could be a content-management system combined with a marketing-automation platform. It could be a digital-asset manager combined with a customer-data platform.</p>\n\n\n\n<p>Spark conversation by naming consumer examples and business-to-business examples of connected experience interactions that you admire, find familiar, or even dislike. This should cover a representative range of personalization patterns, including automated app-based interactions (such as onboarding sequences or wizards), notifications, and recommenders. We have a catalog of these in the cards. Here’s a list of <a href=\"https://www.dynamicyield.com/personalization-examples/\">142 different interactions</a> to jog your thinking.</p>\n\n\n\n<p>This is all about setting the table. What are the possible paths for the practice in your organization? If you want a broader view, here’s a <a href=\"https://visit.bucketbriga.de/c/field-notes/navigating-the-personalization-gap-a-field-guide\">long-form primer</a> and a <a href=\"https://visit.bucketbriga.de/c/field-notes/progressive-personalization-a-decisionmaking-model-for-better-outcomes-in-personalized-ux\">strategic framework</a>.</p>\n\n\n\n<p>Assess each example that you discuss for its complexity and the level of effort that you estimate that it would take for your team to deliver that feature (or something similar). In our cards, we divide connected experiences into five levels: functions, features, experiences, complete products, and portfolios. Size your own build here. This will help to focus the conversation on the merits of ongoing investment as well as the gap between what you deliver today and what you want to deliver in the future.</p>\n\n\n\n<p>Next, have your team plot each idea on the following 2×2 grid, which lays out the <strong>four enduring arguments</strong> for a personalized experience. This is critical because it emphasizes how personalization can not only help your external customers but also affect your own ways of working. It’s also a reminder (which is why we used the word <em>argument</em> earlier) of the broader effort beyond these tactical interventions.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/arguments-for-personalization-1024x575.jpg\" alt=\"A two-by-two grid shows the four areas of emphasis for a personalization program in an organization: Business efficiency, customer experience, business orchestration, and customer understanding. The focus varies from front-stage to back-stage and from business-focused to customer-focused outcomes.\" /><figcaption><em>Getting intentional about the desired outcomes is an important component to a large-scale personalization program. Credit: </em><a href=\"https://bucket.studio/\"><em>Bucket Studio</em></a><em>.</em></figcaption></figure>\n\n\n\n<p>Each team member should vote on where they see your product or service putting its emphasis. Naturally, you can’t prioritize all of them. The intention here is to flesh out how different departments may view their own upsides to the effort, which can vary from one to the next. Documenting your desired outcomes lets you know how the team internally aligns across representatives from different departments or functional areas.</p>\n\n\n\n<p>The third and final kickstart activity is about naming your <strong>personalization gap</strong>. Is your customer journey well documented? Will data and privacy compliance be too big of a challenge? Do you have <a href=\"https://aws.amazon.com/blogs/machine-learning/selecting-the-right-metadata-to-build-high-performing-recommendation-models-with-amazon-personalize/\">content metadata needs</a> that you have to address? (We’re pretty sure that you do: it’s just a matter of recognizing the relative size of that need and its remedy.) In our cards, we’ve noted a number of program risks, including common team dispositions. Our Detractor card, for example, lists six stakeholder behaviors that hinder progress.</p>\n\n\n\n<p>Effectively collaborating and managing expectations is critical to your success. Consider the potential barriers to your future progress. Press the participants to name specific steps to overcome or mitigate those barriers in your organization. As studies have shown, personalization efforts face many common barriers.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/barriers-to-personalization-1024x483.jpg\" alt=\"Barriers to personalization according to a Boston Consulting Group 2016 research study. The top items include “too few personnel dedicated to personalization,” “lack of a clear roadmap,” and “inadequate cross-functional coordination and project management.”\" /><figcaption><em>The largest management consultancies have established practice areas in personalization, and they regularly research program risks and challenges. Credit: </em><a href=\"https://www.bcg.com/publications/2017/retail-marketing-sales-profiting-personalization\"><em>Boston Consulting Group</em></a><em>.</em></figcaption></figure>\n\n\n\n<p>At this point, you’ve hopefully discussed sample interactions, emphasized a key area of benefit, and flagged key gaps? Good—you’re ready to continue.</p>\n\n\n\n<h2>Hit that test kitchen</h2>\n\n\n\n<p>Next, let’s look at what you’ll need to bring your personalization recipes to life. Personalization engines, which are robust software suites for automating and expressing dynamic content, can intimidate new customers. Their capabilities are sweeping and powerful, and they present broad options for how your organization can conduct its activities. This presents the question: Where do you begin when you’re configuring a connected experience?</p>\n\n\n\n<p>What’s important here is to avoid treating the installed software like it were a dream kitchen from some fantasy remodeling project (as one of our client executives memorably put it). These software engines are more like <strong>test kitchens</strong> where your team can begin devising, tasting, and refining the snacks and meals that will become a part of your personalization program’s regularly evolving menu.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/personalization-pyramid-1024x576.jpg\" alt=\"The Progressive Personalization Model v2: A pyramid with the following layers, starting at the base and working up: Raw Data (millions), Actionable Data (hundreds of thousands), Segments (thousands), Customer Experience Patterns (many), Interactions (dozens), and Goals (handful).\" /><figcaption><em>Progressive personalization, a framework for designing connected experiences. Credit: </em><a href=\"https://bucket.studio/\"><em>Bucket Studio</em></a><em> and Colin Eagan.</em></figcaption></figure>\n\n\n\n<p>The ultimate menu of the prioritized backlog will come together over the course of the workshop. And creating “dishes” is the way that you’ll have individual team stakeholders construct personalized interactions that serve their needs or the needs of others.</p>\n\n\n\n<p>The dishes will come from recipes, and those recipes have set ingredients.</p>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/personalization-poker-deck-1024x576.jpg\" alt=\"A photo of the Progressive Personalization deck of cards with accompanying text reading: Align on key terms and tactics. Draft and groom a full backlog, designing with data.\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/poker-deck-cards-1024x660.jpg\" alt=\"A zoomed out view of many of the cards in the deck. Cards have colors corresponding to the layers of the personalization pyramid and include actionable details.\" /></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/poker-deck-recipes-1024x572.jpg\" alt=\"Progressive personalization is a model of designing for personalized interactions that uses playing cards to assemble the typical parts for such features and functionality.\" /><figcaption><em>In the same way that ingredients form a recipe, you can also create </em><a href=\"http://progressivepersonalization.com/\"><em>cards</em></a><em> to break down a personalized interaction into its constituent parts. Credit: </em><a href=\"https://bucket.studio/\"><em>Bucket Studio</em></a><em> and Colin Eagan.</em></figcaption></figure>\n\n\n\n<h2>Verify your ingredients</h2>\n\n\n\n<p>Like a good product manager, you’ll make sure—andyou’ll validate with the right stakeholders present—that you have all the ingredients on hand to cook up your desired interaction (or that you can work out what needs to be added to your pantry). These ingredients include the audience that you’re targeting, content and design elements, the context for the interaction, and your measure for how it’ll come together. </p>\n\n\n\n<p>This isn’t just about discovering requirements. Documenting your personalizations as a series of if-then statements lets the team: </p>\n\n\n\n<ol>\n<li>compare findings toward a unified approach for developing features, not unlike when artists paint with the same palette; </li>\n\n\n\n<li>specify a consistent set of interactions that users find uniform or familiar; </li>\n\n\n\n<li>and develop parity across performance measurements and key performance indicators too. </li>\n</ol>\n\n\n\n<p>This helps you streamline your designs and your technical efforts while you deliver a shared palette of core motifs of your personalized or automated experience.</p>\n\n\n\n<h2>Compose your recipe</h2>\n\n\n\n<p>What ingredients are important to you? Think of a who-what-when-why <a href=\"https://en.wikipedia.org/wiki/Five_Ws\">construct</a>: </p>\n\n\n\n<ul>\n<li>Who are your key audience segments or groups?</li>\n\n\n\n<li>What kind of content will you give them, in what design elements, and under what circumstances?</li>\n\n\n\n<li>And for which business and user benefits?</li>\n</ul>\n\n\n\n<p>We first developed these <a href=\"https://alistapart.com/article/personalization-pyramid/\">cards and card categories</a> five years ago. We regularly play-test their fit with conference audiences and clients. And we still encounter new possibilities. But they all follow an underlying who-what-when-why logic.<br /><br />Here are three examples for a subscription-based reading app, which you can generally follow along with right to left in the cards in the accompanying photo below. </p>\n\n\n\n<ol>\n<li>Nurture personalization: When a guest or an unknown visitor interacts with  a product title, a banner or alert bar appears that makes it easier for them to encounter a related title they may want to read, saving them time.</li>\n\n\n\n<li>Welcome automation: When there’s a newly registered user, an email is generated to call out the breadth of the content catalog and to make them a happier subscriber.</li>\n\n\n\n<li>Winback automation: Before their subscription lapses or after a recent failed renewal, a user is sent an email that gives them a promotional offer to suggest that they reconsider renewing or to remind them to renew.</li>\n</ol>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/recipe-nurture-1024x573.jpg\" alt=\"A selection of prompt cards assembled to represent the key parameters of a “nurture” user flow.\" /><figcaption><em>A “nurture” automation may trigger a banner or alert box that promotes content that makes it easier for users to complete a common task, based on behavioral profiling of two user types. Credit: </em><a href=\"https://bucket.studio/\"><em>Bucket Studio</em></a><em>.</em></figcaption></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/recipe-welcome-1024x574.jpg\" alt=\"A selection of prompt cards assembled to represent the key parameters of a “welcome”, or onboarding, user flow.\" /><figcaption><em>A “welcome” automation may be triggered for any user that sends an email to help familiarize them with the breadth of a content library, and this email ideally helps them consider selecting various titles (no matter how much time they devote to reviewing the email’s content itself). Credit: </em><a href=\"https://bucket.studio/\"><em>Bucket Studio</em></a><em>.</em></figcaption></figure>\n\n\n\n<figure><img src=\"https://alistapart.com/wp-content/uploads/2024/04/recipe-winback-1024x573.jpg\" alt=\"A selection of prompt cards assembled to represent the key parameters of a “winback”, or customer-churn risk, user flow.\" /><figcaption><em>A “winback” automation may be triggered for a specific group, such as users with recently failed credit-card transactions or users at risk of churning out of active usage, that present them with a specific offer to mitigate near-future inactivity. Credit: </em><a href=\"https://bucket.studio/\"><em>Bucket Studio</em></a><em>.</em></figcaption></figure>\n\n\n\n<p>A useful preworkshop activity may be to think through a first draft of what these cards might be for your organization, although we’ve also found that this process sometimes flows best through cocreating the recipes themselves. Start with a set of blank cards, and begin labeling and grouping them through the design process, eventually distilling them to a refined subset of highly useful candidate cards.</p>\n\n\n\n<p>You can think of the later stages of the workshop as <a href=\"https://visit.bucketbriga.de/c/field-notes/pre-personalization-workshop\">moving from recipes toward a cookbook</a> in focus—like a more nuanced customer-journey mapping. Individual “cooks” will pitch their recipes to the team, using a common <a href=\"https://hbr.org/2016/09/know-your-customers-jobs-to-be-done\">jobs-to-be-done</a> format so that measurability and results are baked in, and from there, the resulting collection will be prioritized for finished design and delivery to production.</p>\n\n\n\n<h2>Better kitchens require better architecture</h2>\n\n\n\n<p>Simplifying a customer experience is a complicated effort for those who are inside delivering it. Beware anyone who says otherwise. With that being said,  “Complicated problems can be hard to solve, but <a href=\"https://sloanreview.mit.edu/article/the-critical-difference-between-complex-and-complicated/\">they are addressable with rules and recipes</a>.”</p>\n\n\n\n<p>When personalization becomes a laugh line, it’s because a team is <a href=\"https://aws.amazon.com/what-is/overfitting/\">overfitting</a>: they aren’t designing with their best data. Like a sparse pantry, every organization has metadata debt to go along with its technical debt, and this creates a drag on personalization effectiveness. Your AI’s output quality, for example, is indeed limited by your <a href=\"https://en.wikipedia.org/wiki/Information_architecture\">IA</a>. Spotify’s poster-child prowess today was unfathomable before they <a href=\"https://www.theguardian.com/technology/2014/mar/06/spotify-echo-nest-streaming-music-deal\">acquired</a> a seemingly modest <a href=\"https://en.wikipedia.org/wiki/The_Echo_Nest\">metadata startup</a> that now <a href=\"https://techcrunch.com/2014/10/19/the-sonic-mad-scientists/\">powers</a> its underlying information architecture.</p>\n\n\n\n<h2>You can definitely stand the heat…</h2>\n\n\n\n<p>Personalization technology opens a doorway into a confounding ocean of possible designs. Only a disciplined and highly collaborative approach will bring about the necessary focus and intention to succeed. So banish the dream kitchen. Instead, hit the test kitchen to save time, preserve job satisfaction and security, and safely dispense with the fanciful ideas that originate upstairs of the doers in your organization. There are meals to serve and mouths to feed.</p>\n\n\n\n<p>This workshop framework gives you a fighting shot at lasting success as well as sound beginnings. Wiring up your information layer isn’t an overnight affair. But if you use the same cookbook and shared recipes, you’ll have solid footing for success. We designed these activities to make your organization’s needs concrete and clear, long before the hazards pile up.</p>\n\n\n\n<p>While there are associated costs toward investing in this kind of technology and product design, your ability to size up and confront your unique situation and your digital capabilities is time well spent. Don’t squander it. The proof, as they say, is in the pudding.</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"fad690c993a553be9d1f4dd1069b6e285f80e6e3db1ad0249e9ba74a153c526c","category":"Tech"}