{"title":"MADE 2025: Wrap-Up","link":"https://moots.com/blogs/news/made-2025-wrap-up-1","date":1762458861000,"content":"\n      <p>What a weekend. The energy at <a href=\"https://made.bike/\">MADE</a> in Portland was incredible, and we couldn’t be more grateful to everyone who stopped by our booth, shared stories, and celebrated titanium with us. To all of our loyal fans, friends, and new faces—thank you for making this show such a success.</p>\n<p>This year, we brought a lineup of bikes that each told a different story of what titanium can do.</p>\n<h3>Adventure Bike, New Model Preview</h3>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/Screenshot-2025-08-21-at-5.38.59-PM-1024x677.jpg\" alt=\"\" width=\"800\" height=\"529\" /></p>\n<p>Purpose-built for big days out, this new adventure platform showed off progressive geometry, tons of mounts, and internal routing—all wrapped in a topo-inspired anodized finish. It’s our vision for the next era of all-surface exploration. More information avaliable this fall.</p>\n<h3> </h3>\n<h3>Routt 45 “City Slicker”</h3>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/Screenshot-2025-08-22-at-4.19.25-PM-1024x674.jpg\" alt=\"\" width=\"800\" height=\"527\" /></p>\n<p>A one-off concept that turned heads at the Shimano booth. Outfitted with Shimano’s new Q’Auto electronic drivetrain, flat bars, custom Sims fenders, and our new CRD Bearing Cap, the City Slicker reimagines a Routt 45 as a sleek, titanium commuter.</p>\n<h3>Routt CRD Blackbird</h3>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/Untitled-design-16-819x1024.jpg\" alt=\"\" width=\"800\" height=\"1000\" /></p>\n<p>Handcrafted in Steamboat Springs and handpainted in Portland, the Blackbird was our ultimate showpiece. This size 55 one-of-one made its final appearance at MADE before being offered for sale—a true collector’s piece of Moots history. If you are interested in purchasing this bike, please inquire with info@moots.com</p>\n<h3> </h3>\n<h3>Womble 29, Cerakote Lavender</h3>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/08/Womble-2-1024x683.jpg\" alt=\"\" width=\"800\" height=\"534\" /></p>\n<p>Our playful titanium hardtail, shown in a bold lavender Cerakote finish with an MRP Ribbon SL Rally fork. Updated with a double-butted front triangle, UDH dropouts, and optional sliders, the Womble proved just how versatile and modern a titanium MTB can be.</p>\n<p>Each bike we presented reflected our constant pursuit of craftsmanship, performance, and timeless design. Remeber...NO COMPROMISES!</p>\n<p>The conversations, the rides, and the stoke from MADE remind us why we do what we do. Events like this are about more than bikes—they’re about community. Thank you for being part of ours.</p>\n<p>Until next time.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"fb5fd9ac8ed0ba132fe5e64249663154bd4c303f079b4da943a9d463d50df05e","category":"Cycling"}