{"title":"Lauren Hall: Legacy in Motion","link":"https://moots.com/blogs/news/lauren-hall-legacy-in-motion","date":1762459438000,"content":"\n      <p><img src=\"https://moots.com/wp-content/uploads/2025/05/35291AD0-8E9B-4493-802F-A3BD93320AD2-768x1024.jpeg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p>There’s something about a Moots bike that stops people in their tracks. Maybe it’s the raw titanium finish, the clean lines, or -most often- the flawless welds that are truly in a class of their own. When I’m out riding, people recognize the brand immediately: “Moots! That’s Colorado, right?” Yes. And it’s more than a bike-it’s a legacy.</p>\n<p>That word, legacy, had been on my mind a lot lately.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_5573-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p>Last week, I had the privilege of returning to my hometown in Mississippi to attend my high school’s athletic banquet. I’ve known for some time that an award exists in my name – the <strong>Lauren Hall Award and Scholarship</strong>-honoring the most outstanding senior female athlete. But sitting in the audience and hearing the accomplishments of these athletes- how they’ve excelled in multiple sports, won state championships, and shown remarkable discipline and heart-was deeply meaningful.</p>\n<p>This year’s recipient is <strong>Samantha Edwards</strong>, a standout student-athlete who will be attending <strong>Mississippi State University</strong>, my alma mater. I couldn’t be more proud to see her carry forward the values that matter most: hard work, determination, and the courage to lead by example.</p>\n<p>We were-and still are-the St. Aloysius Flashes. That spirit of pushing boundaries and showing up with integrity lives on.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/05/IMG_5551-768x1024.jpg\" alt=\"\" width=\"768\" height=\"1024\" /></p>\n<p>But none of this -my athletic career, the award, even the confidence to pursue cycling-would have been possible without my hero and mentor: <strong>my dad</strong>. He’s been the steady support and quiet inspiration behind it all. He showed up for every practice, every basketball, soccer, and softball game, every tennis match, every track meet. His presence taught me that consistency, encouragement, and heart matter most. <strong>He is a legacy I will always strive to emulate. </strong></p>\n<p>And it’s that same spirit I see in Moots.</p>\n<p>Moots has built a legacy not just of beautiful, bikes, but of purpose-driven design and enduring quality. Just like those student-athletes, the Moots team shows up every day committed to their craft. Whether its’s refining a new geometry or hand-welding each frame in Steamboat Springs, they’re building more than just bikes- they’re building trust, community, and a standard for others to follow.</p>\n<p>I’m honored to be part of that legacy, both on and off the bike. Here’s to Samantha and her bright future, to my dad and everything he’s poured into mine, to every rider who recognizes the excellence behind a Moots frame-and to all of us carrying forward something that lasts.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"fe242e75dd44ec7b7f230f71c597de451224fd05e9f4926ebd421a4d455e953f","category":"Cycling"}