{"title":"Rider Spotlight: Mr. Keita Iwao","link":"https://moots.com/blogs/news/rider-spotlight-mr-keita-iwao","date":1762459270000,"content":"\n      <p><img src=\"https://moots.com/wp-content/uploads/2025/06/0734D8E1-62AC-4CF0-8024-C200FF8D4646-819x1024.jpg\" alt=\"\" width=\"505\" height=\"632\" /></p>\n<p>At Moots, we took the time to learn more about Mr. Keita Iwao—a passionate rider from Kagoshima, Japan whose connection to his Routt 45 runs deep. What started with a spark of inspiration online has become a lasting relationship built on craftsmanship, adventure, and personal meaning.</p>\n<p>We hope you enjoy this glimpse into Keita’s story, his riding life in Japan, and the special bond he shares with his Moots.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/06/IMG_8851-768x1024.jpg\" alt=\"\" width=\"545\" height=\"725\" /></p>\n<p><strong>WHERE ARE YOU FROM?</strong></p>\n<p><em>I’m from Kagoshima, Japan.</em></p>\n<p><strong>WHAT ORIGINALLY DREW YOU TO MOOTS?</strong></p>\n<p><em>My first encounter with MOOTS was around 2020. I saw an Instagram post from a bike shop and was instantly struck by how cool their bikes looked, thinking, \"Can a bike really be this awesome?\" From there, I delved into various content like blog articles and YouTube videos to learn more about MOOTS. As I discovered their honest approach to craftsmanship and the high level of customer satisfaction, I became more and more drawn to their appeal. I was thrilled when I found out that it was possible to purchase MOOTS even from Japan.</em></p>\n<p><strong>WHY DID YOU PICK THE ROUTT 45?</strong></p>\n<p><em>For me, my gravel bike usually serves two main purposes: either gravel rides with buddies and the occasional annual gravel event (race), or more leisurely-paced long rides. When I initially placed my order, the Routt 45 and Routt RSL were the only two frames that met my purpose. In my area, there's not much smooth gravel; most of the forest roads are littered with rocks and potholes. Because of this, I prioritized wider tire clearance over weight or nimble handling, leading me to choose the Routt 45. I was also strongly drawn to the bike's web catalog, which used the unique and playful expression \"fast-paced lunch rides\"—that sense of fun probably played a big role in my decision as well.</em></p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/06/IMG_6795-769x1024.jpg\" alt=\"\" width=\"584\" height=\"777\" /></p>\n<p><strong>HOW DID YOU DECIDE ON THE FINISH? ARE THERE ANY DETAILS OF THE BIKE YOU ARE OBSESSED WITH?</strong></p>\n<p><em>I had always admired the STANLEY logo design ever since it first introduced me to the cool aesthetic of MOOTS bikes, so for me, there really wasn't any other choice.</em></p>\n<p><em>What I particularly love are the pattern on the chainstay and the alligator graphic on the seat tube. There's a cuteness within their beauty, and all of these details together create a truly special feel.</em></p>\n<p><strong>DID YOU CUSTOMIZE YOUR BUILD? </strong></p>\n<p><em>I purchased it as a frame, and since I wanted to try out Campagnolo Ekar, which was a hot topic at the time, I went with Campagnolo for everything, including the wheels.</em></p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/06/IMG_8815-769x1024.jpg\" alt=\"\" width=\"596\" height=\"793\" /></p>\n<p><strong>CAN  YOU TELL US ABOUT A STANDOUT MOMENT THAT MADE YOU THINK 'THISI IS WHY I BOUGHT THIS BIKE'?</strong></p>\n<p><em>The Grinduro Japan in 2023 particularly stands out in my memory. The timed sections of that event had a lot of intense downhills, and many riders struggled. However, because I was using 45mm-wide gravel tires, combined with the excellent integrated feel of my bike frame, I was able to ride incredibly comfortably and fast. Many people complimented my bike, saying \"That's a nice bike!\" – so, the entire event was a great memory, largely thanks to my Moots.</em></p>\n<p><strong>WHAT DOES RIDING A MOOTS MEAN TO YOU? </strong></p>\n<p><em>I believe it holds a special meaning, as if it colors my entire lifestyle, not just the time I spend riding.</em></p>\n<p><strong>WHAT TERRAIN OR TYPE OF RIDE DO YOU DO THE MOST ON YOUR MOOTS?</strong></p>\n<p><em>I primarily do hilly and rough gravel rides. </em></p>\n<p><strong>TELL US ABOUT A MEMORABLE RIDE, OR TRIP THAT YOU TOOK YOUR ROUTT 45 ON. </strong></p>\n<p><em>A memorable trip was definitely a bike camping adventure with friends, where I attached a bike trailer and loaded up my solo camping gear. One of my buddies also rides a MOOTS (a VAMOOTS RCS), and sitting around a campfire, praising each other's bikes, is a pretty rare and unforgettable experience.</em></p>\n<p><strong>WHERE DID YOU BUY YOUR BIKE? </strong></p>\n<p><em>I bought my bike from a shop called KOGU Kagoshima.</em></p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/06/IMG_2061-768x1024.jpg\" alt=\"\" width=\"531\" height=\"708\" /></p>\n<p> </p>\n<p><strong>IF YOUR BIKE HAD A NAME OR PERSONALITY, WHAT WOULD IT BE?</strong></p>\n<p><em>It's tough to give it a name, but I'm thinking of calling it Takamori, after Takamori Saigo, the great historical figure from Kagoshima. I believe his magnanimity and imposing, steadfast image perfectly align with the robust presence of this bike, a fitting tribute given Saigo's large stature and the MOOTS' sturdy, substantial look.</em></p>\n<p><img src=\"https://moots.com/wp-content/uploads/2025/06/3022EF7C-8202-432F-9287-AC354BAB241D-820x1024.jpg\" alt=\"\" width=\"634\" height=\"792\" /></p>\n<p><strong>TELL US ABOUT YOUR BUILD! </strong></p>\n<p>Drivetrain: Campagnolo EKAR</p>\n<p>Wheels: Campagnolo Shamal Carbon</p>\n<p>Tires: Panaracer Gravelking X1R 700x45mm</p>\n<p>Handlebar: Thomson Alloy Gravel</p>\n<p>Stem: Thomson ELITE X4</p>\n<p>Seatpost: Thomson Masterpiece</p>\n<p>Saddle: fizik Arione R1</p>\n<p>Bottle Cages: SILCA SICURO Ti</p>\n<p>Headset: Chris King</p>\n<p> </p>\n<p>Inclosing, this bike will always remain special to me, not just because of its quality, but also because my son was born three months after it arrived. He's only two now, but when he grows up and shows interest in sports bikes, I want to proudly tell him, \"This is the bike I bought when you were born.\" I plan to keep riding this bike until then, and I hope to share some of my biking adventures with him as well.</p>\n<p>--</p>\n<p>Thank you so much Mr. Keita Iwao for letting us get to know you and  your Routt 45 more. We look forward to hearing more about the adventures to come.</p>\n    ","author":"Elizabeth Reeder","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"ffc49cb3784adf8f993947bf82ae55678c1ed7f70d2a5e6457d6b79ca0c16701","category":"Cycling"}